{"SurahNumber":11,"HasBismillah":true,"Verses":[{"SurahNumber":11,"VerseNumber":1,"Text":"الٓرۚ كِتَٰبٌ أُحۡكِمَتۡ ءَايَٰتُهُۥ ثُمَّ فُصِّلَتۡ مِن لَّدُنۡ حَكِيمٍ خَبِيرٍ","End":"١"},{"SurahNumber":11,"VerseNumber":2,"Text":"أَلَّا تَعۡبُدُوٓاْ إِلَّا ٱللَّهَۚ إِنَّنِي لَكُم مِّنۡهُ نَذِيرٞ وَبَشِيرٞ","End":"٢"},{"SurahNumber":11,"VerseNumber":3,"Text":"وَأَنِ ٱسۡتَغۡفِرُواْ رَبَّكُمۡ ثُمَّ تُوبُوٓاْ إِلَيۡهِ يُمَتِّعۡكُم مَّتَٰعًا حَسَنًا إِلَىٰٓ أَجَلٖ مُّسَمّٗى وَيُؤۡتِ كُلَّ ذِي فَضۡلٖ فَضۡلَهُۥۖ وَإِن تَوَلَّوۡاْ فَإِنِّيٓ أَخَافُ عَلَيۡكُمۡ عَذَابَ يَوۡمٖ كَبِيرٍ","End":"٣"},{"SurahNumber":11,"VerseNumber":4,"Text":"إِلَى ٱللَّهِ مَرۡجِعُكُمۡۖ وَهُوَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ","End":"٤"},{"SurahNumber":11,"VerseNumber":5,"Text":"أَلَآ إِنَّهُمۡ يَثۡنُونَ صُدُورَهُمۡ لِيَسۡتَخۡفُواْ مِنۡهُۚ أَلَا حِينَ يَسۡتَغۡشُونَ ثِيَابَهُمۡ يَعۡلَمُ مَا يُسِرُّونَ وَمَا يُعۡلِنُونَۚ إِنَّهُۥ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ","End":"٥"},{"SurahNumber":11,"VerseNumber":6,"Text":"۞وَمَا مِن دَآبَّةٖ فِي ٱلۡأَرۡضِ إِلَّا عَلَى ٱللَّهِ رِزۡقُهَا وَيَعۡلَمُ مُسۡتَقَرَّهَا وَمُسۡتَوۡدَعَهَاۚ كُلّٞ فِي كِتَٰبٖ مُّبِينٖ","End":"٦"},{"SurahNumber":11,"VerseNumber":7,"Text":"وَهُوَ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ فِي سِتَّةِ أَيَّامٖ وَكَانَ عَرۡشُهُۥ عَلَى ٱلۡمَآءِ لِيَبۡلُوَكُمۡ أَيُّكُمۡ أَحۡسَنُ عَمَلٗاۗ وَلَئِن قُلۡتَ إِنَّكُم مَّبۡعُوثُونَ مِنۢ بَعۡدِ ٱلۡمَوۡتِ لَيَقُولَنَّ ٱلَّذِينَ كَفَرُوٓاْ إِنۡ هَٰذَآ إِلَّا سِحۡرٞ مُّبِينٞ","End":"٧"},{"SurahNumber":11,"VerseNumber":8,"Text":"وَلَئِنۡ أَخَّرۡنَا عَنۡهُمُ ٱلۡعَذَابَ إِلَىٰٓ أُمَّةٖ مَّعۡدُودَةٖ لَّيَقُولُنَّ مَا يَحۡبِسُهُۥٓۗ أَلَا يَوۡمَ يَأۡتِيهِمۡ لَيۡسَ مَصۡرُوفًا عَنۡهُمۡ وَحَاقَ بِهِم مَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ","End":"٨"},{"SurahNumber":11,"VerseNumber":9,"Text":"وَلَئِنۡ أَذَقۡنَا ٱلۡإِنسَٰنَ مِنَّا رَحۡمَةٗ ثُمَّ نَزَعۡنَٰهَا مِنۡهُ إِنَّهُۥ لَيَـُٔوسٞ كَفُورٞ","End":"٩"},{"SurahNumber":11,"VerseNumber":10,"Text":"وَلَئِنۡ أَذَقۡنَٰهُ نَعۡمَآءَ بَعۡدَ ضَرَّآءَ مَسَّتۡهُ لَيَقُولَنَّ ذَهَبَ ٱلسَّيِّـَٔاتُ عَنِّيٓۚ إِنَّهُۥ لَفَرِحٞ فَخُورٌ","End":"١٠"},{"SurahNumber":11,"VerseNumber":11,"Text":"إِلَّا ٱلَّذِينَ صَبَرُواْ وَعَمِلُواْ ٱلصَّـٰلِحَٰتِ أُوْلَـٰٓئِكَ لَهُم مَّغۡفِرَةٞ وَأَجۡرٞ كَبِيرٞ","End":"١١"},{"SurahNumber":11,"VerseNumber":12,"Text":"فَلَعَلَّكَ تَارِكُۢ بَعۡضَ مَا يُوحَىٰٓ إِلَيۡكَ وَضَآئِقُۢ بِهِۦ صَدۡرُكَ أَن يَقُولُواْ لَوۡلَآ أُنزِلَ عَلَيۡهِ كَنزٌ أَوۡ جَآءَ مَعَهُۥ مَلَكٌۚ إِنَّمَآ أَنتَ نَذِيرٞۚ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ وَكِيلٌ","End":"١٢"},{"SurahNumber":11,"VerseNumber":13,"Text":"أَمۡ يَقُولُونَ ٱفۡتَرَىٰهُۖ قُلۡ فَأۡتُواْ بِعَشۡرِ سُوَرٖ مِّثۡلِهِۦ مُفۡتَرَيَٰتٖ وَٱدۡعُواْ مَنِ ٱسۡتَطَعۡتُم مِّن دُونِ ٱللَّهِ إِن كُنتُمۡ صَٰدِقِينَ","End":"١٣"},{"SurahNumber":11,"VerseNumber":14,"Text":"فَإِلَّمۡ يَسۡتَجِيبُواْ لَكُمۡ فَٱعۡلَمُوٓاْ أَنَّمَآ أُنزِلَ بِعِلۡمِ ٱللَّهِ وَأَن لَّآ إِلَٰهَ إِلَّا هُوَۖ فَهَلۡ أَنتُم مُّسۡلِمُونَ","End":"١٤"},{"SurahNumber":11,"VerseNumber":15,"Text":"مَن كَانَ يُرِيدُ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا وَزِينَتَهَا نُوَفِّ إِلَيۡهِمۡ أَعۡمَٰلَهُمۡ فِيهَا وَهُمۡ فِيهَا لَا يُبۡخَسُونَ","End":"١٥"},{"SurahNumber":11,"VerseNumber":16,"Text":"أُوْلَـٰٓئِكَ ٱلَّذِينَ لَيۡسَ لَهُمۡ فِي ٱلۡأٓخِرَةِ إِلَّا ٱلنَّارُۖ وَحَبِطَ مَا صَنَعُواْ فِيهَا وَبَٰطِلٞ مَّا كَانُواْ يَعۡمَلُونَ","End":"١٦"},{"SurahNumber":11,"VerseNumber":17,"Text":"أَفَمَن كَانَ عَلَىٰ بَيِّنَةٖ مِّن رَّبِّهِۦ وَيَتۡلُوهُ شَاهِدٞ مِّنۡهُ وَمِن قَبۡلِهِۦ كِتَٰبُ مُوسَىٰٓ إِمَامٗا وَرَحۡمَةًۚ أُوْلَـٰٓئِكَ يُؤۡمِنُونَ بِهِۦۚ وَمَن يَكۡفُرۡ بِهِۦ مِنَ ٱلۡأَحۡزَابِ فَٱلنَّارُ مَوۡعِدُهُۥۚ فَلَا تَكُ فِي مِرۡيَةٖ مِّنۡهُۚ إِنَّهُ ٱلۡحَقُّ مِن رَّبِّكَ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يُؤۡمِنُونَ","End":"١٧"},{"SurahNumber":11,"VerseNumber":18,"Text":"وَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًاۚ أُوْلَـٰٓئِكَ يُعۡرَضُونَ عَلَىٰ رَبِّهِمۡ وَيَقُولُ ٱلۡأَشۡهَٰدُ هَـٰٓؤُلَآءِ ٱلَّذِينَ كَذَبُواْ عَلَىٰ رَبِّهِمۡۚ أَلَا لَعۡنَةُ ٱللَّهِ عَلَى ٱلظَّـٰلِمِينَ","End":"١٨"},{"SurahNumber":11,"VerseNumber":19,"Text":"ٱلَّذِينَ يَصُدُّونَ عَن سَبِيلِ ٱللَّهِ وَيَبۡغُونَهَا عِوَجٗا وَهُم بِٱلۡأٓخِرَةِ هُمۡ كَٰفِرُونَ","End":"١٩"},{"SurahNumber":11,"VerseNumber":20,"Text":"أُوْلَـٰٓئِكَ لَمۡ يَكُونُواْ مُعۡجِزِينَ فِي ٱلۡأَرۡضِ وَمَا كَانَ لَهُم مِّن دُونِ ٱللَّهِ مِنۡ أَوۡلِيَآءَۘ يُضَٰعَفُ لَهُمُ ٱلۡعَذَابُۚ مَا كَانُواْ يَسۡتَطِيعُونَ ٱلسَّمۡعَ وَمَا كَانُواْ يُبۡصِرُونَ","End":"٢٠"},{"SurahNumber":11,"VerseNumber":21,"Text":"أُوْلَـٰٓئِكَ ٱلَّذِينَ خَسِرُوٓاْ أَنفُسَهُمۡ وَضَلَّ عَنۡهُم مَّا كَانُواْ يَفۡتَرُونَ","End":"٢١"},{"SurahNumber":11,"VerseNumber":22,"Text":"لَا جَرَمَ أَنَّهُمۡ فِي ٱلۡأٓخِرَةِ هُمُ ٱلۡأَخۡسَرُونَ","End":"٢٢"},{"SurahNumber":11,"VerseNumber":23,"Text":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّـٰلِحَٰتِ وَأَخۡبَتُوٓاْ إِلَىٰ رَبِّهِمۡ أُوْلَـٰٓئِكَ أَصۡحَٰبُ ٱلۡجَنَّةِۖ هُمۡ فِيهَا خَٰلِدُونَ","End":"٢٣"},{"SurahNumber":11,"VerseNumber":24,"Text":"۞مَثَلُ ٱلۡفَرِيقَيۡنِ كَٱلۡأَعۡمَىٰ وَٱلۡأَصَمِّ وَٱلۡبَصِيرِ وَٱلسَّمِيعِۚ هَلۡ يَسۡتَوِيَانِ مَثَلًاۚ أَفَلَا تَذَكَّرُونَ","End":"٢٤"},{"SurahNumber":11,"VerseNumber":25,"Text":"وَلَقَدۡ أَرۡسَلۡنَا نُوحًا إِلَىٰ قَوۡمِهِۦٓ إِنِّي لَكُمۡ نَذِيرٞ مُّبِينٌ","End":"٢٥"},{"SurahNumber":11,"VerseNumber":26,"Text":"أَن لَّا تَعۡبُدُوٓاْ إِلَّا ٱللَّهَۖ إِنِّيٓ أَخَافُ عَلَيۡكُمۡ عَذَابَ يَوۡمٍ أَلِيمٖ","End":"٢٦"},{"SurahNumber":11,"VerseNumber":27,"Text":"فَقَالَ ٱلۡمَلَأُ ٱلَّذِينَ كَفَرُواْ مِن قَوۡمِهِۦ مَا نَرَىٰكَ إِلَّا بَشَرٗا مِّثۡلَنَا وَمَا نَرَىٰكَ ٱتَّبَعَكَ إِلَّا ٱلَّذِينَ هُمۡ أَرَاذِلُنَا بَادِيَ ٱلرَّأۡيِ وَمَا نَرَىٰ لَكُمۡ عَلَيۡنَا مِن فَضۡلِۭ بَلۡ نَظُنُّكُمۡ كَٰذِبِينَ","End":"٢٧"},{"SurahNumber":11,"VerseNumber":28,"Text":"قَالَ يَٰقَوۡمِ أَرَءَيۡتُمۡ إِن كُنتُ عَلَىٰ بَيِّنَةٖ مِّن رَّبِّي وَءَاتَىٰنِي رَحۡمَةٗ مِّنۡ عِندِهِۦ فَعُمِّيَتۡ عَلَيۡكُمۡ أَنُلۡزِمُكُمُوهَا وَأَنتُمۡ لَهَا كَٰرِهُونَ","End":"٢٨"},{"SurahNumber":11,"VerseNumber":29,"Text":"وَيَٰقَوۡمِ لَآ أَسۡـَٔلُكُمۡ عَلَيۡهِ مَالًاۖ إِنۡ أَجۡرِيَ إِلَّا عَلَى ٱللَّهِۚ وَمَآ أَنَا۠ بِطَارِدِ ٱلَّذِينَ ءَامَنُوٓاْۚ إِنَّهُم مُّلَٰقُواْ رَبِّهِمۡ وَلَٰكِنِّيٓ أَرَىٰكُمۡ قَوۡمٗا تَجۡهَلُونَ","End":"٢٩"},{"SurahNumber":11,"VerseNumber":30,"Text":"وَيَٰقَوۡمِ مَن يَنصُرُنِي مِنَ ٱللَّهِ إِن طَرَدتُّهُمۡۚ أَفَلَا تَذَكَّرُونَ","End":"٣٠"},{"SurahNumber":11,"VerseNumber":31,"Text":"وَلَآ أَقُولُ لَكُمۡ عِندِي خَزَآئِنُ ٱللَّهِ وَلَآ أَعۡلَمُ ٱلۡغَيۡبَ وَلَآ أَقُولُ إِنِّي مَلَكٞ وَلَآ أَقُولُ لِلَّذِينَ تَزۡدَرِيٓ أَعۡيُنُكُمۡ لَن يُؤۡتِيَهُمُ ٱللَّهُ خَيۡرًاۖ ٱللَّهُ أَعۡلَمُ بِمَا فِيٓ أَنفُسِهِمۡ إِنِّيٓ إِذٗا لَّمِنَ ٱلظَّـٰلِمِينَ","End":"٣١"},{"SurahNumber":11,"VerseNumber":32,"Text":"قَالُواْ يَٰنُوحُ قَدۡ جَٰدَلۡتَنَا فَأَكۡثَرۡتَ جِدَٰلَنَا فَأۡتِنَا بِمَا تَعِدُنَآ إِن كُنتَ مِنَ ٱلصَّـٰدِقِينَ","End":"٣٢"},{"SurahNumber":11,"VerseNumber":33,"Text":"قَالَ إِنَّمَا يَأۡتِيكُم بِهِ ٱللَّهُ إِن شَآءَ وَمَآ أَنتُم بِمُعۡجِزِينَ","End":"٣٣"},{"SurahNumber":11,"VerseNumber":34,"Text":"وَلَا يَنفَعُكُمۡ نُصۡحِيٓ إِنۡ أَرَدتُّ أَنۡ أَنصَحَ لَكُمۡ إِن كَانَ ٱللَّهُ يُرِيدُ أَن يُغۡوِيَكُمۡۚ هُوَ رَبُّكُمۡ وَإِلَيۡهِ تُرۡجَعُونَ","End":"٣٤"},{"SurahNumber":11,"VerseNumber":35,"Text":"أَمۡ يَقُولُونَ ٱفۡتَرَىٰهُۖ قُلۡ إِنِ ٱفۡتَرَيۡتُهُۥ فَعَلَيَّ إِجۡرَامِي وَأَنَا۠ بَرِيٓءٞ مِّمَّا تُجۡرِمُونَ","End":"٣٥"},{"SurahNumber":11,"VerseNumber":36,"Text":"وَأُوحِيَ إِلَىٰ نُوحٍ أَنَّهُۥ لَن يُؤۡمِنَ مِن قَوۡمِكَ إِلَّا مَن قَدۡ ءَامَنَ فَلَا تَبۡتَئِسۡ بِمَا كَانُواْ يَفۡعَلُونَ","End":"٣٦"},{"SurahNumber":11,"VerseNumber":37,"Text":"وَٱصۡنَعِ ٱلۡفُلۡكَ بِأَعۡيُنِنَا وَوَحۡيِنَا وَلَا تُخَٰطِبۡنِي فِي ٱلَّذِينَ ظَلَمُوٓاْ إِنَّهُم مُّغۡرَقُونَ","End":"٣٧"},{"SurahNumber":11,"VerseNumber":38,"Text":"وَيَصۡنَعُ ٱلۡفُلۡكَ وَكُلَّمَا مَرَّ عَلَيۡهِ مَلَأٞ مِّن قَوۡمِهِۦ سَخِرُواْ مِنۡهُۚ قَالَ إِن تَسۡخَرُواْ مِنَّا فَإِنَّا نَسۡخَرُ مِنكُمۡ كَمَا تَسۡخَرُونَ","End":"٣٨"},{"SurahNumber":11,"VerseNumber":39,"Text":"فَسَوۡفَ تَعۡلَمُونَ مَن يَأۡتِيهِ عَذَابٞ يُخۡزِيهِ وَيَحِلُّ عَلَيۡهِ عَذَابٞ مُّقِيمٌ","End":"٣٩"},{"SurahNumber":11,"VerseNumber":40,"Text":"حَتَّىٰٓ إِذَا جَآءَ أَمۡرُنَا وَفَارَ ٱلتَّنُّورُ قُلۡنَا ٱحۡمِلۡ فِيهَا مِن كُلّٖ زَوۡجَيۡنِ ٱثۡنَيۡنِ وَأَهۡلَكَ إِلَّا مَن سَبَقَ عَلَيۡهِ ٱلۡقَوۡلُ وَمَنۡ ءَامَنَۚ وَمَآ ءَامَنَ مَعَهُۥٓ إِلَّا قَلِيلٞ","End":"٤٠"},{"SurahNumber":11,"VerseNumber":41,"Text":"۞وَقَالَ ٱرۡكَبُواْ فِيهَا بِسۡمِ ٱللَّهِ مَجۡرٜىٰهَا وَمُرۡسَىٰهَآۚ إِنَّ رَبِّي لَغَفُورٞ رَّحِيمٞ","End":"٤١"},{"SurahNumber":11,"VerseNumber":42,"Text":"وَهِيَ تَجۡرِي بِهِمۡ فِي مَوۡجٖ كَٱلۡجِبَالِ وَنَادَىٰ نُوحٌ ٱبۡنَهُۥ وَكَانَ فِي مَعۡزِلٖ يَٰبُنَيَّ ٱرۡكَب مَّعَنَا وَلَا تَكُن مَّعَ ٱلۡكَٰفِرِينَ","End":"٤٢"},{"SurahNumber":11,"VerseNumber":43,"Text":"قَالَ سَـَٔاوِيٓ إِلَىٰ جَبَلٖ يَعۡصِمُنِي مِنَ ٱلۡمَآءِۚ قَالَ لَا عَاصِمَ ٱلۡيَوۡمَ مِنۡ أَمۡرِ ٱللَّهِ إِلَّا مَن رَّحِمَۚ وَحَالَ بَيۡنَهُمَا ٱلۡمَوۡجُ فَكَانَ مِنَ ٱلۡمُغۡرَقِينَ","End":"٤٣"},{"SurahNumber":11,"VerseNumber":44,"Text":"وَقِيلَ يَـٰٓأَرۡضُ ٱبۡلَعِي مَآءَكِ وَيَٰسَمَآءُ أَقۡلِعِي وَغِيضَ ٱلۡمَآءُ وَقُضِيَ ٱلۡأَمۡرُ وَٱسۡتَوَتۡ عَلَى ٱلۡجُودِيِّۖ وَقِيلَ بُعۡدٗا لِّلۡقَوۡمِ ٱلظَّـٰلِمِينَ","End":"٤٤"},{"SurahNumber":11,"VerseNumber":45,"Text":"وَنَادَىٰ نُوحٞ رَّبَّهُۥ فَقَالَ رَبِّ إِنَّ ٱبۡنِي مِنۡ أَهۡلِي وَإِنَّ وَعۡدَكَ ٱلۡحَقُّ وَأَنتَ أَحۡكَمُ ٱلۡحَٰكِمِينَ","End":"٤٥"},{"SurahNumber":11,"VerseNumber":46,"Text":"قَالَ يَٰنُوحُ إِنَّهُۥ لَيۡسَ مِنۡ أَهۡلِكَۖ إِنَّهُۥ عَمَلٌ غَيۡرُ صَٰلِحٖۖ فَلَا تَسۡـَٔلۡنِ مَا لَيۡسَ لَكَ بِهِۦ عِلۡمٌۖ إِنِّيٓ أَعِظُكَ أَن تَكُونَ مِنَ ٱلۡجَٰهِلِينَ","End":"٤٦"},{"SurahNumber":11,"VerseNumber":47,"Text":"قَالَ رَبِّ إِنِّيٓ أَعُوذُ بِكَ أَنۡ أَسۡـَٔلَكَ مَا لَيۡسَ لِي بِهِۦ عِلۡمٞۖ وَإِلَّا تَغۡفِرۡ لِي وَتَرۡحَمۡنِيٓ أَكُن مِّنَ ٱلۡخَٰسِرِينَ","End":"٤٧"},{"SurahNumber":11,"VerseNumber":48,"Text":"قِيلَ يَٰنُوحُ ٱهۡبِطۡ بِسَلَٰمٖ مِّنَّا وَبَرَكَٰتٍ عَلَيۡكَ وَعَلَىٰٓ أُمَمٖ مِّمَّن مَّعَكَۚ وَأُمَمٞ سَنُمَتِّعُهُمۡ ثُمَّ يَمَسُّهُم مِّنَّا عَذَابٌ أَلِيمٞ","End":"٤٨"},{"SurahNumber":11,"VerseNumber":49,"Text":"تِلۡكَ مِنۡ أَنۢبَآءِ ٱلۡغَيۡبِ نُوحِيهَآ إِلَيۡكَۖ مَا كُنتَ تَعۡلَمُهَآ أَنتَ وَلَا قَوۡمُكَ مِن قَبۡلِ هَٰذَاۖ فَٱصۡبِرۡۖ إِنَّ ٱلۡعَٰقِبَةَ لِلۡمُتَّقِينَ","End":"٤٩"},{"SurahNumber":11,"VerseNumber":50,"Text":"وَإِلَىٰ عَادٍ أَخَاهُمۡ هُودٗاۚ قَالَ يَٰقَوۡمِ ٱعۡبُدُواْ ٱللَّهَ مَا لَكُم مِّنۡ إِلَٰهٍ غَيۡرُهُۥٓۖ إِنۡ أَنتُمۡ إِلَّا مُفۡتَرُونَ","End":"٥٠"},{"SurahNumber":11,"VerseNumber":51,"Text":"يَٰقَوۡمِ لَآ أَسۡـَٔلُكُمۡ عَلَيۡهِ أَجۡرًاۖ إِنۡ أَجۡرِيَ إِلَّا عَلَى ٱلَّذِي فَطَرَنِيٓۚ أَفَلَا تَعۡقِلُونَ","End":"٥١"},{"SurahNumber":11,"VerseNumber":52,"Text":"وَيَٰقَوۡمِ ٱسۡتَغۡفِرُواْ رَبَّكُمۡ ثُمَّ تُوبُوٓاْ إِلَيۡهِ يُرۡسِلِ ٱلسَّمَآءَ عَلَيۡكُم مِّدۡرَارٗا وَيَزِدۡكُمۡ قُوَّةً إِلَىٰ قُوَّتِكُمۡ وَلَا تَتَوَلَّوۡاْ مُجۡرِمِينَ","End":"٥٢"},{"SurahNumber":11,"VerseNumber":53,"Text":"قَالُواْ يَٰهُودُ مَا جِئۡتَنَا بِبَيِّنَةٖ وَمَا نَحۡنُ بِتَارِكِيٓ ءَالِهَتِنَا عَن قَوۡلِكَ وَمَا نَحۡنُ لَكَ بِمُؤۡمِنِينَ","End":"٥٣"},{"SurahNumber":11,"VerseNumber":54,"Text":"إِن نَّقُولُ إِلَّا ٱعۡتَرَىٰكَ بَعۡضُ ءَالِهَتِنَا بِسُوٓءٖۗ قَالَ إِنِّيٓ أُشۡهِدُ ٱللَّهَ وَٱشۡهَدُوٓاْ أَنِّي بَرِيٓءٞ مِّمَّا تُشۡرِكُونَ","End":"٥٤"},{"SurahNumber":11,"VerseNumber":55,"Text":"مِن دُونِهِۦۖ فَكِيدُونِي جَمِيعٗا ثُمَّ لَا تُنظِرُونِ","End":"٥٥"},{"SurahNumber":11,"VerseNumber":56,"Text":"إِنِّي تَوَكَّلۡتُ عَلَى ٱللَّهِ رَبِّي وَرَبِّكُمۚ مَّا مِن دَآبَّةٍ إِلَّا هُوَ ءَاخِذُۢ بِنَاصِيَتِهَآۚ إِنَّ رَبِّي عَلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ","End":"٥٦"},{"SurahNumber":11,"VerseNumber":57,"Text":"فَإِن تَوَلَّوۡاْ فَقَدۡ أَبۡلَغۡتُكُم مَّآ أُرۡسِلۡتُ بِهِۦٓ إِلَيۡكُمۡۚ وَيَسۡتَخۡلِفُ رَبِّي قَوۡمًا غَيۡرَكُمۡ وَلَا تَضُرُّونَهُۥ شَيۡـًٔاۚ إِنَّ رَبِّي عَلَىٰ كُلِّ شَيۡءٍ حَفِيظٞ","End":"٥٧"},{"SurahNumber":11,"VerseNumber":58,"Text":"وَلَمَّا جَآءَ أَمۡرُنَا نَجَّيۡنَا هُودٗا وَٱلَّذِينَ ءَامَنُواْ مَعَهُۥ بِرَحۡمَةٖ مِّنَّا وَنَجَّيۡنَٰهُم مِّنۡ عَذَابٍ غَلِيظٖ","End":"٥٨"},{"SurahNumber":11,"VerseNumber":59,"Text":"وَتِلۡكَ عَادٞۖ جَحَدُواْ بِـَٔايَٰتِ رَبِّهِمۡ وَعَصَوۡاْ رُسُلَهُۥ وَٱتَّبَعُوٓاْ أَمۡرَ كُلِّ جَبَّارٍ عَنِيدٖ","End":"٥٩"},{"SurahNumber":11,"VerseNumber":60,"Text":"وَأُتۡبِعُواْ فِي هَٰذِهِ ٱلدُّنۡيَا لَعۡنَةٗ وَيَوۡمَ ٱلۡقِيَٰمَةِۗ أَلَآ إِنَّ عَادٗا كَفَرُواْ رَبَّهُمۡۗ أَلَا بُعۡدٗا لِّعَادٖ قَوۡمِ هُودٖ","End":"٦٠"},{"SurahNumber":11,"VerseNumber":61,"Text":"۞وَإِلَىٰ ثَمُودَ أَخَاهُمۡ صَٰلِحٗاۚ قَالَ يَٰقَوۡمِ ٱعۡبُدُواْ ٱللَّهَ مَا لَكُم مِّنۡ إِلَٰهٍ غَيۡرُهُۥۖ هُوَ أَنشَأَكُم مِّنَ ٱلۡأَرۡضِ وَٱسۡتَعۡمَرَكُمۡ فِيهَا فَٱسۡتَغۡفِرُوهُ ثُمَّ تُوبُوٓاْ إِلَيۡهِۚ إِنَّ رَبِّي قَرِيبٞ مُّجِيبٞ","End":"٦١"},{"SurahNumber":11,"VerseNumber":62,"Text":"قَالُواْ يَٰصَٰلِحُ قَدۡ كُنتَ فِينَا مَرۡجُوّٗا قَبۡلَ هَٰذَآۖ أَتَنۡهَىٰنَآ أَن نَّعۡبُدَ مَا يَعۡبُدُ ءَابَآؤُنَا وَإِنَّنَا لَفِي شَكّٖ مِّمَّا تَدۡعُونَآ إِلَيۡهِ مُرِيبٖ","End":"٦٢"},{"SurahNumber":11,"VerseNumber":63,"Text":"قَالَ يَٰقَوۡمِ أَرَءَيۡتُمۡ إِن كُنتُ عَلَىٰ بَيِّنَةٖ مِّن رَّبِّي وَءَاتَىٰنِي مِنۡهُ رَحۡمَةٗ فَمَن يَنصُرُنِي مِنَ ٱللَّهِ إِنۡ عَصَيۡتُهُۥۖ فَمَا تَزِيدُونَنِي غَيۡرَ تَخۡسِيرٖ","End":"٦٣"},{"SurahNumber":11,"VerseNumber":64,"Text":"وَيَٰقَوۡمِ هَٰذِهِۦ نَاقَةُ ٱللَّهِ لَكُمۡ ءَايَةٗۖ فَذَرُوهَا تَأۡكُلۡ فِيٓ أَرۡضِ ٱللَّهِۖ وَلَا تَمَسُّوهَا بِسُوٓءٖ فَيَأۡخُذَكُمۡ عَذَابٞ قَرِيبٞ","End":"٦٤"},{"SurahNumber":11,"VerseNumber":65,"Text":"فَعَقَرُوهَا فَقَالَ تَمَتَّعُواْ فِي دَارِكُمۡ ثَلَٰثَةَ أَيَّامٖۖ ذَٰلِكَ وَعۡدٌ غَيۡرُ مَكۡذُوبٖ","End":"٦٥"},{"SurahNumber":11,"VerseNumber":66,"Text":"فَلَمَّا جَآءَ أَمۡرُنَا نَجَّيۡنَا صَٰلِحٗا وَٱلَّذِينَ ءَامَنُواْ مَعَهُۥ بِرَحۡمَةٖ مِّنَّا وَمِنۡ خِزۡيِ يَوۡمِئِذٍۚ إِنَّ رَبَّكَ هُوَ ٱلۡقَوِيُّ ٱلۡعَزِيزُ","End":"٦٦"},{"SurahNumber":11,"VerseNumber":67,"Text":"وَأَخَذَ ٱلَّذِينَ ظَلَمُواْ ٱلصَّيۡحَةُ فَأَصۡبَحُواْ فِي دِيَٰرِهِمۡ جَٰثِمِينَ","End":"٦٧"},{"SurahNumber":11,"VerseNumber":68,"Text":"كَأَن لَّمۡ يَغۡنَوۡاْ فِيهَآۗ أَلَآ إِنَّ ثَمُودَاْ كَفَرُواْ رَبَّهُمۡۗ أَلَا بُعۡدٗا لِّثَمُودَ","End":"٦٨"},{"SurahNumber":11,"VerseNumber":69,"Text":"وَلَقَدۡ جَآءَتۡ رُسُلُنَآ إِبۡرَٰهِيمَ بِٱلۡبُشۡرَىٰ قَالُواْ سَلَٰمٗاۖ قَالَ سَلَٰمٞۖ فَمَا لَبِثَ أَن جَآءَ بِعِجۡلٍ حَنِيذٖ","End":"٦٩"},{"SurahNumber":11,"VerseNumber":70,"Text":"فَلَمَّا رَءَآ أَيۡدِيَهُمۡ لَا تَصِلُ إِلَيۡهِ نَكِرَهُمۡ وَأَوۡجَسَ مِنۡهُمۡ خِيفَةٗۚ قَالُواْ لَا تَخَفۡ إِنَّآ أُرۡسِلۡنَآ إِلَىٰ قَوۡمِ لُوطٖ","End":"٧٠"},{"SurahNumber":11,"VerseNumber":71,"Text":"وَٱمۡرَأَتُهُۥ قَآئِمَةٞ فَضَحِكَتۡ فَبَشَّرۡنَٰهَا بِإِسۡحَٰقَ وَمِن وَرَآءِ إِسۡحَٰقَ يَعۡقُوبَ","End":"٧١"},{"SurahNumber":11,"VerseNumber":72,"Text":"قَالَتۡ يَٰوَيۡلَتَىٰٓ ءَأَلِدُ وَأَنَا۠ عَجُوزٞ وَهَٰذَا بَعۡلِي شَيۡخًاۖ إِنَّ هَٰذَا لَشَيۡءٌ عَجِيبٞ","End":"٧٢"},{"SurahNumber":11,"VerseNumber":73,"Text":"قَالُوٓاْ أَتَعۡجَبِينَ مِنۡ أَمۡرِ ٱللَّهِۖ رَحۡمَتُ ٱللَّهِ وَبَرَكَٰتُهُۥ عَلَيۡكُمۡ أَهۡلَ ٱلۡبَيۡتِۚ إِنَّهُۥ حَمِيدٞ مَّجِيدٞ","End":"٧٣"},{"SurahNumber":11,"VerseNumber":74,"Text":"فَلَمَّا ذَهَبَ عَنۡ إِبۡرَٰهِيمَ ٱلرَّوۡعُ وَجَآءَتۡهُ ٱلۡبُشۡرَىٰ يُجَٰدِلُنَا فِي قَوۡمِ لُوطٍ","End":"٧٤"},{"SurahNumber":11,"VerseNumber":75,"Text":"إِنَّ إِبۡرَٰهِيمَ لَحَلِيمٌ أَوَّـٰهٞ مُّنِيبٞ","End":"٧٥"},{"SurahNumber":11,"VerseNumber":76,"Text":"يَـٰٓإِبۡرَٰهِيمُ أَعۡرِضۡ عَنۡ هَٰذَآۖ إِنَّهُۥ قَدۡ جَآءَ أَمۡرُ رَبِّكَۖ وَإِنَّهُمۡ ءَاتِيهِمۡ عَذَابٌ غَيۡرُ مَرۡدُودٖ","End":"٧٦"},{"SurahNumber":11,"VerseNumber":77,"Text":"وَلَمَّا جَآءَتۡ رُسُلُنَا لُوطٗا سِيٓءَ بِهِمۡ وَضَاقَ بِهِمۡ ذَرۡعٗا وَقَالَ هَٰذَا يَوۡمٌ عَصِيبٞ","End":"٧٧"},{"SurahNumber":11,"VerseNumber":78,"Text":"وَجَآءَهُۥ قَوۡمُهُۥ يُهۡرَعُونَ إِلَيۡهِ وَمِن قَبۡلُ كَانُواْ يَعۡمَلُونَ ٱلسَّيِّـَٔاتِۚ قَالَ يَٰقَوۡمِ هَـٰٓؤُلَآءِ بَنَاتِي هُنَّ أَطۡهَرُ لَكُمۡۖ فَٱتَّقُواْ ٱللَّهَ وَلَا تُخۡزُونِ فِي ضَيۡفِيٓۖ أَلَيۡسَ مِنكُمۡ رَجُلٞ رَّشِيدٞ","End":"٧٨"},{"SurahNumber":11,"VerseNumber":79,"Text":"قَالُواْ لَقَدۡ عَلِمۡتَ مَا لَنَا فِي بَنَاتِكَ مِنۡ حَقّٖ وَإِنَّكَ لَتَعۡلَمُ مَا نُرِيدُ","End":"٧٩"},{"SurahNumber":11,"VerseNumber":80,"Text":"قَالَ لَوۡ أَنَّ لِي بِكُمۡ قُوَّةً أَوۡ ءَاوِيٓ إِلَىٰ رُكۡنٖ شَدِيدٖ","End":"٨٠"},{"SurahNumber":11,"VerseNumber":81,"Text":"قَالُواْ يَٰلُوطُ إِنَّا رُسُلُ رَبِّكَ لَن يَصِلُوٓاْ إِلَيۡكَۖ فَأَسۡرِ بِأَهۡلِكَ بِقِطۡعٖ مِّنَ ٱلَّيۡلِ وَلَا يَلۡتَفِتۡ مِنكُمۡ أَحَدٌ إِلَّا ٱمۡرَأَتَكَۖ إِنَّهُۥ مُصِيبُهَا مَآ أَصَابَهُمۡۚ إِنَّ مَوۡعِدَهُمُ ٱلصُّبۡحُۚ أَلَيۡسَ ٱلصُّبۡحُ بِقَرِيبٖ","End":"٨١"},{"SurahNumber":11,"VerseNumber":82,"Text":"فَلَمَّا جَآءَ أَمۡرُنَا جَعَلۡنَا عَٰلِيَهَا سَافِلَهَا وَأَمۡطَرۡنَا عَلَيۡهَا حِجَارَةٗ مِّن سِجِّيلٖ مَّنضُودٖ","End":"٨٢"},{"SurahNumber":11,"VerseNumber":83,"Text":"مُّسَوَّمَةً عِندَ رَبِّكَۖ وَمَا هِيَ مِنَ ٱلظَّـٰلِمِينَ بِبَعِيدٖ","End":"٨٣"},{"SurahNumber":11,"VerseNumber":84,"Text":"۞وَإِلَىٰ مَدۡيَنَ أَخَاهُمۡ شُعَيۡبٗاۚ قَالَ يَٰقَوۡمِ ٱعۡبُدُواْ ٱللَّهَ مَا لَكُم مِّنۡ إِلَٰهٍ غَيۡرُهُۥۖ وَلَا تَنقُصُواْ ٱلۡمِكۡيَالَ وَٱلۡمِيزَانَۖ إِنِّيٓ أَرَىٰكُم بِخَيۡرٖ وَإِنِّيٓ أَخَافُ عَلَيۡكُمۡ عَذَابَ يَوۡمٖ مُّحِيطٖ","End":"٨٤"},{"SurahNumber":11,"VerseNumber":85,"Text":"وَيَٰقَوۡمِ أَوۡفُواْ ٱلۡمِكۡيَالَ وَٱلۡمِيزَانَ بِٱلۡقِسۡطِۖ وَلَا تَبۡخَسُواْ ٱلنَّاسَ أَشۡيَآءَهُمۡ وَلَا تَعۡثَوۡاْ فِي ٱلۡأَرۡضِ مُفۡسِدِينَ","End":"٨٥"},{"SurahNumber":11,"VerseNumber":86,"Text":"بَقِيَّتُ ٱللَّهِ خَيۡرٞ لَّكُمۡ إِن كُنتُم مُّؤۡمِنِينَۚ وَمَآ أَنَا۠ عَلَيۡكُم بِحَفِيظٖ","End":"٨٦"},{"SurahNumber":11,"VerseNumber":87,"Text":"قَالُواْ يَٰشُعَيۡبُ أَصَلَوٰتُكَ تَأۡمُرُكَ أَن نَّتۡرُكَ مَا يَعۡبُدُ ءَابَآؤُنَآ أَوۡ أَن نَّفۡعَلَ فِيٓ أَمۡوَٰلِنَا مَا نَشَـٰٓؤُاْۖ إِنَّكَ لَأَنتَ ٱلۡحَلِيمُ ٱلرَّشِيدُ","End":"٨٧"},{"SurahNumber":11,"VerseNumber":88,"Text":"قَالَ يَٰقَوۡمِ أَرَءَيۡتُمۡ إِن كُنتُ عَلَىٰ بَيِّنَةٖ مِّن رَّبِّي وَرَزَقَنِي مِنۡهُ رِزۡقًا حَسَنٗاۚ وَمَآ أُرِيدُ أَنۡ أُخَالِفَكُمۡ إِلَىٰ مَآ أَنۡهَىٰكُمۡ عَنۡهُۚ إِنۡ أُرِيدُ إِلَّا ٱلۡإِصۡلَٰحَ مَا ٱسۡتَطَعۡتُۚ وَمَا تَوۡفِيقِيٓ إِلَّا بِٱللَّهِۚ عَلَيۡهِ تَوَكَّلۡتُ وَإِلَيۡهِ أُنِيبُ","End":"٨٨"},{"SurahNumber":11,"VerseNumber":89,"Text":"وَيَٰقَوۡمِ لَا يَجۡرِمَنَّكُمۡ شِقَاقِيٓ أَن يُصِيبَكُم مِّثۡلُ مَآ أَصَابَ قَوۡمَ نُوحٍ أَوۡ قَوۡمَ هُودٍ أَوۡ قَوۡمَ صَٰلِحٖۚ وَمَا قَوۡمُ لُوطٖ مِّنكُم بِبَعِيدٖ","End":"٨٩"},{"SurahNumber":11,"VerseNumber":90,"Text":"وَٱسۡتَغۡفِرُواْ رَبَّكُمۡ ثُمَّ تُوبُوٓاْ إِلَيۡهِۚ إِنَّ رَبِّي رَحِيمٞ وَدُودٞ","End":"٩٠"},{"SurahNumber":11,"VerseNumber":91,"Text":"قَالُواْ يَٰشُعَيۡبُ مَا نَفۡقَهُ كَثِيرٗا مِّمَّا تَقُولُ وَإِنَّا لَنَرَىٰكَ فِينَا ضَعِيفٗاۖ وَلَوۡلَا رَهۡطُكَ لَرَجَمۡنَٰكَۖ وَمَآ أَنتَ عَلَيۡنَا بِعَزِيزٖ","End":"٩١"},{"SurahNumber":11,"VerseNumber":92,"Text":"قَالَ يَٰقَوۡمِ أَرَهۡطِيٓ أَعَزُّ عَلَيۡكُم مِّنَ ٱللَّهِ وَٱتَّخَذۡتُمُوهُ وَرَآءَكُمۡ ظِهۡرِيًّاۖ إِنَّ رَبِّي بِمَا تَعۡمَلُونَ مُحِيطٞ","End":"٩٢"},{"SurahNumber":11,"VerseNumber":93,"Text":"وَيَٰقَوۡمِ ٱعۡمَلُواْ عَلَىٰ مَكَانَتِكُمۡ إِنِّي عَٰمِلٞۖ سَوۡفَ تَعۡلَمُونَ مَن يَأۡتِيهِ عَذَابٞ يُخۡزِيهِ وَمَنۡ هُوَ كَٰذِبٞۖ وَٱرۡتَقِبُوٓاْ إِنِّي مَعَكُمۡ رَقِيبٞ","End":"٩٣"},{"SurahNumber":11,"VerseNumber":94,"Text":"وَلَمَّا جَآءَ أَمۡرُنَا نَجَّيۡنَا شُعَيۡبٗا وَٱلَّذِينَ ءَامَنُواْ مَعَهُۥ بِرَحۡمَةٖ مِّنَّا وَأَخَذَتِ ٱلَّذِينَ ظَلَمُواْ ٱلصَّيۡحَةُ فَأَصۡبَحُواْ فِي دِيَٰرِهِمۡ جَٰثِمِينَ","End":"٩٤"},{"SurahNumber":11,"VerseNumber":95,"Text":"كَأَن لَّمۡ يَغۡنَوۡاْ فِيهَآۗ أَلَا بُعۡدٗا لِّمَدۡيَنَ كَمَا بَعِدَتۡ ثَمُودُ","End":"٩٥"},{"SurahNumber":11,"VerseNumber":96,"Text":"وَلَقَدۡ أَرۡسَلۡنَا مُوسَىٰ بِـَٔايَٰتِنَا وَسُلۡطَٰنٖ مُّبِينٍ","End":"٩٦"},{"SurahNumber":11,"VerseNumber":97,"Text":"إِلَىٰ فِرۡعَوۡنَ وَمَلَإِيْهِۦ فَٱتَّبَعُوٓاْ أَمۡرَ فِرۡعَوۡنَۖ وَمَآ أَمۡرُ فِرۡعَوۡنَ بِرَشِيدٖ","End":"٩٧"},{"SurahNumber":11,"VerseNumber":98,"Text":"يَقۡدُمُ قَوۡمَهُۥ يَوۡمَ ٱلۡقِيَٰمَةِ فَأَوۡرَدَهُمُ ٱلنَّارَۖ وَبِئۡسَ ٱلۡوِرۡدُ ٱلۡمَوۡرُودُ","End":"٩٨"},{"SurahNumber":11,"VerseNumber":99,"Text":"وَأُتۡبِعُواْ فِي هَٰذِهِۦ لَعۡنَةٗ وَيَوۡمَ ٱلۡقِيَٰمَةِۚ بِئۡسَ ٱلرِّفۡدُ ٱلۡمَرۡفُودُ","End":"٩٩"},{"SurahNumber":11,"VerseNumber":100,"Text":"ذَٰلِكَ مِنۡ أَنۢبَآءِ ٱلۡقُرَىٰ نَقُصُّهُۥ عَلَيۡكَۖ مِنۡهَا قَآئِمٞ وَحَصِيدٞ","End":"١٠٠"},{"SurahNumber":11,"VerseNumber":101,"Text":"وَمَا ظَلَمۡنَٰهُمۡ وَلَٰكِن ظَلَمُوٓاْ أَنفُسَهُمۡۖ فَمَآ أَغۡنَتۡ عَنۡهُمۡ ءَالِهَتُهُمُ ٱلَّتِي يَدۡعُونَ مِن دُونِ ٱللَّهِ مِن شَيۡءٖ لَّمَّا جَآءَ أَمۡرُ رَبِّكَۖ وَمَا زَادُوهُمۡ غَيۡرَ تَتۡبِيبٖ","End":"١٠١"},{"SurahNumber":11,"VerseNumber":102,"Text":"وَكَذَٰلِكَ أَخۡذُ رَبِّكَ إِذَآ أَخَذَ ٱلۡقُرَىٰ وَهِيَ ظَٰلِمَةٌۚ إِنَّ أَخۡذَهُۥٓ أَلِيمٞ شَدِيدٌ","End":"١٠٢"},{"SurahNumber":11,"VerseNumber":103,"Text":"إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّمَنۡ خَافَ عَذَابَ ٱلۡأٓخِرَةِۚ ذَٰلِكَ يَوۡمٞ مَّجۡمُوعٞ لَّهُ ٱلنَّاسُ وَذَٰلِكَ يَوۡمٞ مَّشۡهُودٞ","End":"١٠٣"},{"SurahNumber":11,"VerseNumber":104,"Text":"وَمَا نُؤَخِّرُهُۥٓ إِلَّا لِأَجَلٖ مَّعۡدُودٖ","End":"١٠٤"},{"SurahNumber":11,"VerseNumber":105,"Text":"يَوۡمَ يَأۡتِ لَا تَكَلَّمُ نَفۡسٌ إِلَّا بِإِذۡنِهِۦۚ فَمِنۡهُمۡ شَقِيّٞ وَسَعِيدٞ","End":"١٠٥"},{"SurahNumber":11,"VerseNumber":106,"Text":"فَأَمَّا ٱلَّذِينَ شَقُواْ فَفِي ٱلنَّارِ لَهُمۡ فِيهَا زَفِيرٞ وَشَهِيقٌ","End":"١٠٦"},{"SurahNumber":11,"VerseNumber":107,"Text":"خَٰلِدِينَ فِيهَا مَا دَامَتِ ٱلسَّمَٰوَٰتُ وَٱلۡأَرۡضُ إِلَّا مَا شَآءَ رَبُّكَۚ إِنَّ رَبَّكَ فَعَّالٞ لِّمَا يُرِيدُ","End":"١٠٧"},{"SurahNumber":11,"VerseNumber":108,"Text":"۞وَأَمَّا ٱلَّذِينَ سُعِدُواْ فَفِي ٱلۡجَنَّةِ خَٰلِدِينَ فِيهَا مَا دَامَتِ ٱلسَّمَٰوَٰتُ وَٱلۡأَرۡضُ إِلَّا مَا شَآءَ رَبُّكَۖ عَطَآءً غَيۡرَ مَجۡذُوذٖ","End":"١٠٨"},{"SurahNumber":11,"VerseNumber":109,"Text":"فَلَا تَكُ فِي مِرۡيَةٖ مِّمَّا يَعۡبُدُ هَـٰٓؤُلَآءِۚ مَا يَعۡبُدُونَ إِلَّا كَمَا يَعۡبُدُ ءَابَآؤُهُم مِّن قَبۡلُۚ وَإِنَّا لَمُوَفُّوهُمۡ نَصِيبَهُمۡ غَيۡرَ مَنقُوصٖ","End":"١٠٩"},{"SurahNumber":11,"VerseNumber":110,"Text":"وَلَقَدۡ ءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ فَٱخۡتُلِفَ فِيهِۚ وَلَوۡلَا كَلِمَةٞ سَبَقَتۡ مِن رَّبِّكَ لَقُضِيَ بَيۡنَهُمۡۚ وَإِنَّهُمۡ لَفِي شَكّٖ مِّنۡهُ مُرِيبٖ","End":"١١٠"},{"SurahNumber":11,"VerseNumber":111,"Text":"وَإِنَّ كُلّٗا لَّمَّا لَيُوَفِّيَنَّهُمۡ رَبُّكَ أَعۡمَٰلَهُمۡۚ إِنَّهُۥ بِمَا يَعۡمَلُونَ خَبِيرٞ","End":"١١١"},{"SurahNumber":11,"VerseNumber":112,"Text":"فَٱسۡتَقِمۡ كَمَآ أُمِرۡتَ وَمَن تَابَ مَعَكَ وَلَا تَطۡغَوۡاْۚ إِنَّهُۥ بِمَا تَعۡمَلُونَ بَصِيرٞ","End":"١١٢"},{"SurahNumber":11,"VerseNumber":113,"Text":"وَلَا تَرۡكَنُوٓاْ إِلَى ٱلَّذِينَ ظَلَمُواْ فَتَمَسَّكُمُ ٱلنَّارُ وَمَا لَكُم مِّن دُونِ ٱللَّهِ مِنۡ أَوۡلِيَآءَ ثُمَّ لَا تُنصَرُونَ","End":"١١٣"},{"SurahNumber":11,"VerseNumber":114,"Text":"وَأَقِمِ ٱلصَّلَوٰةَ طَرَفَيِ ٱلنَّهَارِ وَزُلَفٗا مِّنَ ٱلَّيۡلِۚ إِنَّ ٱلۡحَسَنَٰتِ يُذۡهِبۡنَ ٱلسَّيِّـَٔاتِۚ ذَٰلِكَ ذِكۡرَىٰ لِلذَّـٰكِرِينَ","End":"١١٤"},{"SurahNumber":11,"VerseNumber":115,"Text":"وَٱصۡبِرۡ فَإِنَّ ٱللَّهَ لَا يُضِيعُ أَجۡرَ ٱلۡمُحۡسِنِينَ","End":"١١٥"},{"SurahNumber":11,"VerseNumber":116,"Text":"فَلَوۡلَا كَانَ مِنَ ٱلۡقُرُونِ مِن قَبۡلِكُمۡ أُوْلُواْ بَقِيَّةٖ يَنۡهَوۡنَ عَنِ ٱلۡفَسَادِ فِي ٱلۡأَرۡضِ إِلَّا قَلِيلٗا مِّمَّنۡ أَنجَيۡنَا مِنۡهُمۡۗ وَٱتَّبَعَ ٱلَّذِينَ ظَلَمُواْ مَآ أُتۡرِفُواْ فِيهِ وَكَانُواْ مُجۡرِمِينَ","End":"١١٦"},{"SurahNumber":11,"VerseNumber":117,"Text":"وَمَا كَانَ رَبُّكَ لِيُهۡلِكَ ٱلۡقُرَىٰ بِظُلۡمٖ وَأَهۡلُهَا مُصۡلِحُونَ","End":"١١٧"},{"SurahNumber":11,"VerseNumber":118,"Text":"وَلَوۡ شَآءَ رَبُّكَ لَجَعَلَ ٱلنَّاسَ أُمَّةٗ وَٰحِدَةٗۖ وَلَا يَزَالُونَ مُخۡتَلِفِينَ","End":"١١٨"},{"SurahNumber":11,"VerseNumber":119,"Text":"إِلَّا مَن رَّحِمَ رَبُّكَۚ وَلِذَٰلِكَ خَلَقَهُمۡۗ وَتَمَّتۡ كَلِمَةُ رَبِّكَ لَأَمۡلَأَنَّ جَهَنَّمَ مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ أَجۡمَعِينَ","End":"١١٩"},{"SurahNumber":11,"VerseNumber":120,"Text":"وَكُلّٗا نَّقُصُّ عَلَيۡكَ مِنۡ أَنۢبَآءِ ٱلرُّسُلِ مَا نُثَبِّتُ بِهِۦ فُؤَادَكَۚ وَجَآءَكَ فِي هَٰذِهِ ٱلۡحَقُّ وَمَوۡعِظَةٞ وَذِكۡرَىٰ لِلۡمُؤۡمِنِينَ","End":"١٢٠"},{"SurahNumber":11,"VerseNumber":121,"Text":"وَقُل لِّلَّذِينَ لَا يُؤۡمِنُونَ ٱعۡمَلُواْ عَلَىٰ مَكَانَتِكُمۡ إِنَّا عَٰمِلُونَ","End":"١٢١"},{"SurahNumber":11,"VerseNumber":122,"Text":"وَٱنتَظِرُوٓاْ إِنَّا مُنتَظِرُونَ","End":"١٢٢"},{"SurahNumber":11,"VerseNumber":123,"Text":"وَلِلَّهِ غَيۡبُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَإِلَيۡهِ يُرۡجَعُ ٱلۡأَمۡرُ كُلُّهُۥ فَٱعۡبُدۡهُ وَتَوَكَّلۡ عَلَيۡهِۚ وَمَا رَبُّكَ بِغَٰفِلٍ عَمَّا تَعۡمَلُونَ","End":"١٢٣"}],"Translations":[{"LanguageCode":"ara","Language":"Arabic","Name":"ara-quran-la","Author":"Quran Transliteration","Source":"http://tanzil.net","Direction":"ltr","Translations":[{"SurahNumber":11,"VerseNumber":1,"Text":"Aliflamra kitabun ohkimat ayatuhu thumma fussilat min ladun hakeemin khabeerin"},{"SurahNumber":11,"VerseNumber":2,"Text":"Alla taAAbudoo illa Allaha innanee lakum minhu natheerun wabasheerun"},{"SurahNumber":11,"VerseNumber":3,"Text":"Waani istaghfiroo rabbakum thumma tooboo ilayhi yumattiAAkum mataAAan hasanan ila ajalin musamman wayuti kulla thee fadlin fadlahu wain tawallaw fainee akhafu AAalaykum AAathaba yawmin kabeerin"},{"SurahNumber":11,"VerseNumber":4,"Text":"Ila Allahi marjiAAukum wahuwa AAala kulli shayin qadeerun"},{"SurahNumber":11,"VerseNumber":5,"Text":"Ala innahum yathnoona sudoorahum liyastakhfoo minhu ala heena yastaghshoona thiyabahum yaAAlamu ma yusirroona wama yuAAlinoona innahu AAaleemun bithati alssudoori"},{"SurahNumber":11,"VerseNumber":6,"Text":"Wama min dabbatin fee alardi illa AAala Allahi rizquha wayaAAlamu mustaqarraha wamustawdaAAaha kullun fee kitabin mubeenin"},{"SurahNumber":11,"VerseNumber":7,"Text":"Wahuwa allathee khalaqa alssamawati waalarda fee sittati ayyamin wakana AAarshuhu AAala almai liyabluwakum ayyukum ahsanu AAamalan walain qulta innakum mabAAoothoona min baAAdi almawti layaqoolanna allatheena kafaroo in hatha illa sihrun mubeenun"},{"SurahNumber":11,"VerseNumber":8,"Text":"Walain akhkharna AAanhumu alAAathaba ila ommatin maAAdoodatin layaqoolunna ma yahbisuhu ala yawma yateehim laysa masroofan AAanhum wahaqa bihim ma kanoo bihi yastahzioona"},{"SurahNumber":11,"VerseNumber":9,"Text":"Walain athaqna alinsana minna rahmatan thumma nazaAAnaha minhu innahu layaoosun kafoorun"},{"SurahNumber":11,"VerseNumber":10,"Text":"Walain athaqnahu naAAmaa baAAda darraa massathu layaqoolanna thahaba alssayyiatu AAannee innahu lafarihun fakhoorun"},{"SurahNumber":11,"VerseNumber":11,"Text":"Illa allatheena sabaroo waAAamiloo alssalihati olaika lahum maghfiratun waajrun kabeerun"},{"SurahNumber":11,"VerseNumber":12,"Text":"FalaAAallaka tarikun baAAda ma yooha ilayka wadaiqun bihi sadruka an yaqooloo lawla onzila AAalayhi kanzun aw jaa maAAahu malakun innama anta natheerun waAllahu AAala kulli shayin wakeelun"},{"SurahNumber":11,"VerseNumber":13,"Text":"Am yaqooloona iftarahu qul fatoo biAAashri suwarin mithlihi muftarayatin waodAAoo mani istataAAtum min dooni Allahi in kuntum sadiqeena"},{"SurahNumber":11,"VerseNumber":14,"Text":"Fai llam yastajeeboo lakum faiAAlamoo annama onzila biAAilmi Allahi waan la ilaha illa huwa fahal antum muslimoona"},{"SurahNumber":11,"VerseNumber":15,"Text":"Man kana yureedu alhayata alddunya wazeenataha nuwaffi ilayhim aAAmalahum feeha wahum feeha la yubkhasoona"},{"SurahNumber":11,"VerseNumber":16,"Text":"Olaika allatheena laysa lahum fee alakhirati illa alnnaru wahabita ma sanaAAoo feeha wabatilun ma kanoo yaAAmaloona"},{"SurahNumber":11,"VerseNumber":17,"Text":"Afaman kana AAala bayyinatin min rabbihi wayatloohu shahidun minhu wamin qablihi kitabu moosa imaman warahmatan olaika yuminoona bihi waman yakfur bihi mina alahzabi faalnnaru mawAAiduhu fala taku fee miryatin minhu innahu alhaqqu min rabbika walakinna akthara alnnasi la yuminoona"},{"SurahNumber":11,"VerseNumber":18,"Text":"Waman athlamu mimmani iftara AAala Allahi kathiban olaika yuAAradoona AAala rabbihim wayaqoolu alashhadu haolai allatheena kathaboo AAala rabbihim ala laAAnatu Allahi AAala alththalimeena"},{"SurahNumber":11,"VerseNumber":19,"Text":"Allatheena yasuddoona AAan sabeeli Allahi wayabghoonaha AAiwajan wahum bialakhirati hum kafiroona"},{"SurahNumber":11,"VerseNumber":20,"Text":"Olaika lam yakoonoo muAAjizeena fee alardi wama kana lahum min dooni Allahi min awliyaa yudaAAafu lahumu alAAathabu ma kanoo yastateeAAoona alssamAAa wama kanoo yubsiroona"},{"SurahNumber":11,"VerseNumber":21,"Text":"Olaika allatheena khasiroo anfusahum wadalla AAanhum ma kanoo yaftaroona"},{"SurahNumber":11,"VerseNumber":22,"Text":"La jarama annahum fee alakhirati humu alakhsaroona"},{"SurahNumber":11,"VerseNumber":23,"Text":"Inna allatheena amanoo waAAamiloo alsalihati waakhbatoo ila rabbihim olaika ashabu aljannati hum feeha khalidoona"},{"SurahNumber":11,"VerseNumber":24,"Text":"Mathalu alfareeqayni kaalaAAma waalasammi waalbaseeri waalssameeAAi hal yastawiyani mathalan afala tathakkaroona"},{"SurahNumber":11,"VerseNumber":25,"Text":"Walaqad arsalna noohan ila qawmihi innee lakum natheerun mubeenun"},{"SurahNumber":11,"VerseNumber":26,"Text":"An la taAAbudoo illa Allaha innee akhafu AAalaykum AAathaba yawmin aleemin"},{"SurahNumber":11,"VerseNumber":27,"Text":"Faqala almalao allatheena kafaroo min qawmihi ma naraka illa basharan mithlana wama naraka ittabaAAaka illa allatheena hum arathiluna badiya alrrayi wama nara lakum AAalayna min fadlin bal nathunnukum kathibeena"},{"SurahNumber":11,"VerseNumber":28,"Text":"Qala ya qawmi araaytum in kuntu AAala bayyinatin min rabbee waatanee rahmatan min AAindihi faAAummiyat AAalaykum anulzimukumooha waantum laha karihoona"},{"SurahNumber":11,"VerseNumber":29,"Text":"Waya qawmi la asalukum AAalayhi malan in ajriya illa AAala Allahi wama ana bitaridi allatheena amanoo innahum mulaqoo rabbihim walakinnee arakum qawman tajhaloona"},{"SurahNumber":11,"VerseNumber":30,"Text":"Waya qawmi man yansurunee mina Allahi in taradtuhum afala tathakkaroona"},{"SurahNumber":11,"VerseNumber":31,"Text":"Wala aqoolu lakum AAindee khazainu Allahi wala aAAlamu alghayba wala aqoolu innee malakun wala aqoolu lillatheena tazdaree aAAyunukum lan yutiyahumu Allahu khayran Allahu aAAlamu bima fee anfusihim innee ithan lamina alththalimeena"},{"SurahNumber":11,"VerseNumber":32,"Text":"Qaloo ya noohu qad jadaltana faaktharta jidalana fatina bima taAAiduna in kunta mina alssadiqeena"},{"SurahNumber":11,"VerseNumber":33,"Text":"Qala innama yateekum bihi Allahu in shaa wama antum bimuAAjizeena"},{"SurahNumber":11,"VerseNumber":34,"Text":"Wala yanfaAAukum nushee in aradtu an ansaha lakum in kana Allahu yureedu an yughwiyakum huwa rabbukum wailayhi turjaAAoona"},{"SurahNumber":11,"VerseNumber":35,"Text":"Am yaqooloona iftarahu qul ini iftaraytuhu faAAalayya ijramee waana bareeon mimma tujrimoona"},{"SurahNumber":11,"VerseNumber":36,"Text":"Waoohiya ila noohin annahu lan yumina min qawmika illa man qad amana fala tabtais bima kanoo yafAAaloona"},{"SurahNumber":11,"VerseNumber":37,"Text":"WaisnaAAi alfulka biaAAyunina wawahyina wala tukhatibnee fee allatheena thalamoo innahum mughraqoona"},{"SurahNumber":11,"VerseNumber":38,"Text":"WayasnaAAu alfulka wakullama marra AAalayhi malaon min qawmihi sakhiroo minhu qala in taskharoo minna fainna naskharu minkum kama taskharoona"},{"SurahNumber":11,"VerseNumber":39,"Text":"Fasawfa taAAlamoona man yateehi AAathabun yukhzeehi wayahillu AAalayhi AAathabun muqeemun"},{"SurahNumber":11,"VerseNumber":40,"Text":"Hatta itha jaa amruna wafara alttannooru qulna ihmil feeha min kullin zawjayni ithnayni waahlaka illa man sabaqa AAalayhi alqawlu waman amana wama amana maAAahu illa qaleelun"},{"SurahNumber":11,"VerseNumber":41,"Text":"Waqala irkaboo feeha bismi Allahi majraha wamursaha inna rabbee laghafoorun raheemun"},{"SurahNumber":11,"VerseNumber":42,"Text":"Wahiya tajree bihim fee mawjin kaaljibali wanada noohunu ibnahu wakana fee maAAzilin ya bunayya irkab maAAana wala takun maAAa alkafireena"},{"SurahNumber":11,"VerseNumber":43,"Text":"Qala saawee ila jabalin yaAAsimunee mina almai qala la AAasima alyawma min amri Allahi illa man rahima wahala baynahuma almawju fakana mina almughraqeena"},{"SurahNumber":11,"VerseNumber":44,"Text":"Waqeela ya ardu iblaAAee maaki waya samao aqliAAee wagheeda almao waqudiya alamru waistawat AAala aljoodiyyi waqeela buAAdan lilqawmi alththalimeena"},{"SurahNumber":11,"VerseNumber":45,"Text":"Wanada noohun rabbahu faqala rabbi inna ibnee min ahlee wainna waAAdaka alhaqqu waanta ahkamu alhakimeena"},{"SurahNumber":11,"VerseNumber":46,"Text":"Qala ya noohu innahu laysa min ahlika innahu AAamalun ghayru salihin fala tasalni ma laysa laka bihi AAilmun innee aAAithuka an takoona mina aljahileena"},{"SurahNumber":11,"VerseNumber":47,"Text":"Qala rabbi innee aAAoothu bika an asalaka ma laysa lee bihi AAilmun wailla taghfir lee watarhamnee akun mina alkhasireena"},{"SurahNumber":11,"VerseNumber":48,"Text":"Qeela ya noohu ihbit bisalamin minna wabarakatin AAalayka waAAala omamin mimman maAAaka waomamun sanumattiAAuhum thumma yamassuhum minna AAathabun aleemun"},{"SurahNumber":11,"VerseNumber":49,"Text":"Tilka min anbai alghaybi nooheeha ilayka ma kunta taAAlamuha anta wala qawmuka min qabli hatha faisbir inna alAAaqibata lilmuttaqeena"},{"SurahNumber":11,"VerseNumber":50,"Text":"Waila AAadin akhahum hoodan qala ya qawmi oAAbudoo Allaha ma lakum min ilahin ghayruhu in antum illa muftaroona"},{"SurahNumber":11,"VerseNumber":51,"Text":"Ya qawmi la asalukum AAalayhi ajran in ajriya illa AAala allathee fataranee afala taAAqiloona"},{"SurahNumber":11,"VerseNumber":52,"Text":"Waya qawmi istaghfiroo rabbakum thumma tooboo ilayhi yursili alssamaa AAalaykum midraran wayazidkum quwwatan ila quwwatikum wala tatawallaw mujrimeena"},{"SurahNumber":11,"VerseNumber":53,"Text":"Qaloo ya hoodu ma jitana bibayyinatin wama nahnu bitarikee alihatina AAan qawlika wama nahnu laka bimumineena"},{"SurahNumber":11,"VerseNumber":54,"Text":"In naqoolu illa iAAtaraka baAAdu alihatina bisooin qala innee oshhidu Allaha waishhadoo annee bareeon mimma tushrikoona"},{"SurahNumber":11,"VerseNumber":55,"Text":"Min doonihi fakeedoonee jameeAAan thumma la tunthirooni"},{"SurahNumber":11,"VerseNumber":56,"Text":"Innee tawakkaltu AAala Allahi rabbee warabbikum ma min dabbatin illa huwa akhithun binasiyatiha inna rabbee AAala siratin mustaqeemin"},{"SurahNumber":11,"VerseNumber":57,"Text":"Fain tawallaw faqad ablaghtukum ma orsiltu bihi ilaykum wayastakhlifu rabbee qawman ghayrakum wala tadurroonahu shayan inna rabbee AAala kulli shayin hafeethun"},{"SurahNumber":11,"VerseNumber":58,"Text":"Walamma jaa amruna najjayna hoodan waallatheena amanoo maAAahu birahmatin minna wanajjaynahum min AAathabin ghaleethin"},{"SurahNumber":11,"VerseNumber":59,"Text":"Watilka AAadun jahadoo biayati rabbihim waAAasaw rusulahu waittabaAAoo amra kulli jabbarin AAaneedin"},{"SurahNumber":11,"VerseNumber":60,"Text":"WaotbiAAoo fee hathihi alddunya laAAnatan wayawma alqiyamati ala inna AAadan kafaroo rabbahum ala buAAdan liAAadin qawmi hoodin"},{"SurahNumber":11,"VerseNumber":61,"Text":"Waila thamooda akhahum salihan qala ya qawmi oAAbudoo Allaha ma lakum min ilahin ghayruhu huwa anshaakum mina alardi waistaAAmarakum feeha faistaghfiroohu thumma tooboo ilayhi inna rabbee qareebun mujeebun"},{"SurahNumber":11,"VerseNumber":62,"Text":"Qaloo ya salihu qad kunta feena marjuwwan qabla hatha atanhana an naAAbuda ma yaAAbudu abaona wainnana lafee shakkin mimma tadAAoona ilayhi mureebun"},{"SurahNumber":11,"VerseNumber":63,"Text":"Qala ya qawmi araaytum in kuntu AAala bayyinatin min rabbee waatanee minhu rahmatan faman yansurunee mina Allahi in AAasaytuhu fama tazeedoonanee ghayra takhseerin"},{"SurahNumber":11,"VerseNumber":64,"Text":"Waya qawmi hathihi naqatu Allahi lakum ayatan fatharooha takul fee ardi Allahi wala tamassooha bisooin fayakhuthakum AAathabun qareebun"},{"SurahNumber":11,"VerseNumber":65,"Text":"FaAAaqarooha faqala tamattaAAoo fee darikum thalathata ayyamin thalika waAAdun ghayru makthoobin"},{"SurahNumber":11,"VerseNumber":66,"Text":"Falamma jaa amruna najjayna salihan waallatheena amanoo maAAahu birahmatin minna wamin khizyi yawmiithin inna rabbaka huwa alqawiyyu alAAazeezu"},{"SurahNumber":11,"VerseNumber":67,"Text":"Waakhatha allatheena thalamoo alssayhatu faasbahoo fee diyarihim jathimeena"},{"SurahNumber":11,"VerseNumber":68,"Text":"Kaan lam yaghnaw feeha ala inna thamooda kafaroo rabbahum ala buAAdan lithamooda"},{"SurahNumber":11,"VerseNumber":69,"Text":"Walaqad jaat rusuluna ibraheema bialbushra qaloo salaman qala salamun fama labitha an jaa biAAijlin haneethin"},{"SurahNumber":11,"VerseNumber":70,"Text":"Falamma raa aydiyahum la tasilu ilayhi nakirahum waawjasa minhum kheefatan qaloo la takhaf inna orsilna ila qawmi lootin"},{"SurahNumber":11,"VerseNumber":71,"Text":"Waimraatuhu qaimatun fadahikat fabashsharnaha biishaqa wamin warai ishaqa yaAAqooba"},{"SurahNumber":11,"VerseNumber":72,"Text":"Qalat ya waylata aalidu waana AAajoozun wahatha baAAlee shaykhan inna hatha lashayon AAajeebun"},{"SurahNumber":11,"VerseNumber":73,"Text":"Qaloo ataAAjabeena min amri Allahi rahmatu Allahi wabarakatuhu AAalaykum ahla albayti innahu hameedun majeedun"},{"SurahNumber":11,"VerseNumber":74,"Text":"Falamma thahaba AAan ibraheema alrrawAAu wajaathu albushra yujadiluna fee qawmi lootin"},{"SurahNumber":11,"VerseNumber":75,"Text":"Inna ibraheema lahaleemun awwahun muneebun"},{"SurahNumber":11,"VerseNumber":76,"Text":"Ya ibraheemu aAArid AAan hatha innahu qad jaa amru rabbika wainnahum ateehim AAathabun ghayru mardoodin"},{"SurahNumber":11,"VerseNumber":77,"Text":"Walamma jaat rusuluna lootan seea bihim wadaqa bihim tharAAan waqala hatha yawmun AAaseebun"},{"SurahNumber":11,"VerseNumber":78,"Text":"Wajaahu qawmuhu yuhraAAoona ilayhi wamin qablu kanoo yaAAmaloona alssayyiati qala ya qawmi haolai banatee hunna atharu lakum faittaqoo Allaha wala tukhzooni fee dayfee alaysa minkum rajulun rasheedun"},{"SurahNumber":11,"VerseNumber":79,"Text":"Qaloo laqad AAalimta ma lana fee banatika min haqqin wainnaka lataAAlamu ma nureedu"},{"SurahNumber":11,"VerseNumber":80,"Text":"Qala law anna lee bikum quwwatan aw awee ila ruknin shadeedin"},{"SurahNumber":11,"VerseNumber":81,"Text":"Qaloo ya lootu inna rusulu rabbika lan yasiloo ilayka faasri biahlika biqitAAin mina allayli wala yaltafit minkum ahadun illa imraataka innahu museebuha ma asabahum inna mawAAidahumu alssubhu alaysa alssubhu biqareebin"},{"SurahNumber":11,"VerseNumber":82,"Text":"Falamma jaa amruna jaAAalna AAaliyaha safilaha waamtarna AAalayha hijaratan min sijjeelin mandoodin"},{"SurahNumber":11,"VerseNumber":83,"Text":"Musawwamatan AAinda rabbika wama hiya mina alththalimeena bibaAAeedin"},{"SurahNumber":11,"VerseNumber":84,"Text":"Waila madyana akhahum shuAAayban qala ya qawmi oAAbudoo Allaha ma lakum min ilahin ghayruhu wala tanqusoo almikyala waalmeezana innee arakum bikhayrin wainnee akhafu AAalaykum AAathaba yawmin muheetin"},{"SurahNumber":11,"VerseNumber":85,"Text":"Waya qawmi awfoo almikyala waalmeezana bialqisti wala tabkhasoo alnnasa ashyaahum wala taAAthaw fee alardi mufsideena"},{"SurahNumber":11,"VerseNumber":86,"Text":"Baqiyyatu Allahi khayrun lakum in kuntum mumineena wama ana AAalaykum bihafeethin"},{"SurahNumber":11,"VerseNumber":87,"Text":"Qaloo ya shuAAaybu asalatuka tamuruka an natruka ma yaAAbudu abaona aw an nafAAala fee amwalina ma nashao innaka laanta alhaleemu alrrasheedu"},{"SurahNumber":11,"VerseNumber":88,"Text":"Qala ya qawmi araaytum in kuntu AAala bayyinatin min rabbee warazaqanee minhu rizqan hasanan wama oreedu an okhalifakum ila ma anhakum AAanhu in oreedu illa alislaha ma istataAAtu wama tawfeeqee illa biAllahi AAalayhi tawakkaltu wailayhi oneebu"},{"SurahNumber":11,"VerseNumber":89,"Text":"Waya qawmi la yajrimannakum shiqaqee an yuseebakum mithlu ma asaba qawma noohin aw qawma hoodin aw qawma salihin wama qawmu lootin minkum bibaAAeedin"},{"SurahNumber":11,"VerseNumber":90,"Text":"Waistaghfiroo rabbakum thumma tooboo ilayhi inna rabbee raheemun wadoodun"},{"SurahNumber":11,"VerseNumber":91,"Text":"Qaloo ya shuAAaybu ma nafqahu katheeran mimma taqoolu wainna lanaraka feena daAAeefan walawla rahtuka larajamnaka wama anta AAalayna biAAazeezin"},{"SurahNumber":11,"VerseNumber":92,"Text":"Qala ya qawmi arahtee aAAazzu AAalaykum mina Allahi waittakhathtumoohu waraakum thihriyyan inna rabbee bima taAAmaloona muheetun"},{"SurahNumber":11,"VerseNumber":93,"Text":"Waya qawmi iAAmaloo AAala makanatikum innee AAamilun sawfa taAAlamoona man yateehi AAathabun yukhzeehi waman huwa kathibun wairtaqiboo inne maAAakum raqeebun"},{"SurahNumber":11,"VerseNumber":94,"Text":"Walamma jaa amruna najjayna shuAAayban waallatheena amanoo maAAahu birahmatin minna waakhathati allatheena thalamoo alssayhatu faasbahoo fee diyarihim jathimeena"},{"SurahNumber":11,"VerseNumber":95,"Text":"Kaan lam yaghnaw feeha ala buAAdan limadyana kama baAAidat thamoodu"},{"SurahNumber":11,"VerseNumber":96,"Text":"Walaqad arsalna moosa biayatina wasultanin mubeenin"},{"SurahNumber":11,"VerseNumber":97,"Text":"Ila firAAawna wamalaihi faittabaAAoo amra firAAawna wama amru firAAawna birasheedin"},{"SurahNumber":11,"VerseNumber":98,"Text":"Yaqdumu qawmahu yawma alqiyamati faawradahumu alnnara wabisa alwirdu almawroodu"},{"SurahNumber":11,"VerseNumber":99,"Text":"WaotbiAAoo fee hathihi laAAnatan wayawma alqiyamati bisa alrrifdu almarfoodu"},{"SurahNumber":11,"VerseNumber":100,"Text":"Thalika min anbai alqura naqussuhu AAalayka minha qaimun wahaseedun"},{"SurahNumber":11,"VerseNumber":101,"Text":"Wama thalamnahum walakin thalamoo anfusahum fama aghnat AAanhum alihatuhumu allatee yadAAoona min dooni Allahi min shayin lamma jaa amru rabbika wama zadoohum ghayra tatbeebin"},{"SurahNumber":11,"VerseNumber":102,"Text":"Wakathalika akhthu rabbika itha akhatha alqura wahiya thalimatun inna akhthahu aleemun shadeedun"},{"SurahNumber":11,"VerseNumber":103,"Text":"Inna fee thalika laayatan liman khafa AAathaba alakhirati thalika yawmun majmooAAun lahu alnnasu wathalika yawmun mashhoodun"},{"SurahNumber":11,"VerseNumber":104,"Text":"Wama nuakhkhiruhu illa liajalin maAAdoodin"},{"SurahNumber":11,"VerseNumber":105,"Text":"Yawma yati la takallamu nafsun illa biithnihi faminhum shaqiyyun wasaAAeedin"},{"SurahNumber":11,"VerseNumber":106,"Text":"Faamma allatheena shaqoo fafee alnnari lahum feeha zafeerun washaheequn"},{"SurahNumber":11,"VerseNumber":107,"Text":"Khalideena feeha ma damati alssamawatu waalardu illa ma shaa rabbuka inna rabbaka faAAAAalun lima yureedu"},{"SurahNumber":11,"VerseNumber":108,"Text":"Waamma allatheena suAAidoo fafee aljannati khalideena feeha ma damati alssamawatu waalardu illa ma shaa rabbuka AAataan ghayra majthoothin"},{"SurahNumber":11,"VerseNumber":109,"Text":"Fala taku fee miryatin mimma yaAAbudu haolai ma yaAAbudoona illa kama yaAAbudu abaohum min qablu wainna lamuwaffoohum naseebahum ghayra manqoosin"},{"SurahNumber":11,"VerseNumber":110,"Text":"Walaqad atayna moosa alkitaba faikhtulifa feehi walawla kalimatun sabaqat min rabbika laqudiya baynahum wainnahum lafee shakkin minhu mureebun"},{"SurahNumber":11,"VerseNumber":111,"Text":"Wainna kullan lamma layuwaffiyannahum rabbuka aAAmalahum innahu bima yaAAmaloona khabeerun"},{"SurahNumber":11,"VerseNumber":112,"Text":"Faistaqim kama omirta waman taba maAAaka wala tatghaw innahu bima taAAmaloona baseerun"},{"SurahNumber":11,"VerseNumber":113,"Text":"Wala tarkanoo ila allatheena thalamoo fatamassakumu alnnaru wama lakum min dooni Allahi min awliyaa thumma la tunsaroona"},{"SurahNumber":11,"VerseNumber":114,"Text":"Waaqimi alssalata tarafayi alnnahari wazulafan mina allayli inna alhasanati yuthhibna alssayyiati thalika thikra lilththakireena"},{"SurahNumber":11,"VerseNumber":115,"Text":"Waisbir fainna Allaha la yudeeAAu ajra almuhsineena"},{"SurahNumber":11,"VerseNumber":116,"Text":"Falawla kana mina alqurooni min qablikum oloo baqiyyatin yanhawna AAani alfasadi fee alardi illa qaleelan mimman anjayna minhum waittabaAAa allatheena thalamoo ma otrifoo feehi wakanoo mujrimeena"},{"SurahNumber":11,"VerseNumber":117,"Text":"Wama kana rabbuka liyuhlika alqura bithulmin waahluha muslihoona"},{"SurahNumber":11,"VerseNumber":118,"Text":"Walaw shaa rabbuka lajaAAala alnnasa ommatan wahidatan wala yazaloona mukhtalifeena"},{"SurahNumber":11,"VerseNumber":119,"Text":"Illa man rahima rabbuka walithalika khalaqahum watammat kalimatu rabbika laamlaanna jahannama mina aljinnati waalnnasi ajmaAAeena"},{"SurahNumber":11,"VerseNumber":120,"Text":"Wakullan naqussu AAalayka min anbai alrrusuli ma nuthabbitu bihi fuadaka wajaaka fee hathihi alhaqqu wamawAAithatun wathikra lilmumineena"},{"SurahNumber":11,"VerseNumber":121,"Text":"Waqul lillatheena la yuminoona iAAmaloo AAala makanatikum inna AAamiloona"},{"SurahNumber":11,"VerseNumber":122,"Text":"Waintathiroo inna muntathiroona"},{"SurahNumber":11,"VerseNumber":123,"Text":"Walillahi ghaybu alssamawati waalardi wailayhi yurjaAAu alamru kulluhu faoAAbudhu watawakkal AAalayhi wama rabbuka bighafilin AAamma taAAmaloona"}]},{"LanguageCode":"eng","Language":"English","Name":"eng-mustafakhattabg","Author":"Mustafa Khattab God Edition","Source":"","Direction":"ltr","Translations":[{"SurahNumber":11,"VerseNumber":1,"Text":"Alif-Lãm-Ra. ˹This is˺ a Book whose verses are well perfected and then fully explained. ˹It is˺ from the One ˹Who is˺ All-Wise, All-Aware"},{"SurahNumber":11,"VerseNumber":2,"Text":"˹Tell them, O Prophet,˺ “Worship none but God. Surely I am a warner and deliverer of good news to you from Him"},{"SurahNumber":11,"VerseNumber":3,"Text":"And seek your Lord’s forgiveness and turn to Him in repentance. He will grant you a good provision for an appointed term and graciously reward the doers of good. But if you turn away, then I truly fear for you the torment of a formidable Day"},{"SurahNumber":11,"VerseNumber":4,"Text":"To God is your return. And He is Most Capable of everything.”"},{"SurahNumber":11,"VerseNumber":5,"Text":"Indeed, they enfold ˹what is in˺ their hearts, ˹trying˺ to hide it from Him! But even when they cover themselves with their clothes, He knows what they conceal and what they reveal. Surely He knows best what is ˹hidden˺ in the heart"},{"SurahNumber":11,"VerseNumber":6,"Text":"There is no moving creature on earth whose provision is not guaranteed by God. And He knows where it lives and where it is laid to rest. All is ˹written˺ in a perfect Record"},{"SurahNumber":11,"VerseNumber":7,"Text":"He is the One Who created the heavens and the earth in six Days—and His Throne was upon the waters—in order to test which of you is best in deeds. And if you ˹O Prophet˺ say, “Surely you will ˹all˺ be raised up after death,” the disbelievers will certainly say, “That is nothing but pure magic!”"},{"SurahNumber":11,"VerseNumber":8,"Text":"And if We delay their punishment until an appointed time, they will definitely say, “What is holding it back?” Indeed, on the Day it overtakes them, it will not be averted from them, and they will be overwhelmed by what they used to ridicule"},{"SurahNumber":11,"VerseNumber":9,"Text":"If We give people a taste of Our mercy then take it away from them, they become utterly desperate, ungrateful"},{"SurahNumber":11,"VerseNumber":10,"Text":"But if We give them a taste of prosperity after being touched with adversity, they say, “My ills are gone,” and become totally prideful and boastful"},{"SurahNumber":11,"VerseNumber":11,"Text":"except those who patiently endure and do good. It is they who will have forgiveness and a mighty reward"},{"SurahNumber":11,"VerseNumber":12,"Text":"Perhaps you ˹O Prophet˺ may wish to give up some of what is revealed to you and may be distressed by it because they say, “If only a treasure had been sent down to him, or an angel had come with him!” You are only a warner, and God is the Trustee of All Affairs"},{"SurahNumber":11,"VerseNumber":13,"Text":"Or do they say, “He has fabricated this ˹Quran˺!”? Say, ˹O Prophet,˺ “Produce ten fabricated sûrahs like it and seek help from whoever you can—other than God—if what you say is true!”"},{"SurahNumber":11,"VerseNumber":14,"Text":"But if your helpers fail you, then know that it has been revealed with the knowledge of God, and that there is no god ˹worthy of worship˺ except Him! Will you ˹not˺ then submit ˹to God˺"},{"SurahNumber":11,"VerseNumber":15,"Text":"Whoever desires ˹only˺ this worldly life and its luxuries, We will pay them in full for their deeds in this life—nothing will be left out"},{"SurahNumber":11,"VerseNumber":16,"Text":"It is they who will have nothing in the Hereafter except the Fire. Their efforts in this life will be fruitless and their deeds will be useless"},{"SurahNumber":11,"VerseNumber":17,"Text":"˹Can these people be compared to˺ those ˹believers˺ who stand on clear proof from their Lord, backed by ˹the Quran as˺ a witness from Him, and preceded by the Book of Moses ˹which was revealed˺ as a guide and mercy? It is those ˹believers˺ who have faith in it. But whoever from the ˹disbelieving˺ groups rejects it, the Fire will be their destiny. So do not be in doubt of it. It is certainly the truth from your Lord, but most people do not believe"},{"SurahNumber":11,"VerseNumber":18,"Text":"Who does more wrong than those who fabricate lies against God? They will be brought before their Lord, and the witnesses will say, “These are the ones who lied against their Lord.” Surely God’s condemnation is upon the wrongdoers"},{"SurahNumber":11,"VerseNumber":19,"Text":"who hinder ˹others˺ from God’s Path, striving to make it ˹appear˺ crooked, and disbelieve in the Hereafter"},{"SurahNumber":11,"VerseNumber":20,"Text":"They will never frustrate God on earth, and they will have no protector besides God. Their punishment will be multiplied, for they failed to hear or see ˹the truth˺"},{"SurahNumber":11,"VerseNumber":21,"Text":"It is they who have ruined themselves, and whatever ˹gods˺ they fabricated will fail them"},{"SurahNumber":11,"VerseNumber":22,"Text":"Without a doubt, they will be the worst losers in the Hereafter"},{"SurahNumber":11,"VerseNumber":23,"Text":"Surely those who believe, do good, and humble themselves before their Lord will be the residents of Paradise. They will be there forever"},{"SurahNumber":11,"VerseNumber":24,"Text":"The example of these two parties is that of the blind and the deaf, compared to the seeing and the hearing. Can the two be equal? Will you not then be mindful"},{"SurahNumber":11,"VerseNumber":25,"Text":"Surely We sent Noah to his people. ˹He said,˺ “Indeed, I am sent to you with a clear warning"},{"SurahNumber":11,"VerseNumber":26,"Text":"that you should worship none but God. I truly fear for you the torment of a painful Day.”"},{"SurahNumber":11,"VerseNumber":27,"Text":"The disbelieving chiefs of his people said, “We see you only as a human being like ourselves, and we see that no one follows you except the lowliest among us, who do so ˹hastily˺ without thinking. We do not see anything that makes ˹all of˺ you any better than us. In fact, we think you are liars.”"},{"SurahNumber":11,"VerseNumber":28,"Text":"He said, “O my people! Consider if I stand on a clear proof from my Lord and He has blessed me with a mercy from Himself, which you fail to see. Should we ˹then˺ force it on you against your will"},{"SurahNumber":11,"VerseNumber":29,"Text":"O my people! I do not ask you for a payment for this ˹message˺. My reward is only from God. And I will never dismiss the believers, for they will surely meet their Lord. But I can see that you are a people acting ignorantly"},{"SurahNumber":11,"VerseNumber":30,"Text":"O my people! Who would protect me from God if I were to dismiss them? Will you not then be mindful"},{"SurahNumber":11,"VerseNumber":31,"Text":"I do not say to you that I possess God’s treasuries or know the unseen, nor do I claim to be an angel, nor do I say that God will never grant goodness to those you look down upon. God knows best what is ˹hidden˺ within them. ˹If I did,˺ then I would truly be one of the wrongdoers.”"},{"SurahNumber":11,"VerseNumber":32,"Text":"They protested, “O Noah! You have argued with us far too much, so bring upon us what you threaten us with, if what you say is true.”"},{"SurahNumber":11,"VerseNumber":33,"Text":"He responded, “It is God Who can bring it upon you if He wills, and then you will have no escape"},{"SurahNumber":11,"VerseNumber":34,"Text":"My advice will not benefit you—no matter how hard I try—if God wills ˹for˺ you to stray. He is your Lord, and to Him you will ˹all˺ be returned.”"},{"SurahNumber":11,"VerseNumber":35,"Text":"Or do they say, “He has fabricated this ˹Quran˺!”? Say, ˹O Prophet,˺ “If I have done so, then I bear the burden of that sin! But I am free from your sinful accusation.”"},{"SurahNumber":11,"VerseNumber":36,"Text":"And it was revealed to Noah, “None of your people will believe except those who already have. So do not be distressed by what they have been doing"},{"SurahNumber":11,"VerseNumber":37,"Text":"And build the Ark under Our ˹watchful˺ Eyes and directions, and do not plead with Me for those who have done wrong, for they will surely be drowned.”"},{"SurahNumber":11,"VerseNumber":38,"Text":"So he began to build the Ark, and whenever some of the chiefs of his people passed by, they mocked him. He said, “If you laugh at us, we will ˹soon˺ laugh at you similarly"},{"SurahNumber":11,"VerseNumber":39,"Text":"You will soon come to know who will be visited by a humiliating torment ˹in this life˺ and overwhelmed by an everlasting punishment ˹in the next˺.”"},{"SurahNumber":11,"VerseNumber":40,"Text":"And when Our command came and the oven burst ˹with water˺, We said ˹to Noah˺, “Take into the Ark a pair from every species along with your family—except those against whom the decree ˹to drown˺ has already been passed—and those who believe.” But none believed with him except for a few"},{"SurahNumber":11,"VerseNumber":41,"Text":"And he said, “Board it! In the Name of God it will sail and cast anchor. Surely my Lord is All-Forgiving, Most Merciful.”"},{"SurahNumber":11,"VerseNumber":42,"Text":"And ˹so˺ the Ark sailed with them through waves like mountains. Noah called out to his son, who stood apart, “O my dear son! Come aboard with us and do not be with the disbelievers.”"},{"SurahNumber":11,"VerseNumber":43,"Text":"He replied, “I will take refuge on a mountain, which will protect me from the water.” Noah cried, “Today no one is protected from God’s decree except those to whom He shows mercy!” And the waves came between them, and his son was among the drowned"},{"SurahNumber":11,"VerseNumber":44,"Text":"And it was said, “O earth! Swallow up your water. And O sky! Withhold ˹your rain˺.” The floodwater receded and the decree was carried out. The Ark rested on Mount Judi, and it was said, “Away with the wrongdoing people!”"},{"SurahNumber":11,"VerseNumber":45,"Text":"Noah called out to his Lord, saying, “My Lord! Certainly my son is ˹also˺ of my family, Your promise is surely true, and You are the most just of all judges!”"},{"SurahNumber":11,"VerseNumber":46,"Text":"God replied, “O Noah! He is certainly not of your family—he was entirely of unrighteous conduct. So do not ask Me about what you have no knowledge of! I warn you so you do not fall into ignorance.”"},{"SurahNumber":11,"VerseNumber":47,"Text":"Noah pleaded, “My Lord, I seek refuge in You from asking You about what I have no knowledge of, and unless You forgive me and have mercy on me, I will be one of the losers.”"},{"SurahNumber":11,"VerseNumber":48,"Text":"It was said, “O Noah! Disembark with Our peace and blessings on you and some of the descendants of those with you. As for the others, We will allow them ˹a brief˺ enjoyment, then they will be touched with a painful punishment from Us.”"},{"SurahNumber":11,"VerseNumber":49,"Text":"This is one of the stories of the unseen, which we reveal to you ˹O Prophet˺. Neither you nor your people knew it before this. So be patient! Surely the ultimate outcome belongs ˹only˺ to the righteous"},{"SurahNumber":11,"VerseNumber":50,"Text":"And to the people of ’Âd We sent their brother Hûd. He said, “O my people! Worship God. You have no god other than Him. You do nothing but fabricate lies ˹against God˺"},{"SurahNumber":11,"VerseNumber":51,"Text":"O my people! I do not ask you for any reward for this ˹message˺. My reward is only from the One Who created me. Will you not then understand"},{"SurahNumber":11,"VerseNumber":52,"Text":"And O my people! Seek your Lord’s forgiveness and turn to Him in repentance. He will shower you with rain in abundance, and add strength to your strength. So do not turn away, persisting in wickedness.”"},{"SurahNumber":11,"VerseNumber":53,"Text":"They argued, “O Hûd! You have not given us any clear proof, and we will never abandon our gods upon your word, nor will we believe in you"},{"SurahNumber":11,"VerseNumber":54,"Text":"All we can say is that some of our gods have possessed you with evil.” He said, “I call God to witness, and you too bear witness, that I ˹totally˺ reject whatever you associate"},{"SurahNumber":11,"VerseNumber":55,"Text":"with Him ˹in worship˺. So let all of you plot against me without delay"},{"SurahNumber":11,"VerseNumber":56,"Text":"I have put my trust in God—my Lord and your Lord. There is no living creature that is not completely under His control. Surely my Lord’s Way is perfect justice"},{"SurahNumber":11,"VerseNumber":57,"Text":"But if you turn away, I have already delivered to you what I have been sent with. My Lord will replace you with others. You are not harming Him in the least. Indeed, my Lord is a ˹vigilant˺ Keeper over all things.”"},{"SurahNumber":11,"VerseNumber":58,"Text":"When Our command came, We rescued Hûd and those who believed with him by a mercy from Us, saving them from a harsh torment"},{"SurahNumber":11,"VerseNumber":59,"Text":"That was ’Âd. They denied the signs of their Lord, disobeyed His messengers, and followed the command of every stubborn tyrant"},{"SurahNumber":11,"VerseNumber":60,"Text":"They were followed by a curse in this world, as they will be on the Day of Judgment. Surely ’Âd denied their Lord. So away with ’Âd, the people of Hûd"},{"SurahNumber":11,"VerseNumber":61,"Text":"And to the people of Thamûd We sent their brother Ṣâliḥ. He said, “O my people! Worship God. You have no god other than Him. He ˹is the One Who˺ produced you from the earth and settled you on it. So seek His forgiveness and turn to Him in repentance. Surely my Lord is Ever Near, All-Responsive ˹to prayers˺.”"},{"SurahNumber":11,"VerseNumber":62,"Text":"They argued, “O Ṣâliḥ! We truly had high hopes in you before this. How dare you forbid us to worship what our forefathers had worshipped? We are certainly in alarming doubt about what you are inviting us to.”"},{"SurahNumber":11,"VerseNumber":63,"Text":"He responded, “O my people! Consider if I stand on a clear proof from my Lord and He has blessed me with a mercy from Him. Who could help me against God if I were to disobey Him? You would only contribute to my doom"},{"SurahNumber":11,"VerseNumber":64,"Text":"And O my people! This she-camel of God is a sign for you. So leave her to graze ˹freely˺ on God’s earth and do her no harm, or a swift punishment will overtake you!”"},{"SurahNumber":11,"VerseNumber":65,"Text":"But they killed her, so he warned ˹them˺, “You have ˹only˺ three ˹more˺ days to enjoy life in your homes—this is an unfailing promise!”"},{"SurahNumber":11,"VerseNumber":66,"Text":"When Our command came, We saved Ṣâliḥ and those who believed with him by a mercy from Us and spared them the disgrace of that Day. Surely your Lord ˹alone˺ is the All-Powerful, Almighty"},{"SurahNumber":11,"VerseNumber":67,"Text":"And the ˹mighty˺ blast overtook the wrongdoers, so they fell lifeless in their homes"},{"SurahNumber":11,"VerseNumber":68,"Text":"as if they had never lived there. Surely Thamûd denied their Lord, so away with Thamûd"},{"SurahNumber":11,"VerseNumber":69,"Text":"And surely Our messenger-angels came to Abraham with good news ˹of a son˺. They greeted ˹him with˺, “Peace!” And he replied, “Peace ˹be upon you˺!” Then it was not long before he brought ˹them˺ a ˹fat,˺ roasted calf"},{"SurahNumber":11,"VerseNumber":70,"Text":"And when he saw that their hands did not reach for the food, he became suspicious and fearful of them. They reassured ˹him˺, “Do not be afraid! We are ˹angels˺ sent ˹only˺ against the people of Lot.”"},{"SurahNumber":11,"VerseNumber":71,"Text":"And his wife was standing by, so she laughed, then We gave her good news of ˹the birth of˺ Isaac, and, after him, Jacob"},{"SurahNumber":11,"VerseNumber":72,"Text":"She wondered, “Oh, my! How can I have a child in this old age, and my husband here is an old man? This is truly an astonishing thing!”"},{"SurahNumber":11,"VerseNumber":73,"Text":"They responded, “Are you astonished by God’s decree? May God’s mercy and blessings be upon you, O people of this house. Indeed, He is Praiseworthy, All-Glorious.”"},{"SurahNumber":11,"VerseNumber":74,"Text":"Then after the fear had left Abraham, and the good news had reached him, he began to plead with Us for the people of Lot"},{"SurahNumber":11,"VerseNumber":75,"Text":"Truly, Abraham was forbearing, tender-hearted, and ever turning ˹to his Lord˺"},{"SurahNumber":11,"VerseNumber":76,"Text":"˹The angels said,˺ “O Abraham! Plead no more! Your Lord’s decree has already come, and they will certainly be afflicted with a punishment that cannot be averted!”"},{"SurahNumber":11,"VerseNumber":77,"Text":"When Our messenger-angels came to Lot, he was distressed and worried by their arrival. He said, “This is a terrible day.”"},{"SurahNumber":11,"VerseNumber":78,"Text":"And ˹the men of˺ his people—who were used to shameful deeds—came to him rushing. He pleaded, “O my people! Here are my daughters ˹for marriage˺—they are pure for you. So fear God, and do not humiliate me by disrespecting my guests. Is there not ˹even˺ a single right-minded man among you?”"},{"SurahNumber":11,"VerseNumber":79,"Text":"They argued, “You certainly know that we have no need for your daughters. You already know what we desire!”"},{"SurahNumber":11,"VerseNumber":80,"Text":"He responded, “If only I had the strength ˹to resist you˺ or could rely on a strong supporter.”"},{"SurahNumber":11,"VerseNumber":81,"Text":"The angels said, “O Lot! We are the messengers of your Lord. They will never reach you. So travel with your family in the dark of night, and do not let any of you look back, except your wife. She will certainly suffer the fate of the others. Their appointed time is the morning. Is the morning not near?”"},{"SurahNumber":11,"VerseNumber":82,"Text":"When Our command came, We turned the cities upside down and rained down on them clustered stones of baked clay"},{"SurahNumber":11,"VerseNumber":83,"Text":"marked by your Lord ˹O Prophet˺. And these stones are not far from the ˹pagan˺ wrongdoers"},{"SurahNumber":11,"VerseNumber":84,"Text":"And to the people of Midian We sent their brother Shu’aib. He said, “O my people! Worship God. You have no god other than Him. And do not give short measure and weight. I do see you in prosperity now, but I truly fear for you the torment of an overwhelming Day"},{"SurahNumber":11,"VerseNumber":85,"Text":"O my people! Give full measure and weigh with justice. Do not defraud people of their property, nor go about spreading corruption in the land"},{"SurahNumber":11,"VerseNumber":86,"Text":"What is left ˹as a lawful gain˺ by God is far better for you if you are ˹truly˺ believers. And I am not a keeper over you.”"},{"SurahNumber":11,"VerseNumber":87,"Text":"They asked ˹sarcastically˺, “O Shu’aib! Does your prayer command you that we should abandon what our forefathers worshipped or give up managing our wealth as we please? Indeed, you are such a tolerant, sensible man!”"},{"SurahNumber":11,"VerseNumber":88,"Text":"He said, “O my people! Consider if I stand on a clear proof from my Lord and He has blessed me with a good provision from Him. I do not want to do what I am forbidding you from. I only intend reform to the best of my ability. My success comes only through God. In Him I trust and to Him I turn"},{"SurahNumber":11,"VerseNumber":89,"Text":"O my people! Do not let your opposition to me lead you to a fate similar to that of the people of Noah, or Hûd, or Ṣâliḥ. And the people of Lot are not far from you"},{"SurahNumber":11,"VerseNumber":90,"Text":"So seek your Lord’s forgiveness and turn to Him in repentance. Surely my Lord is Most Merciful, All-Loving.”"},{"SurahNumber":11,"VerseNumber":91,"Text":"They threatened, “O Shu’aib! We do not comprehend much of what you say, and surely we see you powerless among us. Were it not for your clan, we would have certainly stoned you, for you are nothing to us.”"},{"SurahNumber":11,"VerseNumber":92,"Text":"He said, “O my people! Do you have more regard for my clan than for God, turning your back on Him entirely? Surely my Lord is Fully Aware of what you do"},{"SurahNumber":11,"VerseNumber":93,"Text":"O my people! Persist in your ways, for I ˹too˺ will persist in mine. You will soon come to know who will be visited by a humiliating torment and is a liar! And watch! I too am watching with you!”"},{"SurahNumber":11,"VerseNumber":94,"Text":"When Our command came, We saved Shu’aib and those who believed with him by a mercy from Us. And the ˹mighty˺ blast overtook the wrongdoers, so they fell lifeless in their homes"},{"SurahNumber":11,"VerseNumber":95,"Text":"as if they had never lived there. So away with Midian as it was with Thamûd"},{"SurahNumber":11,"VerseNumber":96,"Text":"Indeed, We sent Moses with Our signs and compelling proof"},{"SurahNumber":11,"VerseNumber":97,"Text":"to Pharaoh and his chiefs, but they followed the command of Pharaoh, and Pharaoh’s command was not well guided"},{"SurahNumber":11,"VerseNumber":98,"Text":"He will be before his people on the Day of Judgment and will lead them into the Fire. What an evil place to be led into"},{"SurahNumber":11,"VerseNumber":99,"Text":"They were followed by a curse in this ˹life˺ and ˹will receive another˺ on the Day of Judgment. What an evil gift to receive"},{"SurahNumber":11,"VerseNumber":100,"Text":"These are accounts, We relate to you ˹O Prophet˺, of the ˹destroyed˺ cities. Some are still standing ˹barren˺, while others have been mowed down"},{"SurahNumber":11,"VerseNumber":101,"Text":"We did not wrong them, rather they wronged themselves. The gods they invoked beside God were of no help at all when the command of your Lord came, and only contributed to their ruin"},{"SurahNumber":11,"VerseNumber":102,"Text":"Such is the ˹crushing˺ grip of your Lord when He seizes the societies entrenched in wrongdoing. Indeed, His grip is ˹terribly˺ painful and severe"},{"SurahNumber":11,"VerseNumber":103,"Text":"Surely in this is a sign for those who fear the torment of the Hereafter. That is a Day for which humanity will be gathered and a Day ˹that will be˺ witnessed ˹by all˺"},{"SurahNumber":11,"VerseNumber":104,"Text":"We only delay it for a fixed term"},{"SurahNumber":11,"VerseNumber":105,"Text":"When that Day arrives, no one will dare speak except with His permission. Some of them will be miserable, others joyful"},{"SurahNumber":11,"VerseNumber":106,"Text":"As for those bound for misery, they will be in the Fire, where they will be sighing and gasping"},{"SurahNumber":11,"VerseNumber":107,"Text":"staying there forever, as long as the heavens and the earth will endure, except what your Lord wills. Surely your Lord does what He intends"},{"SurahNumber":11,"VerseNumber":108,"Text":"And as for those destined to joy, they will be in Paradise, staying there forever, as long as the heavens and the earth will endure, except what your Lord wills—a ˹generous˺ giving, without end"},{"SurahNumber":11,"VerseNumber":109,"Text":"So do not be in doubt ˹O Prophet˺ about what those ˹pagans˺ worship. They worship nothing except what their forefathers worshipped before ˹them˺. And We will certainly give them their share ˹of punishment˺ in full, without any reduction"},{"SurahNumber":11,"VerseNumber":110,"Text":"Indeed, We had given Moses the Scripture, but differences arose regarding it. Had it not been for a prior decree from your Lord, their differences would have been settled ˹at once˺. They are truly in alarming doubt about it"},{"SurahNumber":11,"VerseNumber":111,"Text":"And surely your Lord will fully pay all for their deeds. He is certainly All-Aware of what they do"},{"SurahNumber":11,"VerseNumber":112,"Text":"So be steadfast as you are commanded ˹O Prophet˺, along with those who turn ˹in submission to God˺ with you. And do not transgress. Surely He is All-Seeing of what you ˹believers˺ do"},{"SurahNumber":11,"VerseNumber":113,"Text":"And do not be inclined to the wrongdoers or you will be touched by the Fire. For then you would have no protectors other than God, nor would you be helped"},{"SurahNumber":11,"VerseNumber":114,"Text":"Establish prayer ˹O Prophet˺ at both ends of the day and in the early part of the night. Surely good deeds wipe out evil deeds. That is a reminder for the mindful"},{"SurahNumber":11,"VerseNumber":115,"Text":"And be patient! Certainly God does not discount the reward of the good-doers"},{"SurahNumber":11,"VerseNumber":116,"Text":"If only there had been among the ˹destroyed˺ peoples before you, ˹O believers,˺ virtuous individuals who forbade corruption in the land—other than the few We had saved ˹from the torment˺. But the wrongdoers ˹only˺ pursued their ˹worldly˺ pleasures, becoming wicked"},{"SurahNumber":11,"VerseNumber":117,"Text":"And your Lord ˹O Prophet˺ would never destroy a society unjustly while its people were acting rightly"},{"SurahNumber":11,"VerseNumber":118,"Text":"Had your Lord so willed, He would have certainly made humanity one single community ˹of believers˺, but they will always ˹choose to˺ differ—"},{"SurahNumber":11,"VerseNumber":119,"Text":"except those shown mercy by your Lord—and so He created them ˹to choose freely˺. And so the Word of your Lord will be fulfilled: “I will surely fill up Hell with jinn and humans all together.”"},{"SurahNumber":11,"VerseNumber":120,"Text":"And We relate to you ˹O Prophet˺ the stories of the messengers to reassure your heart. And there has come to you in this ˹sûrah˺ the truth, a warning ˹to the disbelievers˺, and a reminder to the believers"},{"SurahNumber":11,"VerseNumber":121,"Text":"Say to those who disbelieve, “Persist in your ways; we will certainly persist in ours"},{"SurahNumber":11,"VerseNumber":122,"Text":"And wait! Surely we ˹too˺ are waiting.”"},{"SurahNumber":11,"VerseNumber":123,"Text":"To God ˹alone˺ belongs the knowledge of what is hidden in the heavens and the earth. And to Him all matters are returned. So worship Him and put your trust in Him. And your Lord is never unaware of what you do"}]}]}