{"SurahNumber":16,"HasBismillah":true,"Verses":[{"SurahNumber":16,"VerseNumber":1,"Text":"أَتَىٰٓ أَمۡرُ ٱللَّهِ فَلَا تَسۡتَعۡجِلُوهُۚ سُبۡحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يُشۡرِكُونَ","End":"١"},{"SurahNumber":16,"VerseNumber":2,"Text":"يُنَزِّلُ ٱلۡمَلَـٰٓئِكَةَ بِٱلرُّوحِ مِنۡ أَمۡرِهِۦ عَلَىٰ مَن يَشَآءُ مِنۡ عِبَادِهِۦٓ أَنۡ أَنذِرُوٓاْ أَنَّهُۥ لَآ إِلَٰهَ إِلَّآ أَنَا۠ فَٱتَّقُونِ","End":"٢"},{"SurahNumber":16,"VerseNumber":3,"Text":"خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ بِٱلۡحَقِّۚ تَعَٰلَىٰ عَمَّا يُشۡرِكُونَ","End":"٣"},{"SurahNumber":16,"VerseNumber":4,"Text":"خَلَقَ ٱلۡإِنسَٰنَ مِن نُّطۡفَةٖ فَإِذَا هُوَ خَصِيمٞ مُّبِينٞ","End":"٤"},{"SurahNumber":16,"VerseNumber":5,"Text":"وَٱلۡأَنۡعَٰمَ خَلَقَهَاۖ لَكُمۡ فِيهَا دِفۡءٞ وَمَنَٰفِعُ وَمِنۡهَا تَأۡكُلُونَ","End":"٥"},{"SurahNumber":16,"VerseNumber":6,"Text":"وَلَكُمۡ فِيهَا جَمَالٌ حِينَ تُرِيحُونَ وَحِينَ تَسۡرَحُونَ","End":"٦"},{"SurahNumber":16,"VerseNumber":7,"Text":"وَتَحۡمِلُ أَثۡقَالَكُمۡ إِلَىٰ بَلَدٖ لَّمۡ تَكُونُواْ بَٰلِغِيهِ إِلَّا بِشِقِّ ٱلۡأَنفُسِۚ إِنَّ رَبَّكُمۡ لَرَءُوفٞ رَّحِيمٞ","End":"٧"},{"SurahNumber":16,"VerseNumber":8,"Text":"وَٱلۡخَيۡلَ وَٱلۡبِغَالَ وَٱلۡحَمِيرَ لِتَرۡكَبُوهَا وَزِينَةٗۚ وَيَخۡلُقُ مَا لَا تَعۡلَمُونَ","End":"٨"},{"SurahNumber":16,"VerseNumber":9,"Text":"وَعَلَى ٱللَّهِ قَصۡدُ ٱلسَّبِيلِ وَمِنۡهَا جَآئِرٞۚ وَلَوۡ شَآءَ لَهَدَىٰكُمۡ أَجۡمَعِينَ","End":"٩"},{"SurahNumber":16,"VerseNumber":10,"Text":"هُوَ ٱلَّذِيٓ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗۖ لَّكُم مِّنۡهُ شَرَابٞ وَمِنۡهُ شَجَرٞ فِيهِ تُسِيمُونَ","End":"١٠"},{"SurahNumber":16,"VerseNumber":11,"Text":"يُنۢبِتُ لَكُم بِهِ ٱلزَّرۡعَ وَٱلزَّيۡتُونَ وَٱلنَّخِيلَ وَٱلۡأَعۡنَٰبَ وَمِن كُلِّ ٱلثَّمَرَٰتِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَتَفَكَّرُونَ","End":"١١"},{"SurahNumber":16,"VerseNumber":12,"Text":"وَسَخَّرَ لَكُمُ ٱلَّيۡلَ وَٱلنَّهَارَ وَٱلشَّمۡسَ وَٱلۡقَمَرَۖ وَٱلنُّجُومُ مُسَخَّرَٰتُۢ بِأَمۡرِهِۦٓۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَعۡقِلُونَ","End":"١٢"},{"SurahNumber":16,"VerseNumber":13,"Text":"وَمَا ذَرَأَ لَكُمۡ فِي ٱلۡأَرۡضِ مُخۡتَلِفًا أَلۡوَٰنُهُۥٓۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَذَّكَّرُونَ","End":"١٣"},{"SurahNumber":16,"VerseNumber":14,"Text":"وَهُوَ ٱلَّذِي سَخَّرَ ٱلۡبَحۡرَ لِتَأۡكُلُواْ مِنۡهُ لَحۡمٗا طَرِيّٗا وَتَسۡتَخۡرِجُواْ مِنۡهُ حِلۡيَةٗ تَلۡبَسُونَهَاۖ وَتَرَى ٱلۡفُلۡكَ مَوَاخِرَ فِيهِ وَلِتَبۡتَغُواْ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ","End":"١٤"},{"SurahNumber":16,"VerseNumber":15,"Text":"وَأَلۡقَىٰ فِي ٱلۡأَرۡضِ رَوَٰسِيَ أَن تَمِيدَ بِكُمۡ وَأَنۡهَٰرٗا وَسُبُلٗا لَّعَلَّكُمۡ تَهۡتَدُونَ","End":"١٥"},{"SurahNumber":16,"VerseNumber":16,"Text":"وَعَلَٰمَٰتٖۚ وَبِٱلنَّجۡمِ هُمۡ يَهۡتَدُونَ","End":"١٦"},{"SurahNumber":16,"VerseNumber":17,"Text":"أَفَمَن يَخۡلُقُ كَمَن لَّا يَخۡلُقُۚ أَفَلَا تَذَكَّرُونَ","End":"١٧"},{"SurahNumber":16,"VerseNumber":18,"Text":"وَإِن تَعُدُّواْ نِعۡمَةَ ٱللَّهِ لَا تُحۡصُوهَآۗ إِنَّ ٱللَّهَ لَغَفُورٞ رَّحِيمٞ","End":"١٨"},{"SurahNumber":16,"VerseNumber":19,"Text":"وَٱللَّهُ يَعۡلَمُ مَا تُسِرُّونَ وَمَا تُعۡلِنُونَ","End":"١٩"},{"SurahNumber":16,"VerseNumber":20,"Text":"وَٱلَّذِينَ يَدۡعُونَ مِن دُونِ ٱللَّهِ لَا يَخۡلُقُونَ شَيۡـٔٗا وَهُمۡ يُخۡلَقُونَ","End":"٢٠"},{"SurahNumber":16,"VerseNumber":21,"Text":"أَمۡوَٰتٌ غَيۡرُ أَحۡيَآءٖۖ وَمَا يَشۡعُرُونَ أَيَّانَ يُبۡعَثُونَ","End":"٢١"},{"SurahNumber":16,"VerseNumber":22,"Text":"إِلَٰهُكُمۡ إِلَٰهٞ وَٰحِدٞۚ فَٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ قُلُوبُهُم مُّنكِرَةٞ وَهُم مُّسۡتَكۡبِرُونَ","End":"٢٢"},{"SurahNumber":16,"VerseNumber":23,"Text":"لَا جَرَمَ أَنَّ ٱللَّهَ يَعۡلَمُ مَا يُسِرُّونَ وَمَا يُعۡلِنُونَۚ إِنَّهُۥ لَا يُحِبُّ ٱلۡمُسۡتَكۡبِرِينَ","End":"٢٣"},{"SurahNumber":16,"VerseNumber":24,"Text":"وَإِذَا قِيلَ لَهُم مَّاذَآ أَنزَلَ رَبُّكُمۡ قَالُوٓاْ أَسَٰطِيرُ ٱلۡأَوَّلِينَ","End":"٢٤"},{"SurahNumber":16,"VerseNumber":25,"Text":"لِيَحۡمِلُوٓاْ أَوۡزَارَهُمۡ كَامِلَةٗ يَوۡمَ ٱلۡقِيَٰمَةِ وَمِنۡ أَوۡزَارِ ٱلَّذِينَ يُضِلُّونَهُم بِغَيۡرِ عِلۡمٍۗ أَلَا سَآءَ مَا يَزِرُونَ","End":"٢٥"},{"SurahNumber":16,"VerseNumber":26,"Text":"قَدۡ مَكَرَ ٱلَّذِينَ مِن قَبۡلِهِمۡ فَأَتَى ٱللَّهُ بُنۡيَٰنَهُم مِّنَ ٱلۡقَوَاعِدِ فَخَرَّ عَلَيۡهِمُ ٱلسَّقۡفُ مِن فَوۡقِهِمۡ وَأَتَىٰهُمُ ٱلۡعَذَابُ مِنۡ حَيۡثُ لَا يَشۡعُرُونَ","End":"٢٦"},{"SurahNumber":16,"VerseNumber":27,"Text":"ثُمَّ يَوۡمَ ٱلۡقِيَٰمَةِ يُخۡزِيهِمۡ وَيَقُولُ أَيۡنَ شُرَكَآءِيَ ٱلَّذِينَ كُنتُمۡ تُشَـٰٓقُّونَ فِيهِمۡۚ قَالَ ٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ إِنَّ ٱلۡخِزۡيَ ٱلۡيَوۡمَ وَٱلسُّوٓءَ عَلَى ٱلۡكَٰفِرِينَ","End":"٢٧"},{"SurahNumber":16,"VerseNumber":28,"Text":"ٱلَّذِينَ تَتَوَفَّىٰهُمُ ٱلۡمَلَـٰٓئِكَةُ ظَالِمِيٓ أَنفُسِهِمۡۖ فَأَلۡقَوُاْ ٱلسَّلَمَ مَا كُنَّا نَعۡمَلُ مِن سُوٓءِۭۚ بَلَىٰٓۚ إِنَّ ٱللَّهَ عَلِيمُۢ بِمَا كُنتُمۡ تَعۡمَلُونَ","End":"٢٨"},{"SurahNumber":16,"VerseNumber":29,"Text":"فَٱدۡخُلُوٓاْ أَبۡوَٰبَ جَهَنَّمَ خَٰلِدِينَ فِيهَاۖ فَلَبِئۡسَ مَثۡوَى ٱلۡمُتَكَبِّرِينَ","End":"٢٩"},{"SurahNumber":16,"VerseNumber":30,"Text":"۞وَقِيلَ لِلَّذِينَ ٱتَّقَوۡاْ مَاذَآ أَنزَلَ رَبُّكُمۡۚ قَالُواْ خَيۡرٗاۗ لِّلَّذِينَ أَحۡسَنُواْ فِي هَٰذِهِ ٱلدُّنۡيَا حَسَنَةٞۚ وَلَدَارُ ٱلۡأٓخِرَةِ خَيۡرٞۚ وَلَنِعۡمَ دَارُ ٱلۡمُتَّقِينَ","End":"٣٠"},{"SurahNumber":16,"VerseNumber":31,"Text":"جَنَّـٰتُ عَدۡنٖ يَدۡخُلُونَهَا تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۖ لَهُمۡ فِيهَا مَا يَشَآءُونَۚ كَذَٰلِكَ يَجۡزِي ٱللَّهُ ٱلۡمُتَّقِينَ","End":"٣١"},{"SurahNumber":16,"VerseNumber":32,"Text":"ٱلَّذِينَ تَتَوَفَّىٰهُمُ ٱلۡمَلَـٰٓئِكَةُ طَيِّبِينَ يَقُولُونَ سَلَٰمٌ عَلَيۡكُمُ ٱدۡخُلُواْ ٱلۡجَنَّةَ بِمَا كُنتُمۡ تَعۡمَلُونَ","End":"٣٢"},{"SurahNumber":16,"VerseNumber":33,"Text":"هَلۡ يَنظُرُونَ إِلَّآ أَن تَأۡتِيَهُمُ ٱلۡمَلَـٰٓئِكَةُ أَوۡ يَأۡتِيَ أَمۡرُ رَبِّكَۚ كَذَٰلِكَ فَعَلَ ٱلَّذِينَ مِن قَبۡلِهِمۡۚ وَمَا ظَلَمَهُمُ ٱللَّهُ وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ","End":"٣٣"},{"SurahNumber":16,"VerseNumber":34,"Text":"فَأَصَابَهُمۡ سَيِّـَٔاتُ مَا عَمِلُواْ وَحَاقَ بِهِم مَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ","End":"٣٤"},{"SurahNumber":16,"VerseNumber":35,"Text":"وَقَالَ ٱلَّذِينَ أَشۡرَكُواْ لَوۡ شَآءَ ٱللَّهُ مَا عَبَدۡنَا مِن دُونِهِۦ مِن شَيۡءٖ نَّحۡنُ وَلَآ ءَابَآؤُنَا وَلَا حَرَّمۡنَا مِن دُونِهِۦ مِن شَيۡءٖۚ كَذَٰلِكَ فَعَلَ ٱلَّذِينَ مِن قَبۡلِهِمۡۚ فَهَلۡ عَلَى ٱلرُّسُلِ إِلَّا ٱلۡبَلَٰغُ ٱلۡمُبِينُ","End":"٣٥"},{"SurahNumber":16,"VerseNumber":36,"Text":"وَلَقَدۡ بَعَثۡنَا فِي كُلِّ أُمَّةٖ رَّسُولًا أَنِ ٱعۡبُدُواْ ٱللَّهَ وَٱجۡتَنِبُواْ ٱلطَّـٰغُوتَۖ فَمِنۡهُم مَّنۡ هَدَى ٱللَّهُ وَمِنۡهُم مَّنۡ حَقَّتۡ عَلَيۡهِ ٱلضَّلَٰلَةُۚ فَسِيرُواْ فِي ٱلۡأَرۡضِ فَٱنظُرُواْ كَيۡفَ كَانَ عَٰقِبَةُ ٱلۡمُكَذِّبِينَ","End":"٣٦"},{"SurahNumber":16,"VerseNumber":37,"Text":"إِن تَحۡرِصۡ عَلَىٰ هُدَىٰهُمۡ فَإِنَّ ٱللَّهَ لَا يَهۡدِي مَن يُضِلُّۖ وَمَا لَهُم مِّن نَّـٰصِرِينَ","End":"٣٧"},{"SurahNumber":16,"VerseNumber":38,"Text":"وَأَقۡسَمُواْ بِٱللَّهِ جَهۡدَ أَيۡمَٰنِهِمۡ لَا يَبۡعَثُ ٱللَّهُ مَن يَمُوتُۚ بَلَىٰ وَعۡدًا عَلَيۡهِ حَقّٗا وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَعۡلَمُونَ","End":"٣٨"},{"SurahNumber":16,"VerseNumber":39,"Text":"لِيُبَيِّنَ لَهُمُ ٱلَّذِي يَخۡتَلِفُونَ فِيهِ وَلِيَعۡلَمَ ٱلَّذِينَ كَفَرُوٓاْ أَنَّهُمۡ كَانُواْ كَٰذِبِينَ","End":"٣٩"},{"SurahNumber":16,"VerseNumber":40,"Text":"إِنَّمَا قَوۡلُنَا لِشَيۡءٍ إِذَآ أَرَدۡنَٰهُ أَن نَّقُولَ لَهُۥ كُن فَيَكُونُ","End":"٤٠"},{"SurahNumber":16,"VerseNumber":41,"Text":"وَٱلَّذِينَ هَاجَرُواْ فِي ٱللَّهِ مِنۢ بَعۡدِ مَا ظُلِمُواْ لَنُبَوِّئَنَّهُمۡ فِي ٱلدُّنۡيَا حَسَنَةٗۖ وَلَأَجۡرُ ٱلۡأٓخِرَةِ أَكۡبَرُۚ لَوۡ كَانُواْ يَعۡلَمُونَ","End":"٤١"},{"SurahNumber":16,"VerseNumber":42,"Text":"ٱلَّذِينَ صَبَرُواْ وَعَلَىٰ رَبِّهِمۡ يَتَوَكَّلُونَ","End":"٤٢"},{"SurahNumber":16,"VerseNumber":43,"Text":"وَمَآ أَرۡسَلۡنَا مِن قَبۡلِكَ إِلَّا رِجَالٗا نُّوحِيٓ إِلَيۡهِمۡۖ فَسۡـَٔلُوٓاْ أَهۡلَ ٱلذِّكۡرِ إِن كُنتُمۡ لَا تَعۡلَمُونَ","End":"٤٣"},{"SurahNumber":16,"VerseNumber":44,"Text":"بِٱلۡبَيِّنَٰتِ وَٱلزُّبُرِۗ وَأَنزَلۡنَآ إِلَيۡكَ ٱلذِّكۡرَ لِتُبَيِّنَ لِلنَّاسِ مَا نُزِّلَ إِلَيۡهِمۡ وَلَعَلَّهُمۡ يَتَفَكَّرُونَ","End":"٤٤"},{"SurahNumber":16,"VerseNumber":45,"Text":"أَفَأَمِنَ ٱلَّذِينَ مَكَرُواْ ٱلسَّيِّـَٔاتِ أَن يَخۡسِفَ ٱللَّهُ بِهِمُ ٱلۡأَرۡضَ أَوۡ يَأۡتِيَهُمُ ٱلۡعَذَابُ مِنۡ حَيۡثُ لَا يَشۡعُرُونَ","End":"٤٥"},{"SurahNumber":16,"VerseNumber":46,"Text":"أَوۡ يَأۡخُذَهُمۡ فِي تَقَلُّبِهِمۡ فَمَا هُم بِمُعۡجِزِينَ","End":"٤٦"},{"SurahNumber":16,"VerseNumber":47,"Text":"أَوۡ يَأۡخُذَهُمۡ عَلَىٰ تَخَوُّفٖ فَإِنَّ رَبَّكُمۡ لَرَءُوفٞ رَّحِيمٌ","End":"٤٧"},{"SurahNumber":16,"VerseNumber":48,"Text":"أَوَلَمۡ يَرَوۡاْ إِلَىٰ مَا خَلَقَ ٱللَّهُ مِن شَيۡءٖ يَتَفَيَّؤُاْ ظِلَٰلُهُۥ عَنِ ٱلۡيَمِينِ وَٱلشَّمَآئِلِ سُجَّدٗا لِّلَّهِ وَهُمۡ دَٰخِرُونَ","End":"٤٨"},{"SurahNumber":16,"VerseNumber":49,"Text":"وَلِلَّهِۤ يَسۡجُدُۤ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِ مِن دَآبَّةٖ وَٱلۡمَلَـٰٓئِكَةُ وَهُمۡ لَا يَسۡتَكۡبِرُونَ","End":"٤٩"},{"SurahNumber":16,"VerseNumber":50,"Text":"يَخَافُونَ رَبَّهُم مِّن فَوۡقِهِمۡ وَيَفۡعَلُونَ مَا يُؤۡمَرُونَ۩","End":"٥٠"},{"SurahNumber":16,"VerseNumber":51,"Text":"۞وَقَالَ ٱللَّهُ لَا تَتَّخِذُوٓاْ إِلَٰهَيۡنِ ٱثۡنَيۡنِۖ إِنَّمَا هُوَ إِلَٰهٞ وَٰحِدٞ فَإِيَّـٰيَ فَٱرۡهَبُونِ","End":"٥١"},{"SurahNumber":16,"VerseNumber":52,"Text":"وَلَهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَلَهُ ٱلدِّينُ وَاصِبًاۚ أَفَغَيۡرَ ٱللَّهِ تَتَّقُونَ","End":"٥٢"},{"SurahNumber":16,"VerseNumber":53,"Text":"وَمَا بِكُم مِّن نِّعۡمَةٖ فَمِنَ ٱللَّهِۖ ثُمَّ إِذَا مَسَّكُمُ ٱلضُّرُّ فَإِلَيۡهِ تَجۡـَٔرُونَ","End":"٥٣"},{"SurahNumber":16,"VerseNumber":54,"Text":"ثُمَّ إِذَا كَشَفَ ٱلضُّرَّ عَنكُمۡ إِذَا فَرِيقٞ مِّنكُم بِرَبِّهِمۡ يُشۡرِكُونَ","End":"٥٤"},{"SurahNumber":16,"VerseNumber":55,"Text":"لِيَكۡفُرُواْ بِمَآ ءَاتَيۡنَٰهُمۡۚ فَتَمَتَّعُواْ فَسَوۡفَ تَعۡلَمُونَ","End":"٥٥"},{"SurahNumber":16,"VerseNumber":56,"Text":"وَيَجۡعَلُونَ لِمَا لَا يَعۡلَمُونَ نَصِيبٗا مِّمَّا رَزَقۡنَٰهُمۡۗ تَٱللَّهِ لَتُسۡـَٔلُنَّ عَمَّا كُنتُمۡ تَفۡتَرُونَ","End":"٥٦"},{"SurahNumber":16,"VerseNumber":57,"Text":"وَيَجۡعَلُونَ لِلَّهِ ٱلۡبَنَٰتِ سُبۡحَٰنَهُۥ وَلَهُم مَّا يَشۡتَهُونَ","End":"٥٧"},{"SurahNumber":16,"VerseNumber":58,"Text":"وَإِذَا بُشِّرَ أَحَدُهُم بِٱلۡأُنثَىٰ ظَلَّ وَجۡهُهُۥ مُسۡوَدّٗا وَهُوَ كَظِيمٞ","End":"٥٨"},{"SurahNumber":16,"VerseNumber":59,"Text":"يَتَوَٰرَىٰ مِنَ ٱلۡقَوۡمِ مِن سُوٓءِ مَا بُشِّرَ بِهِۦٓۚ أَيُمۡسِكُهُۥ عَلَىٰ هُونٍ أَمۡ يَدُسُّهُۥ فِي ٱلتُّرَابِۗ أَلَا سَآءَ مَا يَحۡكُمُونَ","End":"٥٩"},{"SurahNumber":16,"VerseNumber":60,"Text":"لِلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ مَثَلُ ٱلسَّوۡءِۖ وَلِلَّهِ ٱلۡمَثَلُ ٱلۡأَعۡلَىٰۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","End":"٦٠"},{"SurahNumber":16,"VerseNumber":61,"Text":"وَلَوۡ يُؤَاخِذُ ٱللَّهُ ٱلنَّاسَ بِظُلۡمِهِم مَّا تَرَكَ عَلَيۡهَا مِن دَآبَّةٖ وَلَٰكِن يُؤَخِّرُهُمۡ إِلَىٰٓ أَجَلٖ مُّسَمّٗىۖ فَإِذَا جَآءَ أَجَلُهُمۡ لَا يَسۡتَـٔۡخِرُونَ سَاعَةٗ وَلَا يَسۡتَقۡدِمُونَ","End":"٦١"},{"SurahNumber":16,"VerseNumber":62,"Text":"وَيَجۡعَلُونَ لِلَّهِ مَا يَكۡرَهُونَۚ وَتَصِفُ أَلۡسِنَتُهُمُ ٱلۡكَذِبَ أَنَّ لَهُمُ ٱلۡحُسۡنَىٰۚ لَا جَرَمَ أَنَّ لَهُمُ ٱلنَّارَ وَأَنَّهُم مُّفۡرَطُونَ","End":"٦٢"},{"SurahNumber":16,"VerseNumber":63,"Text":"تَٱللَّهِ لَقَدۡ أَرۡسَلۡنَآ إِلَىٰٓ أُمَمٖ مِّن قَبۡلِكَ فَزَيَّنَ لَهُمُ ٱلشَّيۡطَٰنُ أَعۡمَٰلَهُمۡ فَهُوَ وَلِيُّهُمُ ٱلۡيَوۡمَ وَلَهُمۡ عَذَابٌ أَلِيمٞ","End":"٦٣"},{"SurahNumber":16,"VerseNumber":64,"Text":"وَمَآ أَنزَلۡنَا عَلَيۡكَ ٱلۡكِتَٰبَ إِلَّا لِتُبَيِّنَ لَهُمُ ٱلَّذِي ٱخۡتَلَفُواْ فِيهِ وَهُدٗى وَرَحۡمَةٗ لِّقَوۡمٖ يُؤۡمِنُونَ","End":"٦٤"},{"SurahNumber":16,"VerseNumber":65,"Text":"وَٱللَّهُ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَأَحۡيَا بِهِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَآۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَسۡمَعُونَ","End":"٦٥"},{"SurahNumber":16,"VerseNumber":66,"Text":"وَإِنَّ لَكُمۡ فِي ٱلۡأَنۡعَٰمِ لَعِبۡرَةٗۖ نُّسۡقِيكُم مِّمَّا فِي بُطُونِهِۦ مِنۢ بَيۡنِ فَرۡثٖ وَدَمٖ لَّبَنًا خَالِصٗا سَآئِغٗا لِّلشَّـٰرِبِينَ","End":"٦٦"},{"SurahNumber":16,"VerseNumber":67,"Text":"وَمِن ثَمَرَٰتِ ٱلنَّخِيلِ وَٱلۡأَعۡنَٰبِ تَتَّخِذُونَ مِنۡهُ سَكَرٗا وَرِزۡقًا حَسَنًاۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَعۡقِلُونَ","End":"٦٧"},{"SurahNumber":16,"VerseNumber":68,"Text":"وَأَوۡحَىٰ رَبُّكَ إِلَى ٱلنَّحۡلِ أَنِ ٱتَّخِذِي مِنَ ٱلۡجِبَالِ بُيُوتٗا وَمِنَ ٱلشَّجَرِ وَمِمَّا يَعۡرِشُونَ","End":"٦٨"},{"SurahNumber":16,"VerseNumber":69,"Text":"ثُمَّ كُلِي مِن كُلِّ ٱلثَّمَرَٰتِ فَٱسۡلُكِي سُبُلَ رَبِّكِ ذُلُلٗاۚ يَخۡرُجُ مِنۢ بُطُونِهَا شَرَابٞ مُّخۡتَلِفٌ أَلۡوَٰنُهُۥ فِيهِ شِفَآءٞ لِّلنَّاسِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَتَفَكَّرُونَ","End":"٦٩"},{"SurahNumber":16,"VerseNumber":70,"Text":"وَٱللَّهُ خَلَقَكُمۡ ثُمَّ يَتَوَفَّىٰكُمۡۚ وَمِنكُم مَّن يُرَدُّ إِلَىٰٓ أَرۡذَلِ ٱلۡعُمُرِ لِكَيۡ لَا يَعۡلَمَ بَعۡدَ عِلۡمٖ شَيۡـًٔاۚ إِنَّ ٱللَّهَ عَلِيمٞ قَدِيرٞ","End":"٧٠"},{"SurahNumber":16,"VerseNumber":71,"Text":"وَٱللَّهُ فَضَّلَ بَعۡضَكُمۡ عَلَىٰ بَعۡضٖ فِي ٱلرِّزۡقِۚ فَمَا ٱلَّذِينَ فُضِّلُواْ بِرَآدِّي رِزۡقِهِمۡ عَلَىٰ مَا مَلَكَتۡ أَيۡمَٰنُهُمۡ فَهُمۡ فِيهِ سَوَآءٌۚ أَفَبِنِعۡمَةِ ٱللَّهِ يَجۡحَدُونَ","End":"٧١"},{"SurahNumber":16,"VerseNumber":72,"Text":"وَٱللَّهُ جَعَلَ لَكُم مِّنۡ أَنفُسِكُمۡ أَزۡوَٰجٗا وَجَعَلَ لَكُم مِّنۡ أَزۡوَٰجِكُم بَنِينَ وَحَفَدَةٗ وَرَزَقَكُم مِّنَ ٱلطَّيِّبَٰتِۚ أَفَبِٱلۡبَٰطِلِ يُؤۡمِنُونَ وَبِنِعۡمَتِ ٱللَّهِ هُمۡ يَكۡفُرُونَ","End":"٧٢"},{"SurahNumber":16,"VerseNumber":73,"Text":"وَيَعۡبُدُونَ مِن دُونِ ٱللَّهِ مَا لَا يَمۡلِكُ لَهُمۡ رِزۡقٗا مِّنَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ شَيۡـٔٗا وَلَا يَسۡتَطِيعُونَ","End":"٧٣"},{"SurahNumber":16,"VerseNumber":74,"Text":"فَلَا تَضۡرِبُواْ لِلَّهِ ٱلۡأَمۡثَالَۚ إِنَّ ٱللَّهَ يَعۡلَمُ وَأَنتُمۡ لَا تَعۡلَمُونَ","End":"٧٤"},{"SurahNumber":16,"VerseNumber":75,"Text":"۞ضَرَبَ ٱللَّهُ مَثَلًا عَبۡدٗا مَّمۡلُوكٗا لَّا يَقۡدِرُ عَلَىٰ شَيۡءٖ وَمَن رَّزَقۡنَٰهُ مِنَّا رِزۡقًا حَسَنٗا فَهُوَ يُنفِقُ مِنۡهُ سِرّٗا وَجَهۡرًاۖ هَلۡ يَسۡتَوُۥنَۚ ٱلۡحَمۡدُ لِلَّهِۚ بَلۡ أَكۡثَرُهُمۡ لَا يَعۡلَمُونَ","End":"٧٥"},{"SurahNumber":16,"VerseNumber":76,"Text":"وَضَرَبَ ٱللَّهُ مَثَلٗا رَّجُلَيۡنِ أَحَدُهُمَآ أَبۡكَمُ لَا يَقۡدِرُ عَلَىٰ شَيۡءٖ وَهُوَ كَلٌّ عَلَىٰ مَوۡلَىٰهُ أَيۡنَمَا يُوَجِّههُّ لَا يَأۡتِ بِخَيۡرٍ هَلۡ يَسۡتَوِي هُوَ وَمَن يَأۡمُرُ بِٱلۡعَدۡلِ وَهُوَ عَلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ","End":"٧٦"},{"SurahNumber":16,"VerseNumber":77,"Text":"وَلِلَّهِ غَيۡبُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَمَآ أَمۡرُ ٱلسَّاعَةِ إِلَّا كَلَمۡحِ ٱلۡبَصَرِ أَوۡ هُوَ أَقۡرَبُۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","End":"٧٧"},{"SurahNumber":16,"VerseNumber":78,"Text":"وَٱللَّهُ أَخۡرَجَكُم مِّنۢ بُطُونِ أُمَّهَٰتِكُمۡ لَا تَعۡلَمُونَ شَيۡـٔٗا وَجَعَلَ لَكُمُ ٱلسَّمۡعَ وَٱلۡأَبۡصَٰرَ وَٱلۡأَفۡـِٔدَةَ لَعَلَّكُمۡ تَشۡكُرُونَ","End":"٧٨"},{"SurahNumber":16,"VerseNumber":79,"Text":"أَلَمۡ يَرَوۡاْ إِلَى ٱلطَّيۡرِ مُسَخَّرَٰتٖ فِي جَوِّ ٱلسَّمَآءِ مَا يُمۡسِكُهُنَّ إِلَّا ٱللَّهُۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يُؤۡمِنُونَ","End":"٧٩"},{"SurahNumber":16,"VerseNumber":80,"Text":"وَٱللَّهُ جَعَلَ لَكُم مِّنۢ بُيُوتِكُمۡ سَكَنٗا وَجَعَلَ لَكُم مِّن جُلُودِ ٱلۡأَنۡعَٰمِ بُيُوتٗا تَسۡتَخِفُّونَهَا يَوۡمَ ظَعۡنِكُمۡ وَيَوۡمَ إِقَامَتِكُمۡ وَمِنۡ أَصۡوَافِهَا وَأَوۡبَارِهَا وَأَشۡعَارِهَآ أَثَٰثٗا وَمَتَٰعًا إِلَىٰ حِينٖ","End":"٨٠"},{"SurahNumber":16,"VerseNumber":81,"Text":"وَٱللَّهُ جَعَلَ لَكُم مِّمَّا خَلَقَ ظِلَٰلٗا وَجَعَلَ لَكُم مِّنَ ٱلۡجِبَالِ أَكۡنَٰنٗا وَجَعَلَ لَكُمۡ سَرَٰبِيلَ تَقِيكُمُ ٱلۡحَرَّ وَسَرَٰبِيلَ تَقِيكُم بَأۡسَكُمۡۚ كَذَٰلِكَ يُتِمُّ نِعۡمَتَهُۥ عَلَيۡكُمۡ لَعَلَّكُمۡ تُسۡلِمُونَ","End":"٨١"},{"SurahNumber":16,"VerseNumber":82,"Text":"فَإِن تَوَلَّوۡاْ فَإِنَّمَا عَلَيۡكَ ٱلۡبَلَٰغُ ٱلۡمُبِينُ","End":"٨٢"},{"SurahNumber":16,"VerseNumber":83,"Text":"يَعۡرِفُونَ نِعۡمَتَ ٱللَّهِ ثُمَّ يُنكِرُونَهَا وَأَكۡثَرُهُمُ ٱلۡكَٰفِرُونَ","End":"٨٣"},{"SurahNumber":16,"VerseNumber":84,"Text":"وَيَوۡمَ نَبۡعَثُ مِن كُلِّ أُمَّةٖ شَهِيدٗا ثُمَّ لَا يُؤۡذَنُ لِلَّذِينَ كَفَرُواْ وَلَا هُمۡ يُسۡتَعۡتَبُونَ","End":"٨٤"},{"SurahNumber":16,"VerseNumber":85,"Text":"وَإِذَا رَءَا ٱلَّذِينَ ظَلَمُواْ ٱلۡعَذَابَ فَلَا يُخَفَّفُ عَنۡهُمۡ وَلَا هُمۡ يُنظَرُونَ","End":"٨٥"},{"SurahNumber":16,"VerseNumber":86,"Text":"وَإِذَا رَءَا ٱلَّذِينَ أَشۡرَكُواْ شُرَكَآءَهُمۡ قَالُواْ رَبَّنَا هَـٰٓؤُلَآءِ شُرَكَآؤُنَا ٱلَّذِينَ كُنَّا نَدۡعُواْ مِن دُونِكَۖ فَأَلۡقَوۡاْ إِلَيۡهِمُ ٱلۡقَوۡلَ إِنَّكُمۡ لَكَٰذِبُونَ","End":"٨٦"},{"SurahNumber":16,"VerseNumber":87,"Text":"وَأَلۡقَوۡاْ إِلَى ٱللَّهِ يَوۡمَئِذٍ ٱلسَّلَمَۖ وَضَلَّ عَنۡهُم مَّا كَانُواْ يَفۡتَرُونَ","End":"٨٧"},{"SurahNumber":16,"VerseNumber":88,"Text":"ٱلَّذِينَ كَفَرُواْ وَصَدُّواْ عَن سَبِيلِ ٱللَّهِ زِدۡنَٰهُمۡ عَذَابٗا فَوۡقَ ٱلۡعَذَابِ بِمَا كَانُواْ يُفۡسِدُونَ","End":"٨٨"},{"SurahNumber":16,"VerseNumber":89,"Text":"وَيَوۡمَ نَبۡعَثُ فِي كُلِّ أُمَّةٖ شَهِيدًا عَلَيۡهِم مِّنۡ أَنفُسِهِمۡۖ وَجِئۡنَا بِكَ شَهِيدًا عَلَىٰ هَـٰٓؤُلَآءِۚ وَنَزَّلۡنَا عَلَيۡكَ ٱلۡكِتَٰبَ تِبۡيَٰنٗا لِّكُلِّ شَيۡءٖ وَهُدٗى وَرَحۡمَةٗ وَبُشۡرَىٰ لِلۡمُسۡلِمِينَ","End":"٨٩"},{"SurahNumber":16,"VerseNumber":90,"Text":"۞إِنَّ ٱللَّهَ يَأۡمُرُ بِٱلۡعَدۡلِ وَٱلۡإِحۡسَٰنِ وَإِيتَآيِٕ ذِي ٱلۡقُرۡبَىٰ وَيَنۡهَىٰ عَنِ ٱلۡفَحۡشَآءِ وَٱلۡمُنكَرِ وَٱلۡبَغۡيِۚ يَعِظُكُمۡ لَعَلَّكُمۡ تَذَكَّرُونَ","End":"٩٠"},{"SurahNumber":16,"VerseNumber":91,"Text":"وَأَوۡفُواْ بِعَهۡدِ ٱللَّهِ إِذَا عَٰهَدتُّمۡ وَلَا تَنقُضُواْ ٱلۡأَيۡمَٰنَ بَعۡدَ تَوۡكِيدِهَا وَقَدۡ جَعَلۡتُمُ ٱللَّهَ عَلَيۡكُمۡ كَفِيلًاۚ إِنَّ ٱللَّهَ يَعۡلَمُ مَا تَفۡعَلُونَ","End":"٩١"},{"SurahNumber":16,"VerseNumber":92,"Text":"وَلَا تَكُونُواْ كَٱلَّتِي نَقَضَتۡ غَزۡلَهَا مِنۢ بَعۡدِ قُوَّةٍ أَنكَٰثٗا تَتَّخِذُونَ أَيۡمَٰنَكُمۡ دَخَلَۢا بَيۡنَكُمۡ أَن تَكُونَ أُمَّةٌ هِيَ أَرۡبَىٰ مِنۡ أُمَّةٍۚ إِنَّمَا يَبۡلُوكُمُ ٱللَّهُ بِهِۦۚ وَلَيُبَيِّنَنَّ لَكُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ مَا كُنتُمۡ فِيهِ تَخۡتَلِفُونَ","End":"٩٢"},{"SurahNumber":16,"VerseNumber":93,"Text":"وَلَوۡ شَآءَ ٱللَّهُ لَجَعَلَكُمۡ أُمَّةٗ وَٰحِدَةٗ وَلَٰكِن يُضِلُّ مَن يَشَآءُ وَيَهۡدِي مَن يَشَآءُۚ وَلَتُسۡـَٔلُنَّ عَمَّا كُنتُمۡ تَعۡمَلُونَ","End":"٩٣"},{"SurahNumber":16,"VerseNumber":94,"Text":"وَلَا تَتَّخِذُوٓاْ أَيۡمَٰنَكُمۡ دَخَلَۢا بَيۡنَكُمۡ فَتَزِلَّ قَدَمُۢ بَعۡدَ ثُبُوتِهَا وَتَذُوقُواْ ٱلسُّوٓءَ بِمَا صَدَدتُّمۡ عَن سَبِيلِ ٱللَّهِ وَلَكُمۡ عَذَابٌ عَظِيمٞ","End":"٩٤"},{"SurahNumber":16,"VerseNumber":95,"Text":"وَلَا تَشۡتَرُواْ بِعَهۡدِ ٱللَّهِ ثَمَنٗا قَلِيلًاۚ إِنَّمَا عِندَ ٱللَّهِ هُوَ خَيۡرٞ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ","End":"٩٥"},{"SurahNumber":16,"VerseNumber":96,"Text":"مَا عِندَكُمۡ يَنفَدُ وَمَا عِندَ ٱللَّهِ بَاقٖۗ وَلَنَجۡزِيَنَّ ٱلَّذِينَ صَبَرُوٓاْ أَجۡرَهُم بِأَحۡسَنِ مَا كَانُواْ يَعۡمَلُونَ","End":"٩٦"},{"SurahNumber":16,"VerseNumber":97,"Text":"مَنۡ عَمِلَ صَٰلِحٗا مِّن ذَكَرٍ أَوۡ أُنثَىٰ وَهُوَ مُؤۡمِنٞ فَلَنُحۡيِيَنَّهُۥ حَيَوٰةٗ طَيِّبَةٗۖ وَلَنَجۡزِيَنَّهُمۡ أَجۡرَهُم بِأَحۡسَنِ مَا كَانُواْ يَعۡمَلُونَ","End":"٩٧"},{"SurahNumber":16,"VerseNumber":98,"Text":"فَإِذَا قَرَأۡتَ ٱلۡقُرۡءَانَ فَٱسۡتَعِذۡ بِٱللَّهِ مِنَ ٱلشَّيۡطَٰنِ ٱلرَّجِيمِ","End":"٩٨"},{"SurahNumber":16,"VerseNumber":99,"Text":"إِنَّهُۥ لَيۡسَ لَهُۥ سُلۡطَٰنٌ عَلَى ٱلَّذِينَ ءَامَنُواْ وَعَلَىٰ رَبِّهِمۡ يَتَوَكَّلُونَ","End":"٩٩"},{"SurahNumber":16,"VerseNumber":100,"Text":"إِنَّمَا سُلۡطَٰنُهُۥ عَلَى ٱلَّذِينَ يَتَوَلَّوۡنَهُۥ وَٱلَّذِينَ هُم بِهِۦ مُشۡرِكُونَ","End":"١٠٠"},{"SurahNumber":16,"VerseNumber":101,"Text":"وَإِذَا بَدَّلۡنَآ ءَايَةٗ مَّكَانَ ءَايَةٖ وَٱللَّهُ أَعۡلَمُ بِمَا يُنَزِّلُ قَالُوٓاْ إِنَّمَآ أَنتَ مُفۡتَرِۭۚ بَلۡ أَكۡثَرُهُمۡ لَا يَعۡلَمُونَ","End":"١٠١"},{"SurahNumber":16,"VerseNumber":102,"Text":"قُلۡ نَزَّلَهُۥ رُوحُ ٱلۡقُدُسِ مِن رَّبِّكَ بِٱلۡحَقِّ لِيُثَبِّتَ ٱلَّذِينَ ءَامَنُواْ وَهُدٗى وَبُشۡرَىٰ لِلۡمُسۡلِمِينَ","End":"١٠٢"},{"SurahNumber":16,"VerseNumber":103,"Text":"وَلَقَدۡ نَعۡلَمُ أَنَّهُمۡ يَقُولُونَ إِنَّمَا يُعَلِّمُهُۥ بَشَرٞۗ لِّسَانُ ٱلَّذِي يُلۡحِدُونَ إِلَيۡهِ أَعۡجَمِيّٞ وَهَٰذَا لِسَانٌ عَرَبِيّٞ مُّبِينٌ","End":"١٠٣"},{"SurahNumber":16,"VerseNumber":104,"Text":"إِنَّ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِـَٔايَٰتِ ٱللَّهِ لَا يَهۡدِيهِمُ ٱللَّهُ وَلَهُمۡ عَذَابٌ أَلِيمٌ","End":"١٠٤"},{"SurahNumber":16,"VerseNumber":105,"Text":"إِنَّمَا يَفۡتَرِي ٱلۡكَذِبَ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِـَٔايَٰتِ ٱللَّهِۖ وَأُوْلَـٰٓئِكَ هُمُ ٱلۡكَٰذِبُونَ","End":"١٠٥"},{"SurahNumber":16,"VerseNumber":106,"Text":"مَن كَفَرَ بِٱللَّهِ مِنۢ بَعۡدِ إِيمَٰنِهِۦٓ إِلَّا مَنۡ أُكۡرِهَ وَقَلۡبُهُۥ مُطۡمَئِنُّۢ بِٱلۡإِيمَٰنِ وَلَٰكِن مَّن شَرَحَ بِٱلۡكُفۡرِ صَدۡرٗا فَعَلَيۡهِمۡ غَضَبٞ مِّنَ ٱللَّهِ وَلَهُمۡ عَذَابٌ عَظِيمٞ","End":"١٠٦"},{"SurahNumber":16,"VerseNumber":107,"Text":"ذَٰلِكَ بِأَنَّهُمُ ٱسۡتَحَبُّواْ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا عَلَى ٱلۡأٓخِرَةِ وَأَنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡكَٰفِرِينَ","End":"١٠٧"},{"SurahNumber":16,"VerseNumber":108,"Text":"أُوْلَـٰٓئِكَ ٱلَّذِينَ طَبَعَ ٱللَّهُ عَلَىٰ قُلُوبِهِمۡ وَسَمۡعِهِمۡ وَأَبۡصَٰرِهِمۡۖ وَأُوْلَـٰٓئِكَ هُمُ ٱلۡغَٰفِلُونَ","End":"١٠٨"},{"SurahNumber":16,"VerseNumber":109,"Text":"لَا جَرَمَ أَنَّهُمۡ فِي ٱلۡأٓخِرَةِ هُمُ ٱلۡخَٰسِرُونَ","End":"١٠٩"},{"SurahNumber":16,"VerseNumber":110,"Text":"ثُمَّ إِنَّ رَبَّكَ لِلَّذِينَ هَاجَرُواْ مِنۢ بَعۡدِ مَا فُتِنُواْ ثُمَّ جَٰهَدُواْ وَصَبَرُوٓاْ إِنَّ رَبَّكَ مِنۢ بَعۡدِهَا لَغَفُورٞ رَّحِيمٞ","End":"١١٠"},{"SurahNumber":16,"VerseNumber":111,"Text":"۞يَوۡمَ تَأۡتِي كُلُّ نَفۡسٖ تُجَٰدِلُ عَن نَّفۡسِهَا وَتُوَفَّىٰ كُلُّ نَفۡسٖ مَّا عَمِلَتۡ وَهُمۡ لَا يُظۡلَمُونَ","End":"١١١"},{"SurahNumber":16,"VerseNumber":112,"Text":"وَضَرَبَ ٱللَّهُ مَثَلٗا قَرۡيَةٗ كَانَتۡ ءَامِنَةٗ مُّطۡمَئِنَّةٗ يَأۡتِيهَا رِزۡقُهَا رَغَدٗا مِّن كُلِّ مَكَانٖ فَكَفَرَتۡ بِأَنۡعُمِ ٱللَّهِ فَأَذَٰقَهَا ٱللَّهُ لِبَاسَ ٱلۡجُوعِ وَٱلۡخَوۡفِ بِمَا كَانُواْ يَصۡنَعُونَ","End":"١١٢"},{"SurahNumber":16,"VerseNumber":113,"Text":"وَلَقَدۡ جَآءَهُمۡ رَسُولٞ مِّنۡهُمۡ فَكَذَّبُوهُ فَأَخَذَهُمُ ٱلۡعَذَابُ وَهُمۡ ظَٰلِمُونَ","End":"١١٣"},{"SurahNumber":16,"VerseNumber":114,"Text":"فَكُلُواْ مِمَّا رَزَقَكُمُ ٱللَّهُ حَلَٰلٗا طَيِّبٗا وَٱشۡكُرُواْ نِعۡمَتَ ٱللَّهِ إِن كُنتُمۡ إِيَّاهُ تَعۡبُدُونَ","End":"١١٤"},{"SurahNumber":16,"VerseNumber":115,"Text":"إِنَّمَا حَرَّمَ عَلَيۡكُمُ ٱلۡمَيۡتَةَ وَٱلدَّمَ وَلَحۡمَ ٱلۡخِنزِيرِ وَمَآ أُهِلَّ لِغَيۡرِ ٱللَّهِ بِهِۦۖ فَمَنِ ٱضۡطُرَّ غَيۡرَ بَاغٖ وَلَا عَادٖ فَإِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","End":"١١٥"},{"SurahNumber":16,"VerseNumber":116,"Text":"وَلَا تَقُولُواْ لِمَا تَصِفُ أَلۡسِنَتُكُمُ ٱلۡكَذِبَ هَٰذَا حَلَٰلٞ وَهَٰذَا حَرَامٞ لِّتَفۡتَرُواْ عَلَى ٱللَّهِ ٱلۡكَذِبَۚ إِنَّ ٱلَّذِينَ يَفۡتَرُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَ لَا يُفۡلِحُونَ","End":"١١٦"},{"SurahNumber":16,"VerseNumber":117,"Text":"مَتَٰعٞ قَلِيلٞ وَلَهُمۡ عَذَابٌ أَلِيمٞ","End":"١١٧"},{"SurahNumber":16,"VerseNumber":118,"Text":"وَعَلَى ٱلَّذِينَ هَادُواْ حَرَّمۡنَا مَا قَصَصۡنَا عَلَيۡكَ مِن قَبۡلُۖ وَمَا ظَلَمۡنَٰهُمۡ وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ","End":"١١٨"},{"SurahNumber":16,"VerseNumber":119,"Text":"ثُمَّ إِنَّ رَبَّكَ لِلَّذِينَ عَمِلُواْ ٱلسُّوٓءَ بِجَهَٰلَةٖ ثُمَّ تَابُواْ مِنۢ بَعۡدِ ذَٰلِكَ وَأَصۡلَحُوٓاْ إِنَّ رَبَّكَ مِنۢ بَعۡدِهَا لَغَفُورٞ رَّحِيمٌ","End":"١١٩"},{"SurahNumber":16,"VerseNumber":120,"Text":"إِنَّ إِبۡرَٰهِيمَ كَانَ أُمَّةٗ قَانِتٗا لِّلَّهِ حَنِيفٗا وَلَمۡ يَكُ مِنَ ٱلۡمُشۡرِكِينَ","End":"١٢٠"},{"SurahNumber":16,"VerseNumber":121,"Text":"شَاكِرٗا لِّأَنۡعُمِهِۚ ٱجۡتَبَىٰهُ وَهَدَىٰهُ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ","End":"١٢١"},{"SurahNumber":16,"VerseNumber":122,"Text":"وَءَاتَيۡنَٰهُ فِي ٱلدُّنۡيَا حَسَنَةٗۖ وَإِنَّهُۥ فِي ٱلۡأٓخِرَةِ لَمِنَ ٱلصَّـٰلِحِينَ","End":"١٢٢"},{"SurahNumber":16,"VerseNumber":123,"Text":"ثُمَّ أَوۡحَيۡنَآ إِلَيۡكَ أَنِ ٱتَّبِعۡ مِلَّةَ إِبۡرَٰهِيمَ حَنِيفٗاۖ وَمَا كَانَ مِنَ ٱلۡمُشۡرِكِينَ","End":"١٢٣"},{"SurahNumber":16,"VerseNumber":124,"Text":"إِنَّمَا جُعِلَ ٱلسَّبۡتُ عَلَى ٱلَّذِينَ ٱخۡتَلَفُواْ فِيهِۚ وَإِنَّ رَبَّكَ لَيَحۡكُمُ بَيۡنَهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ فِيمَا كَانُواْ فِيهِ يَخۡتَلِفُونَ","End":"١٢٤"},{"SurahNumber":16,"VerseNumber":125,"Text":"ٱدۡعُ إِلَىٰ سَبِيلِ رَبِّكَ بِٱلۡحِكۡمَةِ وَٱلۡمَوۡعِظَةِ ٱلۡحَسَنَةِۖ وَجَٰدِلۡهُم بِٱلَّتِي هِيَ أَحۡسَنُۚ إِنَّ رَبَّكَ هُوَ أَعۡلَمُ بِمَن ضَلَّ عَن سَبِيلِهِۦ وَهُوَ أَعۡلَمُ بِٱلۡمُهۡتَدِينَ","End":"١٢٥"},{"SurahNumber":16,"VerseNumber":126,"Text":"وَإِنۡ عَاقَبۡتُمۡ فَعَاقِبُواْ بِمِثۡلِ مَا عُوقِبۡتُم بِهِۦۖ وَلَئِن صَبَرۡتُمۡ لَهُوَ خَيۡرٞ لِّلصَّـٰبِرِينَ","End":"١٢٦"},{"SurahNumber":16,"VerseNumber":127,"Text":"وَٱصۡبِرۡ وَمَا صَبۡرُكَ إِلَّا بِٱللَّهِۚ وَلَا تَحۡزَنۡ عَلَيۡهِمۡ وَلَا تَكُ فِي ضَيۡقٖ مِّمَّا يَمۡكُرُونَ","End":"١٢٧"},{"SurahNumber":16,"VerseNumber":128,"Text":"إِنَّ ٱللَّهَ مَعَ ٱلَّذِينَ ٱتَّقَواْ وَّٱلَّذِينَ هُم مُّحۡسِنُونَ","End":"١٢٨"}],"Translations":[{"LanguageCode":"ara","Language":"Arabic","Name":"ara-quran-la","Author":"Quran Transliteration","Source":"http://tanzil.net","Direction":"ltr","Translations":[{"SurahNumber":16,"VerseNumber":1,"Text":"Ata amru Allahi fala tastaAAjiloohu subhanahu wataAAala AAamma yushrikoona"},{"SurahNumber":16,"VerseNumber":2,"Text":"Yunazzilu almalaikata bialrroohi min amrihi AAala man yashao min AAibadihi an anthiroo annahu la ilaha illa ana faittaqooni"},{"SurahNumber":16,"VerseNumber":3,"Text":"Khalaqa alssamawati waalarda bialhaqqi taAAala AAamma yushrikoona"},{"SurahNumber":16,"VerseNumber":4,"Text":"Khalaqa alinsana min nutfatin faitha huwa khaseemun mubeenun"},{"SurahNumber":16,"VerseNumber":5,"Text":"WaalanAAama khalaqaha lakum feeha difon wamanafiAAu waminha takuloona"},{"SurahNumber":16,"VerseNumber":6,"Text":"Walakum feeha jamalun heena tureehoona waheena tasrahoona"},{"SurahNumber":16,"VerseNumber":7,"Text":"Watahmilu athqalakum ila baladin lam takoonoo baligheehi illa bishiqqi alanfusi inna rabbakum laraoofun raheemun"},{"SurahNumber":16,"VerseNumber":8,"Text":"Waalkhayla waalbighala waalhameera litarkabooha wazeenatan wayakhluqu ma la taAAlamoona"},{"SurahNumber":16,"VerseNumber":9,"Text":"WaAAala Allahi qasdu alssabeeli waminha jairun walaw shaa lahadakum ajmaAAeena"},{"SurahNumber":16,"VerseNumber":10,"Text":"Huwa allathee anzala mina alssamai maan lakum minhu sharabun waminhu shajarun feehi tuseemoona"},{"SurahNumber":16,"VerseNumber":11,"Text":"Yunbitu lakum bihi alzzarAAa waalzzaytoona waalnnakheela waalaAAnaba wamin kulli alththamarati inna fee thalika laayatan liqawmin yatafakkaroona"},{"SurahNumber":16,"VerseNumber":12,"Text":"Wasakhkhara lakumu allayla waalnnahara waalshshamsa waalqamara waalnnujoomu musakhkharatun biamrihi inna fee thalika laayatin liqawmin yaAAqiloona"},{"SurahNumber":16,"VerseNumber":13,"Text":"Wama tharaa lakum fee alardi mukhtalifan alwanuhu inna fee thalika laayatan liqawmin yaththakkaroona"},{"SurahNumber":16,"VerseNumber":14,"Text":"Wahuwa allathee sakhkhara albahra litakuloo minhu lahman tariyyan watastakhrijoo minhu hilyatan talbasoonaha watara alfulka mawakhira feehi walitabtaghoo min fadlihi walaAAallakum tashkuroona"},{"SurahNumber":16,"VerseNumber":15,"Text":"Waalqa fee alardi rawasiya an tameeda bikum waanharan wasubulan laAAallakum tahtadoona"},{"SurahNumber":16,"VerseNumber":16,"Text":"WaAAalamatin wabialnnajmi hum yahtadoona"},{"SurahNumber":16,"VerseNumber":17,"Text":"Afaman yakhluqu kaman la yakhluqu afala tathakkaroona"},{"SurahNumber":16,"VerseNumber":18,"Text":"Wain taAAuddoo niAAmata Allahi la tuhsooha inna Allaha laghafoorun raheemun"},{"SurahNumber":16,"VerseNumber":19,"Text":"WaAllahu yaAAlamu ma tusirroona wama tuAAlinoona"},{"SurahNumber":16,"VerseNumber":20,"Text":"Waallatheena yadAAoona min dooni Allahi la yakhluqoona shayan wahum yukhlaqoona"},{"SurahNumber":16,"VerseNumber":21,"Text":"Amwatun ghayru ahyain wama yashAAuroona ayyana yubAAathoona"},{"SurahNumber":16,"VerseNumber":22,"Text":"Ilahukum ilahun wahidun faallatheena la yuminoona bialakhirati quloobuhum munkiratun wahum mustakbiroona"},{"SurahNumber":16,"VerseNumber":23,"Text":"La jarama anna Allaha yaAAlamu ma yusirroona wama yuAAlinoona innahu la yuhibbu almustakbireena"},{"SurahNumber":16,"VerseNumber":24,"Text":"Waitha qeela lahum matha anzala rabbukum qaloo asateeru alawwaleena"},{"SurahNumber":16,"VerseNumber":25,"Text":"Liyahmiloo awzarahum kamilatan yawma alqiyamati wamin awzari allatheena yudilloonahum bighayri AAilmin ala saa ma yaziroona"},{"SurahNumber":16,"VerseNumber":26,"Text":"Qad makara allatheena min qablihim faata Allahu bunyanahum mina alqawaAAidi fakharra AAalayhimu alssaqfu min fawqihim waatahumu alAAathabu min haythu la yashAAuroona"},{"SurahNumber":16,"VerseNumber":27,"Text":"Thumma yawma alqiyamati yukhzeehim wayaqoolu ayna shurakaiya allatheena kuntum tushaqqoona feehim qala allatheena ootoo alAAilma inna alkhizya alyawma waalssooa AAala alkafireena"},{"SurahNumber":16,"VerseNumber":28,"Text":"Allatheena tatawaffahumu almalaikatu thalimee anfusihim faalqawoo alssalama ma kunna naAAmalu min sooin bala inna Allaha AAaleemun bima kuntum taAAmaloona"},{"SurahNumber":16,"VerseNumber":29,"Text":"Faodkhuloo abwaba jahannama khalideena feeha falabisa mathwa almutakabbireena"},{"SurahNumber":16,"VerseNumber":30,"Text":"Waqeela lillatheena ittaqaw matha anzala rabbukum qaloo khayran lillatheena ahsanoo fee hathihi alddunya hasanatun waladaru alakhirati khayrun walaniAAma daru almuttaqeena"},{"SurahNumber":16,"VerseNumber":31,"Text":"Jannatu AAadnin yadkhuloonaha tajree min tahtiha alanharu lahum feeha ma yashaoona kathalika yajzee Allahu almuttaqeena"},{"SurahNumber":16,"VerseNumber":32,"Text":"Allatheena tatawaffahumu almalaikatu tayyibeena yaqooloona salamun AAalaykumu odkhuloo aljannata bima kuntum taAAmaloona"},{"SurahNumber":16,"VerseNumber":33,"Text":"Hal yanthuroona illa an tatiyahumu almalaikatu aw yatiya amru rabbika kathalika faAAala allatheena min qablihim wama thalamahumu Allahu walakin kanoo anfusahum yathlimoona"},{"SurahNumber":16,"VerseNumber":34,"Text":"Faasabahum sayyiatu ma AAamiloo wahaqa bihim ma kanoo bihi yastahzioona"},{"SurahNumber":16,"VerseNumber":35,"Text":"Waqala allatheena ashrakoo law shaa Allahu ma AAabadna min doonihi min shayin nahnu wala abaona wala harramna min doonihi min shayin kathalika faAAala allatheena min qablihim fahal AAala alrrusuli illa albalaghu almubeenu"},{"SurahNumber":16,"VerseNumber":36,"Text":"Walaqad baAAathna fee kulli ommatin rasoolan ani oAAbudoo Allaha waijtaniboo alttaghoota faminhum man hada Allahu waminhum man haqqat AAalayhi alddalalatu faseeroo fee alardi faonthuroo kayfa kana AAaqibatu almukaththibeena"},{"SurahNumber":16,"VerseNumber":37,"Text":"In tahris AAala hudahum fainna Allaha la yahdee man yudillu wama lahum min nasireena"},{"SurahNumber":16,"VerseNumber":38,"Text":"Waaqsamoo biAllahi jahda aymanihim la yabAAathu Allahu man yamootu bala waAAdan AAalayhi haqqan walakinna akthara alnnasi la yaAAlamoona"},{"SurahNumber":16,"VerseNumber":39,"Text":"Liyubayyina lahumu allathee yakhtalifoona feehi waliyaAAlama allatheena kafaroo annahum kanoo kathibeena"},{"SurahNumber":16,"VerseNumber":40,"Text":"Innama qawluna lishayin itha aradnahu an naqoola lahu kun fayakoonu"},{"SurahNumber":16,"VerseNumber":41,"Text":"Waallatheena hajaroo fee Allahi min baAAdi ma thulimoo lanubawwiannahum fee alddunya hasanatan walaajru alakhirati akbaru law kanoo yaAAlamoona"},{"SurahNumber":16,"VerseNumber":42,"Text":"Allatheena sabaroo waAAala rabbihim yatawakkaloona"},{"SurahNumber":16,"VerseNumber":43,"Text":"Wama arsalna min qablika illa rijalan noohee ilayhim faisaloo ahla alththikri in kuntum la taAAlamoona"},{"SurahNumber":16,"VerseNumber":44,"Text":"Bialbayyinati waalzzuburi waanzalna ilayka alththikra litubayyina lilnnasi ma nuzzila ilayhim walaAAallahum yatafakkaroona"},{"SurahNumber":16,"VerseNumber":45,"Text":"Afaamina allatheena makaroo alssayyiati an yakhsifa Allahu bihimu alarda aw yatiyahumu alAAathabu min haythu la yashAAuroona"},{"SurahNumber":16,"VerseNumber":46,"Text":"Aw yakhuthahum fee taqallubihim fama hum bimuAAjizeena"},{"SurahNumber":16,"VerseNumber":47,"Text":"Aw yakhuthahum AAala takhawwufin fainna rabbakum laraoofun raheemun"},{"SurahNumber":16,"VerseNumber":48,"Text":"Awa lam yaraw ila ma khalaqa Allahu min shayin yatafayyao thilaluhu AAani alyameeni waalshshamaili sujjadan lillahi wahum dakhiroona"},{"SurahNumber":16,"VerseNumber":49,"Text":"Walillahi yasjudu ma fee alssamawati wama fee alardi min dabbatin waalmalaikatu wahum la yastakbiroona"},{"SurahNumber":16,"VerseNumber":50,"Text":"Yakhafoona rabbahum min fawqihim wayafAAaloona ma yumaroona"},{"SurahNumber":16,"VerseNumber":51,"Text":"Waqala Allahu la tattakhithoo ilahayni ithnayni innama huwa ilahun wahidun faiyyaya fairhabooni"},{"SurahNumber":16,"VerseNumber":52,"Text":"Walahu ma fee alssamawati waalardi walahu alddeenu wasiban afaghayra Allahi tattaqoona"},{"SurahNumber":16,"VerseNumber":53,"Text":"Wama bikum min niAAmatin famina Allahi thumma itha massakumu alddurru failayhi tajaroona"},{"SurahNumber":16,"VerseNumber":54,"Text":"Thumma itha kashafa alddurra AAankum itha fareequn minkum birabbihim yushrikoona"},{"SurahNumber":16,"VerseNumber":55,"Text":"Liyakfuroo bima ataynahum fatamattaAAoo fasawfa taAAlamoona"},{"SurahNumber":16,"VerseNumber":56,"Text":"WayajAAaloona lima la yaAAlamoona naseeban mimma razaqnahum taAllahi latusalunna AAamma kuntum taftaroona"},{"SurahNumber":16,"VerseNumber":57,"Text":"WayajAAaloona lillahi albanati subhanahu walahum ma yashtahoona"},{"SurahNumber":16,"VerseNumber":58,"Text":"Waitha bushshira ahaduhum bialontha thalla wajhuhu muswaddan wahuwa katheemun"},{"SurahNumber":16,"VerseNumber":59,"Text":"Yatawara mina alqawmi min sooi ma bushshira bihi ayumsikuhu AAala hoonin am yadussuhu fee altturabi ala saa ma yahkumoona"},{"SurahNumber":16,"VerseNumber":60,"Text":"Lillatheena la yuminoona bialakhirati mathalu alssawi walillahi almathalu alaAAla wahuwa alAAazeezu alhakeemu"},{"SurahNumber":16,"VerseNumber":61,"Text":"Walaw yuakhithu Allahu alnnasa bithulmihim ma taraka AAalayha min dabbatin walakin yuakhkhiruhum ila ajalin musamman faitha jaa ajaluhum la yastakhiroona saAAatan wala yastaqdimoona"},{"SurahNumber":16,"VerseNumber":62,"Text":"WayajAAaloona lillahi ma yakrahoona watasifu alsinatuhumu alkathiba anna lahumu alhusna la jarama anna lahumu alnnara waannahum mufratoona"},{"SurahNumber":16,"VerseNumber":63,"Text":"TaAllahi laqad arsalna ila omamin min qablika fazayyana lahumu alshshaytanu aAAmalahum fahuwa waliyyuhumu alyawma walahum AAathabun aleemun"},{"SurahNumber":16,"VerseNumber":64,"Text":"Wama anzalna AAalayka alkitaba illa litubayyina lahumu allathee ikhtalafoo feehi wahudan warahmatan liqawmin yuminoona"},{"SurahNumber":16,"VerseNumber":65,"Text":"WaAllahu anzala mina alssamai maan faahya bihi alarda baAAda mawtiha inna fee thalika laayatan liqawmin yasmaAAoona"},{"SurahNumber":16,"VerseNumber":66,"Text":"Wainna lakum fee alanAAami laAAibratan nusqeekum mimma fee butoonihi min bayni farthin wadamin labanan khalisan saighan lilshsharibeena"},{"SurahNumber":16,"VerseNumber":67,"Text":"Wamin thamarati alnnakheeli waalaAAnabi tattakhithoona minhu sakaran warizqan hasanan inna fee thalika laayatan liqawmin yaAAqiloona"},{"SurahNumber":16,"VerseNumber":68,"Text":"Waawha rabbuka ila alnnahli ani ittakhithee mina aljibali buyootan wamina alshshajari wamimma yaAArishoona"},{"SurahNumber":16,"VerseNumber":69,"Text":"Thumma kulee min kulli alththamarati faoslukee subula rabbiki thululan yakhruju min butooniha sharabun mukhtalifun alwanuhu feehi shifaon lilnnasi inna fee thalika laayatan liqawmin yatafakkaroona"},{"SurahNumber":16,"VerseNumber":70,"Text":"WaAllahu khalaqakum thumma yatawaffakum waminkum man yuraddu ila arthali alAAumuri likay la yaAAlama baAAda AAilmin shayan inna Allaha AAaleemun qadeerun"},{"SurahNumber":16,"VerseNumber":71,"Text":"WaAllahu faddala baAAdakum AAala baAAdin fee alrrizqi fama allatheena fuddiloo biraddee rizqihim AAala ma malakat aymanuhum fahum feehi sawaon afabiniAAmati Allahi yajhadoona"},{"SurahNumber":16,"VerseNumber":72,"Text":"WaAllahu jaAAala lakum min anfusikum azwajan wajaAAala lakum min azwajikum baneena wahafadatan warazaqakum mina alttayyibati afabialbatili yuminoona wabiniAAmati Allahi hum yakfuroona"},{"SurahNumber":16,"VerseNumber":73,"Text":"WayaAAbudoona min dooni Allahi ma la yamliku lahum rizqan mina alssamawati waalardi shayan wala yastateeAAoona"},{"SurahNumber":16,"VerseNumber":74,"Text":"Fala tadriboo lillahi alamthala inna Allaha yaAAlamu waantum la taAAlamoona"},{"SurahNumber":16,"VerseNumber":75,"Text":"Daraba Allahu mathalan AAabdan mamlookan la yaqdiru AAala shayin waman razaqnahu minna rizqan hasanan fahuwa yunfiqu minhu sirran wajahran hal yastawoona alhamdu lillahi bal aktharuhum la yaAAlamoona"},{"SurahNumber":16,"VerseNumber":76,"Text":"Wadaraba Allahu mathalan rajulayni ahaduhuma abkamu la yaqdiru AAala shayin wahuwa kallun AAala mawlahu aynama yuwajjihhu la yati bikhayrin hal yastawee huwa waman yamuru bialAAadli wahuwa AAala siratin mustaqeemin"},{"SurahNumber":16,"VerseNumber":77,"Text":"Walillahi ghaybu alssamawati waalardi wama amru alssaAAati illa kalamhi albasari aw huwa aqrabu inna Allaha AAala kulli shayin qadeerun"},{"SurahNumber":16,"VerseNumber":78,"Text":"WaAllahu akhrajakum min butooni ommahatikum la taAAlamoona shayan wajaAAala lakumu alssamAAa waalabsara waalafidata laAAallakum tashkuroona"},{"SurahNumber":16,"VerseNumber":79,"Text":"Alam yaraw ila alttayri musakhkharatin fee jawwi alssamai ma yumsikuhunna illa Allahu inna fee thalika laayatin liqawmin yuminoona"},{"SurahNumber":16,"VerseNumber":80,"Text":"WaAllahu jaAAala lakum min buyootikum sakanan wajaAAala lakum min juloodi alanAAami buyootan tastakhiffoonaha yawma thaAAnikum wayawma iqamatikum wamin aswafiha waawbariha waashAAariha athathan wamataAAan ila heenin"},{"SurahNumber":16,"VerseNumber":81,"Text":"WaAllahu jaAAala lakum mimma khalaqa thilalan wajaAAala lakum mina aljibali aknanan wajaAAala lakum sarabeela taqeekumu alharra wasarabeela taqeekum basakum kathalika yutimmu niAAmatahu AAalaykum laAAallakum tuslimoona"},{"SurahNumber":16,"VerseNumber":82,"Text":"Fain tawallaw fainnama AAalayka albalaghu almubeenu"},{"SurahNumber":16,"VerseNumber":83,"Text":"YaAArifoona niAAmata Allahi thumma yunkiroonaha waaktharuhumu alkafiroona"},{"SurahNumber":16,"VerseNumber":84,"Text":"Wayawma nabAAathu min kulli ommatin shaheedan thumma la yuthanu lillatheena kafaroo wala hum yustaAAtaboona"},{"SurahNumber":16,"VerseNumber":85,"Text":"Waitha raa allatheena thalamoo alAAathaba fala yukhaffafu AAanhum wala hum yuntharoona"},{"SurahNumber":16,"VerseNumber":86,"Text":"Waitha raa allatheena ashrakoo shurakaahum qaloo rabbana haolai shurakaona allatheena kunna nadAAoo min doonika faalqaw ilayhimu alqawla innakum lakathiboona"},{"SurahNumber":16,"VerseNumber":87,"Text":"Waalqaw ila Allahi yawmaithin alssalama wadalla AAanhum ma kanoo yaftaroona"},{"SurahNumber":16,"VerseNumber":88,"Text":"Allatheena kafaroo wasaddoo AAan sabeeli Allahi zidnahum AAathaban fawqa alAAathabi bima kanoo yufsidoona"},{"SurahNumber":16,"VerseNumber":89,"Text":"Wayawma nabAAathu fee kulli ommatin shaheedan AAalayhim min anfusihim wajina bika shaheedan AAala haolai wanazzalna AAalayka alkitaba tibyanan likulli shayin wahudan warahmatan wabushra lilmuslimeena"},{"SurahNumber":16,"VerseNumber":90,"Text":"Inna Allaha yamuru bialAAadli waalihsani waeetai thee alqurba wayanha AAani alfahshai waalmunkari waalbaghyi yaAAithukum laAAallakum tathakkaroona"},{"SurahNumber":16,"VerseNumber":91,"Text":"Waawfoo biAAahdi Allahi itha AAahadtum wala tanqudoo alaymana baAAda tawkeediha waqad jaAAaltumu Allaha AAalaykum kafeelan inna Allaha yaAAlamu ma tafAAaloona"},{"SurahNumber":16,"VerseNumber":92,"Text":"Wala takoonoo kaallatee naqadat ghazlaha min baAAdi quwwatin ankathan tattakhithoona aymanakum dakhalan baynakum an takoona ommatun hiya arba min ommatin innama yablookumu Allahu bihi walayubayyinanna lakum yawma alqiyamati ma kuntum feehi takhtalifoona"},{"SurahNumber":16,"VerseNumber":93,"Text":"Walaw shaa Allahu lajaAAalakum ommatan wahidatan walakin yudillu man yashao wayahdee man yashao walatusalunna AAamma kuntum taAAmaloona"},{"SurahNumber":16,"VerseNumber":94,"Text":"Wala tattakhithoo aymanakum dakhalan baynakum fatazilla qadamun baAAda thubootiha watathooqoo alssooa bima sadadtum AAan sabeeli Allahi walakum AAathabun AAatheemun"},{"SurahNumber":16,"VerseNumber":95,"Text":"Wala tashtaroo biAAahdi Allahi thamanan qaleelan innama AAinda Allahi huwa khayrun lakum in kuntum taAAlamoona"},{"SurahNumber":16,"VerseNumber":96,"Text":"Ma AAindakum yanfadu wama AAinda Allahi baqin walanajziyanna allatheena sabaroo ajrahum biahsani ma kanoo yaAAmaloona"},{"SurahNumber":16,"VerseNumber":97,"Text":"Man AAamila salihan min thakarin aw ontha wahuwa muminun falanuhyiyannahu hayatan tayyibatan walanajziyannahum ajrahum biahsani ma kanoo yaAAmaloona"},{"SurahNumber":16,"VerseNumber":98,"Text":"Faitha qarata alqurana faistaAAith biAllahi mina alshshaytani alrrajeemi"},{"SurahNumber":16,"VerseNumber":99,"Text":"Innahu laysa lahu sultanun AAala allatheena amanoo waAAala rabbihim yatawakkaloona"},{"SurahNumber":16,"VerseNumber":100,"Text":"Innama sultanuhu AAala allatheena yatawallawnahu waallatheena hum bihi mushrikoona"},{"SurahNumber":16,"VerseNumber":101,"Text":"Waitha baddalna ayatan makana ayatin waAllahu aAAlamu bima yunazzilu qaloo innama anta muftarin bal aktharuhum la yaAAlamoona"},{"SurahNumber":16,"VerseNumber":102,"Text":"Qul nazzalahu roohu alqudusi min rabbika bialhaqqi liyuthabbita allatheena amanoo wahudan wabushra lilmuslimeena"},{"SurahNumber":16,"VerseNumber":103,"Text":"Walaqad naAAlamu annahum yaqooloona innama yuAAallimuhu basharun lisanu allathee yulhidoona ilayhi aAAjamiyyun wahatha lisanun AAarabiyyun mubeenun"},{"SurahNumber":16,"VerseNumber":104,"Text":"Inna allatheena la yuminoona biayati Allahi la yahdeehimu Allahu walahum AAathabun aleemun"},{"SurahNumber":16,"VerseNumber":105,"Text":"Innama yaftaree alkathiba allatheena la yuminoona biayati Allahi waolaika humu alkathiboona"},{"SurahNumber":16,"VerseNumber":106,"Text":"Man kafara biAllahi min baAAdi eemanihi illa man okriha waqalbuhu mutmainnun bialeemani walakin man sharaha bialkufri sadran faAAalayhim ghadabun mina Allahi walahum AAathabun AAatheemun"},{"SurahNumber":16,"VerseNumber":107,"Text":"Thalika biannahumu istahabboo alhayata alddunya AAala alakhirati waanna Allaha la yahdee alqawma alkafireena"},{"SurahNumber":16,"VerseNumber":108,"Text":"Olaika allatheena tabaAAa Allahu AAala quloobihim wasamAAihim waabsarihim waolaika humu alghafiloona"},{"SurahNumber":16,"VerseNumber":109,"Text":"La jarama annahum fee alakhirati humu alkhasiroona"},{"SurahNumber":16,"VerseNumber":110,"Text":"Thumma inna rabbaka lillatheena hajaroo min baAAdi ma futinoo thumma jahadoo wasabaroo inna rabbaka min baAAdiha laghafoorun raheemun"},{"SurahNumber":16,"VerseNumber":111,"Text":"Yawma tatee kullu nafsin tujadilu AAan nafsiha watuwaffa kullu nafsin ma AAamilat wahum la yuthlamoona"},{"SurahNumber":16,"VerseNumber":112,"Text":"Wadaraba Allahu mathalan qaryatan kanat aminatan mutmainnatan yateeha rizquha raghadan min kulli makanin fakafarat bianAAumi Allahi faathaqaha Allahu libasa aljooAAi waalkhawfi bima kanoo yasnaAAoona"},{"SurahNumber":16,"VerseNumber":113,"Text":"Walaqad jaahum rasoolun minhum fakaththaboohu faakhathahumu alAAathabu wahum thalimoona"},{"SurahNumber":16,"VerseNumber":114,"Text":"Fakuloo mimma razaqakumu Allahu halalan tayyiban waoshkuroo niAAmata Allahi in kuntum iyyahu taAAbudoona"},{"SurahNumber":16,"VerseNumber":115,"Text":"Innama harrama AAalaykumu almaytata waalddama walahma alkhinzeeri wama ohilla lighayri Allahi bihi famani idturra ghayra baghin wala AAadin fainna Allaha ghafoorun raheemun"},{"SurahNumber":16,"VerseNumber":116,"Text":"Wala taqooloo lima tasifu alsinatukumu alkathiba hatha halalun wahatha haramun litaftaroo AAala Allahi alkathiba inna allatheena yaftaroona AAala Allahi alkathiba la yuflihoona"},{"SurahNumber":16,"VerseNumber":117,"Text":"MataAAun qaleelun walahum AAathabun aleemun"},{"SurahNumber":16,"VerseNumber":118,"Text":"WaAAala allatheena hadoo harramna ma qasasna AAalayka min qablu wama thalamnahum walakin kanoo anfusahum yathlimoona"},{"SurahNumber":16,"VerseNumber":119,"Text":"Thumma inna rabbaka lillatheena AAamiloo alssooa bijahalatin thumma taboo min baAAdi thalika waaslahoo inna rabbaka min baAAdiha laghafoorun raheemun"},{"SurahNumber":16,"VerseNumber":120,"Text":"Inna ibraheema kana ommatan qanitan lillahi haneefan walam yaku mina almushrikeena"},{"SurahNumber":16,"VerseNumber":121,"Text":"Shakiran lianAAumihi ijtabahu wahadahu ila siratin mustaqeemin"},{"SurahNumber":16,"VerseNumber":122,"Text":"Waataynahu fee alddunya hasanatan wainnahu fee alakhirati lamina alssaliheena"},{"SurahNumber":16,"VerseNumber":123,"Text":"Thumma awhayna ilayka ani ittabiAA millata ibraheema haneefan wama kana mina almushrikeena"},{"SurahNumber":16,"VerseNumber":124,"Text":"Innama juAAila alssabtu AAala allatheena ikhtalafoo feehi wainna rabbaka layahkumu baynahum yawma alqiyamati feema kanoo feehi yakhtalifoona"},{"SurahNumber":16,"VerseNumber":125,"Text":"OdAAu ila sabeeli rabbika bialhikmati waalmawAAithati alhasanati wajadilhum biallatee hiya ahsanu inna rabbaka huwa aAAlamu biman dalla AAan sabeelihi wahuwa aAAlamu bialmuhtadeena"},{"SurahNumber":16,"VerseNumber":126,"Text":"Wain AAaqabtum faAAaqiboo bimithli ma AAooqibtum bihi walain sabartum lahuwa khayrun lilssabireena"},{"SurahNumber":16,"VerseNumber":127,"Text":"Waisbir wama sabruka illa biAllahi wala tahzan AAalayhim wala taku fee dayqin mimma yamkuroona"},{"SurahNumber":16,"VerseNumber":128,"Text":"Inna Allaha maAAa allatheena ittaqaw waallatheena hum muhsinoona"}]},{"LanguageCode":"eng","Language":"English","Name":"eng-mustafakhattabg","Author":"Mustafa Khattab God Edition","Source":"","Direction":"ltr","Translations":[{"SurahNumber":16,"VerseNumber":1,"Text":"The command of God is at hand, so do not hasten it. Glorified and Exalted is He above what they associate ˹with Him in worship˺"},{"SurahNumber":16,"VerseNumber":2,"Text":"He sends down the angels with revelation by His command to whoever He wills of His servants, ˹stating:˺ “Warn ˹humanity˺ that there is no god ˹worthy of worship˺ except Me, so be mindful of Me ˹alone˺.”"},{"SurahNumber":16,"VerseNumber":3,"Text":"He created the heavens and the earth for a purpose. Exalted is He above what they associate with Him ˹in worship˺"},{"SurahNumber":16,"VerseNumber":4,"Text":"He created humans from a sperm-drop, then—behold!—they openly challenge ˹Him˺"},{"SurahNumber":16,"VerseNumber":5,"Text":"And He created the cattle for you as a source of warmth, food, and ˹many other˺ benefits"},{"SurahNumber":16,"VerseNumber":6,"Text":"They are also pleasing to you when you bring them home and when you take them out to graze"},{"SurahNumber":16,"VerseNumber":7,"Text":"And they carry your loads to ˹distant˺ lands which you could not otherwise reach without great hardship. Surely your Lord is Ever Gracious, Most Merciful"},{"SurahNumber":16,"VerseNumber":8,"Text":"˹He also created˺ horses, mules, and donkeys for your transportation and adornment. And He creates what you do not know"},{"SurahNumber":16,"VerseNumber":9,"Text":"It is upon God ˹alone˺ to ˹clearly˺ show the Straight Way. Other ways are deviant. Had He willed, He would have easily imposed guidance upon all of you"},{"SurahNumber":16,"VerseNumber":10,"Text":"He is the One Who sends down rain from the sky, from which you drink and by which plants grow for your cattle to graze"},{"SurahNumber":16,"VerseNumber":11,"Text":"With it He produces for you ˹various˺ crops, olives, palm trees, grapevines, and every type of fruit. Surely in this is a sign for those who reflect"},{"SurahNumber":16,"VerseNumber":12,"Text":"And He has subjected for your benefit the day and the night, the sun and the moon. And the stars have been subjected by His command. Surely in this are signs for those who understand"},{"SurahNumber":16,"VerseNumber":13,"Text":"And ˹He subjected˺ for you whatever He has created on earth of varying colours. Surely in this is a sign for those who are mindful"},{"SurahNumber":16,"VerseNumber":14,"Text":"And He is the One Who has subjected the sea, so from it you may eat tender seafood and extract ornaments to wear. And you see the ships ploughing their way through it, so you may seek His bounty and give thanks ˹to Him˺"},{"SurahNumber":16,"VerseNumber":15,"Text":"He has placed into the earth firm mountains, so it does not shake with you, as well as rivers, and pathways so you may find your way"},{"SurahNumber":16,"VerseNumber":16,"Text":"Also by landmarks and stars do people find their way"},{"SurahNumber":16,"VerseNumber":17,"Text":"Can the One Who creates be equal to those who do not? Will you not then be mindful"},{"SurahNumber":16,"VerseNumber":18,"Text":"If you tried to count God’s blessings, you would never be able to number them. Surely God is All-Forgiving, Most Merciful"},{"SurahNumber":16,"VerseNumber":19,"Text":"And God knows what you conceal and what you reveal"},{"SurahNumber":16,"VerseNumber":20,"Text":"But those ˹idols˺ they invoke besides God cannot create anything—they themselves are created"},{"SurahNumber":16,"VerseNumber":21,"Text":"They are dead, not alive—not even knowing when their followers will be resurrected"},{"SurahNumber":16,"VerseNumber":22,"Text":"Your God is ˹only˺ One God. As for those who do not believe in the Hereafter, their hearts are in denial, and they are too proud"},{"SurahNumber":16,"VerseNumber":23,"Text":"Without a doubt, God knows what they conceal and what they reveal. He certainly does not like those who are too proud"},{"SurahNumber":16,"VerseNumber":24,"Text":"And when it is said to them, “What has your Lord revealed?” They say, “Ancient fables!”"},{"SurahNumber":16,"VerseNumber":25,"Text":"Let them bear their burdens in full on the Day of Judgment as well as some of the burdens of those they mislead without knowledge. Evil indeed is what they will bear"},{"SurahNumber":16,"VerseNumber":26,"Text":"Indeed, those before them had plotted, but God struck at the ˹very˺ foundation of their structure, so the roof collapsed on top of them, and the torment came upon them from where they did not expect"},{"SurahNumber":16,"VerseNumber":27,"Text":"Then on the Day of Judgment He will humiliate them and say, “Where are My ˹so-called˺ associate-gods for whose sake you used to oppose ˹the believers˺?” Those gifted with knowledge will say, “Surely disgrace and misery today are upon the disbelievers.”"},{"SurahNumber":16,"VerseNumber":28,"Text":"Those whose souls the angels seize while they wrong themselves will then offer ˹full˺ submission ˹and say falsely,˺ “We did not do any evil.” ˹The angels will say,˺ “No! Surely God fully knows what you used to do"},{"SurahNumber":16,"VerseNumber":29,"Text":"So enter the gates of Hell, to stay there forever. Indeed, what an evil home for the arrogant!”"},{"SurahNumber":16,"VerseNumber":30,"Text":"And ˹when˺ it is said to those mindful ˹of God˺, “What has your Lord revealed?” They say, “All the best!” For those who do good in this world, there is goodness. But far better is the ˹eternal˺ Home of the Hereafter. How excellent indeed is the home of the righteous"},{"SurahNumber":16,"VerseNumber":31,"Text":"the Gardens of Eternity which they will enter, under which rivers flow. In it they will have whatever they desire. This is how God rewards the righteous—"},{"SurahNumber":16,"VerseNumber":32,"Text":"those whose souls the angels take while they are virtuous, saying ˹to them˺, “Peace be upon you! Enter Paradise for what you used to do.”"},{"SurahNumber":16,"VerseNumber":33,"Text":"Are they only awaiting the coming of the angels or the command of your Lord ˹O Prophet˺? So were those before them. And God never wronged them, but it was they who wronged themselves"},{"SurahNumber":16,"VerseNumber":34,"Text":"Then the evil ˹consequences˺ of their deeds overtook them, and they were overwhelmed by what they used to ridicule"},{"SurahNumber":16,"VerseNumber":35,"Text":"The polytheists argue, “Had God willed, neither we nor our forefathers would have worshipped anything other than Him, nor prohibited anything without His command.” So did those before them. Is not the messengers’ duty only to deliver ˹the message˺ clearly"},{"SurahNumber":16,"VerseNumber":36,"Text":"We surely sent a messenger to every community, saying, “Worship God and shun false gods.” But some of them were guided by God, while others were destined to stray. So travel throughout the land and see the fate of the deniers"},{"SurahNumber":16,"VerseNumber":37,"Text":"Even though you ˹O Prophet˺ are keen on their guidance, God certainly does not guide those He leaves to stray, and they will have no helpers"},{"SurahNumber":16,"VerseNumber":38,"Text":"They swear by God their most solemn oaths that God will never raise the dead to life. Yes ˹He will˺! It is a true promise binding on Him, but most people do not know"},{"SurahNumber":16,"VerseNumber":39,"Text":"˹He will do that˺ to make clear to them what they disagreed on, and for the disbelievers to know that they were liars"},{"SurahNumber":16,"VerseNumber":40,"Text":"If We ever will something ˹to exist˺, all We say is: “Be!” And it is"},{"SurahNumber":16,"VerseNumber":41,"Text":"As for those who emigrated in ˹the cause of˺ God after being persecuted, We will surely bless them with a good home in this world. But the reward of the Hereafter is far better, if only they knew"},{"SurahNumber":16,"VerseNumber":42,"Text":"˹It is˺ they who have patiently endured, and in their Lord they put their trust"},{"SurahNumber":16,"VerseNumber":43,"Text":"We did not send ˹messengers˺ before you ˹O Prophet˺ except mere men inspired by Us. If you ˹polytheists˺ do not know ˹this already˺, then ask those who have knowledge ˹of the Scriptures˺"},{"SurahNumber":16,"VerseNumber":44,"Text":"˹We sent them˺ with clear proofs and divine Books. And We have sent down to you ˹O Prophet˺ the Reminder, so that you may explain to people what has been revealed for them, and perhaps they will reflect"},{"SurahNumber":16,"VerseNumber":45,"Text":"Do those who devise evil plots feel secure that God will not cause the earth to swallow them? Or that the torment will not come upon them in ways they cannot comprehend"},{"SurahNumber":16,"VerseNumber":46,"Text":"Or that He will not seize them while they go about ˹their day˺, for then they will have no escape"},{"SurahNumber":16,"VerseNumber":47,"Text":"Or that He will not destroy them gradually? But your Lord is truly Ever Gracious, Most Merciful"},{"SurahNumber":16,"VerseNumber":48,"Text":"Have they not considered how the shadows of everything God has created incline to the right and the left ˹as the sun moves˺, totally submitting to God in all humility"},{"SurahNumber":16,"VerseNumber":49,"Text":"And to God ˹alone˺ bows down ˹in submission˺ whatever is in the heavens and whatever is on the earth of living creatures, as do the angels—who are not too proud ˹to do so˺"},{"SurahNumber":16,"VerseNumber":50,"Text":"They fear their Lord above them, and do whatever they are commanded"},{"SurahNumber":16,"VerseNumber":51,"Text":"And God has said, “Do not take two gods. There is only One God. So be in awe of Me ˹alone˺.”"},{"SurahNumber":16,"VerseNumber":52,"Text":"To Him belongs whatever is in the heavens and the earth, and to Him ˹alone˺ is the everlasting devotion. Will you then fear any other than God"},{"SurahNumber":16,"VerseNumber":53,"Text":"Whatever blessings you have are from God. Then whenever hardship touches you, to Him ˹alone˺ you cry ˹for help˺"},{"SurahNumber":16,"VerseNumber":54,"Text":"Then as soon as He removes the hardship from you, a group of you associates ˹others˺ with their Lord ˹in worship˺"},{"SurahNumber":16,"VerseNumber":55,"Text":"only returning Our favours with ingratitude. So enjoy yourselves, for you will soon know"},{"SurahNumber":16,"VerseNumber":56,"Text":"And they ˹even˺ assign to those ˹idols˺—who know nothing—a share of what We have provided for them. By God! You will certainly be questioned about whatever ˹lies˺ you used to fabricate ˹against God˺"},{"SurahNumber":16,"VerseNumber":57,"Text":"And they attribute ˹angels as˺ daughters to God—glory be to Him!—the opposite of what they desire for themselves"},{"SurahNumber":16,"VerseNumber":58,"Text":"Whenever one of them is given the good news of a baby girl, his face grows gloomy, as he suppresses his rage"},{"SurahNumber":16,"VerseNumber":59,"Text":"He hides himself from the people because of the bad news he has received. Should he keep her in disgrace, or bury her ˹alive˺ in the ground? Evil indeed is their judgment"},{"SurahNumber":16,"VerseNumber":60,"Text":"To those who disbelieve in the Hereafter belong all evil qualities, whereas to God belong the finest attributes. And He is the Almighty, All-Wise"},{"SurahNumber":16,"VerseNumber":61,"Text":"If God were to punish people ˹immediately˺ for their wrongdoing, He would not have left a single living being on earth. But He delays them for an appointed term. And when their time arrives, they cannot delay it for a moment, nor could they advance it"},{"SurahNumber":16,"VerseNumber":62,"Text":"They attribute to God what they hate ˹for themselves˺, and their tongues utter the lie that they will have the finest reward. Without a doubt, for them is the Fire, where they will be abandoned"},{"SurahNumber":16,"VerseNumber":63,"Text":"By God! We have surely sent messengers to communities before you ˹O Prophet˺, but Satan made their misdeeds appealing to them. So he is their patron today, and they will suffer a painful punishment"},{"SurahNumber":16,"VerseNumber":64,"Text":"We have revealed to you the Book only to clarify for them what they differed about, and as a guide and mercy for those who believe"},{"SurahNumber":16,"VerseNumber":65,"Text":"And God sends down rain from the sky, giving life to the earth after its death. Surely in this is a sign for those who listen"},{"SurahNumber":16,"VerseNumber":66,"Text":"And there is certainly a lesson for you in cattle: We give you to drink of what is in their bellies, from between digested food and blood: pure milk, pleasant to drink"},{"SurahNumber":16,"VerseNumber":67,"Text":"And from the fruits of palm trees and grapevines you derive intoxicants as well as wholesome provision. Surely in this is a sign for those who understand"},{"SurahNumber":16,"VerseNumber":68,"Text":"And your Lord inspired the bees: “Make ˹your˺ homes in the mountains, the trees, and in what people construct"},{"SurahNumber":16,"VerseNumber":69,"Text":"and feed from ˹the flower of˺ any fruit ˹you please˺ and follow the ways your Lord has made easy for you.” From their bellies comes forth liquid of varying colours, in which there is healing for people. Surely in this is a sign for those who reflect"},{"SurahNumber":16,"VerseNumber":70,"Text":"God has created you, and then causes you to die. And some of you are left to reach the most feeble stage of life so that they may know nothing after having known much. Indeed, God is All-Knowing, Most Capable"},{"SurahNumber":16,"VerseNumber":71,"Text":"And God has favoured some of you over others in provision. But those who have been much favoured would not share their wealth with those ˹bondspeople˺ in their possession, making them their equals. Do they then deny God’s favours"},{"SurahNumber":16,"VerseNumber":72,"Text":"And God has made for you spouses of your own kind, and given you through your spouses children and grandchildren. And He has granted you good, lawful provisions. Are they then faithful to falsehood and ungrateful for God’s favours"},{"SurahNumber":16,"VerseNumber":73,"Text":"Yet they worship besides God those ˹idols˺ who do not afford them any provision from the heavens and the earth, nor do they have the power to"},{"SurahNumber":16,"VerseNumber":74,"Text":"So do not set up equals to God, for God certainly knows and you do not know"},{"SurahNumber":16,"VerseNumber":75,"Text":"God sets forth a parable: a slave who lacks all means, compared to a ˹free˺ man to whom We granted a good provision, of which he donates ˹freely,˺ openly and secretly. Are they equal? Praise be to God. In fact, most of them do not know"},{"SurahNumber":16,"VerseNumber":76,"Text":"And God sets forth a parable of two men: one of them is dumb, incapable of anything. He is a burden on his master. Wherever he is sent, he brings no good. Can such a person be equal to the one who commands justice and is on the Straight Path"},{"SurahNumber":16,"VerseNumber":77,"Text":"To God ˹alone˺ belongs ˹the knowledge of˺ the unseen in the heavens and the earth. Bringing about the Hour would only take the blink of an eye, or even less. Surely God is Most Capable of everything"},{"SurahNumber":16,"VerseNumber":78,"Text":"And God brought you out of the wombs of your mothers while you knew nothing, and gave you hearing, sight, and intellect so perhaps you would be thankful"},{"SurahNumber":16,"VerseNumber":79,"Text":"Have they not seen the birds glide in the open sky? None holds them up except God. Surely in this are signs for those who believe"},{"SurahNumber":16,"VerseNumber":80,"Text":"And God has made your homes a place to rest, and has given you tents from the hide of animals, light to handle when you travel and when you camp. And out of their wool, fur, and hair He has given you furnishings and goods for a while"},{"SurahNumber":16,"VerseNumber":81,"Text":"And God has provided you shade out of what He created, and has given you shelter in the mountains. He has also provided you with clothes protecting you from the heat ˹and cold˺, and armour shielding you in battle. This is how He perfects His favour upon you, so perhaps you will ˹fully˺ submit ˹to Him˺"},{"SurahNumber":16,"VerseNumber":82,"Text":"But if they turn away, then your duty ˹O Prophet˺ is only to deliver ˹the message˺ clearly"},{"SurahNumber":16,"VerseNumber":83,"Text":"They are aware of God’s favours, but still deny them. And most of them are ˹truly˺ ungrateful"},{"SurahNumber":16,"VerseNumber":84,"Text":"˹Consider, O Prophet,˺ the Day We will call ˹a prophet as˺ a witness from every faith-community. Then the disbelievers will neither be allowed to plead nor appease ˹their Lord˺"},{"SurahNumber":16,"VerseNumber":85,"Text":"And when the wrongdoers face the punishment, it will not be lightened for them, nor will they be delayed ˹from it˺"},{"SurahNumber":16,"VerseNumber":86,"Text":"And when the polytheists see their associate-gods, they will say, “Our Lord! These are our associate-gods that we used to invoke besides You.” Their gods will throw a rebuttal at them, ˹saying,˺ “You are definitely liars.”"},{"SurahNumber":16,"VerseNumber":87,"Text":"They will offer ˹full˺ submission to God on that Day, and whatever ˹gods˺ they fabricated will fail them"},{"SurahNumber":16,"VerseNumber":88,"Text":"For those who disbelieve and hinder ˹others˺ from the Way of God, We will add more punishment to their punishment for all the corruption they spread"},{"SurahNumber":16,"VerseNumber":89,"Text":"˹Consider, O Prophet,˺ the Day We will call against every faith-community a witness of their own. And We will call you to be a witness against these ˹people of yours˺. We have revealed to you the Book as an explanation of all things, a guide, a mercy, and good news for those who ˹fully˺ submit"},{"SurahNumber":16,"VerseNumber":90,"Text":"Indeed, God commands justice, grace, as well as courtesy to close relatives. He forbids indecency, wickedness, and aggression. He instructs you so perhaps you will be mindful"},{"SurahNumber":16,"VerseNumber":91,"Text":"Honour God’s covenant when you make a pledge, and do not break your oaths after confirming them, having made God your guarantor. Surely God knows all you do"},{"SurahNumber":16,"VerseNumber":92,"Text":"Do not be like the woman who ˹foolishly˺ unravels her yarn after it is firmly spun, by taking your oaths as a means of deceiving one another in favour of a stronger group. Surely God tests you through this. And on the Day of Judgment He will certainly make your differences clear to you"},{"SurahNumber":16,"VerseNumber":93,"Text":"Had God willed, He could have easily made you one community ˹of believers˺, but He leaves to stray whoever He wills and guides whoever He wills. And you will certainly be questioned about what you used to do"},{"SurahNumber":16,"VerseNumber":94,"Text":"And do not take your oaths as a means of deceiving one another or your feet will slip after they have been firm. Then you will taste the evil ˹consequences˺ of hindering ˹others˺ from the Way of God, and you will suffer a tremendous punishment"},{"SurahNumber":16,"VerseNumber":95,"Text":"And do not trade God’s covenant for a fleeting gain. What is with God is certainly far better for you, if only you knew"},{"SurahNumber":16,"VerseNumber":96,"Text":"Whatever you have will end, but whatever God has is everlasting. And We will certainly reward the steadfast according to the best of their deeds"},{"SurahNumber":16,"VerseNumber":97,"Text":"Whoever does good, whether male or female, and is a believer, We will surely bless them with a good life, and We will certainly reward them according to the best of their deeds"},{"SurahNumber":16,"VerseNumber":98,"Text":"When you recite the Quran, seek refuge with God from Satan, the accursed"},{"SurahNumber":16,"VerseNumber":99,"Text":"He certainly has no authority over those who believe and put their trust in their Lord"},{"SurahNumber":16,"VerseNumber":100,"Text":"His authority is only over those who take him as a patron and who—under his influence—associate ˹others˺ with God ˹in worship˺"},{"SurahNumber":16,"VerseNumber":101,"Text":"When We replace a verse with another—and God knows best what He reveals—they say, “You ˹Muḥammad˺ are just a fabricator.” In fact, most of them do not know"},{"SurahNumber":16,"VerseNumber":102,"Text":"Say, “The holy spirit has brought it down from your Lord with the truth to reassure the believers, and as a guide and good news for those who submit ˹to God˺.”"},{"SurahNumber":16,"VerseNumber":103,"Text":"And We surely know that they say, “No one is teaching him except a human.” But the man they refer to speaks a foreign tongue, whereas this ˹Quran˺ is ˹in˺ eloquent Arabic"},{"SurahNumber":16,"VerseNumber":104,"Text":"Surely those who do not believe in God’s revelations will never be guided by God, and they will suffer a painful punishment"},{"SurahNumber":16,"VerseNumber":105,"Text":"No one fabricates lies except those who disbelieve in God’s revelations, and it is they who are the ˹true˺ liars"},{"SurahNumber":16,"VerseNumber":106,"Text":"Whoever disbelieves in God after their belief—not those who are forced while their hearts are firm in faith, but those who embrace disbelief wholeheartedly—they will be condemned by God and suffer a tremendous punishment"},{"SurahNumber":16,"VerseNumber":107,"Text":"This is because they prefer the life of this world over the Hereafter. Surely God never guides those who ˹choose to˺ disbelieve"},{"SurahNumber":16,"VerseNumber":108,"Text":"They are the ones whose hearts, ears, and eyes are sealed by God, and it is they who are ˹truly˺ heedless"},{"SurahNumber":16,"VerseNumber":109,"Text":"Without a doubt, they will be the losers in the Hereafter"},{"SurahNumber":16,"VerseNumber":110,"Text":"As for those who emigrated after being compelled ˹to renounce Islam˺, then struggled ˹in God’s cause˺, and persevered, your Lord ˹O Prophet˺ is truly All-Forgiving, Most Merciful after all"},{"SurahNumber":16,"VerseNumber":111,"Text":"˹Consider˺ the Day ˹when˺ every soul will come pleading for itself, and each will be paid in full for what it did, and none will be wronged"},{"SurahNumber":16,"VerseNumber":112,"Text":"And God sets forth the example of a society which was safe and at ease, receiving its provision in abundance from all directions. But its people met God’s favours with ingratitude, so God made them taste the clutches of hunger and fear for their misdeeds"},{"SurahNumber":16,"VerseNumber":113,"Text":"A messenger of their own actually did come to them, but they denied him. So the torment overtook them while they persisted in wrongdoing"},{"SurahNumber":16,"VerseNumber":114,"Text":"So eat from the good, lawful things which God has provided for you, and be grateful for God’s favours, if you ˹truly˺ worship Him ˹alone˺"},{"SurahNumber":16,"VerseNumber":115,"Text":"He has only forbidden you ˹to eat˺ carrion, blood, swine, and what is slaughtered in the name of any other than God. But if someone is compelled by necessity—neither driven by desire nor exceeding immediate need—then surely God is All-Forgiving, Most Merciful"},{"SurahNumber":16,"VerseNumber":116,"Text":"Do not falsely declare with your tongues, “This is lawful, and that is unlawful,” ˹only˺ fabricating lies against God. Indeed, those who fabricate lies against God will never succeed"},{"SurahNumber":16,"VerseNumber":117,"Text":"˹It is only˺ a brief enjoyment, then they will suffer a painful punishment"},{"SurahNumber":16,"VerseNumber":118,"Text":"To the Jews, We have forbidden what We related to you before. We did not wrong them, but it was they who wronged themselves"},{"SurahNumber":16,"VerseNumber":119,"Text":"As for those who commit evil ignorantly ˹or recklessly˺, then repent afterwards and mend their ways, then your Lord is surely All-Forgiving, Most Merciful"},{"SurahNumber":16,"VerseNumber":120,"Text":"Indeed, Abraham was a model of excellence: devoted to God, ˹perfectly˺ upright—not a polytheist—"},{"SurahNumber":16,"VerseNumber":121,"Text":"˹utterly˺ grateful for God’s favours. ˹So˺ He chose him and guided him to the Straight Path"},{"SurahNumber":16,"VerseNumber":122,"Text":"We blessed him with all goodness in this world, and in the Hereafter he will certainly be among the righteous"},{"SurahNumber":16,"VerseNumber":123,"Text":"Then We revealed to you ˹O Prophet, saying˺: “Follow the faith of Abraham, the upright, who was not one of the polytheists.”"},{"SurahNumber":16,"VerseNumber":124,"Text":"˹Honouring˺ the Sabbath was ordained only for those who disputed about Abraham. And surely your Lord will judge between them on the Day of Judgment regarding their disputes"},{"SurahNumber":16,"VerseNumber":125,"Text":"Invite ˹all˺ to the Way of your Lord with wisdom and kind advice, and only debate with them in the best manner. Surely your Lord ˹alone˺ knows best who has strayed from His Way and who is ˹rightly˺ guided"},{"SurahNumber":16,"VerseNumber":126,"Text":"If you retaliate, then let it be equivalent to what you have suffered. But if you patiently endure, it is certainly best for those who are patient"},{"SurahNumber":16,"VerseNumber":127,"Text":"Be patient ˹O Prophet˺, for your patience is only with God’s help. Do not grieve over those ˹who disbelieve˺, nor be distressed by their schemes"},{"SurahNumber":16,"VerseNumber":128,"Text":"Surely God is with those who shun evil and who do good ˹deeds˺"}]}]}