{"SurahNumber":17,"HasBismillah":true,"Verses":[{"SurahNumber":17,"VerseNumber":1,"Text":"سُبۡحَٰنَ ٱلَّذِيٓ أَسۡرَىٰ بِعَبۡدِهِۦ لَيۡلٗا مِّنَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ إِلَى ٱلۡمَسۡجِدِ ٱلۡأَقۡصَا ٱلَّذِي بَٰرَكۡنَا حَوۡلَهُۥ لِنُرِيَهُۥ مِنۡ ءَايَٰتِنَآۚ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلۡبَصِيرُ","End":"١"},{"SurahNumber":17,"VerseNumber":2,"Text":"وَءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ وَجَعَلۡنَٰهُ هُدٗى لِّبَنِيٓ إِسۡرَـٰٓءِيلَ أَلَّا تَتَّخِذُواْ مِن دُونِي وَكِيلٗا","End":"٢"},{"SurahNumber":17,"VerseNumber":3,"Text":"ذُرِّيَّةَ مَنۡ حَمَلۡنَا مَعَ نُوحٍۚ إِنَّهُۥ كَانَ عَبۡدٗا شَكُورٗا","End":"٣"},{"SurahNumber":17,"VerseNumber":4,"Text":"وَقَضَيۡنَآ إِلَىٰ بَنِيٓ إِسۡرَـٰٓءِيلَ فِي ٱلۡكِتَٰبِ لَتُفۡسِدُنَّ فِي ٱلۡأَرۡضِ مَرَّتَيۡنِ وَلَتَعۡلُنَّ عُلُوّٗا كَبِيرٗا","End":"٤"},{"SurahNumber":17,"VerseNumber":5,"Text":"فَإِذَا جَآءَ وَعۡدُ أُولَىٰهُمَا بَعَثۡنَا عَلَيۡكُمۡ عِبَادٗا لَّنَآ أُوْلِي بَأۡسٖ شَدِيدٖ فَجَاسُواْ خِلَٰلَ ٱلدِّيَارِۚ وَكَانَ وَعۡدٗا مَّفۡعُولٗا","End":"٥"},{"SurahNumber":17,"VerseNumber":6,"Text":"ثُمَّ رَدَدۡنَا لَكُمُ ٱلۡكَرَّةَ عَلَيۡهِمۡ وَأَمۡدَدۡنَٰكُم بِأَمۡوَٰلٖ وَبَنِينَ وَجَعَلۡنَٰكُمۡ أَكۡثَرَ نَفِيرًا","End":"٦"},{"SurahNumber":17,"VerseNumber":7,"Text":"إِنۡ أَحۡسَنتُمۡ أَحۡسَنتُمۡ لِأَنفُسِكُمۡۖ وَإِنۡ أَسَأۡتُمۡ فَلَهَاۚ فَإِذَا جَآءَ وَعۡدُ ٱلۡأٓخِرَةِ لِيَسُـُٔواْ وُجُوهَكُمۡ وَلِيَدۡخُلُواْ ٱلۡمَسۡجِدَ كَمَا دَخَلُوهُ أَوَّلَ مَرَّةٖ وَلِيُتَبِّرُواْ مَا عَلَوۡاْ تَتۡبِيرًا","End":"٧"},{"SurahNumber":17,"VerseNumber":8,"Text":"عَسَىٰ رَبُّكُمۡ أَن يَرۡحَمَكُمۡۚ وَإِنۡ عُدتُّمۡ عُدۡنَاۚ وَجَعَلۡنَا جَهَنَّمَ لِلۡكَٰفِرِينَ حَصِيرًا","End":"٨"},{"SurahNumber":17,"VerseNumber":9,"Text":"إِنَّ هَٰذَا ٱلۡقُرۡءَانَ يَهۡدِي لِلَّتِي هِيَ أَقۡوَمُ وَيُبَشِّرُ ٱلۡمُؤۡمِنِينَ ٱلَّذِينَ يَعۡمَلُونَ ٱلصَّـٰلِحَٰتِ أَنَّ لَهُمۡ أَجۡرٗا كَبِيرٗا","End":"٩"},{"SurahNumber":17,"VerseNumber":10,"Text":"وَأَنَّ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ أَعۡتَدۡنَا لَهُمۡ عَذَابًا أَلِيمٗا","End":"١٠"},{"SurahNumber":17,"VerseNumber":11,"Text":"وَيَدۡعُ ٱلۡإِنسَٰنُ بِٱلشَّرِّ دُعَآءَهُۥ بِٱلۡخَيۡرِۖ وَكَانَ ٱلۡإِنسَٰنُ عَجُولٗا","End":"١١"},{"SurahNumber":17,"VerseNumber":12,"Text":"وَجَعَلۡنَا ٱلَّيۡلَ وَٱلنَّهَارَ ءَايَتَيۡنِۖ فَمَحَوۡنَآ ءَايَةَ ٱلَّيۡلِ وَجَعَلۡنَآ ءَايَةَ ٱلنَّهَارِ مُبۡصِرَةٗ لِّتَبۡتَغُواْ فَضۡلٗا مِّن رَّبِّكُمۡ وَلِتَعۡلَمُواْ عَدَدَ ٱلسِّنِينَ وَٱلۡحِسَابَۚ وَكُلَّ شَيۡءٖ فَصَّلۡنَٰهُ تَفۡصِيلٗا","End":"١٢"},{"SurahNumber":17,"VerseNumber":13,"Text":"وَكُلَّ إِنسَٰنٍ أَلۡزَمۡنَٰهُ طَـٰٓئِرَهُۥ فِي عُنُقِهِۦۖ وَنُخۡرِجُ لَهُۥ يَوۡمَ ٱلۡقِيَٰمَةِ كِتَٰبٗا يَلۡقَىٰهُ مَنشُورًا","End":"١٣"},{"SurahNumber":17,"VerseNumber":14,"Text":"ٱقۡرَأۡ كِتَٰبَكَ كَفَىٰ بِنَفۡسِكَ ٱلۡيَوۡمَ عَلَيۡكَ حَسِيبٗا","End":"١٤"},{"SurahNumber":17,"VerseNumber":15,"Text":"مَّنِ ٱهۡتَدَىٰ فَإِنَّمَا يَهۡتَدِي لِنَفۡسِهِۦۖ وَمَن ضَلَّ فَإِنَّمَا يَضِلُّ عَلَيۡهَاۚ وَلَا تَزِرُ وَازِرَةٞ وِزۡرَ أُخۡرَىٰۗ وَمَا كُنَّا مُعَذِّبِينَ حَتَّىٰ نَبۡعَثَ رَسُولٗا","End":"١٥"},{"SurahNumber":17,"VerseNumber":16,"Text":"وَإِذَآ أَرَدۡنَآ أَن نُّهۡلِكَ قَرۡيَةً أَمَرۡنَا مُتۡرَفِيهَا فَفَسَقُواْ فِيهَا فَحَقَّ عَلَيۡهَا ٱلۡقَوۡلُ فَدَمَّرۡنَٰهَا تَدۡمِيرٗا","End":"١٦"},{"SurahNumber":17,"VerseNumber":17,"Text":"وَكَمۡ أَهۡلَكۡنَا مِنَ ٱلۡقُرُونِ مِنۢ بَعۡدِ نُوحٖۗ وَكَفَىٰ بِرَبِّكَ بِذُنُوبِ عِبَادِهِۦ خَبِيرَۢا بَصِيرٗا","End":"١٧"},{"SurahNumber":17,"VerseNumber":18,"Text":"مَّن كَانَ يُرِيدُ ٱلۡعَاجِلَةَ عَجَّلۡنَا لَهُۥ فِيهَا مَا نَشَآءُ لِمَن نُّرِيدُ ثُمَّ جَعَلۡنَا لَهُۥ جَهَنَّمَ يَصۡلَىٰهَا مَذۡمُومٗا مَّدۡحُورٗا","End":"١٨"},{"SurahNumber":17,"VerseNumber":19,"Text":"وَمَنۡ أَرَادَ ٱلۡأٓخِرَةَ وَسَعَىٰ لَهَا سَعۡيَهَا وَهُوَ مُؤۡمِنٞ فَأُوْلَـٰٓئِكَ كَانَ سَعۡيُهُم مَّشۡكُورٗا","End":"١٩"},{"SurahNumber":17,"VerseNumber":20,"Text":"كُلّٗا نُّمِدُّ هَـٰٓؤُلَآءِ وَهَـٰٓؤُلَآءِ مِنۡ عَطَآءِ رَبِّكَۚ وَمَا كَانَ عَطَآءُ رَبِّكَ مَحۡظُورًا","End":"٢٠"},{"SurahNumber":17,"VerseNumber":21,"Text":"ٱنظُرۡ كَيۡفَ فَضَّلۡنَا بَعۡضَهُمۡ عَلَىٰ بَعۡضٖۚ وَلَلۡأٓخِرَةُ أَكۡبَرُ دَرَجَٰتٖ وَأَكۡبَرُ تَفۡضِيلٗا","End":"٢١"},{"SurahNumber":17,"VerseNumber":22,"Text":"لَّا تَجۡعَلۡ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ فَتَقۡعُدَ مَذۡمُومٗا مَّخۡذُولٗا","End":"٢٢"},{"SurahNumber":17,"VerseNumber":23,"Text":"۞وَقَضَىٰ رَبُّكَ أَلَّا تَعۡبُدُوٓاْ إِلَّآ إِيَّاهُ وَبِٱلۡوَٰلِدَيۡنِ إِحۡسَٰنًاۚ إِمَّا يَبۡلُغَنَّ عِندَكَ ٱلۡكِبَرَ أَحَدُهُمَآ أَوۡ كِلَاهُمَا فَلَا تَقُل لَّهُمَآ أُفّٖ وَلَا تَنۡهَرۡهُمَا وَقُل لَّهُمَا قَوۡلٗا كَرِيمٗا","End":"٢٣"},{"SurahNumber":17,"VerseNumber":24,"Text":"وَٱخۡفِضۡ لَهُمَا جَنَاحَ ٱلذُّلِّ مِنَ ٱلرَّحۡمَةِ وَقُل رَّبِّ ٱرۡحَمۡهُمَا كَمَا رَبَّيَانِي صَغِيرٗا","End":"٢٤"},{"SurahNumber":17,"VerseNumber":25,"Text":"رَّبُّكُمۡ أَعۡلَمُ بِمَا فِي نُفُوسِكُمۡۚ إِن تَكُونُواْ صَٰلِحِينَ فَإِنَّهُۥ كَانَ لِلۡأَوَّـٰبِينَ غَفُورٗا","End":"٢٥"},{"SurahNumber":17,"VerseNumber":26,"Text":"وَءَاتِ ذَا ٱلۡقُرۡبَىٰ حَقَّهُۥ وَٱلۡمِسۡكِينَ وَٱبۡنَ ٱلسَّبِيلِ وَلَا تُبَذِّرۡ تَبۡذِيرًا","End":"٢٦"},{"SurahNumber":17,"VerseNumber":27,"Text":"إِنَّ ٱلۡمُبَذِّرِينَ كَانُوٓاْ إِخۡوَٰنَ ٱلشَّيَٰطِينِۖ وَكَانَ ٱلشَّيۡطَٰنُ لِرَبِّهِۦ كَفُورٗا","End":"٢٧"},{"SurahNumber":17,"VerseNumber":28,"Text":"وَإِمَّا تُعۡرِضَنَّ عَنۡهُمُ ٱبۡتِغَآءَ رَحۡمَةٖ مِّن رَّبِّكَ تَرۡجُوهَا فَقُل لَّهُمۡ قَوۡلٗا مَّيۡسُورٗا","End":"٢٨"},{"SurahNumber":17,"VerseNumber":29,"Text":"وَلَا تَجۡعَلۡ يَدَكَ مَغۡلُولَةً إِلَىٰ عُنُقِكَ وَلَا تَبۡسُطۡهَا كُلَّ ٱلۡبَسۡطِ فَتَقۡعُدَ مَلُومٗا مَّحۡسُورًا","End":"٢٩"},{"SurahNumber":17,"VerseNumber":30,"Text":"إِنَّ رَبَّكَ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ وَيَقۡدِرُۚ إِنَّهُۥ كَانَ بِعِبَادِهِۦ خَبِيرَۢا بَصِيرٗا","End":"٣٠"},{"SurahNumber":17,"VerseNumber":31,"Text":"وَلَا تَقۡتُلُوٓاْ أَوۡلَٰدَكُمۡ خَشۡيَةَ إِمۡلَٰقٖۖ نَّحۡنُ نَرۡزُقُهُمۡ وَإِيَّاكُمۡۚ إِنَّ قَتۡلَهُمۡ كَانَ خِطۡـٔٗا كَبِيرٗا","End":"٣١"},{"SurahNumber":17,"VerseNumber":32,"Text":"وَلَا تَقۡرَبُواْ ٱلزِّنَىٰٓۖ إِنَّهُۥ كَانَ فَٰحِشَةٗ وَسَآءَ سَبِيلٗا","End":"٣٢"},{"SurahNumber":17,"VerseNumber":33,"Text":"وَلَا تَقۡتُلُواْ ٱلنَّفۡسَ ٱلَّتِي حَرَّمَ ٱللَّهُ إِلَّا بِٱلۡحَقِّۗ وَمَن قُتِلَ مَظۡلُومٗا فَقَدۡ جَعَلۡنَا لِوَلِيِّهِۦ سُلۡطَٰنٗا فَلَا يُسۡرِف فِّي ٱلۡقَتۡلِۖ إِنَّهُۥ كَانَ مَنصُورٗا","End":"٣٣"},{"SurahNumber":17,"VerseNumber":34,"Text":"وَلَا تَقۡرَبُواْ مَالَ ٱلۡيَتِيمِ إِلَّا بِٱلَّتِي هِيَ أَحۡسَنُ حَتَّىٰ يَبۡلُغَ أَشُدَّهُۥۚ وَأَوۡفُواْ بِٱلۡعَهۡدِۖ إِنَّ ٱلۡعَهۡدَ كَانَ مَسۡـُٔولٗا","End":"٣٤"},{"SurahNumber":17,"VerseNumber":35,"Text":"وَأَوۡفُواْ ٱلۡكَيۡلَ إِذَا كِلۡتُمۡ وَزِنُواْ بِٱلۡقِسۡطَاسِ ٱلۡمُسۡتَقِيمِۚ ذَٰلِكَ خَيۡرٞ وَأَحۡسَنُ تَأۡوِيلٗا","End":"٣٥"},{"SurahNumber":17,"VerseNumber":36,"Text":"وَلَا تَقۡفُ مَا لَيۡسَ لَكَ بِهِۦ عِلۡمٌۚ إِنَّ ٱلسَّمۡعَ وَٱلۡبَصَرَ وَٱلۡفُؤَادَ كُلُّ أُوْلَـٰٓئِكَ كَانَ عَنۡهُ مَسۡـُٔولٗا","End":"٣٦"},{"SurahNumber":17,"VerseNumber":37,"Text":"وَلَا تَمۡشِ فِي ٱلۡأَرۡضِ مَرَحًاۖ إِنَّكَ لَن تَخۡرِقَ ٱلۡأَرۡضَ وَلَن تَبۡلُغَ ٱلۡجِبَالَ طُولٗا","End":"٣٧"},{"SurahNumber":17,"VerseNumber":38,"Text":"كُلُّ ذَٰلِكَ كَانَ سَيِّئُهُۥ عِندَ رَبِّكَ مَكۡرُوهٗا","End":"٣٨"},{"SurahNumber":17,"VerseNumber":39,"Text":"ذَٰلِكَ مِمَّآ أَوۡحَىٰٓ إِلَيۡكَ رَبُّكَ مِنَ ٱلۡحِكۡمَةِۗ وَلَا تَجۡعَلۡ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ فَتُلۡقَىٰ فِي جَهَنَّمَ مَلُومٗا مَّدۡحُورًا","End":"٣٩"},{"SurahNumber":17,"VerseNumber":40,"Text":"أَفَأَصۡفَىٰكُمۡ رَبُّكُم بِٱلۡبَنِينَ وَٱتَّخَذَ مِنَ ٱلۡمَلَـٰٓئِكَةِ إِنَٰثًاۚ إِنَّكُمۡ لَتَقُولُونَ قَوۡلًا عَظِيمٗا","End":"٤٠"},{"SurahNumber":17,"VerseNumber":41,"Text":"وَلَقَدۡ صَرَّفۡنَا فِي هَٰذَا ٱلۡقُرۡءَانِ لِيَذَّكَّرُواْ وَمَا يَزِيدُهُمۡ إِلَّا نُفُورٗا","End":"٤١"},{"SurahNumber":17,"VerseNumber":42,"Text":"قُل لَّوۡ كَانَ مَعَهُۥٓ ءَالِهَةٞ كَمَا يَقُولُونَ إِذٗا لَّٱبۡتَغَوۡاْ إِلَىٰ ذِي ٱلۡعَرۡشِ سَبِيلٗا","End":"٤٢"},{"SurahNumber":17,"VerseNumber":43,"Text":"سُبۡحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يَقُولُونَ عُلُوّٗا كَبِيرٗا","End":"٤٣"},{"SurahNumber":17,"VerseNumber":44,"Text":"تُسَبِّحُ لَهُ ٱلسَّمَٰوَٰتُ ٱلسَّبۡعُ وَٱلۡأَرۡضُ وَمَن فِيهِنَّۚ وَإِن مِّن شَيۡءٍ إِلَّا يُسَبِّحُ بِحَمۡدِهِۦ وَلَٰكِن لَّا تَفۡقَهُونَ تَسۡبِيحَهُمۡۚ إِنَّهُۥ كَانَ حَلِيمًا غَفُورٗا","End":"٤٤"},{"SurahNumber":17,"VerseNumber":45,"Text":"وَإِذَا قَرَأۡتَ ٱلۡقُرۡءَانَ جَعَلۡنَا بَيۡنَكَ وَبَيۡنَ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ حِجَابٗا مَّسۡتُورٗا","End":"٤٥"},{"SurahNumber":17,"VerseNumber":46,"Text":"وَجَعَلۡنَا عَلَىٰ قُلُوبِهِمۡ أَكِنَّةً أَن يَفۡقَهُوهُ وَفِيٓ ءَاذَانِهِمۡ وَقۡرٗاۚ وَإِذَا ذَكَرۡتَ رَبَّكَ فِي ٱلۡقُرۡءَانِ وَحۡدَهُۥ وَلَّوۡاْ عَلَىٰٓ أَدۡبَٰرِهِمۡ نُفُورٗا","End":"٤٦"},{"SurahNumber":17,"VerseNumber":47,"Text":"نَّحۡنُ أَعۡلَمُ بِمَا يَسۡتَمِعُونَ بِهِۦٓ إِذۡ يَسۡتَمِعُونَ إِلَيۡكَ وَإِذۡ هُمۡ نَجۡوَىٰٓ إِذۡ يَقُولُ ٱلظَّـٰلِمُونَ إِن تَتَّبِعُونَ إِلَّا رَجُلٗا مَّسۡحُورًا","End":"٤٧"},{"SurahNumber":17,"VerseNumber":48,"Text":"ٱنظُرۡ كَيۡفَ ضَرَبُواْ لَكَ ٱلۡأَمۡثَالَ فَضَلُّواْ فَلَا يَسۡتَطِيعُونَ سَبِيلٗا","End":"٤٨"},{"SurahNumber":17,"VerseNumber":49,"Text":"وَقَالُوٓاْ أَءِذَا كُنَّا عِظَٰمٗا وَرُفَٰتًا أَءِنَّا لَمَبۡعُوثُونَ خَلۡقٗا جَدِيدٗا","End":"٤٩"},{"SurahNumber":17,"VerseNumber":50,"Text":"۞قُلۡ كُونُواْ حِجَارَةً أَوۡ حَدِيدًا","End":"٥٠"},{"SurahNumber":17,"VerseNumber":51,"Text":"أَوۡ خَلۡقٗا مِّمَّا يَكۡبُرُ فِي صُدُورِكُمۡۚ فَسَيَقُولُونَ مَن يُعِيدُنَاۖ قُلِ ٱلَّذِي فَطَرَكُمۡ أَوَّلَ مَرَّةٖۚ فَسَيُنۡغِضُونَ إِلَيۡكَ رُءُوسَهُمۡ وَيَقُولُونَ مَتَىٰ هُوَۖ قُلۡ عَسَىٰٓ أَن يَكُونَ قَرِيبٗا","End":"٥١"},{"SurahNumber":17,"VerseNumber":52,"Text":"يَوۡمَ يَدۡعُوكُمۡ فَتَسۡتَجِيبُونَ بِحَمۡدِهِۦ وَتَظُنُّونَ إِن لَّبِثۡتُمۡ إِلَّا قَلِيلٗا","End":"٥٢"},{"SurahNumber":17,"VerseNumber":53,"Text":"وَقُل لِّعِبَادِي يَقُولُواْ ٱلَّتِي هِيَ أَحۡسَنُۚ إِنَّ ٱلشَّيۡطَٰنَ يَنزَغُ بَيۡنَهُمۡۚ إِنَّ ٱلشَّيۡطَٰنَ كَانَ لِلۡإِنسَٰنِ عَدُوّٗا مُّبِينٗا","End":"٥٣"},{"SurahNumber":17,"VerseNumber":54,"Text":"رَّبُّكُمۡ أَعۡلَمُ بِكُمۡۖ إِن يَشَأۡ يَرۡحَمۡكُمۡ أَوۡ إِن يَشَأۡ يُعَذِّبۡكُمۡۚ وَمَآ أَرۡسَلۡنَٰكَ عَلَيۡهِمۡ وَكِيلٗا","End":"٥٤"},{"SurahNumber":17,"VerseNumber":55,"Text":"وَرَبُّكَ أَعۡلَمُ بِمَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۗ وَلَقَدۡ فَضَّلۡنَا بَعۡضَ ٱلنَّبِيِّـۧنَ عَلَىٰ بَعۡضٖۖ وَءَاتَيۡنَا دَاوُۥدَ زَبُورٗا","End":"٥٥"},{"SurahNumber":17,"VerseNumber":56,"Text":"قُلِ ٱدۡعُواْ ٱلَّذِينَ زَعَمۡتُم مِّن دُونِهِۦ فَلَا يَمۡلِكُونَ كَشۡفَ ٱلضُّرِّ عَنكُمۡ وَلَا تَحۡوِيلًا","End":"٥٦"},{"SurahNumber":17,"VerseNumber":57,"Text":"أُوْلَـٰٓئِكَ ٱلَّذِينَ يَدۡعُونَ يَبۡتَغُونَ إِلَىٰ رَبِّهِمُ ٱلۡوَسِيلَةَ أَيُّهُمۡ أَقۡرَبُ وَيَرۡجُونَ رَحۡمَتَهُۥ وَيَخَافُونَ عَذَابَهُۥٓۚ إِنَّ عَذَابَ رَبِّكَ كَانَ مَحۡذُورٗا","End":"٥٧"},{"SurahNumber":17,"VerseNumber":58,"Text":"وَإِن مِّن قَرۡيَةٍ إِلَّا نَحۡنُ مُهۡلِكُوهَا قَبۡلَ يَوۡمِ ٱلۡقِيَٰمَةِ أَوۡ مُعَذِّبُوهَا عَذَابٗا شَدِيدٗاۚ كَانَ ذَٰلِكَ فِي ٱلۡكِتَٰبِ مَسۡطُورٗا","End":"٥٨"},{"SurahNumber":17,"VerseNumber":59,"Text":"وَمَا مَنَعَنَآ أَن نُّرۡسِلَ بِٱلۡأٓيَٰتِ إِلَّآ أَن كَذَّبَ بِهَا ٱلۡأَوَّلُونَۚ وَءَاتَيۡنَا ثَمُودَ ٱلنَّاقَةَ مُبۡصِرَةٗ فَظَلَمُواْ بِهَاۚ وَمَا نُرۡسِلُ بِٱلۡأٓيَٰتِ إِلَّا تَخۡوِيفٗا","End":"٥٩"},{"SurahNumber":17,"VerseNumber":60,"Text":"وَإِذۡ قُلۡنَا لَكَ إِنَّ رَبَّكَ أَحَاطَ بِٱلنَّاسِۚ وَمَا جَعَلۡنَا ٱلرُّءۡيَا ٱلَّتِيٓ أَرَيۡنَٰكَ إِلَّا فِتۡنَةٗ لِّلنَّاسِ وَٱلشَّجَرَةَ ٱلۡمَلۡعُونَةَ فِي ٱلۡقُرۡءَانِۚ وَنُخَوِّفُهُمۡ فَمَا يَزِيدُهُمۡ إِلَّا طُغۡيَٰنٗا كَبِيرٗا","End":"٦٠"},{"SurahNumber":17,"VerseNumber":61,"Text":"وَإِذۡ قُلۡنَا لِلۡمَلَـٰٓئِكَةِ ٱسۡجُدُواْ لِأٓدَمَ فَسَجَدُوٓاْ إِلَّآ إِبۡلِيسَ قَالَ ءَأَسۡجُدُ لِمَنۡ خَلَقۡتَ طِينٗا","End":"٦١"},{"SurahNumber":17,"VerseNumber":62,"Text":"قَالَ أَرَءَيۡتَكَ هَٰذَا ٱلَّذِي كَرَّمۡتَ عَلَيَّ لَئِنۡ أَخَّرۡتَنِ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِ لَأَحۡتَنِكَنَّ ذُرِّيَّتَهُۥٓ إِلَّا قَلِيلٗا","End":"٦٢"},{"SurahNumber":17,"VerseNumber":63,"Text":"قَالَ ٱذۡهَبۡ فَمَن تَبِعَكَ مِنۡهُمۡ فَإِنَّ جَهَنَّمَ جَزَآؤُكُمۡ جَزَآءٗ مَّوۡفُورٗا","End":"٦٣"},{"SurahNumber":17,"VerseNumber":64,"Text":"وَٱسۡتَفۡزِزۡ مَنِ ٱسۡتَطَعۡتَ مِنۡهُم بِصَوۡتِكَ وَأَجۡلِبۡ عَلَيۡهِم بِخَيۡلِكَ وَرَجِلِكَ وَشَارِكۡهُمۡ فِي ٱلۡأَمۡوَٰلِ وَٱلۡأَوۡلَٰدِ وَعِدۡهُمۡۚ وَمَا يَعِدُهُمُ ٱلشَّيۡطَٰنُ إِلَّا غُرُورًا","End":"٦٤"},{"SurahNumber":17,"VerseNumber":65,"Text":"إِنَّ عِبَادِي لَيۡسَ لَكَ عَلَيۡهِمۡ سُلۡطَٰنٞۚ وَكَفَىٰ بِرَبِّكَ وَكِيلٗا","End":"٦٥"},{"SurahNumber":17,"VerseNumber":66,"Text":"رَّبُّكُمُ ٱلَّذِي يُزۡجِي لَكُمُ ٱلۡفُلۡكَ فِي ٱلۡبَحۡرِ لِتَبۡتَغُواْ مِن فَضۡلِهِۦٓۚ إِنَّهُۥ كَانَ بِكُمۡ رَحِيمٗا","End":"٦٦"},{"SurahNumber":17,"VerseNumber":67,"Text":"وَإِذَا مَسَّكُمُ ٱلضُّرُّ فِي ٱلۡبَحۡرِ ضَلَّ مَن تَدۡعُونَ إِلَّآ إِيَّاهُۖ فَلَمَّا نَجَّىٰكُمۡ إِلَى ٱلۡبَرِّ أَعۡرَضۡتُمۡۚ وَكَانَ ٱلۡإِنسَٰنُ كَفُورًا","End":"٦٧"},{"SurahNumber":17,"VerseNumber":68,"Text":"أَفَأَمِنتُمۡ أَن يَخۡسِفَ بِكُمۡ جَانِبَ ٱلۡبَرِّ أَوۡ يُرۡسِلَ عَلَيۡكُمۡ حَاصِبٗا ثُمَّ لَا تَجِدُواْ لَكُمۡ وَكِيلًا","End":"٦٨"},{"SurahNumber":17,"VerseNumber":69,"Text":"أَمۡ أَمِنتُمۡ أَن يُعِيدَكُمۡ فِيهِ تَارَةً أُخۡرَىٰ فَيُرۡسِلَ عَلَيۡكُمۡ قَاصِفٗا مِّنَ ٱلرِّيحِ فَيُغۡرِقَكُم بِمَا كَفَرۡتُمۡ ثُمَّ لَا تَجِدُواْ لَكُمۡ عَلَيۡنَا بِهِۦ تَبِيعٗا","End":"٦٩"},{"SurahNumber":17,"VerseNumber":70,"Text":"۞وَلَقَدۡ كَرَّمۡنَا بَنِيٓ ءَادَمَ وَحَمَلۡنَٰهُمۡ فِي ٱلۡبَرِّ وَٱلۡبَحۡرِ وَرَزَقۡنَٰهُم مِّنَ ٱلطَّيِّبَٰتِ وَفَضَّلۡنَٰهُمۡ عَلَىٰ كَثِيرٖ مِّمَّنۡ خَلَقۡنَا تَفۡضِيلٗا","End":"٧٠"},{"SurahNumber":17,"VerseNumber":71,"Text":"يَوۡمَ نَدۡعُواْ كُلَّ أُنَاسِۭ بِإِمَٰمِهِمۡۖ فَمَنۡ أُوتِيَ كِتَٰبَهُۥ بِيَمِينِهِۦ فَأُوْلَـٰٓئِكَ يَقۡرَءُونَ كِتَٰبَهُمۡ وَلَا يُظۡلَمُونَ فَتِيلٗا","End":"٧١"},{"SurahNumber":17,"VerseNumber":72,"Text":"وَمَن كَانَ فِي هَٰذِهِۦٓ أَعۡمَىٰ فَهُوَ فِي ٱلۡأٓخِرَةِ أَعۡمَىٰ وَأَضَلُّ سَبِيلٗا","End":"٧٢"},{"SurahNumber":17,"VerseNumber":73,"Text":"وَإِن كَادُواْ لَيَفۡتِنُونَكَ عَنِ ٱلَّذِيٓ أَوۡحَيۡنَآ إِلَيۡكَ لِتَفۡتَرِيَ عَلَيۡنَا غَيۡرَهُۥۖ وَإِذٗا لَّٱتَّخَذُوكَ خَلِيلٗا","End":"٧٣"},{"SurahNumber":17,"VerseNumber":74,"Text":"وَلَوۡلَآ أَن ثَبَّتۡنَٰكَ لَقَدۡ كِدتَّ تَرۡكَنُ إِلَيۡهِمۡ شَيۡـٔٗا قَلِيلًا","End":"٧٤"},{"SurahNumber":17,"VerseNumber":75,"Text":"إِذٗا لَّأَذَقۡنَٰكَ ضِعۡفَ ٱلۡحَيَوٰةِ وَضِعۡفَ ٱلۡمَمَاتِ ثُمَّ لَا تَجِدُ لَكَ عَلَيۡنَا نَصِيرٗا","End":"٧٥"},{"SurahNumber":17,"VerseNumber":76,"Text":"وَإِن كَادُواْ لَيَسۡتَفِزُّونَكَ مِنَ ٱلۡأَرۡضِ لِيُخۡرِجُوكَ مِنۡهَاۖ وَإِذٗا لَّا يَلۡبَثُونَ خِلَٰفَكَ إِلَّا قَلِيلٗا","End":"٧٦"},{"SurahNumber":17,"VerseNumber":77,"Text":"سُنَّةَ مَن قَدۡ أَرۡسَلۡنَا قَبۡلَكَ مِن رُّسُلِنَاۖ وَلَا تَجِدُ لِسُنَّتِنَا تَحۡوِيلًا","End":"٧٧"},{"SurahNumber":17,"VerseNumber":78,"Text":"أَقِمِ ٱلصَّلَوٰةَ لِدُلُوكِ ٱلشَّمۡسِ إِلَىٰ غَسَقِ ٱلَّيۡلِ وَقُرۡءَانَ ٱلۡفَجۡرِۖ إِنَّ قُرۡءَانَ ٱلۡفَجۡرِ كَانَ مَشۡهُودٗا","End":"٧٨"},{"SurahNumber":17,"VerseNumber":79,"Text":"وَمِنَ ٱلَّيۡلِ فَتَهَجَّدۡ بِهِۦ نَافِلَةٗ لَّكَ عَسَىٰٓ أَن يَبۡعَثَكَ رَبُّكَ مَقَامٗا مَّحۡمُودٗا","End":"٧٩"},{"SurahNumber":17,"VerseNumber":80,"Text":"وَقُل رَّبِّ أَدۡخِلۡنِي مُدۡخَلَ صِدۡقٖ وَأَخۡرِجۡنِي مُخۡرَجَ صِدۡقٖ وَٱجۡعَل لِّي مِن لَّدُنكَ سُلۡطَٰنٗا نَّصِيرٗا","End":"٨٠"},{"SurahNumber":17,"VerseNumber":81,"Text":"وَقُلۡ جَآءَ ٱلۡحَقُّ وَزَهَقَ ٱلۡبَٰطِلُۚ إِنَّ ٱلۡبَٰطِلَ كَانَ زَهُوقٗا","End":"٨١"},{"SurahNumber":17,"VerseNumber":82,"Text":"وَنُنَزِّلُ مِنَ ٱلۡقُرۡءَانِ مَا هُوَ شِفَآءٞ وَرَحۡمَةٞ لِّلۡمُؤۡمِنِينَ وَلَا يَزِيدُ ٱلظَّـٰلِمِينَ إِلَّا خَسَارٗا","End":"٨٢"},{"SurahNumber":17,"VerseNumber":83,"Text":"وَإِذَآ أَنۡعَمۡنَا عَلَى ٱلۡإِنسَٰنِ أَعۡرَضَ وَنَـَٔا بِجَانِبِهِۦ وَإِذَا مَسَّهُ ٱلشَّرُّ كَانَ يَـُٔوسٗا","End":"٨٣"},{"SurahNumber":17,"VerseNumber":84,"Text":"قُلۡ كُلّٞ يَعۡمَلُ عَلَىٰ شَاكِلَتِهِۦ فَرَبُّكُمۡ أَعۡلَمُ بِمَنۡ هُوَ أَهۡدَىٰ سَبِيلٗا","End":"٨٤"},{"SurahNumber":17,"VerseNumber":85,"Text":"وَيَسۡـَٔلُونَكَ عَنِ ٱلرُّوحِۖ قُلِ ٱلرُّوحُ مِنۡ أَمۡرِ رَبِّي وَمَآ أُوتِيتُم مِّنَ ٱلۡعِلۡمِ إِلَّا قَلِيلٗا","End":"٨٥"},{"SurahNumber":17,"VerseNumber":86,"Text":"وَلَئِن شِئۡنَا لَنَذۡهَبَنَّ بِٱلَّذِيٓ أَوۡحَيۡنَآ إِلَيۡكَ ثُمَّ لَا تَجِدُ لَكَ بِهِۦ عَلَيۡنَا وَكِيلًا","End":"٨٦"},{"SurahNumber":17,"VerseNumber":87,"Text":"إِلَّا رَحۡمَةٗ مِّن رَّبِّكَۚ إِنَّ فَضۡلَهُۥ كَانَ عَلَيۡكَ كَبِيرٗا","End":"٨٧"},{"SurahNumber":17,"VerseNumber":88,"Text":"قُل لَّئِنِ ٱجۡتَمَعَتِ ٱلۡإِنسُ وَٱلۡجِنُّ عَلَىٰٓ أَن يَأۡتُواْ بِمِثۡلِ هَٰذَا ٱلۡقُرۡءَانِ لَا يَأۡتُونَ بِمِثۡلِهِۦ وَلَوۡ كَانَ بَعۡضُهُمۡ لِبَعۡضٖ ظَهِيرٗا","End":"٨٨"},{"SurahNumber":17,"VerseNumber":89,"Text":"وَلَقَدۡ صَرَّفۡنَا لِلنَّاسِ فِي هَٰذَا ٱلۡقُرۡءَانِ مِن كُلِّ مَثَلٖ فَأَبَىٰٓ أَكۡثَرُ ٱلنَّاسِ إِلَّا كُفُورٗا","End":"٨٩"},{"SurahNumber":17,"VerseNumber":90,"Text":"وَقَالُواْ لَن نُّؤۡمِنَ لَكَ حَتَّىٰ تَفۡجُرَ لَنَا مِنَ ٱلۡأَرۡضِ يَنۢبُوعًا","End":"٩٠"},{"SurahNumber":17,"VerseNumber":91,"Text":"أَوۡ تَكُونَ لَكَ جَنَّةٞ مِّن نَّخِيلٖ وَعِنَبٖ فَتُفَجِّرَ ٱلۡأَنۡهَٰرَ خِلَٰلَهَا تَفۡجِيرًا","End":"٩١"},{"SurahNumber":17,"VerseNumber":92,"Text":"أَوۡ تُسۡقِطَ ٱلسَّمَآءَ كَمَا زَعَمۡتَ عَلَيۡنَا كِسَفًا أَوۡ تَأۡتِيَ بِٱللَّهِ وَٱلۡمَلَـٰٓئِكَةِ قَبِيلًا","End":"٩٢"},{"SurahNumber":17,"VerseNumber":93,"Text":"أَوۡ يَكُونَ لَكَ بَيۡتٞ مِّن زُخۡرُفٍ أَوۡ تَرۡقَىٰ فِي ٱلسَّمَآءِ وَلَن نُّؤۡمِنَ لِرُقِيِّكَ حَتَّىٰ تُنَزِّلَ عَلَيۡنَا كِتَٰبٗا نَّقۡرَؤُهُۥۗ قُلۡ سُبۡحَانَ رَبِّي هَلۡ كُنتُ إِلَّا بَشَرٗا رَّسُولٗا","End":"٩٣"},{"SurahNumber":17,"VerseNumber":94,"Text":"وَمَا مَنَعَ ٱلنَّاسَ أَن يُؤۡمِنُوٓاْ إِذۡ جَآءَهُمُ ٱلۡهُدَىٰٓ إِلَّآ أَن قَالُوٓاْ أَبَعَثَ ٱللَّهُ بَشَرٗا رَّسُولٗا","End":"٩٤"},{"SurahNumber":17,"VerseNumber":95,"Text":"قُل لَّوۡ كَانَ فِي ٱلۡأَرۡضِ مَلَـٰٓئِكَةٞ يَمۡشُونَ مُطۡمَئِنِّينَ لَنَزَّلۡنَا عَلَيۡهِم مِّنَ ٱلسَّمَآءِ مَلَكٗا رَّسُولٗا","End":"٩٥"},{"SurahNumber":17,"VerseNumber":96,"Text":"قُلۡ كَفَىٰ بِٱللَّهِ شَهِيدَۢا بَيۡنِي وَبَيۡنَكُمۡۚ إِنَّهُۥ كَانَ بِعِبَادِهِۦ خَبِيرَۢا بَصِيرٗا","End":"٩٦"},{"SurahNumber":17,"VerseNumber":97,"Text":"وَمَن يَهۡدِ ٱللَّهُ فَهُوَ ٱلۡمُهۡتَدِۖ وَمَن يُضۡلِلۡ فَلَن تَجِدَ لَهُمۡ أَوۡلِيَآءَ مِن دُونِهِۦۖ وَنَحۡشُرُهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ عَلَىٰ وُجُوهِهِمۡ عُمۡيٗا وَبُكۡمٗا وَصُمّٗاۖ مَّأۡوَىٰهُمۡ جَهَنَّمُۖ كُلَّمَا خَبَتۡ زِدۡنَٰهُمۡ سَعِيرٗا","End":"٩٧"},{"SurahNumber":17,"VerseNumber":98,"Text":"ذَٰلِكَ جَزَآؤُهُم بِأَنَّهُمۡ كَفَرُواْ بِـَٔايَٰتِنَا وَقَالُوٓاْ أَءِذَا كُنَّا عِظَٰمٗا وَرُفَٰتًا أَءِنَّا لَمَبۡعُوثُونَ خَلۡقٗا جَدِيدًا","End":"٩٨"},{"SurahNumber":17,"VerseNumber":99,"Text":"۞أَوَلَمۡ يَرَوۡاْ أَنَّ ٱللَّهَ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ قَادِرٌ عَلَىٰٓ أَن يَخۡلُقَ مِثۡلَهُمۡ وَجَعَلَ لَهُمۡ أَجَلٗا لَّا رَيۡبَ فِيهِ فَأَبَى ٱلظَّـٰلِمُونَ إِلَّا كُفُورٗا","End":"٩٩"},{"SurahNumber":17,"VerseNumber":100,"Text":"قُل لَّوۡ أَنتُمۡ تَمۡلِكُونَ خَزَآئِنَ رَحۡمَةِ رَبِّيٓ إِذٗا لَّأَمۡسَكۡتُمۡ خَشۡيَةَ ٱلۡإِنفَاقِۚ وَكَانَ ٱلۡإِنسَٰنُ قَتُورٗا","End":"١٠٠"},{"SurahNumber":17,"VerseNumber":101,"Text":"وَلَقَدۡ ءَاتَيۡنَا مُوسَىٰ تِسۡعَ ءَايَٰتِۭ بَيِّنَٰتٖۖ فَسۡـَٔلۡ بَنِيٓ إِسۡرَـٰٓءِيلَ إِذۡ جَآءَهُمۡ فَقَالَ لَهُۥ فِرۡعَوۡنُ إِنِّي لَأَظُنُّكَ يَٰمُوسَىٰ مَسۡحُورٗا","End":"١٠١"},{"SurahNumber":17,"VerseNumber":102,"Text":"قَالَ لَقَدۡ عَلِمۡتَ مَآ أَنزَلَ هَـٰٓؤُلَآءِ إِلَّا رَبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ بَصَآئِرَ وَإِنِّي لَأَظُنُّكَ يَٰفِرۡعَوۡنُ مَثۡبُورٗا","End":"١٠٢"},{"SurahNumber":17,"VerseNumber":103,"Text":"فَأَرَادَ أَن يَسۡتَفِزَّهُم مِّنَ ٱلۡأَرۡضِ فَأَغۡرَقۡنَٰهُ وَمَن مَّعَهُۥ جَمِيعٗا","End":"١٠٣"},{"SurahNumber":17,"VerseNumber":104,"Text":"وَقُلۡنَا مِنۢ بَعۡدِهِۦ لِبَنِيٓ إِسۡرَـٰٓءِيلَ ٱسۡكُنُواْ ٱلۡأَرۡضَ فَإِذَا جَآءَ وَعۡدُ ٱلۡأٓخِرَةِ جِئۡنَا بِكُمۡ لَفِيفٗا","End":"١٠٤"},{"SurahNumber":17,"VerseNumber":105,"Text":"وَبِٱلۡحَقِّ أَنزَلۡنَٰهُ وَبِٱلۡحَقِّ نَزَلَۗ وَمَآ أَرۡسَلۡنَٰكَ إِلَّا مُبَشِّرٗا وَنَذِيرٗا","End":"١٠٥"},{"SurahNumber":17,"VerseNumber":106,"Text":"وَقُرۡءَانٗا فَرَقۡنَٰهُ لِتَقۡرَأَهُۥ عَلَى ٱلنَّاسِ عَلَىٰ مُكۡثٖ وَنَزَّلۡنَٰهُ تَنزِيلٗا","End":"١٠٦"},{"SurahNumber":17,"VerseNumber":107,"Text":"قُلۡ ءَامِنُواْ بِهِۦٓ أَوۡ لَا تُؤۡمِنُوٓاْۚ إِنَّ ٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ مِن قَبۡلِهِۦٓ إِذَا يُتۡلَىٰ عَلَيۡهِمۡ يَخِرُّونَۤ لِلۡأَذۡقَانِۤ سُجَّدٗاۤ","End":"١٠٧"},{"SurahNumber":17,"VerseNumber":108,"Text":"وَيَقُولُونَ سُبۡحَٰنَ رَبِّنَآ إِن كَانَ وَعۡدُ رَبِّنَا لَمَفۡعُولٗا","End":"١٠٨"},{"SurahNumber":17,"VerseNumber":109,"Text":"وَيَخِرُّونَ لِلۡأَذۡقَانِ يَبۡكُونَ وَيَزِيدُهُمۡ خُشُوعٗا۩","End":"١٠٩"},{"SurahNumber":17,"VerseNumber":110,"Text":"قُلِ ٱدۡعُواْ ٱللَّهَ أَوِ ٱدۡعُواْ ٱلرَّحۡمَٰنَۖ أَيّٗا مَّا تَدۡعُواْ فَلَهُ ٱلۡأَسۡمَآءُ ٱلۡحُسۡنَىٰۚ وَلَا تَجۡهَرۡ بِصَلَاتِكَ وَلَا تُخَافِتۡ بِهَا وَٱبۡتَغِ بَيۡنَ ذَٰلِكَ سَبِيلٗا","End":"١١٠"},{"SurahNumber":17,"VerseNumber":111,"Text":"وَقُلِ ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي لَمۡ يَتَّخِذۡ وَلَدٗا وَلَمۡ يَكُن لَّهُۥ شَرِيكٞ فِي ٱلۡمُلۡكِ وَلَمۡ يَكُن لَّهُۥ وَلِيّٞ مِّنَ ٱلذُّلِّۖ وَكَبِّرۡهُ تَكۡبِيرَۢا","End":"١١١"}],"Translations":[{"LanguageCode":"ara","Language":"Arabic","Name":"ara-quran-la","Author":"Quran Transliteration","Source":"http://tanzil.net","Direction":"ltr","Translations":[{"SurahNumber":17,"VerseNumber":1,"Text":"Subhana allathee asra biAAabdihi laylan mina almasjidi alharami ila almasjidi alaqsa allathee barakna hawlahu linuriyahu min ayatina innahu huwa alssameeAAu albaseeru"},{"SurahNumber":17,"VerseNumber":2,"Text":"Waatayna moosa alkitaba wajaAAalnahu hudan libanee israeela alla tattakhithoo min doonee wakeelan"},{"SurahNumber":17,"VerseNumber":3,"Text":"Thurriyyata man hamalna maAAa noohin innahu kana AAabdan shakooran"},{"SurahNumber":17,"VerseNumber":4,"Text":"Waqadayna ila banee israeela fee alkitabi latufsidunna fee alardi marratayni walataAAlunna AAuluwwan kabeeran"},{"SurahNumber":17,"VerseNumber":5,"Text":"Faitha jaa waAAdu oolahuma baAAathna AAalaykum AAibadan lana olee basin shadeedin fajasoo khilala alddiyari wakana waAAdan mafAAoolan"},{"SurahNumber":17,"VerseNumber":6,"Text":"Thumma radadna lakumu alkarrata AAalayhim waamdadnakum biamwalin wabaneena wajaAAalnakum akthara nafeeran"},{"SurahNumber":17,"VerseNumber":7,"Text":"In ahsantum ahsantum lianfusikum wain asatum falaha faitha jaa waAAdu alakhirati liyasoooo wujoohakum waliyadkhuloo almasjida kama dakhaloohu awwala marratin waliyutabbiroo ma AAalaw tatbeeran"},{"SurahNumber":17,"VerseNumber":8,"Text":"AAasa rabbukum an yarhamakum wain AAudtum AAudna wajaAAalna jahannama lilkafireena haseeran"},{"SurahNumber":17,"VerseNumber":9,"Text":"Inna hatha alqurana yahdee lillatee hiya aqwamu wayubashshiru almumineena allatheena yaAAmaloona alssalihati anna lahum ajran kabeeran"},{"SurahNumber":17,"VerseNumber":10,"Text":"Waanna allatheena la yuminoona bialakhirati aAAtadna lahum AAathaban aleeman"},{"SurahNumber":17,"VerseNumber":11,"Text":"WayadAAu alinsanu bialshsharri duAAaahu bialkhayri wakana alinsanu AAajoolan"},{"SurahNumber":17,"VerseNumber":12,"Text":"WajaAAalna allayla waalnnahara ayatayni famahawna ayata allayli wajaAAalna ayata alnnahari mubsiratan litabtaghoo fadlan min rabbikum walitaAAlamoo AAadada alssineena waalhisaba wakulla shayin fassalnahu tafseelan"},{"SurahNumber":17,"VerseNumber":13,"Text":"Wakulla insanin alzamnahu tairahu fee AAunuqihi wanukhriju lahu yawma alqiyamati kitaban yalqahu manshooran"},{"SurahNumber":17,"VerseNumber":14,"Text":"Iqra kitabaka kafa binafsika alyawma AAalayka haseeban"},{"SurahNumber":17,"VerseNumber":15,"Text":"Mani ihtada fainnama yahtadee linafsihi waman dalla fainnama yadillu AAalayha wala taziru waziratun wizra okhra wama kunna muAAaththibeena hatta nabAAatha rasoolan"},{"SurahNumber":17,"VerseNumber":16,"Text":"Waitha aradna an nuhlika qaryatan amarna mutrafeeha fafasaqoo feeha fahaqqa AAalayha alqawlu fadammarnaha tadmeeran"},{"SurahNumber":17,"VerseNumber":17,"Text":"Wakam ahlakna mina alqurooni min baAAdi noohin wakafa birabbika bithunoobi AAibadihi khabeeran baseeran"},{"SurahNumber":17,"VerseNumber":18,"Text":"Man kana yureedu alAAajilata AAajjalna lahu feeha ma nashao liman nureedu thumma jaAAalna lahu jahannama yaslaha mathmooman madhooran"},{"SurahNumber":17,"VerseNumber":19,"Text":"Waman arada alakhirata wasaAAa laha saAAyaha wahuwa muminun faolaika kana saAAyuhum mashkooran"},{"SurahNumber":17,"VerseNumber":20,"Text":"Kullan numiddu haolai wahaolai min AAatai rabbika wama kana AAatao rabbika mahthooran"},{"SurahNumber":17,"VerseNumber":21,"Text":"Onthur kayfa faddalna baAAdahum AAala baAAdin walalakhiratu akbaru darajatin waakbaru tafdeelan"},{"SurahNumber":17,"VerseNumber":22,"Text":"La tajAAal maAAa Allahi ilahan akhara fataqAAuda mathmooman makhthoolan"},{"SurahNumber":17,"VerseNumber":23,"Text":"Waqada rabbuka alla taAAbudoo illa iyyahu wabialwalidayni ihsanan imma yablughanna AAindaka alkibara ahaduhuma aw kilahuma fala taqul lahuma offin wala tanharhuma waqul lahuma qawlan kareeman"},{"SurahNumber":17,"VerseNumber":24,"Text":"Waikhfid lahuma janaha alththulli mina alrrahmati waqul rabbi irhamhuma kama rabbayanee sagheeran"},{"SurahNumber":17,"VerseNumber":25,"Text":"Rabbukum aAAlamu bima fee nufoosikum in takoonoo saliheena fainnahu kana lilawwabeena ghafooran"},{"SurahNumber":17,"VerseNumber":26,"Text":"Waati tha alqurba haqqahu waalmiskeena waibna alssabeeli wala tubaththir tabtheeran"},{"SurahNumber":17,"VerseNumber":27,"Text":"Inna almubaththireena kanoo ikhwana alshshayateeni wakana alshshaytanu lirabbihi kafooran"},{"SurahNumber":17,"VerseNumber":28,"Text":"Waimma tuAAridanna AAanhumu ibtighaa rahmatin min rabbika tarjooha faqul lahum qawlan maysooran"},{"SurahNumber":17,"VerseNumber":29,"Text":"Wala tajAAal yadaka maghloolatan ila AAunuqika wala tabsutha kulla albasti fataqAAuda malooman mahsooran"},{"SurahNumber":17,"VerseNumber":30,"Text":"Inna rabbaka yabsutu alrrizqa liman yashao wayaqdiru innahu kana biAAibadihi khabeeran baseeran"},{"SurahNumber":17,"VerseNumber":31,"Text":"Wala taqtuloo awladakum khashyata imlaqin nahnu narzuquhum waiyyakum inna qatlahum kana khitan kabeeran"},{"SurahNumber":17,"VerseNumber":32,"Text":"Wala taqraboo alzzina innahu kana fahishatan wasaa sabeelan"},{"SurahNumber":17,"VerseNumber":33,"Text":"Wala taqtuloo alnnafsa allatee harrama Allahu illa bialhaqqi waman qutila mathlooman faqad jaAAalna liwaliyyihi sultanan fala yusrif fee alqatli innahu kana mansooran"},{"SurahNumber":17,"VerseNumber":34,"Text":"Wala taqraboo mala alyateemi illa biallatee hiya ahsanu hatta yablugha ashuddahu waawfoo bialAAahdi inna alAAahda kana masoolan"},{"SurahNumber":17,"VerseNumber":35,"Text":"Waawfoo alkayla itha kiltum wazinoo bialqistasi almustaqeemi thalika khayrun waahsanu taweelan"},{"SurahNumber":17,"VerseNumber":36,"Text":"Wala taqfu ma laysa laka bihi AAilmun inna alssamAAa waalbasara waalfuada kullu olaika kana AAanhu masoolan"},{"SurahNumber":17,"VerseNumber":37,"Text":"Wala tamshi fee alardi marahan innaka lan takhriqa alarda walan tablugha aljibala toolan"},{"SurahNumber":17,"VerseNumber":38,"Text":"Kullu thalika kana sayyiohu AAinda rabbika makroohan"},{"SurahNumber":17,"VerseNumber":39,"Text":"Thalika mimma awha ilayka rabbuka mina alhikmati wala tajAAal maAAa Allahi ilahan akhara fatulqa fee jahannama malooman madhooran"},{"SurahNumber":17,"VerseNumber":40,"Text":"Afaasfakum rabbukum bialbaneena waittakhatha mina almalaikati inathan innakum lataqooloona qawlan AAatheeman"},{"SurahNumber":17,"VerseNumber":41,"Text":"Walaqad sarrafna fee hatha alqurani liyaththakkaroo wama yazeeduhum illa nufooran"},{"SurahNumber":17,"VerseNumber":42,"Text":"Qul law kana maAAahu alihatun kama yaqooloona ithan laibtaghaw ila thee alAAarshi sabeelan"},{"SurahNumber":17,"VerseNumber":43,"Text":"Subhanahu wataAAala AAamma yaqooloona AAuluwwan kabeeran"},{"SurahNumber":17,"VerseNumber":44,"Text":"Tusabbihu lahu alssamawatu alssabAAu waalardu waman feehinna wain min shayin illa yusabbihu bihamdihi walakin la tafqahoona tasbeehahum innahu kana haleeman ghafooran"},{"SurahNumber":17,"VerseNumber":45,"Text":"Waitha qarata alqurana jaAAalna baynaka wabayna allatheena la yuminoona bialakhirati hijaban mastooran"},{"SurahNumber":17,"VerseNumber":46,"Text":"WajaAAalna AAala quloobihim akinnatan an yafqahoohu wafee athanihim waqran waitha thakarta rabbaka fee alqurani wahdahu wallaw AAala adbarihim nufooran"},{"SurahNumber":17,"VerseNumber":47,"Text":"Nahnu aAAlamu bima yastamiAAoona bihi ith yastamiAAoona ilayka waith hum najwa ith yaqoolu alththalimoona in tattabiAAoona illa rajulan mashooran"},{"SurahNumber":17,"VerseNumber":48,"Text":"Onthur kayfa daraboo laka alamthala fadalloo fala yastateeAAoona sabeelan"},{"SurahNumber":17,"VerseNumber":49,"Text":"Waqaloo aitha kunna AAithaman warufatan ainna lamabAAoothoona khalqan jadeedan"},{"SurahNumber":17,"VerseNumber":50,"Text":"Qul koonoo hijaratan aw hadeedan"},{"SurahNumber":17,"VerseNumber":51,"Text":"Aw khalqan mimma yakburu fee sudoorikum fasayaqooloona man yuAAeeduna quli allathee fatarakum awwala marratin fasayunghidoona ilayka ruoosahum wayaqooloona mata huwa qul AAasa an yakoona qareeban"},{"SurahNumber":17,"VerseNumber":52,"Text":"Yawma yadAAookum fatastajeeboona bihamdihi watathunnoona in labithtum illa qaleelan"},{"SurahNumber":17,"VerseNumber":53,"Text":"Waqul liAAibadee yaqooloo allatee hiya ahsanu inna alshshaytana yanzaghu baynahum inna alshshaytana kana lilinsani AAaduwwan mubeenan"},{"SurahNumber":17,"VerseNumber":54,"Text":"Rabbukum aAAlamu bikum in yasha yarhamkum aw in yasha yuAAaththibkum wama arsalnaka AAalayhim wakeelan"},{"SurahNumber":17,"VerseNumber":55,"Text":"Warabbuka aAAlamu biman fee alssamawati waalardi walaqad faddalna baAAda alnnabiyyeena AAala baAAdin waatayna dawooda zabooran"},{"SurahNumber":17,"VerseNumber":56,"Text":"Quli odAAu allatheena zaAAamtum min doonihi fala yamlikoona kashfa alddurri AAankum wala tahweelan"},{"SurahNumber":17,"VerseNumber":57,"Text":"Olaika allatheena yadAAoona yabtaghoona ila rabbihimu alwaseelata ayyuhum aqrabu wayarjoona rahmatahu wayakhafoona AAathabahu inna AAathaba rabbika kana mahthooran"},{"SurahNumber":17,"VerseNumber":58,"Text":"Wain min qaryatin illa nahnu muhlikooha qabla yawmi alqiyamati aw muAAaththibooha AAathaban shadeedan kana thalika fee alkitabi mastooran"},{"SurahNumber":17,"VerseNumber":59,"Text":"Wama manaAAana an nursila bialayati illa an kaththaba biha alawwaloona waatayna thamooda alnnaqata mubsiratan fathalamoo biha wama nursilu bialayati illa takhweefan"},{"SurahNumber":17,"VerseNumber":60,"Text":"Waith qulna laka inna rabbaka ahata bialnnasi wama jaAAalna alrruya allatee araynaka illa fitnatan lilnnasi waalshshajarata almalAAoonata fee alqurani wanukhawwifuhum fama yazeeduhum illa tughyanan kabeeran"},{"SurahNumber":17,"VerseNumber":61,"Text":"Waith qulna lilmalaikati osjudoo liadama fasajadoo illa ibleesa qala aasjudu liman khalaqta teenan"},{"SurahNumber":17,"VerseNumber":62,"Text":"Qala araaytaka hatha allathee karramta AAalayya lain akhkhartani ila yawmi alqiyamati laahtanikanna thurriyyatahu illa qaleelan"},{"SurahNumber":17,"VerseNumber":63,"Text":"Qala ithhab faman tabiAAaka minhum fainna jahannama jazaokum jazaan mawfooran"},{"SurahNumber":17,"VerseNumber":64,"Text":"Waistafziz mani istataAAta minhum bisawtika waajlib AAalayhim bikhaylika warajlika washarikhum fee alamwali waalawladi waAAidhum wama yaAAiduhumu alshshaytanu illa ghurooran"},{"SurahNumber":17,"VerseNumber":65,"Text":"Inna AAibadee laysa laka AAalayhim sultanun wakafa birabbika wakeelan"},{"SurahNumber":17,"VerseNumber":66,"Text":"Rabbukumu allathee yuzjee lakumu alfulka fee albahri litabtaghoo min fadlihi innahu kana bikum raheeman"},{"SurahNumber":17,"VerseNumber":67,"Text":"Waitha massakumu alddurru fee albahri dalla man tadAAoona illa iyyahu falamma najjakum ila albarri aAAradtum wakana alinsanu kafooran"},{"SurahNumber":17,"VerseNumber":68,"Text":"Afaamintum an yakhsifa bikum janiba albarri aw yursila AAalaykum hasiban thumma la tajidoo lakum wakeelan"},{"SurahNumber":17,"VerseNumber":69,"Text":"Am amintum an yuAAeedakum feehi taratan okhra fayursila AAalaykum qasifan mina alrreehi fayughriqakum bima kafartum thumma la tajidoo lakum AAalayna bihi tabeeAAan"},{"SurahNumber":17,"VerseNumber":70,"Text":"Walaqad karramna banee adama wahamalnahum fee albarri waalbahri warazaqnahum mina alttayyibati wafaddalnahum AAala katheerin mimman khalaqna tafdeelan"},{"SurahNumber":17,"VerseNumber":71,"Text":"Yawma nadAAoo kulla onasin biimamihim faman ootiya kitabahu biyameenihi faolaika yaqraoona kitabahum wala yuthlamoona fateelan"},{"SurahNumber":17,"VerseNumber":72,"Text":"Waman kana fee hathihi aAAma fahuwa fee alakhirati aAAma waadallu sabeelan"},{"SurahNumber":17,"VerseNumber":73,"Text":"Wain kadoo layaftinoonaka AAani allathee awhayna ilayka litaftariya AAalayna ghayrahu waithan laittakhathooka khaleelan"},{"SurahNumber":17,"VerseNumber":74,"Text":"Walawla an thabbatnaka laqad kidta tarkanu ilayhim shayan qaleelan"},{"SurahNumber":17,"VerseNumber":75,"Text":"Ithan laathaqnaka diAAfa alhayati wadiAAfa almamati thumma la tajidu laka AAalayna naseeran"},{"SurahNumber":17,"VerseNumber":76,"Text":"Wain kadoo layastafizzoonaka mina alardi liyukhrijooka minha waithan la yalbathoona khilafaka illa qaleelan"},{"SurahNumber":17,"VerseNumber":77,"Text":"Sunnata man qad arsalna qablaka min rusulina wala tajidu lisunnatina tahweelan"},{"SurahNumber":17,"VerseNumber":78,"Text":"Aqimi alssalata lidulooki alshshamsi ila ghasaqi allayli waqurana alfajri inna qurana alfajri kana mashhoodan"},{"SurahNumber":17,"VerseNumber":79,"Text":"Wamina allayli fatahajjad bihi nafilatan laka AAasa an yabAAathaka rabbuka maqaman mahmoodan"},{"SurahNumber":17,"VerseNumber":80,"Text":"Waqul rabbi adkhilnee mudkhala sidqin waakhrijnee mukhraja sidqin waijAAal lee min ladunka sultanan naseeran"},{"SurahNumber":17,"VerseNumber":81,"Text":"Waqul jaa alhaqqu wazahaqa albatilu inna albatila kana zahooqan"},{"SurahNumber":17,"VerseNumber":82,"Text":"Wanunazzilu mina alqurani ma huwa shifaon warahmatun lilmumineena wala yazeedu alththalimeena illa khasaran"},{"SurahNumber":17,"VerseNumber":83,"Text":"Waitha anAAamna AAala alinsani aAArada wanaa bijanibihi waitha massahu alshsharru kana yaoosan"},{"SurahNumber":17,"VerseNumber":84,"Text":"Qul kullun yaAAmalu AAala shakilatihi farabbukum aAAlamu biman huwa ahda sabeelan"},{"SurahNumber":17,"VerseNumber":85,"Text":"Wayasaloonaka AAani alrroohi quli alrroohu min amri rabbee wama ooteetum mina alAAilmi illa qaleelan"},{"SurahNumber":17,"VerseNumber":86,"Text":"Walain shina lanathhabanna biallathee awhayna ilayka thumma la tajidu laka bihi AAalayna wakeelan"},{"SurahNumber":17,"VerseNumber":87,"Text":"Illa rahmatan min rabbika inna fadlahu kana AAalayka kabeeran"},{"SurahNumber":17,"VerseNumber":88,"Text":"Qul laini ijtamaAAati alinsu waaljinnu AAala an yatoo bimithli hatha alqurani la yatoona bimithlihi walaw kana baAAduhum libaAAdin thaheeran"},{"SurahNumber":17,"VerseNumber":89,"Text":"Walaqad sarrafna lilnnasi fee hatha alqurani min kulli mathalin faaba aktharu alnnasi illa kufooran"},{"SurahNumber":17,"VerseNumber":90,"Text":"Waqaloo lan numina laka hatta tafjura lana mina alardi yanbooAAan"},{"SurahNumber":17,"VerseNumber":91,"Text":"Aw takoona laka jannatun min nakheelin waAAinabin fatufajjira alanhara khilalaha tafjeeran"},{"SurahNumber":17,"VerseNumber":92,"Text":"Aw tusqita alssamaa kama zaAAamta AAalayna kisafan aw tatiya biAllahi waalmalaikati qabeelan"},{"SurahNumber":17,"VerseNumber":93,"Text":"Aw yakoona laka baytun min zukhrufin aw tarqa fee alssamai walan numina liruqiyyika hatta tunazzila AAalayna kitaban naqraohu qul subhana rabbee hal kuntu illa basharan rasoolan"},{"SurahNumber":17,"VerseNumber":94,"Text":"Wama manaAAa alnnasa an yuminoo ith jaahumu alhuda illa an qaloo abaAAatha Allahu basharan rasoolan"},{"SurahNumber":17,"VerseNumber":95,"Text":"Qul law kana fee alardi malaikatun yamshoona mutmainneena lanazzalna AAalayhim mina alssamai malakan rasoolan"},{"SurahNumber":17,"VerseNumber":96,"Text":"Qul kafa biAllahi shaheedan baynee wabaynakum innahu kana biAAibadihi khabeeran baseeran"},{"SurahNumber":17,"VerseNumber":97,"Text":"Waman yahdi Allahu fahuwa almuhtadi waman yudlil falan tajida lahum awliyaa min doonihi wanahshuruhum yawma alqiyamati AAala wujoohihim AAumyan wabukman wasumman mawahum jahannamu kullama khabat zidnahum saAAeeran"},{"SurahNumber":17,"VerseNumber":98,"Text":"Thalika jazaohum biannahum kafaroo biayatina waqaloo aitha kunna AAithaman warufatan ainna lamabAAoothoona khalqan jadeedan"},{"SurahNumber":17,"VerseNumber":99,"Text":"Awalam yaraw anna Allaha allathee khalaqa alssamawati waalarda qadirun AAala an yakhluqa mithlahum wajaAAala lahum ajalan la rayba feehi faaba alththalimoona illa kufooran"},{"SurahNumber":17,"VerseNumber":100,"Text":"Qul law antum tamlikoona khazaina rahmati rabbee ithan laamsaktum khashyata alinfaqi wakana alinsanu qatooran"},{"SurahNumber":17,"VerseNumber":101,"Text":"Walaqad atayna moosa tisAAa ayatin bayyinatin faisal banee israeela ith jaahum faqala lahu firAAawnu innee laathunnuka ya moosa mashooran"},{"SurahNumber":17,"VerseNumber":102,"Text":"Qala laqad AAalimta ma anzala haolai illa rabbu alssamawati waalardi basaira wainnee laathunnuka ya firAAawnu mathbooran"},{"SurahNumber":17,"VerseNumber":103,"Text":"Faarada an yastafizzahum mina alardi faaghraqnahu waman maAAahu jameeAAan"},{"SurahNumber":17,"VerseNumber":104,"Text":"Waqulna min baAAdihi libanee israeela oskunoo alarda faitha jaa waAAdu alakhirati jina bikum lafeefan"},{"SurahNumber":17,"VerseNumber":105,"Text":"Wabialhaqqi anzalnahu wabialhaqqi nazala wama arsalnaka illa mubashshiran wanatheeran"},{"SurahNumber":17,"VerseNumber":106,"Text":"Waquranan faraqnahu litaqraahu AAala alnnasi AAala mukthin wanazzalnahu tanzeelan"},{"SurahNumber":17,"VerseNumber":107,"Text":"Qul aminoo bihi aw la tuminoo inna allatheena ootoo alAAilma min qablihi itha yutla AAalayhim yakhirroona lilathqani sujjadan"},{"SurahNumber":17,"VerseNumber":108,"Text":"Wayaqooloona subhana rabbina in kana waAAdu rabbina lamafAAoolan"},{"SurahNumber":17,"VerseNumber":109,"Text":"Wayakhirroona lilathqani yabkoona wayazeeduhum khushooAAan"},{"SurahNumber":17,"VerseNumber":110,"Text":"Quli odAAoo Allaha awi odAAoo alrrahmana ayyan ma tadAAoo falahu alasmao alhusna wala tajhar bisalatika wala tukhafit biha waibtaghi bayna thalika sabeelan"},{"SurahNumber":17,"VerseNumber":111,"Text":"Waquli alhamdu lillahi allathee lam yattakhith waladan walam yakun lahu shareekun fee almulki walam yakun lahu waliyyun mina alththulli wakabbirhu takbeeran"}]},{"LanguageCode":"eng","Language":"English","Name":"eng-mustafakhattabg","Author":"Mustafa Khattab God Edition","Source":"","Direction":"ltr","Translations":[{"SurahNumber":17,"VerseNumber":1,"Text":"Glory be to the One Who took His servant ˹Muḥammad˺ by night from the Sacred Mosque to the Farthest Mosque whose surroundings We have blessed, so that We may show him some of Our signs. Indeed, He alone is the All-Hearing, All-Seeing"},{"SurahNumber":17,"VerseNumber":2,"Text":"And We gave Moses the Scripture and made it a guide for the Children of Israel, ˹stating:˺ “Do not take besides Me any other Trustee of Affairs"},{"SurahNumber":17,"VerseNumber":3,"Text":"˹O˺ descendants of those We carried with Noah ˹in the Ark˺! He was indeed a grateful servant.”"},{"SurahNumber":17,"VerseNumber":4,"Text":"And We warned the Children of Israel in the Scripture, “You will certainly cause corruption in the land twice, and you will become extremely arrogant"},{"SurahNumber":17,"VerseNumber":5,"Text":"When the first of the two warnings would come to pass, We would send against you some of Our servants of great might, who would ravage your homes. This would be a warning fulfilled"},{"SurahNumber":17,"VerseNumber":6,"Text":"Then ˹after your repentance˺ We would give you the upper hand over them and aid you with wealth and offspring, causing you to outnumber them"},{"SurahNumber":17,"VerseNumber":7,"Text":"If you act rightly, it is for your own good, but if you do wrong, it is to your own loss. “And when the second warning would come to pass, your enemies would ˹be left to˺ totally disgrace you and enter the Temple ˹of Jerusalem˺ as they entered it the first time, and utterly destroy whatever would fall into their hands"},{"SurahNumber":17,"VerseNumber":8,"Text":"Perhaps your Lord will have mercy on you ˹if you repent˺, but if you return ˹to sin˺, We will return ˹to punishment˺. And We have made Hell a ˹permanent˺ confinement for the disbelievers.”"},{"SurahNumber":17,"VerseNumber":9,"Text":"Surely this Quran guides to what is most upright, and gives good news to the believers—who do good—that they will have a mighty reward"},{"SurahNumber":17,"VerseNumber":10,"Text":"And ˹it warns˺ those who do not believe in the Hereafter ˹that˺ We have prepared for them a painful punishment"},{"SurahNumber":17,"VerseNumber":11,"Text":"And humans ˹swiftly˺ pray for evil as they pray for good. For humankind is ever hasty"},{"SurahNumber":17,"VerseNumber":12,"Text":"We made the day and night as two signs. So We made the sign of the night devoid of light, and We made the sign of the day ˹perfectly˺ bright, so that you may seek the bounty of your Lord and know the number of years and calculation ˹of time˺. And We have explained everything in detail"},{"SurahNumber":17,"VerseNumber":13,"Text":"We have bound every human’s destiny to their neck. And on the Day of Judgment We will bring forth to each ˹person˺ a record which they will find laid open"},{"SurahNumber":17,"VerseNumber":14,"Text":"˹And it will be said,˺ “Read your record. You ˹alone˺ are sufficient this Day to take account of yourself.”"},{"SurahNumber":17,"VerseNumber":15,"Text":"Whoever chooses to be guided, it is only for their own good. And whoever chooses to stray, it is only to their own loss. No soul burdened with sin will bear the burden of another. And We would never punish ˹a people˺ until We have sent a messenger ˹to warn them˺"},{"SurahNumber":17,"VerseNumber":16,"Text":"Whenever We intend to destroy a society, We command its elite ˹to obey God˺ but they act rebelliously in it. So the decree ˹of punishment˺ is justified, and We destroy it utterly"},{"SurahNumber":17,"VerseNumber":17,"Text":"˹Imagine˺ how many peoples We have destroyed after Noah! And sufficient is your Lord as All-Aware and All-Seeing of the sins of His servants"},{"SurahNumber":17,"VerseNumber":18,"Text":"Whoever desires this fleeting world ˹alone˺, We hasten in it whatever We please to whoever We will; then We destine them for Hell, where they will burn, condemned and rejected"},{"SurahNumber":17,"VerseNumber":19,"Text":"But whoever desires the Hereafter and strives for it accordingly, and is a ˹true˺ believer, it is they whose striving will be appreciated"},{"SurahNumber":17,"VerseNumber":20,"Text":"We provide both the former and the latter from the bounty of your Lord. And the bounty of your Lord can never be withheld"},{"SurahNumber":17,"VerseNumber":21,"Text":"See how We have favoured some over others ˹in this life˺, but the Hereafter is certainly far greater in rank and in favour"},{"SurahNumber":17,"VerseNumber":22,"Text":"Do not set up any other god with God, or you will end up condemned, abandoned"},{"SurahNumber":17,"VerseNumber":23,"Text":"For your Lord has decreed that you worship none but Him. And honour your parents. If one or both of them reach old age in your care, never say to them ˹even˺ ‘ugh,’ nor yell at them. Rather, address them respectfully"},{"SurahNumber":17,"VerseNumber":24,"Text":"And be humble with them out of mercy, and pray, “My Lord! Be merciful to them as they raised me when I was young.”"},{"SurahNumber":17,"VerseNumber":25,"Text":"Your Lord knows best what is within yourselves. If you are righteous, He is certainly All-Forgiving to those who ˹constantly˺ turn to Him"},{"SurahNumber":17,"VerseNumber":26,"Text":"Give to close relatives their due, as well as the poor and ˹needy˺ travellers. And do not spend wastefully"},{"SurahNumber":17,"VerseNumber":27,"Text":"Surely the wasteful are ˹like˺ brothers to the devils. And the Devil is ever ungrateful to his Lord"},{"SurahNumber":17,"VerseNumber":28,"Text":"But if you must turn them down ˹because you lack the means to give˺—while hoping to receive your Lord’s bounty—then ˹at least˺ give them a kind word"},{"SurahNumber":17,"VerseNumber":29,"Text":"Do not be so tight-fisted, for you will be blameworthy; nor so open-handed, for you will end up in poverty"},{"SurahNumber":17,"VerseNumber":30,"Text":"Surely your Lord gives abundant or limited provisions to whoever He wills. He is certainly All-Aware, All-Seeing of His servants"},{"SurahNumber":17,"VerseNumber":31,"Text":"Do not kill your children for fear of poverty. We provide for them and for you. Surely killing them is a heinous sin"},{"SurahNumber":17,"VerseNumber":32,"Text":"Do not go near adultery. It is truly a shameful deed and an evil way"},{"SurahNumber":17,"VerseNumber":33,"Text":"Do not take a ˹human˺ life—made sacred by God—except with ˹legal˺ right. If anyone is killed unjustly, We have given their heirs the authority, but do not let them exceed limits in retaliation, for they are already supported ˹by law˺"},{"SurahNumber":17,"VerseNumber":34,"Text":"Do not come near the wealth of the orphan—unless intending to enhance it—until they attain maturity. Honour ˹your˺ pledges, for you will surely be accountable for them"},{"SurahNumber":17,"VerseNumber":35,"Text":"Give in full when you measure, and weigh with an even balance. That is fairest and best in the end"},{"SurahNumber":17,"VerseNumber":36,"Text":"Do not follow what you have no ˹sure˺ knowledge of. Indeed, all will be called to account for ˹their˺ hearing, sight, and intellect"},{"SurahNumber":17,"VerseNumber":37,"Text":"And do not walk on the earth arrogantly. Surely you can neither crack the earth nor stretch to the height of the mountains"},{"SurahNumber":17,"VerseNumber":38,"Text":"The violation of any of these ˹commandments˺ is detestable to your Lord"},{"SurahNumber":17,"VerseNumber":39,"Text":"This is part of the wisdom which your Lord has revealed to you ˹O Prophet˺. And do not set up any other god with God ˹O humanity˺, or you will be cast into Hell, blameworthy, rejected"},{"SurahNumber":17,"VerseNumber":40,"Text":"Has your Lord favoured you ˹pagans˺ with sons and taken angels as ˹His˺ daughters? You are truly making an outrageous claim"},{"SurahNumber":17,"VerseNumber":41,"Text":"We have surely varied ˹the signs˺ in this Quran so perhaps they may be mindful, but it only drives them farther away"},{"SurahNumber":17,"VerseNumber":42,"Text":"Say, ˹O Prophet,˺ “Had there been other gods besides Him—as they claim—then they would have certainly sought a way to ˹challenge˺ the Lord of the Throne.”"},{"SurahNumber":17,"VerseNumber":43,"Text":"Glorified and Highly Exalted is He above what they claim"},{"SurahNumber":17,"VerseNumber":44,"Text":"The seven heavens, the earth, and all those in them glorify Him. There is not a single thing that does not glorify His praises—but you ˹simply˺ cannot comprehend their glorification. He is indeed Most Forbearing, All-Forgiving"},{"SurahNumber":17,"VerseNumber":45,"Text":"When you ˹O Prophet˺ recite the Quran, We put a hidden barrier between you and those who do not believe in the Hereafter"},{"SurahNumber":17,"VerseNumber":46,"Text":"We have cast veils over their hearts—leaving them unable to comprehend it—and deafness in their ears. And when you mention your Lord alone in the Quran, they turn their backs in aversion"},{"SurahNumber":17,"VerseNumber":47,"Text":"We know best how they listen to your recitation and what they say privately—when the wrongdoers say, “You would only be following a bewitched man.”"},{"SurahNumber":17,"VerseNumber":48,"Text":"See how they call you names ˹O Prophet˺! So they have gone so ˹far˺ astray that they cannot find the ˹Right˺ Way"},{"SurahNumber":17,"VerseNumber":49,"Text":"And they say ˹mockingly˺, “When we are reduced to bones and ashes, will we really be raised as a new creation?”"},{"SurahNumber":17,"VerseNumber":50,"Text":"Say, ˹O Prophet,˺ “˹Yes, even if˺ you become stones, or iron"},{"SurahNumber":17,"VerseNumber":51,"Text":"or whatever you think is harder to bring to life!” Then they will ask ˹you˺, “Who will bring us back ˹to life˺?” Say, “The One Who created you the first time.” They will then shake their heads at you and ask, “When will that be?” Say, “Perhaps it is soon!”"},{"SurahNumber":17,"VerseNumber":52,"Text":"On the Day He will call you, you will ˹instantly˺ respond by praising Him, thinking you had remained ˹in the world˺ only for a little while"},{"SurahNumber":17,"VerseNumber":53,"Text":"Tell My ˹believing˺ servants to say only what is best. Satan certainly seeks to sow discord among them. Satan is indeed a sworn enemy to humankind"},{"SurahNumber":17,"VerseNumber":54,"Text":"Your Lord knows you best. He may have mercy on you if He wills, or punish you if He wills. We have not sent you ˹O Prophet˺ as a keeper over them"},{"SurahNumber":17,"VerseNumber":55,"Text":"Your Lord knows best all those in the heavens and the earth. And We have surely favoured some prophets above others, and to David We gave the Psalms"},{"SurahNumber":17,"VerseNumber":56,"Text":"Say, ˹O Prophet,˺ “Invoke those you claim ˹to be divine˺ besides Him—they do not have the power to undo harm from you or transfer it ˹to someone else˺.”"},{"SurahNumber":17,"VerseNumber":57,"Text":"˹Even˺ the closest ˹to God˺ of those invoked would be seeking a way to their Lord, hoping for His mercy, and fearing His punishment. Indeed, your Lord’s torment is fearsome"},{"SurahNumber":17,"VerseNumber":58,"Text":"There is not a ˹wicked˺ society that We will not destroy or punish with a severe torment before the Day of Judgment. That is written in the Record"},{"SurahNumber":17,"VerseNumber":59,"Text":"Nothing keeps Us from sending the ˹demanded˺ signs except that they had ˹already˺ been denied by earlier peoples. And We gave Thamûd the she-camel as a clear sign, but they wrongfully rejected it. We only send the signs as a warning"},{"SurahNumber":17,"VerseNumber":60,"Text":"And ˹remember, O Prophet˺ when We told you, “Certainly your Lord encompasses the people.” And We have made what We brought you to see as well as the cursed tree ˹mentioned˺ in the Quran only as a test for the people. We keep warning them, but it only increases them greatly in defiance"},{"SurahNumber":17,"VerseNumber":61,"Text":"And ˹remember˺ when We said to the angels, “Prostrate before Adam,” so they all did—but not Iblîs, who protested, “Should I prostrate to the one You have created from mud?”"},{"SurahNumber":17,"VerseNumber":62,"Text":"Adding, “Do you see this one you honoured above me? If you delay my end until the Day of Judgment, I will certainly take hold of his descendants, except for a few.”"},{"SurahNumber":17,"VerseNumber":63,"Text":"God responded, “Be gone! Whoever of them follows you, Hell will surely be the reward for all of you—an ample reward"},{"SurahNumber":17,"VerseNumber":64,"Text":"And incite whoever you can of them with your voice, mobilize against them all your cavalry and infantry, manipulate them in their wealth and children, and make them promises.” But Satan promises them nothing but delusion"},{"SurahNumber":17,"VerseNumber":65,"Text":"˹God added,˺ “You will truly have no authority over My ˹faithful˺ servants.” And sufficient is your Lord as a Guardian"},{"SurahNumber":17,"VerseNumber":66,"Text":"It is your Lord Who steers the ships for you through the sea, so that you may seek His bounty. Surely He is ever Merciful to you"},{"SurahNumber":17,"VerseNumber":67,"Text":"When you are touched with hardship at sea, you ˹totally˺ forget all ˹the gods˺ you ˹normally˺ invoke, except Him. But when He delivers you ˹safely˺ to shore, you turn away. Humankind is ever ungrateful"},{"SurahNumber":17,"VerseNumber":68,"Text":"Do you feel secure that He will not cause the land to swallow you up, or unleash upon you a storm of stones? Then you will find none to protect you"},{"SurahNumber":17,"VerseNumber":69,"Text":"Or do you feel secure that He will not send you back to sea once again, and send upon you a violent storm, drowning you for your denial? Then you will find none to avenge you against Us"},{"SurahNumber":17,"VerseNumber":70,"Text":"Indeed, We have dignified the children of Adam, carried them on land and sea, granted them good and lawful provisions, and privileged them far above many of Our creatures"},{"SurahNumber":17,"VerseNumber":71,"Text":"˹Beware of˺ the Day We will summon every people with their leader. So whoever will be given their record in their right hand will read it ˹happily˺ and will not be wronged ˹even by the width of˺ the thread of a date stone"},{"SurahNumber":17,"VerseNumber":72,"Text":"But whoever is blind ˹to the truth˺ in this ˹world˺ will be blind in the Hereafter, and ˹even˺ far more astray from the ˹Right˺ Way"},{"SurahNumber":17,"VerseNumber":73,"Text":"They definitely ˹thought they˺ were about to lure you away from what We have revealed to you ˹O Prophet˺, hoping that you would attribute something else to Us falsely—and then they would have certainly taken you as a close friend"},{"SurahNumber":17,"VerseNumber":74,"Text":"Had We not made you steadfast, you probably would have inclined to them a little"},{"SurahNumber":17,"VerseNumber":75,"Text":"and then We truly would have made you taste double ˹punishment˺ both in this life and after death, and you would have found no helper against Us"},{"SurahNumber":17,"VerseNumber":76,"Text":"They were about to intimidate you to drive you out of the land ˹of Mecca˺, but then they would not have survived after you ˹had left˺ except for a little while"},{"SurahNumber":17,"VerseNumber":77,"Text":"˹This has been˺ Our way with the messengers We sent before you. And you will never find any change in Our way"},{"SurahNumber":17,"VerseNumber":78,"Text":"Observe the prayer from the decline of the sun until the darkness of the night and the dawn prayer, for certainly the dawn prayer is witnessed ˹by angels˺"},{"SurahNumber":17,"VerseNumber":79,"Text":"And rise at ˹the last˺ part of the night, offering additional prayers, so your Lord may raise you to a station of praise"},{"SurahNumber":17,"VerseNumber":80,"Text":"And say, “My Lord! Grant me an honourable entrance and an honourable exit and give me a supporting authority from Yourself.”"},{"SurahNumber":17,"VerseNumber":81,"Text":"And declare, “The truth has come and falsehood has vanished. Indeed, falsehood is bound to vanish.”"},{"SurahNumber":17,"VerseNumber":82,"Text":"We send down the Quran as a healing and mercy for the believers, but it only increases the wrongdoers in loss"},{"SurahNumber":17,"VerseNumber":83,"Text":"When We grant people Our favours, they turn away, acting arrogantly. But when touched with evil, they lose all hope"},{"SurahNumber":17,"VerseNumber":84,"Text":"Say, ˹O Prophet,˺ “Everyone acts in their own way. But your Lord knows best whose way is rightly guided.”"},{"SurahNumber":17,"VerseNumber":85,"Text":"They ask you ˹O Prophet˺ about the spirit. Say, “Its nature is known only to my Lord, and you ˹O humanity˺ have been given but little knowledge.”"},{"SurahNumber":17,"VerseNumber":86,"Text":"If We willed, We could have certainly taken away what We have revealed to you ˹O Prophet˺—then you would find none to guarantee its return from Us—"},{"SurahNumber":17,"VerseNumber":87,"Text":"had it not been for the mercy of your Lord. Indeed, His favour upon you is immense"},{"SurahNumber":17,"VerseNumber":88,"Text":"Say, ˹O Prophet,˺ “If ˹all˺ humans and jinn were to come together to produce the equivalent of this Quran, they could not produce its equal, no matter how they supported each other.”"},{"SurahNumber":17,"VerseNumber":89,"Text":"And We have truly set forth every ˹kind of˺ lesson for humanity in this Quran, yet most people persist in disbelief"},{"SurahNumber":17,"VerseNumber":90,"Text":"They challenge ˹the Prophet˺, “We will never believe in you until you cause a spring to gush forth from the earth for us"},{"SurahNumber":17,"VerseNumber":91,"Text":"or until you have a garden of palm trees and vineyards, and cause rivers to flow abundantly in it"},{"SurahNumber":17,"VerseNumber":92,"Text":"or cause the sky to fall upon us in pieces, as you have claimed, or bring God and the angels before us, face to face"},{"SurahNumber":17,"VerseNumber":93,"Text":"or until you have a house of gold, or you ascend into heaven—and even then we will not believe in your ascension until you bring down to us a book that we can read.” Say, “Glory be to my Lord! Am I not only a human messenger?”"},{"SurahNumber":17,"VerseNumber":94,"Text":"And nothing has prevented people from believing when guidance comes to them except their protest: “Has God sent a human as a messenger?”"},{"SurahNumber":17,"VerseNumber":95,"Text":"Say, ˹O Prophet,˺ “Had there been angels walking the earth, well settled, We would have surely sent down for them an angel from heaven as a messenger.”"},{"SurahNumber":17,"VerseNumber":96,"Text":"Say, “Sufficient is God as a Witness between me and you. He is certainly All-Knowing, All-Seeing of His servants.”"},{"SurahNumber":17,"VerseNumber":97,"Text":"Whoever God guides is truly guided. And whoever He leaves to stray, you will find no guardians for them besides Him. And We will drag them on their faces on the Day of Judgment—deaf, dumb, and blind. Hell will be their home. Whenever it dies down, We will flare it up for them"},{"SurahNumber":17,"VerseNumber":98,"Text":"That is their reward for rejecting Our signs and asking ˹mockingly˺, “When we are reduced to bones and ashes, will we really be raised as a new creation?”"},{"SurahNumber":17,"VerseNumber":99,"Text":"Have they not realized that God, Who created the heavens and the earth, can ˹easily˺ re-create them? He has ˹already˺ set for them a time, about which there is no doubt. But the wrongdoers persist in denial"},{"SurahNumber":17,"VerseNumber":100,"Text":"Say ˹to them, O Prophet˺, “Even if you were to possess the ˹infinite˺ treasuries of my Lord’s mercy, then you would certainly withhold ˹them˺, fearing they would run out—for humankind is ever stingy!”"},{"SurahNumber":17,"VerseNumber":101,"Text":"We surely gave Moses nine clear signs. ˹You, O Prophet, can˺ ask the Children of Israel. When Moses came to them, Pharaoh said to him, “I really think that you, O Moses, are bewitched.”"},{"SurahNumber":17,"VerseNumber":102,"Text":"Moses replied, “You know well that none has sent these ˹signs˺ down except the Lord of the heavens and the earth as insights. And I really think that you, O Pharaoh, are doomed.”"},{"SurahNumber":17,"VerseNumber":103,"Text":"So Pharaoh wanted to scare the Israelites out of the land ˹of Egypt˺, but We drowned him and all of those with him"},{"SurahNumber":17,"VerseNumber":104,"Text":"And We said to the Children of Israel after Pharaoh, “Reside in the land, but when the promise of the Hereafter comes to pass, We will bring you all together.”"},{"SurahNumber":17,"VerseNumber":105,"Text":"We have sent down the Quran in truth, and with the truth it has come down. We have sent you ˹O Prophet˺ only as a deliverer of good news and a warner"},{"SurahNumber":17,"VerseNumber":106,"Text":"˹It is˺ a Quran We have revealed in stages so that you may recite it to people at a deliberate pace. And We have sent it down in successive revelations"},{"SurahNumber":17,"VerseNumber":107,"Text":"Say, ˹O Prophet,˺ “Believe in this ˹Quran˺, or do not. Indeed, when it is recited to those who were gifted with knowledge before it ˹was revealed˺, they fall upon their faces in prostration"},{"SurahNumber":17,"VerseNumber":108,"Text":"and say, ‘Glory be to our Lord! Surely the promise of our Lord has been fulfilled.’"},{"SurahNumber":17,"VerseNumber":109,"Text":"And they fall down upon their faces weeping, and it increases them in humility.”"},{"SurahNumber":17,"VerseNumber":110,"Text":"Say, ˹O Prophet,˺ “Call upon God or call upon the Most Compassionate—whichever you call, He has the Most Beautiful Names.” Do not recite your prayers too loudly or silently, but seek a way between"},{"SurahNumber":17,"VerseNumber":111,"Text":"And say, “All praise is for God, Who has never had ˹any˺ offspring; nor does He have a partner in ˹governing˺ the kingdom; nor is He pathetic, needing a protector. And revere Him immensely.”"}]}]}