{"SurahNumber":18,"HasBismillah":true,"Verses":[{"SurahNumber":18,"VerseNumber":1,"Text":"ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِيٓ أَنزَلَ عَلَىٰ عَبۡدِهِ ٱلۡكِتَٰبَ وَلَمۡ يَجۡعَل لَّهُۥ عِوَجَاۜ","End":"١"},{"SurahNumber":18,"VerseNumber":2,"Text":"قَيِّمٗا لِّيُنذِرَ بَأۡسٗا شَدِيدٗا مِّن لَّدُنۡهُ وَيُبَشِّرَ ٱلۡمُؤۡمِنِينَ ٱلَّذِينَ يَعۡمَلُونَ ٱلصَّـٰلِحَٰتِ أَنَّ لَهُمۡ أَجۡرًا حَسَنٗا","End":"٢"},{"SurahNumber":18,"VerseNumber":3,"Text":"مَّـٰكِثِينَ فِيهِ أَبَدٗا","End":"٣"},{"SurahNumber":18,"VerseNumber":4,"Text":"وَيُنذِرَ ٱلَّذِينَ قَالُواْ ٱتَّخَذَ ٱللَّهُ وَلَدٗا","End":"٤"},{"SurahNumber":18,"VerseNumber":5,"Text":"مَّا لَهُم بِهِۦ مِنۡ عِلۡمٖ وَلَا لِأٓبَآئِهِمۡۚ كَبُرَتۡ كَلِمَةٗ تَخۡرُجُ مِنۡ أَفۡوَٰهِهِمۡۚ إِن يَقُولُونَ إِلَّا كَذِبٗا","End":"٥"},{"SurahNumber":18,"VerseNumber":6,"Text":"فَلَعَلَّكَ بَٰخِعٞ نَّفۡسَكَ عَلَىٰٓ ءَاثَٰرِهِمۡ إِن لَّمۡ يُؤۡمِنُواْ بِهَٰذَا ٱلۡحَدِيثِ أَسَفًا","End":"٦"},{"SurahNumber":18,"VerseNumber":7,"Text":"إِنَّا جَعَلۡنَا مَا عَلَى ٱلۡأَرۡضِ زِينَةٗ لَّهَا لِنَبۡلُوَهُمۡ أَيُّهُمۡ أَحۡسَنُ عَمَلٗا","End":"٧"},{"SurahNumber":18,"VerseNumber":8,"Text":"وَإِنَّا لَجَٰعِلُونَ مَا عَلَيۡهَا صَعِيدٗا جُرُزًا","End":"٨"},{"SurahNumber":18,"VerseNumber":9,"Text":"أَمۡ حَسِبۡتَ أَنَّ أَصۡحَٰبَ ٱلۡكَهۡفِ وَٱلرَّقِيمِ كَانُواْ مِنۡ ءَايَٰتِنَا عَجَبًا","End":"٩"},{"SurahNumber":18,"VerseNumber":10,"Text":"إِذۡ أَوَى ٱلۡفِتۡيَةُ إِلَى ٱلۡكَهۡفِ فَقَالُواْ رَبَّنَآ ءَاتِنَا مِن لَّدُنكَ رَحۡمَةٗ وَهَيِّئۡ لَنَا مِنۡ أَمۡرِنَا رَشَدٗا","End":"١٠"},{"SurahNumber":18,"VerseNumber":11,"Text":"فَضَرَبۡنَا عَلَىٰٓ ءَاذَانِهِمۡ فِي ٱلۡكَهۡفِ سِنِينَ عَدَدٗا","End":"١١"},{"SurahNumber":18,"VerseNumber":12,"Text":"ثُمَّ بَعَثۡنَٰهُمۡ لِنَعۡلَمَ أَيُّ ٱلۡحِزۡبَيۡنِ أَحۡصَىٰ لِمَا لَبِثُوٓاْ أَمَدٗا","End":"١٢"},{"SurahNumber":18,"VerseNumber":13,"Text":"نَّحۡنُ نَقُصُّ عَلَيۡكَ نَبَأَهُم بِٱلۡحَقِّۚ إِنَّهُمۡ فِتۡيَةٌ ءَامَنُواْ بِرَبِّهِمۡ وَزِدۡنَٰهُمۡ هُدٗى","End":"١٣"},{"SurahNumber":18,"VerseNumber":14,"Text":"وَرَبَطۡنَا عَلَىٰ قُلُوبِهِمۡ إِذۡ قَامُواْ فَقَالُواْ رَبُّنَا رَبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ لَن نَّدۡعُوَاْ مِن دُونِهِۦٓ إِلَٰهٗاۖ لَّقَدۡ قُلۡنَآ إِذٗا شَطَطًا","End":"١٤"},{"SurahNumber":18,"VerseNumber":15,"Text":"هَـٰٓؤُلَآءِ قَوۡمُنَا ٱتَّخَذُواْ مِن دُونِهِۦٓ ءَالِهَةٗۖ لَّوۡلَا يَأۡتُونَ عَلَيۡهِم بِسُلۡطَٰنِۭ بَيِّنٖۖ فَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبٗا","End":"١٥"},{"SurahNumber":18,"VerseNumber":16,"Text":"وَإِذِ ٱعۡتَزَلۡتُمُوهُمۡ وَمَا يَعۡبُدُونَ إِلَّا ٱللَّهَ فَأۡوُۥٓاْ إِلَى ٱلۡكَهۡفِ يَنشُرۡ لَكُمۡ رَبُّكُم مِّن رَّحۡمَتِهِۦ وَيُهَيِّئۡ لَكُم مِّنۡ أَمۡرِكُم مِّرۡفَقٗا","End":"١٦"},{"SurahNumber":18,"VerseNumber":17,"Text":"۞وَتَرَى ٱلشَّمۡسَ إِذَا طَلَعَت تَّزَٰوَرُ عَن كَهۡفِهِمۡ ذَاتَ ٱلۡيَمِينِ وَإِذَا غَرَبَت تَّقۡرِضُهُمۡ ذَاتَ ٱلشِّمَالِ وَهُمۡ فِي فَجۡوَةٖ مِّنۡهُۚ ذَٰلِكَ مِنۡ ءَايَٰتِ ٱللَّهِۗ مَن يَهۡدِ ٱللَّهُ فَهُوَ ٱلۡمُهۡتَدِۖ وَمَن يُضۡلِلۡ فَلَن تَجِدَ لَهُۥ وَلِيّٗا مُّرۡشِدٗا","End":"١٧"},{"SurahNumber":18,"VerseNumber":18,"Text":"وَتَحۡسَبُهُمۡ أَيۡقَاظٗا وَهُمۡ رُقُودٞۚ وَنُقَلِّبُهُمۡ ذَاتَ ٱلۡيَمِينِ وَذَاتَ ٱلشِّمَالِۖ وَكَلۡبُهُم بَٰسِطٞ ذِرَاعَيۡهِ بِٱلۡوَصِيدِۚ لَوِ ٱطَّلَعۡتَ عَلَيۡهِمۡ لَوَلَّيۡتَ مِنۡهُمۡ فِرَارٗا وَلَمُلِئۡتَ مِنۡهُمۡ رُعۡبٗا","End":"١٨"},{"SurahNumber":18,"VerseNumber":19,"Text":"وَكَذَٰلِكَ بَعَثۡنَٰهُمۡ لِيَتَسَآءَلُواْ بَيۡنَهُمۡۚ قَالَ قَآئِلٞ مِّنۡهُمۡ كَمۡ لَبِثۡتُمۡۖ قَالُواْ لَبِثۡنَا يَوۡمًا أَوۡ بَعۡضَ يَوۡمٖۚ قَالُواْ رَبُّكُمۡ أَعۡلَمُ بِمَا لَبِثۡتُمۡ فَٱبۡعَثُوٓاْ أَحَدَكُم بِوَرِقِكُمۡ هَٰذِهِۦٓ إِلَى ٱلۡمَدِينَةِ فَلۡيَنظُرۡ أَيُّهَآ أَزۡكَىٰ طَعَامٗا فَلۡيَأۡتِكُم بِرِزۡقٖ مِّنۡهُ وَلۡيَتَلَطَّفۡ وَلَا يُشۡعِرَنَّ بِكُمۡ أَحَدًا","End":"١٩"},{"SurahNumber":18,"VerseNumber":20,"Text":"إِنَّهُمۡ إِن يَظۡهَرُواْ عَلَيۡكُمۡ يَرۡجُمُوكُمۡ أَوۡ يُعِيدُوكُمۡ فِي مِلَّتِهِمۡ وَلَن تُفۡلِحُوٓاْ إِذًا أَبَدٗا","End":"٢٠"},{"SurahNumber":18,"VerseNumber":21,"Text":"وَكَذَٰلِكَ أَعۡثَرۡنَا عَلَيۡهِمۡ لِيَعۡلَمُوٓاْ أَنَّ وَعۡدَ ٱللَّهِ حَقّٞ وَأَنَّ ٱلسَّاعَةَ لَا رَيۡبَ فِيهَآ إِذۡ يَتَنَٰزَعُونَ بَيۡنَهُمۡ أَمۡرَهُمۡۖ فَقَالُواْ ٱبۡنُواْ عَلَيۡهِم بُنۡيَٰنٗاۖ رَّبُّهُمۡ أَعۡلَمُ بِهِمۡۚ قَالَ ٱلَّذِينَ غَلَبُواْ عَلَىٰٓ أَمۡرِهِمۡ لَنَتَّخِذَنَّ عَلَيۡهِم مَّسۡجِدٗا","End":"٢١"},{"SurahNumber":18,"VerseNumber":22,"Text":"سَيَقُولُونَ ثَلَٰثَةٞ رَّابِعُهُمۡ كَلۡبُهُمۡ وَيَقُولُونَ خَمۡسَةٞ سَادِسُهُمۡ كَلۡبُهُمۡ رَجۡمَۢا بِٱلۡغَيۡبِۖ وَيَقُولُونَ سَبۡعَةٞ وَثَامِنُهُمۡ كَلۡبُهُمۡۚ قُل رَّبِّيٓ أَعۡلَمُ بِعِدَّتِهِم مَّا يَعۡلَمُهُمۡ إِلَّا قَلِيلٞۗ فَلَا تُمَارِ فِيهِمۡ إِلَّا مِرَآءٗ ظَٰهِرٗا وَلَا تَسۡتَفۡتِ فِيهِم مِّنۡهُمۡ أَحَدٗا","End":"٢٢"},{"SurahNumber":18,"VerseNumber":23,"Text":"وَلَا تَقُولَنَّ لِشَاْيۡءٍ إِنِّي فَاعِلٞ ذَٰلِكَ غَدًا","End":"٢٣"},{"SurahNumber":18,"VerseNumber":24,"Text":"إِلَّآ أَن يَشَآءَ ٱللَّهُۚ وَٱذۡكُر رَّبَّكَ إِذَا نَسِيتَ وَقُلۡ عَسَىٰٓ أَن يَهۡدِيَنِ رَبِّي لِأَقۡرَبَ مِنۡ هَٰذَا رَشَدٗا","End":"٢٤"},{"SurahNumber":18,"VerseNumber":25,"Text":"وَلَبِثُواْ فِي كَهۡفِهِمۡ ثَلَٰثَ مِاْئَةٖ سِنِينَ وَٱزۡدَادُواْ تِسۡعٗا","End":"٢٥"},{"SurahNumber":18,"VerseNumber":26,"Text":"قُلِ ٱللَّهُ أَعۡلَمُ بِمَا لَبِثُواْۖ لَهُۥ غَيۡبُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ أَبۡصِرۡ بِهِۦ وَأَسۡمِعۡۚ مَا لَهُم مِّن دُونِهِۦ مِن وَلِيّٖ وَلَا يُشۡرِكُ فِي حُكۡمِهِۦٓ أَحَدٗا","End":"٢٦"},{"SurahNumber":18,"VerseNumber":27,"Text":"وَٱتۡلُ مَآ أُوحِيَ إِلَيۡكَ مِن كِتَابِ رَبِّكَۖ لَا مُبَدِّلَ لِكَلِمَٰتِهِۦ وَلَن تَجِدَ مِن دُونِهِۦ مُلۡتَحَدٗا","End":"٢٧"},{"SurahNumber":18,"VerseNumber":28,"Text":"وَٱصۡبِرۡ نَفۡسَكَ مَعَ ٱلَّذِينَ يَدۡعُونَ رَبَّهُم بِٱلۡغَدَوٰةِ وَٱلۡعَشِيِّ يُرِيدُونَ وَجۡهَهُۥۖ وَلَا تَعۡدُ عَيۡنَاكَ عَنۡهُمۡ تُرِيدُ زِينَةَ ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَلَا تُطِعۡ مَنۡ أَغۡفَلۡنَا قَلۡبَهُۥ عَن ذِكۡرِنَا وَٱتَّبَعَ هَوَىٰهُ وَكَانَ أَمۡرُهُۥ فُرُطٗا","End":"٢٨"},{"SurahNumber":18,"VerseNumber":29,"Text":"وَقُلِ ٱلۡحَقُّ مِن رَّبِّكُمۡۖ فَمَن شَآءَ فَلۡيُؤۡمِن وَمَن شَآءَ فَلۡيَكۡفُرۡۚ إِنَّآ أَعۡتَدۡنَا لِلظَّـٰلِمِينَ نَارًا أَحَاطَ بِهِمۡ سُرَادِقُهَاۚ وَإِن يَسۡتَغِيثُواْ يُغَاثُواْ بِمَآءٖ كَٱلۡمُهۡلِ يَشۡوِي ٱلۡوُجُوهَۚ بِئۡسَ ٱلشَّرَابُ وَسَآءَتۡ مُرۡتَفَقًا","End":"٢٩"},{"SurahNumber":18,"VerseNumber":30,"Text":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّـٰلِحَٰتِ إِنَّا لَا نُضِيعُ أَجۡرَ مَنۡ أَحۡسَنَ عَمَلًا","End":"٣٠"},{"SurahNumber":18,"VerseNumber":31,"Text":"أُوْلَـٰٓئِكَ لَهُمۡ جَنَّـٰتُ عَدۡنٖ تَجۡرِي مِن تَحۡتِهِمُ ٱلۡأَنۡهَٰرُ يُحَلَّوۡنَ فِيهَا مِنۡ أَسَاوِرَ مِن ذَهَبٖ وَيَلۡبَسُونَ ثِيَابًا خُضۡرٗا مِّن سُندُسٖ وَإِسۡتَبۡرَقٖ مُّتَّكِـِٔينَ فِيهَا عَلَى ٱلۡأَرَآئِكِۚ نِعۡمَ ٱلثَّوَابُ وَحَسُنَتۡ مُرۡتَفَقٗا","End":"٣١"},{"SurahNumber":18,"VerseNumber":32,"Text":"۞وَٱضۡرِبۡ لَهُم مَّثَلٗا رَّجُلَيۡنِ جَعَلۡنَا لِأَحَدِهِمَا جَنَّتَيۡنِ مِنۡ أَعۡنَٰبٖ وَحَفَفۡنَٰهُمَا بِنَخۡلٖ وَجَعَلۡنَا بَيۡنَهُمَا زَرۡعٗا","End":"٣٢"},{"SurahNumber":18,"VerseNumber":33,"Text":"كِلۡتَا ٱلۡجَنَّتَيۡنِ ءَاتَتۡ أُكُلَهَا وَلَمۡ تَظۡلِم مِّنۡهُ شَيۡـٔٗاۚ وَفَجَّرۡنَا خِلَٰلَهُمَا نَهَرٗا","End":"٣٣"},{"SurahNumber":18,"VerseNumber":34,"Text":"وَكَانَ لَهُۥ ثَمَرٞ فَقَالَ لِصَٰحِبِهِۦ وَهُوَ يُحَاوِرُهُۥٓ أَنَا۠ أَكۡثَرُ مِنكَ مَالٗا وَأَعَزُّ نَفَرٗا","End":"٣٤"},{"SurahNumber":18,"VerseNumber":35,"Text":"وَدَخَلَ جَنَّتَهُۥ وَهُوَ ظَالِمٞ لِّنَفۡسِهِۦ قَالَ مَآ أَظُنُّ أَن تَبِيدَ هَٰذِهِۦٓ أَبَدٗا","End":"٣٥"},{"SurahNumber":18,"VerseNumber":36,"Text":"وَمَآ أَظُنُّ ٱلسَّاعَةَ قَآئِمَةٗ وَلَئِن رُّدِدتُّ إِلَىٰ رَبِّي لَأَجِدَنَّ خَيۡرٗا مِّنۡهَا مُنقَلَبٗا","End":"٣٦"},{"SurahNumber":18,"VerseNumber":37,"Text":"قَالَ لَهُۥ صَاحِبُهُۥ وَهُوَ يُحَاوِرُهُۥٓ أَكَفَرۡتَ بِٱلَّذِي خَلَقَكَ مِن تُرَابٖ ثُمَّ مِن نُّطۡفَةٖ ثُمَّ سَوَّىٰكَ رَجُلٗا","End":"٣٧"},{"SurahNumber":18,"VerseNumber":38,"Text":"لَّـٰكِنَّا۠ هُوَ ٱللَّهُ رَبِّي وَلَآ أُشۡرِكُ بِرَبِّيٓ أَحَدٗا","End":"٣٨"},{"SurahNumber":18,"VerseNumber":39,"Text":"وَلَوۡلَآ إِذۡ دَخَلۡتَ جَنَّتَكَ قُلۡتَ مَا شَآءَ ٱللَّهُ لَا قُوَّةَ إِلَّا بِٱللَّهِۚ إِن تَرَنِ أَنَا۠ أَقَلَّ مِنكَ مَالٗا وَوَلَدٗا","End":"٣٩"},{"SurahNumber":18,"VerseNumber":40,"Text":"فَعَسَىٰ رَبِّيٓ أَن يُؤۡتِيَنِ خَيۡرٗا مِّن جَنَّتِكَ وَيُرۡسِلَ عَلَيۡهَا حُسۡبَانٗا مِّنَ ٱلسَّمَآءِ فَتُصۡبِحَ صَعِيدٗا زَلَقًا","End":"٤٠"},{"SurahNumber":18,"VerseNumber":41,"Text":"أَوۡ يُصۡبِحَ مَآؤُهَا غَوۡرٗا فَلَن تَسۡتَطِيعَ لَهُۥ طَلَبٗا","End":"٤١"},{"SurahNumber":18,"VerseNumber":42,"Text":"وَأُحِيطَ بِثَمَرِهِۦ فَأَصۡبَحَ يُقَلِّبُ كَفَّيۡهِ عَلَىٰ مَآ أَنفَقَ فِيهَا وَهِيَ خَاوِيَةٌ عَلَىٰ عُرُوشِهَا وَيَقُولُ يَٰلَيۡتَنِي لَمۡ أُشۡرِكۡ بِرَبِّيٓ أَحَدٗا","End":"٤٢"},{"SurahNumber":18,"VerseNumber":43,"Text":"وَلَمۡ تَكُن لَّهُۥ فِئَةٞ يَنصُرُونَهُۥ مِن دُونِ ٱللَّهِ وَمَا كَانَ مُنتَصِرًا","End":"٤٣"},{"SurahNumber":18,"VerseNumber":44,"Text":"هُنَالِكَ ٱلۡوَلَٰيَةُ لِلَّهِ ٱلۡحَقِّۚ هُوَ خَيۡرٞ ثَوَابٗا وَخَيۡرٌ عُقۡبٗا","End":"٤٤"},{"SurahNumber":18,"VerseNumber":45,"Text":"وَٱضۡرِبۡ لَهُم مَّثَلَ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا كَمَآءٍ أَنزَلۡنَٰهُ مِنَ ٱلسَّمَآءِ فَٱخۡتَلَطَ بِهِۦ نَبَاتُ ٱلۡأَرۡضِ فَأَصۡبَحَ هَشِيمٗا تَذۡرُوهُ ٱلرِّيَٰحُۗ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ مُّقۡتَدِرًا","End":"٤٥"},{"SurahNumber":18,"VerseNumber":46,"Text":"ٱلۡمَالُ وَٱلۡبَنُونَ زِينَةُ ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَٱلۡبَٰقِيَٰتُ ٱلصَّـٰلِحَٰتُ خَيۡرٌ عِندَ رَبِّكَ ثَوَابٗا وَخَيۡرٌ أَمَلٗا","End":"٤٦"},{"SurahNumber":18,"VerseNumber":47,"Text":"وَيَوۡمَ نُسَيِّرُ ٱلۡجِبَالَ وَتَرَى ٱلۡأَرۡضَ بَارِزَةٗ وَحَشَرۡنَٰهُمۡ فَلَمۡ نُغَادِرۡ مِنۡهُمۡ أَحَدٗا","End":"٤٧"},{"SurahNumber":18,"VerseNumber":48,"Text":"وَعُرِضُواْ عَلَىٰ رَبِّكَ صَفّٗا لَّقَدۡ جِئۡتُمُونَا كَمَا خَلَقۡنَٰكُمۡ أَوَّلَ مَرَّةِۭۚ بَلۡ زَعَمۡتُمۡ أَلَّن نَّجۡعَلَ لَكُم مَّوۡعِدٗا","End":"٤٨"},{"SurahNumber":18,"VerseNumber":49,"Text":"وَوُضِعَ ٱلۡكِتَٰبُ فَتَرَى ٱلۡمُجۡرِمِينَ مُشۡفِقِينَ مِمَّا فِيهِ وَيَقُولُونَ يَٰوَيۡلَتَنَا مَالِ هَٰذَا ٱلۡكِتَٰبِ لَا يُغَادِرُ صَغِيرَةٗ وَلَا كَبِيرَةً إِلَّآ أَحۡصَىٰهَاۚ وَوَجَدُواْ مَا عَمِلُواْ حَاضِرٗاۗ وَلَا يَظۡلِمُ رَبُّكَ أَحَدٗا","End":"٤٩"},{"SurahNumber":18,"VerseNumber":50,"Text":"وَإِذۡ قُلۡنَا لِلۡمَلَـٰٓئِكَةِ ٱسۡجُدُواْ لِأٓدَمَ فَسَجَدُوٓاْ إِلَّآ إِبۡلِيسَ كَانَ مِنَ ٱلۡجِنِّ فَفَسَقَ عَنۡ أَمۡرِ رَبِّهِۦٓۗ أَفَتَتَّخِذُونَهُۥ وَذُرِّيَّتَهُۥٓ أَوۡلِيَآءَ مِن دُونِي وَهُمۡ لَكُمۡ عَدُوُّۢۚ بِئۡسَ لِلظَّـٰلِمِينَ بَدَلٗا","End":"٥٠"},{"SurahNumber":18,"VerseNumber":51,"Text":"۞مَّآ أَشۡهَدتُّهُمۡ خَلۡقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَلَا خَلۡقَ أَنفُسِهِمۡ وَمَا كُنتُ مُتَّخِذَ ٱلۡمُضِلِّينَ عَضُدٗا","End":"٥١"},{"SurahNumber":18,"VerseNumber":52,"Text":"وَيَوۡمَ يَقُولُ نَادُواْ شُرَكَآءِيَ ٱلَّذِينَ زَعَمۡتُمۡ فَدَعَوۡهُمۡ فَلَمۡ يَسۡتَجِيبُواْ لَهُمۡ وَجَعَلۡنَا بَيۡنَهُم مَّوۡبِقٗا","End":"٥٢"},{"SurahNumber":18,"VerseNumber":53,"Text":"وَرَءَا ٱلۡمُجۡرِمُونَ ٱلنَّارَ فَظَنُّوٓاْ أَنَّهُم مُّوَاقِعُوهَا وَلَمۡ يَجِدُواْ عَنۡهَا مَصۡرِفٗا","End":"٥٣"},{"SurahNumber":18,"VerseNumber":54,"Text":"وَلَقَدۡ صَرَّفۡنَا فِي هَٰذَا ٱلۡقُرۡءَانِ لِلنَّاسِ مِن كُلِّ مَثَلٖۚ وَكَانَ ٱلۡإِنسَٰنُ أَكۡثَرَ شَيۡءٖ جَدَلٗا","End":"٥٤"},{"SurahNumber":18,"VerseNumber":55,"Text":"وَمَا مَنَعَ ٱلنَّاسَ أَن يُؤۡمِنُوٓاْ إِذۡ جَآءَهُمُ ٱلۡهُدَىٰ وَيَسۡتَغۡفِرُواْ رَبَّهُمۡ إِلَّآ أَن تَأۡتِيَهُمۡ سُنَّةُ ٱلۡأَوَّلِينَ أَوۡ يَأۡتِيَهُمُ ٱلۡعَذَابُ قُبُلٗا","End":"٥٥"},{"SurahNumber":18,"VerseNumber":56,"Text":"وَمَا نُرۡسِلُ ٱلۡمُرۡسَلِينَ إِلَّا مُبَشِّرِينَ وَمُنذِرِينَۚ وَيُجَٰدِلُ ٱلَّذِينَ كَفَرُواْ بِٱلۡبَٰطِلِ لِيُدۡحِضُواْ بِهِ ٱلۡحَقَّۖ وَٱتَّخَذُوٓاْ ءَايَٰتِي وَمَآ أُنذِرُواْ هُزُوٗا","End":"٥٦"},{"SurahNumber":18,"VerseNumber":57,"Text":"وَمَنۡ أَظۡلَمُ مِمَّن ذُكِّرَ بِـَٔايَٰتِ رَبِّهِۦ فَأَعۡرَضَ عَنۡهَا وَنَسِيَ مَا قَدَّمَتۡ يَدَاهُۚ إِنَّا جَعَلۡنَا عَلَىٰ قُلُوبِهِمۡ أَكِنَّةً أَن يَفۡقَهُوهُ وَفِيٓ ءَاذَانِهِمۡ وَقۡرٗاۖ وَإِن تَدۡعُهُمۡ إِلَى ٱلۡهُدَىٰ فَلَن يَهۡتَدُوٓاْ إِذًا أَبَدٗا","End":"٥٧"},{"SurahNumber":18,"VerseNumber":58,"Text":"وَرَبُّكَ ٱلۡغَفُورُ ذُو ٱلرَّحۡمَةِۖ لَوۡ يُؤَاخِذُهُم بِمَا كَسَبُواْ لَعَجَّلَ لَهُمُ ٱلۡعَذَابَۚ بَل لَّهُم مَّوۡعِدٞ لَّن يَجِدُواْ مِن دُونِهِۦ مَوۡئِلٗا","End":"٥٨"},{"SurahNumber":18,"VerseNumber":59,"Text":"وَتِلۡكَ ٱلۡقُرَىٰٓ أَهۡلَكۡنَٰهُمۡ لَمَّا ظَلَمُواْ وَجَعَلۡنَا لِمَهۡلِكِهِم مَّوۡعِدٗا","End":"٥٩"},{"SurahNumber":18,"VerseNumber":60,"Text":"وَإِذۡ قَالَ مُوسَىٰ لِفَتَىٰهُ لَآ أَبۡرَحُ حَتَّىٰٓ أَبۡلُغَ مَجۡمَعَ ٱلۡبَحۡرَيۡنِ أَوۡ أَمۡضِيَ حُقُبٗا","End":"٦٠"},{"SurahNumber":18,"VerseNumber":61,"Text":"فَلَمَّا بَلَغَا مَجۡمَعَ بَيۡنِهِمَا نَسِيَا حُوتَهُمَا فَٱتَّخَذَ سَبِيلَهُۥ فِي ٱلۡبَحۡرِ سَرَبٗا","End":"٦١"},{"SurahNumber":18,"VerseNumber":62,"Text":"فَلَمَّا جَاوَزَا قَالَ لِفَتَىٰهُ ءَاتِنَا غَدَآءَنَا لَقَدۡ لَقِينَا مِن سَفَرِنَا هَٰذَا نَصَبٗا","End":"٦٢"},{"SurahNumber":18,"VerseNumber":63,"Text":"قَالَ أَرَءَيۡتَ إِذۡ أَوَيۡنَآ إِلَى ٱلصَّخۡرَةِ فَإِنِّي نَسِيتُ ٱلۡحُوتَ وَمَآ أَنسَىٰنِيهُ إِلَّا ٱلشَّيۡطَٰنُ أَنۡ أَذۡكُرَهُۥۚ وَٱتَّخَذَ سَبِيلَهُۥ فِي ٱلۡبَحۡرِ عَجَبٗا","End":"٦٣"},{"SurahNumber":18,"VerseNumber":64,"Text":"قَالَ ذَٰلِكَ مَا كُنَّا نَبۡغِۚ فَٱرۡتَدَّا عَلَىٰٓ ءَاثَارِهِمَا قَصَصٗا","End":"٦٤"},{"SurahNumber":18,"VerseNumber":65,"Text":"فَوَجَدَا عَبۡدٗا مِّنۡ عِبَادِنَآ ءَاتَيۡنَٰهُ رَحۡمَةٗ مِّنۡ عِندِنَا وَعَلَّمۡنَٰهُ مِن لَّدُنَّا عِلۡمٗا","End":"٦٥"},{"SurahNumber":18,"VerseNumber":66,"Text":"قَالَ لَهُۥ مُوسَىٰ هَلۡ أَتَّبِعُكَ عَلَىٰٓ أَن تُعَلِّمَنِ مِمَّا عُلِّمۡتَ رُشۡدٗا","End":"٦٦"},{"SurahNumber":18,"VerseNumber":67,"Text":"قَالَ إِنَّكَ لَن تَسۡتَطِيعَ مَعِيَ صَبۡرٗا","End":"٦٧"},{"SurahNumber":18,"VerseNumber":68,"Text":"وَكَيۡفَ تَصۡبِرُ عَلَىٰ مَا لَمۡ تُحِطۡ بِهِۦ خُبۡرٗا","End":"٦٨"},{"SurahNumber":18,"VerseNumber":69,"Text":"قَالَ سَتَجِدُنِيٓ إِن شَآءَ ٱللَّهُ صَابِرٗا وَلَآ أَعۡصِي لَكَ أَمۡرٗا","End":"٦٩"},{"SurahNumber":18,"VerseNumber":70,"Text":"قَالَ فَإِنِ ٱتَّبَعۡتَنِي فَلَا تَسۡـَٔلۡنِي عَن شَيۡءٍ حَتَّىٰٓ أُحۡدِثَ لَكَ مِنۡهُ ذِكۡرٗا","End":"٧٠"},{"SurahNumber":18,"VerseNumber":71,"Text":"فَٱنطَلَقَا حَتَّىٰٓ إِذَا رَكِبَا فِي ٱلسَّفِينَةِ خَرَقَهَاۖ قَالَ أَخَرَقۡتَهَا لِتُغۡرِقَ أَهۡلَهَا لَقَدۡ جِئۡتَ شَيۡـًٔا إِمۡرٗا","End":"٧١"},{"SurahNumber":18,"VerseNumber":72,"Text":"قَالَ أَلَمۡ أَقُلۡ إِنَّكَ لَن تَسۡتَطِيعَ مَعِيَ صَبۡرٗا","End":"٧٢"},{"SurahNumber":18,"VerseNumber":73,"Text":"قَالَ لَا تُؤَاخِذۡنِي بِمَا نَسِيتُ وَلَا تُرۡهِقۡنِي مِنۡ أَمۡرِي عُسۡرٗا","End":"٧٣"},{"SurahNumber":18,"VerseNumber":74,"Text":"فَٱنطَلَقَا حَتَّىٰٓ إِذَا لَقِيَا غُلَٰمٗا فَقَتَلَهُۥ قَالَ أَقَتَلۡتَ نَفۡسٗا زَكِيَّةَۢ بِغَيۡرِ نَفۡسٖ لَّقَدۡ جِئۡتَ شَيۡـٔٗا نُّكۡرٗا","End":"٧٤"},{"SurahNumber":18,"VerseNumber":75,"Text":"۞قَالَ أَلَمۡ أَقُل لَّكَ إِنَّكَ لَن تَسۡتَطِيعَ مَعِيَ صَبۡرٗا","End":"٧٥"},{"SurahNumber":18,"VerseNumber":76,"Text":"قَالَ إِن سَأَلۡتُكَ عَن شَيۡءِۭ بَعۡدَهَا فَلَا تُصَٰحِبۡنِيۖ قَدۡ بَلَغۡتَ مِن لَّدُنِّي عُذۡرٗا","End":"٧٦"},{"SurahNumber":18,"VerseNumber":77,"Text":"فَٱنطَلَقَا حَتَّىٰٓ إِذَآ أَتَيَآ أَهۡلَ قَرۡيَةٍ ٱسۡتَطۡعَمَآ أَهۡلَهَا فَأَبَوۡاْ أَن يُضَيِّفُوهُمَا فَوَجَدَا فِيهَا جِدَارٗا يُرِيدُ أَن يَنقَضَّ فَأَقَامَهُۥۖ قَالَ لَوۡ شِئۡتَ لَتَّخَذۡتَ عَلَيۡهِ أَجۡرٗا","End":"٧٧"},{"SurahNumber":18,"VerseNumber":78,"Text":"قَالَ هَٰذَا فِرَاقُ بَيۡنِي وَبَيۡنِكَۚ سَأُنَبِّئُكَ بِتَأۡوِيلِ مَا لَمۡ تَسۡتَطِع عَّلَيۡهِ صَبۡرًا","End":"٧٨"},{"SurahNumber":18,"VerseNumber":79,"Text":"أَمَّا ٱلسَّفِينَةُ فَكَانَتۡ لِمَسَٰكِينَ يَعۡمَلُونَ فِي ٱلۡبَحۡرِ فَأَرَدتُّ أَنۡ أَعِيبَهَا وَكَانَ وَرَآءَهُم مَّلِكٞ يَأۡخُذُ كُلَّ سَفِينَةٍ غَصۡبٗا","End":"٧٩"},{"SurahNumber":18,"VerseNumber":80,"Text":"وَأَمَّا ٱلۡغُلَٰمُ فَكَانَ أَبَوَاهُ مُؤۡمِنَيۡنِ فَخَشِينَآ أَن يُرۡهِقَهُمَا طُغۡيَٰنٗا وَكُفۡرٗا","End":"٨٠"},{"SurahNumber":18,"VerseNumber":81,"Text":"فَأَرَدۡنَآ أَن يُبۡدِلَهُمَا رَبُّهُمَا خَيۡرٗا مِّنۡهُ زَكَوٰةٗ وَأَقۡرَبَ رُحۡمٗا","End":"٨١"},{"SurahNumber":18,"VerseNumber":82,"Text":"وَأَمَّا ٱلۡجِدَارُ فَكَانَ لِغُلَٰمَيۡنِ يَتِيمَيۡنِ فِي ٱلۡمَدِينَةِ وَكَانَ تَحۡتَهُۥ كَنزٞ لَّهُمَا وَكَانَ أَبُوهُمَا صَٰلِحٗا فَأَرَادَ رَبُّكَ أَن يَبۡلُغَآ أَشُدَّهُمَا وَيَسۡتَخۡرِجَا كَنزَهُمَا رَحۡمَةٗ مِّن رَّبِّكَۚ وَمَا فَعَلۡتُهُۥ عَنۡ أَمۡرِيۚ ذَٰلِكَ تَأۡوِيلُ مَا لَمۡ تَسۡطِع عَّلَيۡهِ صَبۡرٗا","End":"٨٢"},{"SurahNumber":18,"VerseNumber":83,"Text":"وَيَسۡـَٔلُونَكَ عَن ذِي ٱلۡقَرۡنَيۡنِۖ قُلۡ سَأَتۡلُواْ عَلَيۡكُم مِّنۡهُ ذِكۡرًا","End":"٨٣"},{"SurahNumber":18,"VerseNumber":84,"Text":"إِنَّا مَكَّنَّا لَهُۥ فِي ٱلۡأَرۡضِ وَءَاتَيۡنَٰهُ مِن كُلِّ شَيۡءٖ سَبَبٗا","End":"٨٤"},{"SurahNumber":18,"VerseNumber":85,"Text":"فَأَتۡبَعَ سَبَبًا","End":"٨٥"},{"SurahNumber":18,"VerseNumber":86,"Text":"حَتَّىٰٓ إِذَا بَلَغَ مَغۡرِبَ ٱلشَّمۡسِ وَجَدَهَا تَغۡرُبُ فِي عَيۡنٍ حَمِئَةٖ وَوَجَدَ عِندَهَا قَوۡمٗاۖ قُلۡنَا يَٰذَا ٱلۡقَرۡنَيۡنِ إِمَّآ أَن تُعَذِّبَ وَإِمَّآ أَن تَتَّخِذَ فِيهِمۡ حُسۡنٗا","End":"٨٦"},{"SurahNumber":18,"VerseNumber":87,"Text":"قَالَ أَمَّا مَن ظَلَمَ فَسَوۡفَ نُعَذِّبُهُۥ ثُمَّ يُرَدُّ إِلَىٰ رَبِّهِۦ فَيُعَذِّبُهُۥ عَذَابٗا نُّكۡرٗا","End":"٨٧"},{"SurahNumber":18,"VerseNumber":88,"Text":"وَأَمَّا مَنۡ ءَامَنَ وَعَمِلَ صَٰلِحٗا فَلَهُۥ جَزَآءً ٱلۡحُسۡنَىٰۖ وَسَنَقُولُ لَهُۥ مِنۡ أَمۡرِنَا يُسۡرٗا","End":"٨٨"},{"SurahNumber":18,"VerseNumber":89,"Text":"ثُمَّ أَتۡبَعَ سَبَبًا","End":"٨٩"},{"SurahNumber":18,"VerseNumber":90,"Text":"حَتَّىٰٓ إِذَا بَلَغَ مَطۡلِعَ ٱلشَّمۡسِ وَجَدَهَا تَطۡلُعُ عَلَىٰ قَوۡمٖ لَّمۡ نَجۡعَل لَّهُم مِّن دُونِهَا سِتۡرٗا","End":"٩٠"},{"SurahNumber":18,"VerseNumber":91,"Text":"كَذَٰلِكَۖ وَقَدۡ أَحَطۡنَا بِمَا لَدَيۡهِ خُبۡرٗا","End":"٩١"},{"SurahNumber":18,"VerseNumber":92,"Text":"ثُمَّ أَتۡبَعَ سَبَبًا","End":"٩٢"},{"SurahNumber":18,"VerseNumber":93,"Text":"حَتَّىٰٓ إِذَا بَلَغَ بَيۡنَ ٱلسَّدَّيۡنِ وَجَدَ مِن دُونِهِمَا قَوۡمٗا لَّا يَكَادُونَ يَفۡقَهُونَ قَوۡلٗا","End":"٩٣"},{"SurahNumber":18,"VerseNumber":94,"Text":"قَالُواْ يَٰذَا ٱلۡقَرۡنَيۡنِ إِنَّ يَأۡجُوجَ وَمَأۡجُوجَ مُفۡسِدُونَ فِي ٱلۡأَرۡضِ فَهَلۡ نَجۡعَلُ لَكَ خَرۡجًا عَلَىٰٓ أَن تَجۡعَلَ بَيۡنَنَا وَبَيۡنَهُمۡ سَدّٗا","End":"٩٤"},{"SurahNumber":18,"VerseNumber":95,"Text":"قَالَ مَا مَكَّنِّي فِيهِ رَبِّي خَيۡرٞ فَأَعِينُونِي بِقُوَّةٍ أَجۡعَلۡ بَيۡنَكُمۡ وَبَيۡنَهُمۡ رَدۡمًا","End":"٩٥"},{"SurahNumber":18,"VerseNumber":96,"Text":"ءَاتُونِي زُبَرَ ٱلۡحَدِيدِۖ حَتَّىٰٓ إِذَا سَاوَىٰ بَيۡنَ ٱلصَّدَفَيۡنِ قَالَ ٱنفُخُواْۖ حَتَّىٰٓ إِذَا جَعَلَهُۥ نَارٗا قَالَ ءَاتُونِيٓ أُفۡرِغۡ عَلَيۡهِ قِطۡرٗا","End":"٩٦"},{"SurahNumber":18,"VerseNumber":97,"Text":"فَمَا ٱسۡطَٰعُوٓاْ أَن يَظۡهَرُوهُ وَمَا ٱسۡتَطَٰعُواْ لَهُۥ نَقۡبٗا","End":"٩٧"},{"SurahNumber":18,"VerseNumber":98,"Text":"قَالَ هَٰذَا رَحۡمَةٞ مِّن رَّبِّيۖ فَإِذَا جَآءَ وَعۡدُ رَبِّي جَعَلَهُۥ دَكَّآءَۖ وَكَانَ وَعۡدُ رَبِّي حَقّٗا","End":"٩٨"},{"SurahNumber":18,"VerseNumber":99,"Text":"۞وَتَرَكۡنَا بَعۡضَهُمۡ يَوۡمَئِذٖ يَمُوجُ فِي بَعۡضٖۖ وَنُفِخَ فِي ٱلصُّورِ فَجَمَعۡنَٰهُمۡ جَمۡعٗا","End":"٩٩"},{"SurahNumber":18,"VerseNumber":100,"Text":"وَعَرَضۡنَا جَهَنَّمَ يَوۡمَئِذٖ لِّلۡكَٰفِرِينَ عَرۡضًا","End":"١٠٠"},{"SurahNumber":18,"VerseNumber":101,"Text":"ٱلَّذِينَ كَانَتۡ أَعۡيُنُهُمۡ فِي غِطَآءٍ عَن ذِكۡرِي وَكَانُواْ لَا يَسۡتَطِيعُونَ سَمۡعًا","End":"١٠١"},{"SurahNumber":18,"VerseNumber":102,"Text":"أَفَحَسِبَ ٱلَّذِينَ كَفَرُوٓاْ أَن يَتَّخِذُواْ عِبَادِي مِن دُونِيٓ أَوۡلِيَآءَۚ إِنَّآ أَعۡتَدۡنَا جَهَنَّمَ لِلۡكَٰفِرِينَ نُزُلٗا","End":"١٠٢"},{"SurahNumber":18,"VerseNumber":103,"Text":"قُلۡ هَلۡ نُنَبِّئُكُم بِٱلۡأَخۡسَرِينَ أَعۡمَٰلًا","End":"١٠٣"},{"SurahNumber":18,"VerseNumber":104,"Text":"ٱلَّذِينَ ضَلَّ سَعۡيُهُمۡ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَهُمۡ يَحۡسَبُونَ أَنَّهُمۡ يُحۡسِنُونَ صُنۡعًا","End":"١٠٤"},{"SurahNumber":18,"VerseNumber":105,"Text":"أُوْلَـٰٓئِكَ ٱلَّذِينَ كَفَرُواْ بِـَٔايَٰتِ رَبِّهِمۡ وَلِقَآئِهِۦ فَحَبِطَتۡ أَعۡمَٰلُهُمۡ فَلَا نُقِيمُ لَهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ وَزۡنٗا","End":"١٠٥"},{"SurahNumber":18,"VerseNumber":106,"Text":"ذَٰلِكَ جَزَآؤُهُمۡ جَهَنَّمُ بِمَا كَفَرُواْ وَٱتَّخَذُوٓاْ ءَايَٰتِي وَرُسُلِي هُزُوًا","End":"١٠٦"},{"SurahNumber":18,"VerseNumber":107,"Text":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّـٰلِحَٰتِ كَانَتۡ لَهُمۡ جَنَّـٰتُ ٱلۡفِرۡدَوۡسِ نُزُلًا","End":"١٠٧"},{"SurahNumber":18,"VerseNumber":108,"Text":"خَٰلِدِينَ فِيهَا لَا يَبۡغُونَ عَنۡهَا حِوَلٗا","End":"١٠٨"},{"SurahNumber":18,"VerseNumber":109,"Text":"قُل لَّوۡ كَانَ ٱلۡبَحۡرُ مِدَادٗا لِّكَلِمَٰتِ رَبِّي لَنَفِدَ ٱلۡبَحۡرُ قَبۡلَ أَن تَنفَدَ كَلِمَٰتُ رَبِّي وَلَوۡ جِئۡنَا بِمِثۡلِهِۦ مَدَدٗا","End":"١٠٩"},{"SurahNumber":18,"VerseNumber":110,"Text":"قُلۡ إِنَّمَآ أَنَا۠ بَشَرٞ مِّثۡلُكُمۡ يُوحَىٰٓ إِلَيَّ أَنَّمَآ إِلَٰهُكُمۡ إِلَٰهٞ وَٰحِدٞۖ فَمَن كَانَ يَرۡجُواْ لِقَآءَ رَبِّهِۦ فَلۡيَعۡمَلۡ عَمَلٗا صَٰلِحٗا وَلَا يُشۡرِكۡ بِعِبَادَةِ رَبِّهِۦٓ أَحَدَۢا","End":"١١٠"}],"Translations":[{"LanguageCode":"ara","Language":"Arabic","Name":"ara-quran-la","Author":"Quran Transliteration","Source":"http://tanzil.net","Direction":"ltr","Translations":[{"SurahNumber":18,"VerseNumber":1,"Text":"Alhamdu lillahi allathee anzala AAala AAabdihi alkitaba walam yajAAal lahu AAiwajan"},{"SurahNumber":18,"VerseNumber":2,"Text":"Qayyiman liyunthira basan shadeedan min ladunhu wayubashshira almumineena allatheena yaAAmaloona alssalihati anna lahum ajran hasanan"},{"SurahNumber":18,"VerseNumber":3,"Text":"Makitheena feehi abadan"},{"SurahNumber":18,"VerseNumber":4,"Text":"Wayunthira allatheena qaloo ittakhatha Allahu waladan"},{"SurahNumber":18,"VerseNumber":5,"Text":"Ma lahum bihi min AAilmin wala liabaihim kaburat kalimatan takhruju min afwahihim in yaqooloona illa kathiban"},{"SurahNumber":18,"VerseNumber":6,"Text":"FalaAAallaka bakhiAAun nafsaka AAala atharihim in lam yuminoo bihatha alhadeethi asafan"},{"SurahNumber":18,"VerseNumber":7,"Text":"Inna jaAAalna ma AAala alardi zeenatan laha linabluwahum ayyuhum ahsanu AAamalan"},{"SurahNumber":18,"VerseNumber":8,"Text":"Wainna lajaAAiloona ma AAalayha saAAeedan juruzan"},{"SurahNumber":18,"VerseNumber":9,"Text":"Am hasibta anna ashaba alkahfi waalrraqeemi kanoo min ayatina AAajaban"},{"SurahNumber":18,"VerseNumber":10,"Text":"Ith awa alfityatu ila alkahfi faqaloo rabbana atina min ladunka rahmatan wahayyi lana min amrina rashadan"},{"SurahNumber":18,"VerseNumber":11,"Text":"Fadarabna AAala athanihim fee alkahfi sineena AAadadan"},{"SurahNumber":18,"VerseNumber":12,"Text":"Thumma baAAathnahum linaAAlama ayyu alhizbayni ahsa lima labithoo amadan"},{"SurahNumber":18,"VerseNumber":13,"Text":"Nahnu naqussu AAalayka nabaahum bialhaqqi innahum fityatun amanoo birabbihim wazidnahum hudan"},{"SurahNumber":18,"VerseNumber":14,"Text":"Warabatna AAala quloobihim ith qamoo faqaloo rabbuna rabbu alssamawati waalardi lan nadAAuwa min doonihi ilahan laqad qulna ithan shatatan"},{"SurahNumber":18,"VerseNumber":15,"Text":"Haolai qawmuna ittakhathoo min doonihi alihatan lawla yatoona AAalayhim bisultanin bayyinin faman athlamu mimmani iftara AAala Allahi kathiban"},{"SurahNumber":18,"VerseNumber":16,"Text":"Waithi iAAtazaltumoohum wama yaAAbudoona illa Allaha fawoo ila alkahfi yanshur lakum rabbukum min rahmatihi wayuhayyi lakum min amrikum mirfaqan"},{"SurahNumber":18,"VerseNumber":17,"Text":"Watara alshshamsa itha talaAAat tazawaru AAan kahfihim thata alyameeni waitha gharabat taqriduhum thata alshshimali wahum fee fajwatin minhu thalika min ayati Allahi man yahdi Allahu fahuwa almuhtadi waman yudlil falan tajida lahu waliyyan murshidan"},{"SurahNumber":18,"VerseNumber":18,"Text":"Watahsabuhum ayqathan wahum ruqoodun wanuqallibuhum thata alyameeni wathata alshshimali wakalbuhum basitun thiraAAayhi bialwaseedi lawi ittalaAAta AAalayhim lawallayta minhum firaran walamulita minhum ruAAban"},{"SurahNumber":18,"VerseNumber":19,"Text":"Wakathalika baAAathnahum liyatasaaloo baynahum qala qailun minhum kam labithtum qaloo labithna yawman aw baAAda yawmin qaloo rabbukum aAAlamu bima labithtum faibAAathoo ahadakum biwariqikum hathihi ila almadeenati falyanthur ayyuha azka taAAaman falyatikum birizqin minhu walyatalattaf wala yushAAiranna bikum ahadan"},{"SurahNumber":18,"VerseNumber":20,"Text":"Innahum in yathharoo AAalaykum yarjumookum aw yuAAeedookum fee millatihim walan tuflihoo ithan abadan"},{"SurahNumber":18,"VerseNumber":21,"Text":"Wakathalika aAAtharna AAalayhim liyaAAlamoo anna waAAda Allahi haqqun waanna alsaAAata la rayba feeha ith yatanazaAAoona baynahum amrahum faqaloo ibnoo AAalayhim bunyanan rabbuhum aAAlamu bihim qala allatheena ghalaboo AAala amrihim lanattakhithanna AAalayhim masjidan"},{"SurahNumber":18,"VerseNumber":22,"Text":"Sayaqooloona thalathatun rabiAAuhum kalbuhum wayaqooloona khamsatun sadisuhum kalbuhum rajman bialghaybi wayaqooloona sabAAatun wathaminuhum kalbuhum qul rabbee aAAlamu biAAiddatihim ma yaAAlamuhum illa qaleelun fala tumari feehim illa miraan thahiran wala tastafti feehim minhum ahadan"},{"SurahNumber":18,"VerseNumber":23,"Text":"Wala taqoolanna lishayin innee faAAilun thalika ghadan"},{"SurahNumber":18,"VerseNumber":24,"Text":"Illa an yashaa Allahu waothkur rabbaka itha naseeta waqul AAasa an yahdiyani rabbee liaqraba min hatha rashadan"},{"SurahNumber":18,"VerseNumber":25,"Text":"Walabithoo fee kahfihim thalatha miatin sineena waizdadoo tisAAan"},{"SurahNumber":18,"VerseNumber":26,"Text":"Quli Allahu aAAlamu bima labithoo lahu ghaybu alssamawati waalardi absir bihi waasmiAA ma lahum min doonihi min waliyyin wala yushriku fee hukmihi ahadan"},{"SurahNumber":18,"VerseNumber":27,"Text":"Waotlu ma oohiya ilayka min kitabi rabbika la mubaddila likalimatihi walan tajida min doonihi multahadan"},{"SurahNumber":18,"VerseNumber":28,"Text":"Waisbir nafsaka maAAa allatheena yadAAoona rabbahum bialghadati waalAAashiyyi yureedoona wajhahu wala taAAdu AAaynaka AAanhum tureedu zeenata alhayati alddunya wala tutiAA man aghfalna qalbahu AAan thikrina waittabaAAa hawahu wakana amruhu furutan"},{"SurahNumber":18,"VerseNumber":29,"Text":"Waquli alhaqqu min rabbikum faman shaa falyumin waman shaa falyakfur inna aAAtadna lilththalimeena naran ahata bihim suradiquha wain yastagheethoo yughathoo bimain kaalmuhli yashwee alwujooha bisa alshsharabu wasaat murtafaqan"},{"SurahNumber":18,"VerseNumber":30,"Text":"Inna allatheena amanoo waAAamiloo alssalihati inna la nudeeAAu ajra man ahsana AAamalan"},{"SurahNumber":18,"VerseNumber":31,"Text":"Olaika lahum jannatu AAadnin tajree min tahtihimu alanharu yuhallawna feeha min asawira min thahabin wayalbasoona thiyaban khudran min sundusin waistabraqin muttakieena feeha AAala alaraiki niAAma alththawabu wahasunat murtafaqan"},{"SurahNumber":18,"VerseNumber":32,"Text":"Waidrib lahum mathalan rajulayni jaAAalna liahadihima jannatayni min aAAnabin wahafafnahuma binakhlin wajaAAalna baynahuma zarAAan"},{"SurahNumber":18,"VerseNumber":33,"Text":"Kilta aljannatayni atat okulaha walam tathlim minhu shayan wafajjarna khilalahuma naharan"},{"SurahNumber":18,"VerseNumber":34,"Text":"Wakana lahu thamarun faqala lisahibihi wahuwa yuhawiruhu ana aktharu minka malan waaAAazzu nafaran"},{"SurahNumber":18,"VerseNumber":35,"Text":"Wadakhala jannatahu wahuwa thalimun linafsihi qala ma athunnu an tabeeda hathihi abadan"},{"SurahNumber":18,"VerseNumber":36,"Text":"Wama athunnu alssaAAata qaimatan walain rudidtu ila rabbee laajidanna khayran minha munqalaban"},{"SurahNumber":18,"VerseNumber":37,"Text":"Qala lahu sahibuhu wahuwa yuhawiruhu akafarta biallathee khalaqaka min turabin thumma min nutfatin thumma sawwaka rajulan"},{"SurahNumber":18,"VerseNumber":38,"Text":"Lakinna huwa Allahu rabbee wala oshriku birabbee ahadan"},{"SurahNumber":18,"VerseNumber":39,"Text":"Walawla ith dakhalta jannataka qulta ma shaa Allahu la quwwata illa biAllahi in tarani ana aqalla minka malan wawaladan"},{"SurahNumber":18,"VerseNumber":40,"Text":"FaAAasa rabbee an yutiyani khayran min jannatika wayursila AAalayha husbanan mina alssamai fatusbiha saAAeedan zalaqan"},{"SurahNumber":18,"VerseNumber":41,"Text":"Aw yusbiha maoha ghawran falan tastateeAAa lahu talaban"},{"SurahNumber":18,"VerseNumber":42,"Text":"Waoheeta bithamarihi faasbaha yuqallibu kaffayhi AAala ma anfaqa feeha wahiya khawiyatun AAala AAurooshiha wayaqoolu ya laytanee lam oshrik birabbee ahadan"},{"SurahNumber":18,"VerseNumber":43,"Text":"Walam takun lahu fiatun yansuroonahu min dooni Allahi wama kana muntasiran"},{"SurahNumber":18,"VerseNumber":44,"Text":"Hunalika alwalayatu lillahi alhaqqi huwa khayrun thawaban wakhayrun AAuqban"},{"SurahNumber":18,"VerseNumber":45,"Text":"Waidrib lahum mathala alhayati alddunya kamain anzalnahu mina alssamai faikhtalata bihi nabatu alardi faasbaha hasheeman tathroohu alrriyahu wakana Allahu AAala kulli shayin muqtadiran"},{"SurahNumber":18,"VerseNumber":46,"Text":"Almalu waalbanoona zeenatu alhayati alddunya waalbaqiyatu alssalihatu khayrun AAinda rabbika thawaban wakhayrun amalan"},{"SurahNumber":18,"VerseNumber":47,"Text":"Wayawma nusayyiru aljibala watara alarda barizatan wahasharnahum falam nughadir minhum ahadan"},{"SurahNumber":18,"VerseNumber":48,"Text":"WaAAuridoo AAala rabbika saffan laqad jitumoona kama khalaqnakum awwala marratin bal zaAAamtum allan najAAala lakum mawAAidan"},{"SurahNumber":18,"VerseNumber":49,"Text":"WawudiAAa alkitabu fatara almujrimeena mushfiqeena mimma feehi wayaqooloona ya waylatana ma lihatha alkitabi la yughadiru sagheeratan wala kabeeratan illa ahsaha wawajadoo ma AAamiloo hadiran wala yathlimu rabbuka ahadan"},{"SurahNumber":18,"VerseNumber":50,"Text":"Waith qulna lilmalaikati osjudoo liadama fasajadoo illa ibleesa kana mina aljinni fafasaqa AAan amri rabbihi afatattakhithoonahu wathurriyyatahu awliyaa min doonee wahum lakum AAaduwwun bisa lilththalimeena badalan"},{"SurahNumber":18,"VerseNumber":51,"Text":"Ma ashhadtuhum khalqa alssamawati waalardi wala khalqa anfusihim wama kuntu muttakhitha almudilleena AAadudan"},{"SurahNumber":18,"VerseNumber":52,"Text":"Wayawma yaqoolu nadoo shurakaiya allatheena zaAAamtum fadaAAawhum falam yastajeeboo lahum wajaAAalna baynahum mawbiqan"},{"SurahNumber":18,"VerseNumber":53,"Text":"Waraa almujrimoona alnnara fathannoo annahum muwaqiAAooha walam yajidoo AAanha masrifan"},{"SurahNumber":18,"VerseNumber":54,"Text":"Walaqad sarrafna fee hatha alqurani lilnnasi min kulli mathalin wakana alinsanu akthara shayin jadalan"},{"SurahNumber":18,"VerseNumber":55,"Text":"Wama manaAAa alnnasa an yuminoo ith jaahumu alhuda wayastaghfiroo rabbahum illa an tatiyahum sunnatu alawwaleena aw yatiyahumu alAAathabu qubulan"},{"SurahNumber":18,"VerseNumber":56,"Text":"Wama nursilu almursaleena illa mubashshireena wamunthireena wayujadilu allatheena kafaroo bialbatili liyudhidoo bihi alhaqqa waittakhathoo ayatee wama onthiroo huzuwan"},{"SurahNumber":18,"VerseNumber":57,"Text":"Waman athlamu mimman thukkira biayati rabbihi faaAArada AAanha wanasiya ma qaddamat yadahu inna jaAAalna AAala quloobihim akinnatan an yafqahoohu wafee athanihim waqran wain tadAAuhum ila alhuda falan yahtadoo ithan abadan"},{"SurahNumber":18,"VerseNumber":58,"Text":"Warabbuka alghafooru thoo alrrahmati law yuakhithuhum bima kasaboo laAAajjala lahumu alAAathaba bal lahum mawAAidun lan yajidoo min doonihi mawilan"},{"SurahNumber":18,"VerseNumber":59,"Text":"Watilka alqura ahlaknahum lamma thalamoo wajaAAalna limahlikihim mawAAidan"},{"SurahNumber":18,"VerseNumber":60,"Text":"Waith qala moosa lifatahu la abrahu hatta ablugha majmaAAa albahrayni aw amdiya huquban"},{"SurahNumber":18,"VerseNumber":61,"Text":"Falamma balagha majmaAAa baynihima nasiya hootahuma faittakhatha sabeelahu fee albahri saraban"},{"SurahNumber":18,"VerseNumber":62,"Text":"Falamma jawaza qala lifatahu atina ghadaana laqad laqeena min safarina hatha nasaban"},{"SurahNumber":18,"VerseNumber":63,"Text":"Qala araayta ith awayna ila alssakhrati fainnee naseetu alhoota wama ansaneehu illa alshshaytanu an athkurahu waittakhatha sabeelahu fee albahri AAajaban"},{"SurahNumber":18,"VerseNumber":64,"Text":"Qala thalika ma kunna nabghi fairtadda AAala atharihima qasasan"},{"SurahNumber":18,"VerseNumber":65,"Text":"Fawajada AAabdan min AAibadina ataynahu rahmatan min AAindina waAAallamnahu min ladunna AAilman"},{"SurahNumber":18,"VerseNumber":66,"Text":"Qala lahu moosa hal attabiAAuka AAala an tuAAallimani mimma AAullimta rushdan"},{"SurahNumber":18,"VerseNumber":67,"Text":"Qala innaka lan tastateeAAa maAAiya sabran"},{"SurahNumber":18,"VerseNumber":68,"Text":"Wakayfa tasbiru AAala ma lam tuhit bihi khubran"},{"SurahNumber":18,"VerseNumber":69,"Text":"Qala satajidunee in shaa Allahu sabiran wala aAAsee laka amran"},{"SurahNumber":18,"VerseNumber":70,"Text":"Qala faini ittabaAAtanee fala tasalnee AAan shayin hatta ohditha laka minhu thikran"},{"SurahNumber":18,"VerseNumber":71,"Text":"Faintalaqa hatta itha rakiba fee alssafeenati kharaqaha qala akharaqtaha litughriqa ahlaha laqad jita shayan imran"},{"SurahNumber":18,"VerseNumber":72,"Text":"Qala alam aqul innaka lan tastateeAAa maAAiya sabran"},{"SurahNumber":18,"VerseNumber":73,"Text":"Qala la tuakhithnee bima naseetu wala turhiqnee min amree AAusran"},{"SurahNumber":18,"VerseNumber":74,"Text":"Faintalaqa hatta itha laqiya ghulaman faqatalahu qala aqatalta nafsan zakiyyatan bighayri nafsin laqad jita shayan nukran"},{"SurahNumber":18,"VerseNumber":75,"Text":"Qala alam aqul laka innaka lan tastateeAAa maAAiya sabran"},{"SurahNumber":18,"VerseNumber":76,"Text":"Qala in saaltuka AAan shayin baAAdaha fala tusahibnee qad balaghta min ladunnee AAuthran"},{"SurahNumber":18,"VerseNumber":77,"Text":"Faintalaqa hatta itha ataya ahla qaryatin istatAAama ahlaha faabaw an yudayyifoohuma fawajada feeha jidaran yureedu an yanqadda faaqamahu qala law shita laittakhathta AAalayhi ajran"},{"SurahNumber":18,"VerseNumber":78,"Text":"Qala hatha firaqu baynee wabaynika saonabbioka bitaweeli ma lam tastatiAA AAalayhi sabran"},{"SurahNumber":18,"VerseNumber":79,"Text":"Amma alssafeenatu fakanat limasakeena yaAAmaloona fee albahri faaradtu an aAAeebaha wakana waraahum malikun yakhuthu kulla safeenatin ghasban"},{"SurahNumber":18,"VerseNumber":80,"Text":"Waamma alghulamu fakana abawahu muminayni fakhasheena an yurhiqahuma tughyanan wakufran"},{"SurahNumber":18,"VerseNumber":81,"Text":"Faaradna an yubdilahuma rabbuhuma khayran minhu zakatan waaqraba ruhman"},{"SurahNumber":18,"VerseNumber":82,"Text":"Waamma aljidaru fakana lighulamayni yateemayni fee almadeenati wakana tahtahu kanzun lahuma wakana aboohuma salihan faarada rabbuka an yablugha ashuddahuma wayastakhrija kanzahuma rahmatan min rabbika wama faAAaltuhu AAan amree thalika taweelu ma lam tastiAA AAalayhi sabran"},{"SurahNumber":18,"VerseNumber":83,"Text":"Wayasaloonaka AAan thee alqarnayni qul saatloo AAalaykum minhu thikran"},{"SurahNumber":18,"VerseNumber":84,"Text":"Inna makkanna lahu fee alardi waataynahu min kulli shayin sababan"},{"SurahNumber":18,"VerseNumber":85,"Text":"FaatbaAAa sababan"},{"SurahNumber":18,"VerseNumber":86,"Text":"Hatta itha balagha maghriba alshshamsi wajadaha taghrubu fee AAaynin hamiatin wawajada AAindaha qawman qulna ya tha alqarnayni imma an tuAAaththiba waimma an tattakhitha feehim husnan"},{"SurahNumber":18,"VerseNumber":87,"Text":"Qala amma man thalama fasawfa nuAAaththibuhu thumma yuraddu ila rabbihi fayuAAaththibuhu AAathaban nukran"},{"SurahNumber":18,"VerseNumber":88,"Text":"Waamma man amana waAAamila salihan falahu jazaan alhusna wasanaqoolu lahu min amrina yusran"},{"SurahNumber":18,"VerseNumber":89,"Text":"Thumma atbaAAa sababan"},{"SurahNumber":18,"VerseNumber":90,"Text":"Hatta itha balagha matliAAa alshshamsi wajadaha tatluAAu AAala qawmin lam najAAal lahum min dooniha sitran"},{"SurahNumber":18,"VerseNumber":91,"Text":"Kathalika waqad ahatna bima ladayhi khubran"},{"SurahNumber":18,"VerseNumber":92,"Text":"Thumma atbaAAa sababan"},{"SurahNumber":18,"VerseNumber":93,"Text":"Hatta itha balagha bayna alssaddayni wajada min doonihima qawman la yakadoona yafqahoona qawlan"},{"SurahNumber":18,"VerseNumber":94,"Text":"Qaloo ya tha alqarnayni inna yajooja wamajooja mufsidoona fee alardi fahal najAAalu laka kharjan AAala an tajAAala baynana wabaynahum saddan"},{"SurahNumber":18,"VerseNumber":95,"Text":"Qala ma makkannee feehi rabbee khayrun faaAAeenoonee biquwwatin ajAAal baynakum wabaynahum radman"},{"SurahNumber":18,"VerseNumber":96,"Text":"Atoonee zubara alhadeedi hatta itha sawa bayna alsadafayni qala onfukhoo hatta itha jaAAalahu naran qala atoonee ofrigh AAalayhi qitran"},{"SurahNumber":18,"VerseNumber":97,"Text":"Fama istaAAoo an yathharoohu wama istataAAoo lahu naqban"},{"SurahNumber":18,"VerseNumber":98,"Text":"Qala hatha rahmatun min rabbee faitha jaa waAAdu rabbee jaAAalahu dakkaa wakana waAAdu rabbee haqqan"},{"SurahNumber":18,"VerseNumber":99,"Text":"Watarakna baAAdahum yawmaithin yamooju fee baAAdin wanufikha fee alssoori fajamaAAnahum jamAAan"},{"SurahNumber":18,"VerseNumber":100,"Text":"WaAAaradna jahannama yawmaithin lilkafireena AAardan"},{"SurahNumber":18,"VerseNumber":101,"Text":"Allatheena kanat aAAyunuhum fee ghitain AAan thikree wakanoo la yastateeAAoona samAAan"},{"SurahNumber":18,"VerseNumber":102,"Text":"Afahasiba allatheena kafaroo an yattakhithoo AAibadee min doonee awliyaa inna aAAtadna jahannama lilkafireena nuzulan"},{"SurahNumber":18,"VerseNumber":103,"Text":"Qul hal nunabbiokum bialakhsareena aAAmalan"},{"SurahNumber":18,"VerseNumber":104,"Text":"Allatheena dalla saAAyuhum fee alhayati alddunya wahum yahsaboona annahum yuhsinoona sunAAan"},{"SurahNumber":18,"VerseNumber":105,"Text":"Olaika allatheena kafaroo biayati rabbihim waliqaihi fahabitat aAAmaluhum fala nuqeemu lahum yawma alqiyamati waznan"},{"SurahNumber":18,"VerseNumber":106,"Text":"Thalika jazaohum jahannamu bima kafaroo waittakhathoo ayatee warusulee huzuwan"},{"SurahNumber":18,"VerseNumber":107,"Text":"Inna allatheena amanoo waAAamiloo alssalihati kanat lahum jannatu alfirdawsi nuzulan"},{"SurahNumber":18,"VerseNumber":108,"Text":"Khalideena feeha la yabghoona AAanha hiwalan"},{"SurahNumber":18,"VerseNumber":109,"Text":"Qul law kana albahru midadan likalimati rabbee lanafida albahru qabla an tanfada kalimatu rabbee walaw jina bimithlihi madadan"},{"SurahNumber":18,"VerseNumber":110,"Text":"Qul innama ana basharun mithlukum yooha ilayya annama ilahukum ilahun wahidun faman kana yarjoo liqaa rabbihi falyaAAmal AAamalan salihan wala yushrik biAAibadati rabbihi ahadan"}]},{"LanguageCode":"eng","Language":"English","Name":"eng-mustafakhattabg","Author":"Mustafa Khattab God Edition","Source":"","Direction":"ltr","Translations":[{"SurahNumber":18,"VerseNumber":1,"Text":"All praise is for God Who has revealed the Book to His servant, allowing no crookedness in it"},{"SurahNumber":18,"VerseNumber":2,"Text":"˹making it˺ perfectly upright, to warn ˹the disbelievers˺ of a severe torment from Him; to give good news to the believers—who do good—that they will have a fine reward"},{"SurahNumber":18,"VerseNumber":3,"Text":"in which they will remain forever"},{"SurahNumber":18,"VerseNumber":4,"Text":"and to warn those who claim, “God has offspring.”"},{"SurahNumber":18,"VerseNumber":5,"Text":"They have no knowledge of this, nor did their forefathers. What a terrible claim that comes out of their mouths! They say nothing but lies"},{"SurahNumber":18,"VerseNumber":6,"Text":"Now, perhaps you ˹O Prophet˺ will grieve yourself to death over their denial, if they ˹continue to˺ disbelieve in this message"},{"SurahNumber":18,"VerseNumber":7,"Text":"We have indeed made whatever is on earth as an adornment for it, in order to test which of them is best in deeds"},{"SurahNumber":18,"VerseNumber":8,"Text":"And We will certainly reduce whatever is on it to barren ground"},{"SurahNumber":18,"VerseNumber":9,"Text":"Have you ˹O Prophet˺ thought that the people of the cave and the plaque were ˹the only˺ wonders of Our signs"},{"SurahNumber":18,"VerseNumber":10,"Text":"˹Remember˺ when those youths took refuge in the cave, and said, “Our Lord! Grant us mercy from Yourself and guide us rightly through our ordeal.”"},{"SurahNumber":18,"VerseNumber":11,"Text":"So We caused them to fall into a dead sleep in the cave for many years"},{"SurahNumber":18,"VerseNumber":12,"Text":"then We raised them so We may show which of the two groups would make a better estimation of the length of their stay"},{"SurahNumber":18,"VerseNumber":13,"Text":"We relate to you ˹O Prophet˺ their story in truth. They were youths who truly believed in their Lord, and We increased them in guidance"},{"SurahNumber":18,"VerseNumber":14,"Text":"And We strengthened their hearts when they stood up and declared, “Our Lord is the Lord of the heavens and the earth. We will never call upon any god besides Him, or we would truly be uttering an outrageous lie.”"},{"SurahNumber":18,"VerseNumber":15,"Text":"˹Then they said to one another,˺ “These people of ours have taken gods besides Him. Why do they not produce a clear proof of them? Who then does more wrong than those who fabricate lies against God"},{"SurahNumber":18,"VerseNumber":16,"Text":"Since you have distanced yourselves from them and what they worship besides God, take refuge in the cave. Your Lord will extend His mercy to you and accommodate you in your ordeal.”"},{"SurahNumber":18,"VerseNumber":17,"Text":"And you would have seen the sun, as it rose, inclining away from their cave to the right, and as it set, declining away from them to the left, while they lay in its open space. That is one of the signs of God. Whoever God guides is truly guided. But whoever He leaves to stray, you will never find for them a guiding mentor"},{"SurahNumber":18,"VerseNumber":18,"Text":"And you would have thought they were awake, though they were asleep. We turned them over, to the right and left, while their dog stretched his forelegs at the entrance. Had you looked at them, you would have certainly fled away from them, filled with horror"},{"SurahNumber":18,"VerseNumber":19,"Text":"And so We awakened them so that they might question one another. One of them exclaimed, “How long have you remained ˹asleep˺?” Some replied, “Perhaps a day, or part of a day.” They said ˹to one another˺, “Your Lord knows best how long you have remained. So send one of you with these silver coins of yours to the city, and let him find which food is the purest, and then bring you provisions from it. Let him be ˹exceptionally˺ cautious, and do not let him give you away"},{"SurahNumber":18,"VerseNumber":20,"Text":"For, indeed, if they find out about you, they will stone you ˹to death˺, or force you back into their faith, and then you will never succeed.”"},{"SurahNumber":18,"VerseNumber":21,"Text":"That is how We caused them to be discovered so that their people might know that God’s promise ˹of resurrection˺ is true and that there is no doubt about the Hour. When the people disputed with each other about the case of the youth ˹after their death˺, some proposed, “Build a structure around them. Their Lord knows best about them.” Those who prevailed in the matter said, “We will surely build a place of worship over them.”"},{"SurahNumber":18,"VerseNumber":22,"Text":"Some will say, “They were three, their dog was the fourth,” while others will say, “They were five, their dog was the sixth,” ˹only˺ guessing blindly. And others will say, “They were seven and their dog was the eighth.” Say, ˹O Prophet,˺ “My Lord knows best their ˹exact˺ number. Only a few people know as well.” So do not argue about them except with sure knowledge, nor consult any of those ˹who debate˺ about them"},{"SurahNumber":18,"VerseNumber":23,"Text":"And never say of anything, “I will definitely do this tomorrow,”"},{"SurahNumber":18,"VerseNumber":24,"Text":"without adding, “if God so wills!” But if you forget, then remember your Lord, and say, “I trust my Lord will guide me to what is more right than this.”"},{"SurahNumber":18,"VerseNumber":25,"Text":"They had remained in their cave for three hundred years, adding nine"},{"SurahNumber":18,"VerseNumber":26,"Text":"Say, ˹O Prophet,˺ “God knows best how long they stayed. With Him ˹alone˺ is ˹the knowledge of˺ the unseen of the heavens and the earth. How perfectly He hears and sees! They have no guardian besides Him, and He shares His command with none.”"},{"SurahNumber":18,"VerseNumber":27,"Text":"Recite what has been revealed to you from the Book of your Lord. None can change His Words, nor can you find any refuge besides Him"},{"SurahNumber":18,"VerseNumber":28,"Text":"And patiently stick with those who call upon their Lord morning and evening, seeking His pleasure. Do not let your eyes look beyond them, desiring the luxuries of this worldly life. And do not obey those whose hearts We have made heedless of Our remembrance, who follow ˹only˺ their desires and whose state is ˹total˺ loss"},{"SurahNumber":18,"VerseNumber":29,"Text":"And say, ˹O Prophet,˺ “˹This is˺ the truth from your Lord. Whoever wills let them believe, and whoever wills let them disbelieve.” Surely We have prepared for the wrongdoers a Fire whose walls will ˹completely˺ surround them. When they cry for aid, they will be aided with water like molten metal, which will burn ˹their˺ faces. What a horrible drink! And what a terrible place to rest"},{"SurahNumber":18,"VerseNumber":30,"Text":"As for those who believe and do good, We certainly never deny the reward of those who are best in deeds"},{"SurahNumber":18,"VerseNumber":31,"Text":"It is they who will have the Gardens of Eternity, with rivers flowing under their feet. There they will be adorned with bracelets of gold, and wear green garments of fine silk and rich brocade, reclining there on ˹canopied˺ couches. What a marvellous reward! And what a fabulous place to rest"},{"SurahNumber":18,"VerseNumber":32,"Text":"Give them ˹O Prophet˺ an example of two men. To ˹the disbelieving˺ one We gave two gardens of grapevines, which We surrounded with palm trees and placed ˹various˺ crops in between"},{"SurahNumber":18,"VerseNumber":33,"Text":"Each garden yielded ˹all˺ its produce, never falling short. And We caused a river to flow between them"},{"SurahNumber":18,"VerseNumber":34,"Text":"And he had other resources ˹as well˺. So he boasted to a ˹poor˺ companion of his, while conversing with him, “I am greater than you in wealth and superior in manpower.”"},{"SurahNumber":18,"VerseNumber":35,"Text":"And he entered his property, while wronging his soul, saying, “I do not think this will ever perish"},{"SurahNumber":18,"VerseNumber":36,"Text":"nor do I think the Hour will ˹ever˺ come. And if in fact I am returned to my Lord, I will definitely get a far better outcome than ˹all˺ this.”"},{"SurahNumber":18,"VerseNumber":37,"Text":"His ˹believing˺ companion replied, while conversing with him, “Do you disbelieve in the One Who created you from dust, then ˹developed you˺ from a sperm-drop, then formed you into a man"},{"SurahNumber":18,"VerseNumber":38,"Text":"But as for me: He is God, my Lord, and I will never associate anyone with my Lord ˹in worship˺"},{"SurahNumber":18,"VerseNumber":39,"Text":"If only you had said, upon entering your property, ‘This is what God has willed! There is no power except with God!’ Even though you see me inferior to you in wealth and offspring"},{"SurahNumber":18,"VerseNumber":40,"Text":"perhaps my Lord will grant me ˹something˺ better than your garden, and send down upon your garden a thunderbolt from the sky, turning it into a barren waste"},{"SurahNumber":18,"VerseNumber":41,"Text":"Or its water may sink ˹into the earth˺, and then you will never be able to seek it out.”"},{"SurahNumber":18,"VerseNumber":42,"Text":"And so all his produce was ˹totally˺ ruined, so he started to wring his hands for all he had spent on it, while it had collapsed on its trellises. He cried, “Alas! I wish I had never associated anyone with my Lord ˹in worship˺!”"},{"SurahNumber":18,"VerseNumber":43,"Text":"And he had no manpower to help him against God, nor could he ˹even˺ help himself"},{"SurahNumber":18,"VerseNumber":44,"Text":"At this time, support comes ˹only˺ from God—the True ˹Lord˺. He is best in reward and best in outcome"},{"SurahNumber":18,"VerseNumber":45,"Text":"And give them a parable of this worldly life. ˹It is˺ like the plants of the earth, thriving when sustained by the rain We send down from the sky. Then they ˹soon˺ turn into chaff scattered by the wind. And God is fully capable of ˹doing˺ all things"},{"SurahNumber":18,"VerseNumber":46,"Text":"Wealth and children are the adornment of this worldly life, but the everlasting good deeds are far better with your Lord in reward and in hope"},{"SurahNumber":18,"VerseNumber":47,"Text":"˹Beware of˺ the Day We will blow the mountains away, and you will see the earth laid bare. And We will gather all ˹humankind˺, leaving none behind"},{"SurahNumber":18,"VerseNumber":48,"Text":"They will be presented before your Lord in rows, ˹and the deniers will be told,˺ “You have surely returned to Us ˹all alone˺ as We created you the first time, although you ˹always˺ claimed that We would never appoint a time for your return.”"},{"SurahNumber":18,"VerseNumber":49,"Text":"And the record ˹of deeds˺ will be laid ˹open˺, and you will see the wicked in fear of what is ˹written˺ in it. They will cry, “Woe to us! What kind of record is this that does not leave any sin, small or large, unlisted?” They will find whatever they did present ˹before them˺. And your Lord will never wrong anyone"},{"SurahNumber":18,"VerseNumber":50,"Text":"And ˹remember˺ when We said to the angels, “Prostrate before Adam,” so they all did—but not Iblîs, who was one of the jinn, but he rebelled against the command of his Lord. Would you then take him and his descendants as patrons instead of Me, although they are your enemy? What an evil alternative for the wrongdoers ˹to choose˺"},{"SurahNumber":18,"VerseNumber":51,"Text":"I never called them to witness the creation of the heavens and the earth or ˹even˺ their own creation, nor would I take the misleaders as helpers"},{"SurahNumber":18,"VerseNumber":52,"Text":"And ˹beware of˺ the Day He will say, “Call upon those you claimed were My associate-gods.” So they will call them, but will receive no response. And We will make them ˹all˺ share in the same doom"},{"SurahNumber":18,"VerseNumber":53,"Text":"The wicked will see the Fire and realize that they are bound to fall into it, and will find no way to avoid it"},{"SurahNumber":18,"VerseNumber":54,"Text":"We have surely set forth in this Quran every ˹kind of˺ lesson for people, but humankind is the most argumentative of all beings"},{"SurahNumber":18,"VerseNumber":55,"Text":"And nothing prevents people from believing when guidance comes to them and from seeking their Lord’s forgiveness except ˹their demand˺ to meet the same fate of earlier deniers or that the torment would confront them face to face"},{"SurahNumber":18,"VerseNumber":56,"Text":"We do not send the messengers except as deliverers of good news and warners. But the disbelievers argue in falsehood, ˹hoping˺ to discredit the truth with it, and make a mockery of My revelations and warnings"},{"SurahNumber":18,"VerseNumber":57,"Text":"And who does more wrong than those who, when reminded of their Lord’s revelations, turn away from them and forget what their own hands have done? We have certainly cast veils over their hearts—leaving them unable to comprehend this ˹Quran˺—and deafness in their ears. And if you ˹O Prophet˺ invite them to ˹true˺ guidance, they will never be ˹rightly˺ guided"},{"SurahNumber":18,"VerseNumber":58,"Text":"Your Lord is the All-Forgiving, Full of Mercy. If He were to seize them ˹immediately˺ for what they commit, He would have certainly hastened their punishment. But they have an appointed time, from which they will find no refuge"},{"SurahNumber":18,"VerseNumber":59,"Text":"Those ˹are the˺ societies We destroyed when they persisted in wrong, and We had set a time for their destruction"},{"SurahNumber":18,"VerseNumber":60,"Text":"And ˹remember˺ when Moses said to his young assistant, “I will never give up until I reach the junction of the two seas, even if I travel for ages.”"},{"SurahNumber":18,"VerseNumber":61,"Text":"But when they ˹finally˺ reached the point where the seas met, they forgot their ˹salted˺ fish, and it made its way into the sea, slipping away ˹wondrously˺"},{"SurahNumber":18,"VerseNumber":62,"Text":"When they had passed further, he said to his assistant, “Bring us our meal! We have certainly been exhausted by today’s journey.”"},{"SurahNumber":18,"VerseNumber":63,"Text":"He replied, “Do you remember when we rested by the rock? ˹That is when˺ I forgot the fish. None made me forget to mention this except Satan. And the fish made its way into the sea miraculously.”"},{"SurahNumber":18,"VerseNumber":64,"Text":"Moses responded, “That is ˹exactly˺ what we were looking for.” So they returned, retracing their footsteps"},{"SurahNumber":18,"VerseNumber":65,"Text":"There they found a servant of Ours, to whom We had granted mercy from Us and enlightened with knowledge of Our Own"},{"SurahNumber":18,"VerseNumber":66,"Text":"Moses said to him, “May I follow you, provided that you teach me some of the right guidance you have been taught?”"},{"SurahNumber":18,"VerseNumber":67,"Text":"He said, “You certainly cannot be patient ˹enough˺ with me"},{"SurahNumber":18,"VerseNumber":68,"Text":"And how can you be patient with what is beyond your ˹realm of˺ knowledge?”"},{"SurahNumber":18,"VerseNumber":69,"Text":"Moses assured ˹him˺, “You will find me patient, God willing, and I will not disobey any of your orders.”"},{"SurahNumber":18,"VerseNumber":70,"Text":"He responded, “Then if you follow me, do not question me about anything until I ˹myself˺ clarify it for you.”"},{"SurahNumber":18,"VerseNumber":71,"Text":"So they set out, but after they had boarded a ship, the man made a hole in it. Moses protested, “Have you done this to drown its people? You have certainly done a terrible thing!”"},{"SurahNumber":18,"VerseNumber":72,"Text":"He replied, “Did I not say that you cannot have patience with me?”"},{"SurahNumber":18,"VerseNumber":73,"Text":"Moses pleaded, “Excuse me for forgetting, and do not be hard on me.”"},{"SurahNumber":18,"VerseNumber":74,"Text":"So they proceeded until they came across a boy, and the man killed him. Moses protested, “Have you killed an innocent soul, who killed no one? You have certainly done a horrible thing.”"},{"SurahNumber":18,"VerseNumber":75,"Text":"He answered, “Did I not tell you that you cannot have patience with me?”"},{"SurahNumber":18,"VerseNumber":76,"Text":"Moses replied, “If I ever question you about anything after this, then do not keep me in your company, for by then I would have given you enough of an excuse.”"},{"SurahNumber":18,"VerseNumber":77,"Text":"So they moved on until they came to the people of a town. They asked them for food, but the people refused to give them hospitality. There they found a wall ready to collapse, so the man set it right. Moses protested, “If you wanted, you could have demanded a fee for this.”"},{"SurahNumber":18,"VerseNumber":78,"Text":"He replied, “This is the parting of our ways. I will explain to you what you could not bear patiently"},{"SurahNumber":18,"VerseNumber":79,"Text":"“As for the ship, it belonged to some poor people, working at sea. So I intended to damage it, for there was a ˹tyrant˺ king ahead of them who seizes every ˹good˺ ship by force"},{"SurahNumber":18,"VerseNumber":80,"Text":"“And as for the boy, his parents were ˹true˺ believers, and we feared that he would pressure them into defiance and disbelief"},{"SurahNumber":18,"VerseNumber":81,"Text":"So we hoped that their Lord would give them another, more virtuous and caring in his place"},{"SurahNumber":18,"VerseNumber":82,"Text":"“And as for the wall, it belonged to two orphan boys in the city, and under the wall was a treasure that belonged to them, and their father had been a righteous man. So your Lord willed that these children should come of age and retrieve their treasure, as a mercy from your Lord. I did not do it ˹all˺ on my own. This is the explanation of what you could not bear patiently.”"},{"SurahNumber":18,"VerseNumber":83,"Text":"They ask you ˹O Prophet˺ about Ⱬul-Qarnain. Say, “I will relate to you something of his narrative.”"},{"SurahNumber":18,"VerseNumber":84,"Text":"Surely We established him in the land, and gave him the means to all things"},{"SurahNumber":18,"VerseNumber":85,"Text":"So he travelled a course"},{"SurahNumber":18,"VerseNumber":86,"Text":"until he reached the setting ˹point˺ of the sun, which appeared to him to be setting in a spring of murky water, where he found some people. We said, “O Ⱬul-Qarnain! Either punish them or treat them kindly.”"},{"SurahNumber":18,"VerseNumber":87,"Text":"He responded, “Whoever does wrong will be punished by us, then will be returned to their Lord, Who will punish them with a horrible torment"},{"SurahNumber":18,"VerseNumber":88,"Text":"As for those who believe and do good, they will have the finest reward, and we will assign them easy commands.”"},{"SurahNumber":18,"VerseNumber":89,"Text":"Then he travelled a ˹different˺ course"},{"SurahNumber":18,"VerseNumber":90,"Text":"until he reached the rising ˹point˺ of the sun. He found it rising on a people for whom We had provided no shelter from it"},{"SurahNumber":18,"VerseNumber":91,"Text":"So it was. And We truly had full knowledge of him"},{"SurahNumber":18,"VerseNumber":92,"Text":"Then he travelled a ˹third˺ course"},{"SurahNumber":18,"VerseNumber":93,"Text":"until he reached ˹a pass˺ between two mountains. He found in front of them a people who could hardly understand ˹his˺ language"},{"SurahNumber":18,"VerseNumber":94,"Text":"They pleaded, “O Ⱬul-Qarnain! Surely Gog and Magog are spreading corruption throughout the land. Should we pay you tribute, provided that you build a wall between us and them?”"},{"SurahNumber":18,"VerseNumber":95,"Text":"He responded, “What my Lord has provided for me is far better. But assist me with resources, and I will build a barrier between you and them"},{"SurahNumber":18,"VerseNumber":96,"Text":"Bring me blocks of iron!” Then, when he had filled up ˹the gap˺ between the two mountains, he ordered, “Blow!” When the iron became red hot, he said, “Bring me molten copper to pour over it.”"},{"SurahNumber":18,"VerseNumber":97,"Text":"And so the enemies could neither scale nor tunnel through it"},{"SurahNumber":18,"VerseNumber":98,"Text":"He declared, “This is a mercy from my Lord. But when the promise of my Lord comes to pass, He will level it to the ground. And my Lord’s promise is ever true.”"},{"SurahNumber":18,"VerseNumber":99,"Text":"On that Day, We will let them surge ˹like waves˺ over one another. Later, the Trumpet will be blown, and We will gather all ˹people˺ together"},{"SurahNumber":18,"VerseNumber":100,"Text":"On that Day We will display Hell clearly for the disbelievers"},{"SurahNumber":18,"VerseNumber":101,"Text":"those who turned a blind eye to My Reminder and could not stand listening ˹to it˺"},{"SurahNumber":18,"VerseNumber":102,"Text":"Do the disbelievers think they can ˹simply˺ take My servants as lords instead of Me? We have surely prepared Hell as an accommodation for the disbelievers"},{"SurahNumber":18,"VerseNumber":103,"Text":"Say, ˹O Prophet,˺ “Shall we inform you of who will lose the most deeds"},{"SurahNumber":18,"VerseNumber":104,"Text":"˹They are˺ those whose efforts are in vain in this worldly life, while they think they are doing good!”"},{"SurahNumber":18,"VerseNumber":105,"Text":"It is they who reject the signs of their Lord and their meeting with Him, rendering their deeds void, so We will not give their deeds any weight on Judgment Day"},{"SurahNumber":18,"VerseNumber":106,"Text":"That is their reward: Hell, for their disbelief and mockery of My signs and messengers"},{"SurahNumber":18,"VerseNumber":107,"Text":"Indeed, those who believe and do good will have the Gardens of Paradise as an accommodation"},{"SurahNumber":18,"VerseNumber":108,"Text":"where they will be forever, never desiring anywhere else"},{"SurahNumber":18,"VerseNumber":109,"Text":"Say, ˹O Prophet,˺ “If the ocean were ink for ˹writing˺ the Words of my Lord, it would certainly run out before the Words of my Lord were finished, even if We refilled it with its equal.”"},{"SurahNumber":18,"VerseNumber":110,"Text":"Say, ˹O Prophet,˺ “I am only a man like you, ˹but˺ it has been revealed to me that your God is only One God. So whoever hopes for the meeting with their Lord, let them do good deeds and associate none in the worship of their Lord.”"}]}]}