{"SurahNumber":2,"HasBismillah":true,"Verses":[{"SurahNumber":2,"VerseNumber":1,"Text":"الٓمٓ","End":"١"},{"SurahNumber":2,"VerseNumber":2,"Text":"ذَٰلِكَ ٱلۡكِتَٰبُ لَا رَيۡبَۛ فِيهِۛ هُدٗى لِّلۡمُتَّقِينَ","End":"٢"},{"SurahNumber":2,"VerseNumber":3,"Text":"ٱلَّذِينَ يُؤۡمِنُونَ بِٱلۡغَيۡبِ وَيُقِيمُونَ ٱلصَّلَوٰةَ وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ","End":"٣"},{"SurahNumber":2,"VerseNumber":4,"Text":"وَٱلَّذِينَ يُؤۡمِنُونَ بِمَآ أُنزِلَ إِلَيۡكَ وَمَآ أُنزِلَ مِن قَبۡلِكَ وَبِٱلۡأٓخِرَةِ هُمۡ يُوقِنُونَ","End":"٤"},{"SurahNumber":2,"VerseNumber":5,"Text":"أُوْلَـٰٓئِكَ عَلَىٰ هُدٗى مِّن رَّبِّهِمۡۖ وَأُوْلَـٰٓئِكَ هُمُ ٱلۡمُفۡلِحُونَ","End":"٥"},{"SurahNumber":2,"VerseNumber":6,"Text":"إِنَّ ٱلَّذِينَ كَفَرُواْ سَوَآءٌ عَلَيۡهِمۡ ءَأَنذَرۡتَهُمۡ أَمۡ لَمۡ تُنذِرۡهُمۡ لَا يُؤۡمِنُونَ","End":"٦"},{"SurahNumber":2,"VerseNumber":7,"Text":"خَتَمَ ٱللَّهُ عَلَىٰ قُلُوبِهِمۡ وَعَلَىٰ سَمۡعِهِمۡۖ وَعَلَىٰٓ أَبۡصَٰرِهِمۡ غِشَٰوَةٞۖ وَلَهُمۡ عَذَابٌ عَظِيمٞ","End":"٧"},{"SurahNumber":2,"VerseNumber":8,"Text":"وَمِنَ ٱلنَّاسِ مَن يَقُولُ ءَامَنَّا بِٱللَّهِ وَبِٱلۡيَوۡمِ ٱلۡأٓخِرِ وَمَا هُم بِمُؤۡمِنِينَ","End":"٨"},{"SurahNumber":2,"VerseNumber":9,"Text":"يُخَٰدِعُونَ ٱللَّهَ وَٱلَّذِينَ ءَامَنُواْ وَمَا يَخۡدَعُونَ إِلَّآ أَنفُسَهُمۡ وَمَا يَشۡعُرُونَ","End":"٩"},{"SurahNumber":2,"VerseNumber":10,"Text":"فِي قُلُوبِهِم مَّرَضٞ فَزَادَهُمُ ٱللَّهُ مَرَضٗاۖ وَلَهُمۡ عَذَابٌ أَلِيمُۢ بِمَا كَانُواْ يَكۡذِبُونَ","End":"١٠"},{"SurahNumber":2,"VerseNumber":11,"Text":"وَإِذَا قِيلَ لَهُمۡ لَا تُفۡسِدُواْ فِي ٱلۡأَرۡضِ قَالُوٓاْ إِنَّمَا نَحۡنُ مُصۡلِحُونَ","End":"١١"},{"SurahNumber":2,"VerseNumber":12,"Text":"أَلَآ إِنَّهُمۡ هُمُ ٱلۡمُفۡسِدُونَ وَلَٰكِن لَّا يَشۡعُرُونَ","End":"١٢"},{"SurahNumber":2,"VerseNumber":13,"Text":"وَإِذَا قِيلَ لَهُمۡ ءَامِنُواْ كَمَآ ءَامَنَ ٱلنَّاسُ قَالُوٓاْ أَنُؤۡمِنُ كَمَآ ءَامَنَ ٱلسُّفَهَآءُۗ أَلَآ إِنَّهُمۡ هُمُ ٱلسُّفَهَآءُ وَلَٰكِن لَّا يَعۡلَمُونَ","End":"١٣"},{"SurahNumber":2,"VerseNumber":14,"Text":"وَإِذَا لَقُواْ ٱلَّذِينَ ءَامَنُواْ قَالُوٓاْ ءَامَنَّا وَإِذَا خَلَوۡاْ إِلَىٰ شَيَٰطِينِهِمۡ قَالُوٓاْ إِنَّا مَعَكُمۡ إِنَّمَا نَحۡنُ مُسۡتَهۡزِءُونَ","End":"١٤"},{"SurahNumber":2,"VerseNumber":15,"Text":"ٱللَّهُ يَسۡتَهۡزِئُ بِهِمۡ وَيَمُدُّهُمۡ فِي طُغۡيَٰنِهِمۡ يَعۡمَهُونَ","End":"١٥"},{"SurahNumber":2,"VerseNumber":16,"Text":"أُوْلَـٰٓئِكَ ٱلَّذِينَ ٱشۡتَرَوُاْ ٱلضَّلَٰلَةَ بِٱلۡهُدَىٰ فَمَا رَبِحَت تِّجَٰرَتُهُمۡ وَمَا كَانُواْ مُهۡتَدِينَ","End":"١٦"},{"SurahNumber":2,"VerseNumber":17,"Text":"مَثَلُهُمۡ كَمَثَلِ ٱلَّذِي ٱسۡتَوۡقَدَ نَارٗا فَلَمَّآ أَضَآءَتۡ مَا حَوۡلَهُۥ ذَهَبَ ٱللَّهُ بِنُورِهِمۡ وَتَرَكَهُمۡ فِي ظُلُمَٰتٖ لَّا يُبۡصِرُونَ","End":"١٧"},{"SurahNumber":2,"VerseNumber":18,"Text":"صُمُّۢ بُكۡمٌ عُمۡيٞ فَهُمۡ لَا يَرۡجِعُونَ","End":"١٨"},{"SurahNumber":2,"VerseNumber":19,"Text":"أَوۡ كَصَيِّبٖ مِّنَ ٱلسَّمَآءِ فِيهِ ظُلُمَٰتٞ وَرَعۡدٞ وَبَرۡقٞ يَجۡعَلُونَ أَصَٰبِعَهُمۡ فِيٓ ءَاذَانِهِم مِّنَ ٱلصَّوَٰعِقِ حَذَرَ ٱلۡمَوۡتِۚ وَٱللَّهُ مُحِيطُۢ بِٱلۡكَٰفِرِينَ","End":"١٩"},{"SurahNumber":2,"VerseNumber":20,"Text":"يَكَادُ ٱلۡبَرۡقُ يَخۡطَفُ أَبۡصَٰرَهُمۡۖ كُلَّمَآ أَضَآءَ لَهُم مَّشَوۡاْ فِيهِ وَإِذَآ أَظۡلَمَ عَلَيۡهِمۡ قَامُواْۚ وَلَوۡ شَآءَ ٱللَّهُ لَذَهَبَ بِسَمۡعِهِمۡ وَأَبۡصَٰرِهِمۡۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","End":"٢٠"},{"SurahNumber":2,"VerseNumber":21,"Text":"يَـٰٓأَيُّهَا ٱلنَّاسُ ٱعۡبُدُواْ رَبَّكُمُ ٱلَّذِي خَلَقَكُمۡ وَٱلَّذِينَ مِن قَبۡلِكُمۡ لَعَلَّكُمۡ تَتَّقُونَ","End":"٢١"},{"SurahNumber":2,"VerseNumber":22,"Text":"ٱلَّذِي جَعَلَ لَكُمُ ٱلۡأَرۡضَ فِرَٰشٗا وَٱلسَّمَآءَ بِنَآءٗ وَأَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَأَخۡرَجَ بِهِۦ مِنَ ٱلثَّمَرَٰتِ رِزۡقٗا لَّكُمۡۖ فَلَا تَجۡعَلُواْ لِلَّهِ أَندَادٗا وَأَنتُمۡ تَعۡلَمُونَ","End":"٢٢"},{"SurahNumber":2,"VerseNumber":23,"Text":"وَإِن كُنتُمۡ فِي رَيۡبٖ مِّمَّا نَزَّلۡنَا عَلَىٰ عَبۡدِنَا فَأۡتُواْ بِسُورَةٖ مِّن مِّثۡلِهِۦ وَٱدۡعُواْ شُهَدَآءَكُم مِّن دُونِ ٱللَّهِ إِن كُنتُمۡ صَٰدِقِينَ","End":"٢٣"},{"SurahNumber":2,"VerseNumber":24,"Text":"فَإِن لَّمۡ تَفۡعَلُواْ وَلَن تَفۡعَلُواْ فَٱتَّقُواْ ٱلنَّارَ ٱلَّتِي وَقُودُهَا ٱلنَّاسُ وَٱلۡحِجَارَةُۖ أُعِدَّتۡ لِلۡكَٰفِرِينَ","End":"٢٤"},{"SurahNumber":2,"VerseNumber":25,"Text":"وَبَشِّرِ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّـٰلِحَٰتِ أَنَّ لَهُمۡ جَنَّـٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۖ كُلَّمَا رُزِقُواْ مِنۡهَا مِن ثَمَرَةٖ رِّزۡقٗا قَالُواْ هَٰذَا ٱلَّذِي رُزِقۡنَا مِن قَبۡلُۖ وَأُتُواْ بِهِۦ مُتَشَٰبِهٗاۖ وَلَهُمۡ فِيهَآ أَزۡوَٰجٞ مُّطَهَّرَةٞۖ وَهُمۡ فِيهَا خَٰلِدُونَ","End":"٢٥"},{"SurahNumber":2,"VerseNumber":26,"Text":"۞إِنَّ ٱللَّهَ لَا يَسۡتَحۡيِۦٓ أَن يَضۡرِبَ مَثَلٗا مَّا بَعُوضَةٗ فَمَا فَوۡقَهَاۚ فَأَمَّا ٱلَّذِينَ ءَامَنُواْ فَيَعۡلَمُونَ أَنَّهُ ٱلۡحَقُّ مِن رَّبِّهِمۡۖ وَأَمَّا ٱلَّذِينَ كَفَرُواْ فَيَقُولُونَ مَاذَآ أَرَادَ ٱللَّهُ بِهَٰذَا مَثَلٗاۘ يُضِلُّ بِهِۦ كَثِيرٗا وَيَهۡدِي بِهِۦ كَثِيرٗاۚ وَمَا يُضِلُّ بِهِۦٓ إِلَّا ٱلۡفَٰسِقِينَ","End":"٢٦"},{"SurahNumber":2,"VerseNumber":27,"Text":"ٱلَّذِينَ يَنقُضُونَ عَهۡدَ ٱللَّهِ مِنۢ بَعۡدِ مِيثَٰقِهِۦ وَيَقۡطَعُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ وَيُفۡسِدُونَ فِي ٱلۡأَرۡضِۚ أُوْلَـٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ","End":"٢٧"},{"SurahNumber":2,"VerseNumber":28,"Text":"كَيۡفَ تَكۡفُرُونَ بِٱللَّهِ وَكُنتُمۡ أَمۡوَٰتٗا فَأَحۡيَٰكُمۡۖ ثُمَّ يُمِيتُكُمۡ ثُمَّ يُحۡيِيكُمۡ ثُمَّ إِلَيۡهِ تُرۡجَعُونَ","End":"٢٨"},{"SurahNumber":2,"VerseNumber":29,"Text":"هُوَ ٱلَّذِي خَلَقَ لَكُم مَّا فِي ٱلۡأَرۡضِ جَمِيعٗا ثُمَّ ٱسۡتَوَىٰٓ إِلَى ٱلسَّمَآءِ فَسَوَّىٰهُنَّ سَبۡعَ سَمَٰوَٰتٖۚ وَهُوَ بِكُلِّ شَيۡءٍ عَلِيمٞ","End":"٢٩"},{"SurahNumber":2,"VerseNumber":30,"Text":"وَإِذۡ قَالَ رَبُّكَ لِلۡمَلَـٰٓئِكَةِ إِنِّي جَاعِلٞ فِي ٱلۡأَرۡضِ خَلِيفَةٗۖ قَالُوٓاْ أَتَجۡعَلُ فِيهَا مَن يُفۡسِدُ فِيهَا وَيَسۡفِكُ ٱلدِّمَآءَ وَنَحۡنُ نُسَبِّحُ بِحَمۡدِكَ وَنُقَدِّسُ لَكَۖ قَالَ إِنِّيٓ أَعۡلَمُ مَا لَا تَعۡلَمُونَ","End":"٣٠"},{"SurahNumber":2,"VerseNumber":31,"Text":"وَعَلَّمَ ءَادَمَ ٱلۡأَسۡمَآءَ كُلَّهَا ثُمَّ عَرَضَهُمۡ عَلَى ٱلۡمَلَـٰٓئِكَةِ فَقَالَ أَنۢبِـُٔونِي بِأَسۡمَآءِ هَـٰٓؤُلَآءِ إِن كُنتُمۡ صَٰدِقِينَ","End":"٣١"},{"SurahNumber":2,"VerseNumber":32,"Text":"قَالُواْ سُبۡحَٰنَكَ لَا عِلۡمَ لَنَآ إِلَّا مَا عَلَّمۡتَنَآۖ إِنَّكَ أَنتَ ٱلۡعَلِيمُ ٱلۡحَكِيمُ","End":"٣٢"},{"SurahNumber":2,"VerseNumber":33,"Text":"قَالَ يَـٰٓـَٔادَمُ أَنۢبِئۡهُم بِأَسۡمَآئِهِمۡۖ فَلَمَّآ أَنۢبَأَهُم بِأَسۡمَآئِهِمۡ قَالَ أَلَمۡ أَقُل لَّكُمۡ إِنِّيٓ أَعۡلَمُ غَيۡبَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَأَعۡلَمُ مَا تُبۡدُونَ وَمَا كُنتُمۡ تَكۡتُمُونَ","End":"٣٣"},{"SurahNumber":2,"VerseNumber":34,"Text":"وَإِذۡ قُلۡنَا لِلۡمَلَـٰٓئِكَةِ ٱسۡجُدُواْ لِأٓدَمَ فَسَجَدُوٓاْ إِلَّآ إِبۡلِيسَ أَبَىٰ وَٱسۡتَكۡبَرَ وَكَانَ مِنَ ٱلۡكَٰفِرِينَ","End":"٣٤"},{"SurahNumber":2,"VerseNumber":35,"Text":"وَقُلۡنَا يَـٰٓـَٔادَمُ ٱسۡكُنۡ أَنتَ وَزَوۡجُكَ ٱلۡجَنَّةَ وَكُلَا مِنۡهَا رَغَدًا حَيۡثُ شِئۡتُمَا وَلَا تَقۡرَبَا هَٰذِهِ ٱلشَّجَرَةَ فَتَكُونَا مِنَ ٱلظَّـٰلِمِينَ","End":"٣٥"},{"SurahNumber":2,"VerseNumber":36,"Text":"فَأَزَلَّهُمَا ٱلشَّيۡطَٰنُ عَنۡهَا فَأَخۡرَجَهُمَا مِمَّا كَانَا فِيهِۖ وَقُلۡنَا ٱهۡبِطُواْ بَعۡضُكُمۡ لِبَعۡضٍ عَدُوّٞۖ وَلَكُمۡ فِي ٱلۡأَرۡضِ مُسۡتَقَرّٞ وَمَتَٰعٌ إِلَىٰ حِينٖ","End":"٣٦"},{"SurahNumber":2,"VerseNumber":37,"Text":"فَتَلَقَّىٰٓ ءَادَمُ مِن رَّبِّهِۦ كَلِمَٰتٖ فَتَابَ عَلَيۡهِۚ إِنَّهُۥ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ","End":"٣٧"},{"SurahNumber":2,"VerseNumber":38,"Text":"قُلۡنَا ٱهۡبِطُواْ مِنۡهَا جَمِيعٗاۖ فَإِمَّا يَأۡتِيَنَّكُم مِّنِّي هُدٗى فَمَن تَبِعَ هُدَايَ فَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ","End":"٣٨"},{"SurahNumber":2,"VerseNumber":39,"Text":"وَٱلَّذِينَ كَفَرُواْ وَكَذَّبُواْ بِـَٔايَٰتِنَآ أُوْلَـٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ","End":"٣٩"},{"SurahNumber":2,"VerseNumber":40,"Text":"يَٰبَنِيٓ إِسۡرَـٰٓءِيلَ ٱذۡكُرُواْ نِعۡمَتِيَ ٱلَّتِيٓ أَنۡعَمۡتُ عَلَيۡكُمۡ وَأَوۡفُواْ بِعَهۡدِيٓ أُوفِ بِعَهۡدِكُمۡ وَإِيَّـٰيَ فَٱرۡهَبُونِ","End":"٤٠"},{"SurahNumber":2,"VerseNumber":41,"Text":"وَءَامِنُواْ بِمَآ أَنزَلۡتُ مُصَدِّقٗا لِّمَا مَعَكُمۡ وَلَا تَكُونُوٓاْ أَوَّلَ كَافِرِۭ بِهِۦۖ وَلَا تَشۡتَرُواْ بِـَٔايَٰتِي ثَمَنٗا قَلِيلٗا وَإِيَّـٰيَ فَٱتَّقُونِ","End":"٤١"},{"SurahNumber":2,"VerseNumber":42,"Text":"وَلَا تَلۡبِسُواْ ٱلۡحَقَّ بِٱلۡبَٰطِلِ وَتَكۡتُمُواْ ٱلۡحَقَّ وَأَنتُمۡ تَعۡلَمُونَ","End":"٤٢"},{"SurahNumber":2,"VerseNumber":43,"Text":"وَأَقِيمُواْ ٱلصَّلَوٰةَ وَءَاتُواْ ٱلزَّكَوٰةَ وَٱرۡكَعُواْ مَعَ ٱلرَّـٰكِعِينَ","End":"٤٣"},{"SurahNumber":2,"VerseNumber":44,"Text":"۞أَتَأۡمُرُونَ ٱلنَّاسَ بِٱلۡبِرِّ وَتَنسَوۡنَ أَنفُسَكُمۡ وَأَنتُمۡ تَتۡلُونَ ٱلۡكِتَٰبَۚ أَفَلَا تَعۡقِلُونَ","End":"٤٤"},{"SurahNumber":2,"VerseNumber":45,"Text":"وَٱسۡتَعِينُواْ بِٱلصَّبۡرِ وَٱلصَّلَوٰةِۚ وَإِنَّهَا لَكَبِيرَةٌ إِلَّا عَلَى ٱلۡخَٰشِعِينَ","End":"٤٥"},{"SurahNumber":2,"VerseNumber":46,"Text":"ٱلَّذِينَ يَظُنُّونَ أَنَّهُم مُّلَٰقُواْ رَبِّهِمۡ وَأَنَّهُمۡ إِلَيۡهِ رَٰجِعُونَ","End":"٤٦"},{"SurahNumber":2,"VerseNumber":47,"Text":"يَٰبَنِيٓ إِسۡرَـٰٓءِيلَ ٱذۡكُرُواْ نِعۡمَتِيَ ٱلَّتِيٓ أَنۡعَمۡتُ عَلَيۡكُمۡ وَأَنِّي فَضَّلۡتُكُمۡ عَلَى ٱلۡعَٰلَمِينَ","End":"٤٧"},{"SurahNumber":2,"VerseNumber":48,"Text":"وَٱتَّقُواْ يَوۡمٗا لَّا تَجۡزِي نَفۡسٌ عَن نَّفۡسٖ شَيۡـٔٗا وَلَا يُقۡبَلُ مِنۡهَا شَفَٰعَةٞ وَلَا يُؤۡخَذُ مِنۡهَا عَدۡلٞ وَلَا هُمۡ يُنصَرُونَ","End":"٤٨"},{"SurahNumber":2,"VerseNumber":49,"Text":"وَإِذۡ نَجَّيۡنَٰكُم مِّنۡ ءَالِ فِرۡعَوۡنَ يَسُومُونَكُمۡ سُوٓءَ ٱلۡعَذَابِ يُذَبِّحُونَ أَبۡنَآءَكُمۡ وَيَسۡتَحۡيُونَ نِسَآءَكُمۡۚ وَفِي ذَٰلِكُم بَلَآءٞ مِّن رَّبِّكُمۡ عَظِيمٞ","End":"٤٩"},{"SurahNumber":2,"VerseNumber":50,"Text":"وَإِذۡ فَرَقۡنَا بِكُمُ ٱلۡبَحۡرَ فَأَنجَيۡنَٰكُمۡ وَأَغۡرَقۡنَآ ءَالَ فِرۡعَوۡنَ وَأَنتُمۡ تَنظُرُونَ","End":"٥٠"},{"SurahNumber":2,"VerseNumber":51,"Text":"وَإِذۡ وَٰعَدۡنَا مُوسَىٰٓ أَرۡبَعِينَ لَيۡلَةٗ ثُمَّ ٱتَّخَذۡتُمُ ٱلۡعِجۡلَ مِنۢ بَعۡدِهِۦ وَأَنتُمۡ ظَٰلِمُونَ","End":"٥١"},{"SurahNumber":2,"VerseNumber":52,"Text":"ثُمَّ عَفَوۡنَا عَنكُم مِّنۢ بَعۡدِ ذَٰلِكَ لَعَلَّكُمۡ تَشۡكُرُونَ","End":"٥٢"},{"SurahNumber":2,"VerseNumber":53,"Text":"وَإِذۡ ءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ وَٱلۡفُرۡقَانَ لَعَلَّكُمۡ تَهۡتَدُونَ","End":"٥٣"},{"SurahNumber":2,"VerseNumber":54,"Text":"وَإِذۡ قَالَ مُوسَىٰ لِقَوۡمِهِۦ يَٰقَوۡمِ إِنَّكُمۡ ظَلَمۡتُمۡ أَنفُسَكُم بِٱتِّخَاذِكُمُ ٱلۡعِجۡلَ فَتُوبُوٓاْ إِلَىٰ بَارِئِكُمۡ فَٱقۡتُلُوٓاْ أَنفُسَكُمۡ ذَٰلِكُمۡ خَيۡرٞ لَّكُمۡ عِندَ بَارِئِكُمۡ فَتَابَ عَلَيۡكُمۡۚ إِنَّهُۥ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ","End":"٥٤"},{"SurahNumber":2,"VerseNumber":55,"Text":"وَإِذۡ قُلۡتُمۡ يَٰمُوسَىٰ لَن نُّؤۡمِنَ لَكَ حَتَّىٰ نَرَى ٱللَّهَ جَهۡرَةٗ فَأَخَذَتۡكُمُ ٱلصَّـٰعِقَةُ وَأَنتُمۡ تَنظُرُونَ","End":"٥٥"},{"SurahNumber":2,"VerseNumber":56,"Text":"ثُمَّ بَعَثۡنَٰكُم مِّنۢ بَعۡدِ مَوۡتِكُمۡ لَعَلَّكُمۡ تَشۡكُرُونَ","End":"٥٦"},{"SurahNumber":2,"VerseNumber":57,"Text":"وَظَلَّلۡنَا عَلَيۡكُمُ ٱلۡغَمَامَ وَأَنزَلۡنَا عَلَيۡكُمُ ٱلۡمَنَّ وَٱلسَّلۡوَىٰۖ كُلُواْ مِن طَيِّبَٰتِ مَا رَزَقۡنَٰكُمۡۚ وَمَا ظَلَمُونَا وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ","End":"٥٧"},{"SurahNumber":2,"VerseNumber":58,"Text":"وَإِذۡ قُلۡنَا ٱدۡخُلُواْ هَٰذِهِ ٱلۡقَرۡيَةَ فَكُلُواْ مِنۡهَا حَيۡثُ شِئۡتُمۡ رَغَدٗا وَٱدۡخُلُواْ ٱلۡبَابَ سُجَّدٗا وَقُولُواْ حِطَّةٞ نَّغۡفِرۡ لَكُمۡ خَطَٰيَٰكُمۡۚ وَسَنَزِيدُ ٱلۡمُحۡسِنِينَ","End":"٥٨"},{"SurahNumber":2,"VerseNumber":59,"Text":"فَبَدَّلَ ٱلَّذِينَ ظَلَمُواْ قَوۡلًا غَيۡرَ ٱلَّذِي قِيلَ لَهُمۡ فَأَنزَلۡنَا عَلَى ٱلَّذِينَ ظَلَمُواْ رِجۡزٗا مِّنَ ٱلسَّمَآءِ بِمَا كَانُواْ يَفۡسُقُونَ","End":"٥٩"},{"SurahNumber":2,"VerseNumber":60,"Text":"۞وَإِذِ ٱسۡتَسۡقَىٰ مُوسَىٰ لِقَوۡمِهِۦ فَقُلۡنَا ٱضۡرِب بِّعَصَاكَ ٱلۡحَجَرَۖ فَٱنفَجَرَتۡ مِنۡهُ ٱثۡنَتَا عَشۡرَةَ عَيۡنٗاۖ قَدۡ عَلِمَ كُلُّ أُنَاسٖ مَّشۡرَبَهُمۡۖ كُلُواْ وَٱشۡرَبُواْ مِن رِّزۡقِ ٱللَّهِ وَلَا تَعۡثَوۡاْ فِي ٱلۡأَرۡضِ مُفۡسِدِينَ","End":"٦٠"},{"SurahNumber":2,"VerseNumber":61,"Text":"وَإِذۡ قُلۡتُمۡ يَٰمُوسَىٰ لَن نَّصۡبِرَ عَلَىٰ طَعَامٖ وَٰحِدٖ فَٱدۡعُ لَنَا رَبَّكَ يُخۡرِجۡ لَنَا مِمَّا تُنۢبِتُ ٱلۡأَرۡضُ مِنۢ بَقۡلِهَا وَقِثَّآئِهَا وَفُومِهَا وَعَدَسِهَا وَبَصَلِهَاۖ قَالَ أَتَسۡتَبۡدِلُونَ ٱلَّذِي هُوَ أَدۡنَىٰ بِٱلَّذِي هُوَ خَيۡرٌۚ ٱهۡبِطُواْ مِصۡرٗا فَإِنَّ لَكُم مَّا سَأَلۡتُمۡۗ وَضُرِبَتۡ عَلَيۡهِمُ ٱلذِّلَّةُ وَٱلۡمَسۡكَنَةُ وَبَآءُو بِغَضَبٖ مِّنَ ٱللَّهِۚ ذَٰلِكَ بِأَنَّهُمۡ كَانُواْ يَكۡفُرُونَ بِـَٔايَٰتِ ٱللَّهِ وَيَقۡتُلُونَ ٱلنَّبِيِّـۧنَ بِغَيۡرِ ٱلۡحَقِّۚ ذَٰلِكَ بِمَا عَصَواْ وَّكَانُواْ يَعۡتَدُونَ","End":"٦١"},{"SurahNumber":2,"VerseNumber":62,"Text":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَٱلَّذِينَ هَادُواْ وَٱلنَّصَٰرَىٰ وَٱلصَّـٰبِـِٔينَ مَنۡ ءَامَنَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ وَعَمِلَ صَٰلِحٗا فَلَهُمۡ أَجۡرُهُمۡ عِندَ رَبِّهِمۡ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ","End":"٦٢"},{"SurahNumber":2,"VerseNumber":63,"Text":"وَإِذۡ أَخَذۡنَا مِيثَٰقَكُمۡ وَرَفَعۡنَا فَوۡقَكُمُ ٱلطُّورَ خُذُواْ مَآ ءَاتَيۡنَٰكُم بِقُوَّةٖ وَٱذۡكُرُواْ مَا فِيهِ لَعَلَّكُمۡ تَتَّقُونَ","End":"٦٣"},{"SurahNumber":2,"VerseNumber":64,"Text":"ثُمَّ تَوَلَّيۡتُم مِّنۢ بَعۡدِ ذَٰلِكَۖ فَلَوۡلَا فَضۡلُ ٱللَّهِ عَلَيۡكُمۡ وَرَحۡمَتُهُۥ لَكُنتُم مِّنَ ٱلۡخَٰسِرِينَ","End":"٦٤"},{"SurahNumber":2,"VerseNumber":65,"Text":"وَلَقَدۡ عَلِمۡتُمُ ٱلَّذِينَ ٱعۡتَدَوۡاْ مِنكُمۡ فِي ٱلسَّبۡتِ فَقُلۡنَا لَهُمۡ كُونُواْ قِرَدَةً خَٰسِـِٔينَ","End":"٦٥"},{"SurahNumber":2,"VerseNumber":66,"Text":"فَجَعَلۡنَٰهَا نَكَٰلٗا لِّمَا بَيۡنَ يَدَيۡهَا وَمَا خَلۡفَهَا وَمَوۡعِظَةٗ لِّلۡمُتَّقِينَ","End":"٦٦"},{"SurahNumber":2,"VerseNumber":67,"Text":"وَإِذۡ قَالَ مُوسَىٰ لِقَوۡمِهِۦٓ إِنَّ ٱللَّهَ يَأۡمُرُكُمۡ أَن تَذۡبَحُواْ بَقَرَةٗۖ قَالُوٓاْ أَتَتَّخِذُنَا هُزُوٗاۖ قَالَ أَعُوذُ بِٱللَّهِ أَنۡ أَكُونَ مِنَ ٱلۡجَٰهِلِينَ","End":"٦٧"},{"SurahNumber":2,"VerseNumber":68,"Text":"قَالُواْ ٱدۡعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا هِيَۚ قَالَ إِنَّهُۥ يَقُولُ إِنَّهَا بَقَرَةٞ لَّا فَارِضٞ وَلَا بِكۡرٌ عَوَانُۢ بَيۡنَ ذَٰلِكَۖ فَٱفۡعَلُواْ مَا تُؤۡمَرُونَ","End":"٦٨"},{"SurahNumber":2,"VerseNumber":69,"Text":"قَالُواْ ٱدۡعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا لَوۡنُهَاۚ قَالَ إِنَّهُۥ يَقُولُ إِنَّهَا بَقَرَةٞ صَفۡرَآءُ فَاقِعٞ لَّوۡنُهَا تَسُرُّ ٱلنَّـٰظِرِينَ","End":"٦٩"},{"SurahNumber":2,"VerseNumber":70,"Text":"قَالُواْ ٱدۡعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا هِيَ إِنَّ ٱلۡبَقَرَ تَشَٰبَهَ عَلَيۡنَا وَإِنَّآ إِن شَآءَ ٱللَّهُ لَمُهۡتَدُونَ","End":"٧٠"},{"SurahNumber":2,"VerseNumber":71,"Text":"قَالَ إِنَّهُۥ يَقُولُ إِنَّهَا بَقَرَةٞ لَّا ذَلُولٞ تُثِيرُ ٱلۡأَرۡضَ وَلَا تَسۡقِي ٱلۡحَرۡثَ مُسَلَّمَةٞ لَّا شِيَةَ فِيهَاۚ قَالُواْ ٱلۡـَٰٔنَ جِئۡتَ بِٱلۡحَقِّۚ فَذَبَحُوهَا وَمَا كَادُواْ يَفۡعَلُونَ","End":"٧١"},{"SurahNumber":2,"VerseNumber":72,"Text":"وَإِذۡ قَتَلۡتُمۡ نَفۡسٗا فَٱدَّـٰرَ ٰٔتُمۡ فِيهَاۖ وَٱللَّهُ مُخۡرِجٞ مَّا كُنتُمۡ تَكۡتُمُونَ","End":"٧٢"},{"SurahNumber":2,"VerseNumber":73,"Text":"فَقُلۡنَا ٱضۡرِبُوهُ بِبَعۡضِهَاۚ كَذَٰلِكَ يُحۡيِ ٱللَّهُ ٱلۡمَوۡتَىٰ وَيُرِيكُمۡ ءَايَٰتِهِۦ لَعَلَّكُمۡ تَعۡقِلُونَ","End":"٧٣"},{"SurahNumber":2,"VerseNumber":74,"Text":"ثُمَّ قَسَتۡ قُلُوبُكُم مِّنۢ بَعۡدِ ذَٰلِكَ فَهِيَ كَٱلۡحِجَارَةِ أَوۡ أَشَدُّ قَسۡوَةٗۚ وَإِنَّ مِنَ ٱلۡحِجَارَةِ لَمَا يَتَفَجَّرُ مِنۡهُ ٱلۡأَنۡهَٰرُۚ وَإِنَّ مِنۡهَا لَمَا يَشَّقَّقُ فَيَخۡرُجُ مِنۡهُ ٱلۡمَآءُۚ وَإِنَّ مِنۡهَا لَمَا يَهۡبِطُ مِنۡ خَشۡيَةِ ٱللَّهِۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعۡمَلُونَ","End":"٧٤"},{"SurahNumber":2,"VerseNumber":75,"Text":"۞أَفَتَطۡمَعُونَ أَن يُؤۡمِنُواْ لَكُمۡ وَقَدۡ كَانَ فَرِيقٞ مِّنۡهُمۡ يَسۡمَعُونَ كَلَٰمَ ٱللَّهِ ثُمَّ يُحَرِّفُونَهُۥ مِنۢ بَعۡدِ مَا عَقَلُوهُ وَهُمۡ يَعۡلَمُونَ","End":"٧٥"},{"SurahNumber":2,"VerseNumber":76,"Text":"وَإِذَا لَقُواْ ٱلَّذِينَ ءَامَنُواْ قَالُوٓاْ ءَامَنَّا وَإِذَا خَلَا بَعۡضُهُمۡ إِلَىٰ بَعۡضٖ قَالُوٓاْ أَتُحَدِّثُونَهُم بِمَا فَتَحَ ٱللَّهُ عَلَيۡكُمۡ لِيُحَآجُّوكُم بِهِۦ عِندَ رَبِّكُمۡۚ أَفَلَا تَعۡقِلُونَ","End":"٧٦"},{"SurahNumber":2,"VerseNumber":77,"Text":"أَوَلَا يَعۡلَمُونَ أَنَّ ٱللَّهَ يَعۡلَمُ مَا يُسِرُّونَ وَمَا يُعۡلِنُونَ","End":"٧٧"},{"SurahNumber":2,"VerseNumber":78,"Text":"وَمِنۡهُمۡ أُمِّيُّونَ لَا يَعۡلَمُونَ ٱلۡكِتَٰبَ إِلَّآ أَمَانِيَّ وَإِنۡ هُمۡ إِلَّا يَظُنُّونَ","End":"٧٨"},{"SurahNumber":2,"VerseNumber":79,"Text":"فَوَيۡلٞ لِّلَّذِينَ يَكۡتُبُونَ ٱلۡكِتَٰبَ بِأَيۡدِيهِمۡ ثُمَّ يَقُولُونَ هَٰذَا مِنۡ عِندِ ٱللَّهِ لِيَشۡتَرُواْ بِهِۦ ثَمَنٗا قَلِيلٗاۖ فَوَيۡلٞ لَّهُم مِّمَّا كَتَبَتۡ أَيۡدِيهِمۡ وَوَيۡلٞ لَّهُم مِّمَّا يَكۡسِبُونَ","End":"٧٩"},{"SurahNumber":2,"VerseNumber":80,"Text":"وَقَالُواْ لَن تَمَسَّنَا ٱلنَّارُ إِلَّآ أَيَّامٗا مَّعۡدُودَةٗۚ قُلۡ أَتَّخَذۡتُمۡ عِندَ ٱللَّهِ عَهۡدٗا فَلَن يُخۡلِفَ ٱللَّهُ عَهۡدَهُۥٓۖ أَمۡ تَقُولُونَ عَلَى ٱللَّهِ مَا لَا تَعۡلَمُونَ","End":"٨٠"},{"SurahNumber":2,"VerseNumber":81,"Text":"بَلَىٰۚ مَن كَسَبَ سَيِّئَةٗ وَأَحَٰطَتۡ بِهِۦ خَطِيٓـَٔتُهُۥ فَأُوْلَـٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ","End":"٨١"},{"SurahNumber":2,"VerseNumber":82,"Text":"وَٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّـٰلِحَٰتِ أُوْلَـٰٓئِكَ أَصۡحَٰبُ ٱلۡجَنَّةِۖ هُمۡ فِيهَا خَٰلِدُونَ","End":"٨٢"},{"SurahNumber":2,"VerseNumber":83,"Text":"وَإِذۡ أَخَذۡنَا مِيثَٰقَ بَنِيٓ إِسۡرَـٰٓءِيلَ لَا تَعۡبُدُونَ إِلَّا ٱللَّهَ وَبِٱلۡوَٰلِدَيۡنِ إِحۡسَانٗا وَذِي ٱلۡقُرۡبَىٰ وَٱلۡيَتَٰمَىٰ وَٱلۡمَسَٰكِينِ وَقُولُواْ لِلنَّاسِ حُسۡنٗا وَأَقِيمُواْ ٱلصَّلَوٰةَ وَءَاتُواْ ٱلزَّكَوٰةَ ثُمَّ تَوَلَّيۡتُمۡ إِلَّا قَلِيلٗا مِّنكُمۡ وَأَنتُم مُّعۡرِضُونَ","End":"٨٣"},{"SurahNumber":2,"VerseNumber":84,"Text":"وَإِذۡ أَخَذۡنَا مِيثَٰقَكُمۡ لَا تَسۡفِكُونَ دِمَآءَكُمۡ وَلَا تُخۡرِجُونَ أَنفُسَكُم مِّن دِيَٰرِكُمۡ ثُمَّ أَقۡرَرۡتُمۡ وَأَنتُمۡ تَشۡهَدُونَ","End":"٨٤"},{"SurahNumber":2,"VerseNumber":85,"Text":"ثُمَّ أَنتُمۡ هَـٰٓؤُلَآءِ تَقۡتُلُونَ أَنفُسَكُمۡ وَتُخۡرِجُونَ فَرِيقٗا مِّنكُم مِّن دِيَٰرِهِمۡ تَظَٰهَرُونَ عَلَيۡهِم بِٱلۡإِثۡمِ وَٱلۡعُدۡوَٰنِ وَإِن يَأۡتُوكُمۡ أُسَٰرَىٰ تُفَٰدُوهُمۡ وَهُوَ مُحَرَّمٌ عَلَيۡكُمۡ إِخۡرَاجُهُمۡۚ أَفَتُؤۡمِنُونَ بِبَعۡضِ ٱلۡكِتَٰبِ وَتَكۡفُرُونَ بِبَعۡضٖۚ فَمَا جَزَآءُ مَن يَفۡعَلُ ذَٰلِكَ مِنكُمۡ إِلَّا خِزۡيٞ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَيَوۡمَ ٱلۡقِيَٰمَةِ يُرَدُّونَ إِلَىٰٓ أَشَدِّ ٱلۡعَذَابِۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعۡمَلُونَ","End":"٨٥"},{"SurahNumber":2,"VerseNumber":86,"Text":"أُوْلَـٰٓئِكَ ٱلَّذِينَ ٱشۡتَرَوُاْ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا بِٱلۡأٓخِرَةِۖ فَلَا يُخَفَّفُ عَنۡهُمُ ٱلۡعَذَابُ وَلَا هُمۡ يُنصَرُونَ","End":"٨٦"},{"SurahNumber":2,"VerseNumber":87,"Text":"وَلَقَدۡ ءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ وَقَفَّيۡنَا مِنۢ بَعۡدِهِۦ بِٱلرُّسُلِۖ وَءَاتَيۡنَا عِيسَى ٱبۡنَ مَرۡيَمَ ٱلۡبَيِّنَٰتِ وَأَيَّدۡنَٰهُ بِرُوحِ ٱلۡقُدُسِۗ أَفَكُلَّمَا جَآءَكُمۡ رَسُولُۢ بِمَا لَا تَهۡوَىٰٓ أَنفُسُكُمُ ٱسۡتَكۡبَرۡتُمۡ فَفَرِيقٗا كَذَّبۡتُمۡ وَفَرِيقٗا تَقۡتُلُونَ","End":"٨٧"},{"SurahNumber":2,"VerseNumber":88,"Text":"وَقَالُواْ قُلُوبُنَا غُلۡفُۢۚ بَل لَّعَنَهُمُ ٱللَّهُ بِكُفۡرِهِمۡ فَقَلِيلٗا مَّا يُؤۡمِنُونَ","End":"٨٨"},{"SurahNumber":2,"VerseNumber":89,"Text":"وَلَمَّا جَآءَهُمۡ كِتَٰبٞ مِّنۡ عِندِ ٱللَّهِ مُصَدِّقٞ لِّمَا مَعَهُمۡ وَكَانُواْ مِن قَبۡلُ يَسۡتَفۡتِحُونَ عَلَى ٱلَّذِينَ كَفَرُواْ فَلَمَّا جَآءَهُم مَّا عَرَفُواْ كَفَرُواْ بِهِۦۚ فَلَعۡنَةُ ٱللَّهِ عَلَى ٱلۡكَٰفِرِينَ","End":"٨٩"},{"SurahNumber":2,"VerseNumber":90,"Text":"بِئۡسَمَا ٱشۡتَرَوۡاْ بِهِۦٓ أَنفُسَهُمۡ أَن يَكۡفُرُواْ بِمَآ أَنزَلَ ٱللَّهُ بَغۡيًا أَن يُنَزِّلَ ٱللَّهُ مِن فَضۡلِهِۦ عَلَىٰ مَن يَشَآءُ مِنۡ عِبَادِهِۦۖ فَبَآءُو بِغَضَبٍ عَلَىٰ غَضَبٖۚ وَلِلۡكَٰفِرِينَ عَذَابٞ مُّهِينٞ","End":"٩٠"},{"SurahNumber":2,"VerseNumber":91,"Text":"وَإِذَا قِيلَ لَهُمۡ ءَامِنُواْ بِمَآ أَنزَلَ ٱللَّهُ قَالُواْ نُؤۡمِنُ بِمَآ أُنزِلَ عَلَيۡنَا وَيَكۡفُرُونَ بِمَا وَرَآءَهُۥ وَهُوَ ٱلۡحَقُّ مُصَدِّقٗا لِّمَا مَعَهُمۡۗ قُلۡ فَلِمَ تَقۡتُلُونَ أَنۢبِيَآءَ ٱللَّهِ مِن قَبۡلُ إِن كُنتُم مُّؤۡمِنِينَ","End":"٩١"},{"SurahNumber":2,"VerseNumber":92,"Text":"۞وَلَقَدۡ جَآءَكُم مُّوسَىٰ بِٱلۡبَيِّنَٰتِ ثُمَّ ٱتَّخَذۡتُمُ ٱلۡعِجۡلَ مِنۢ بَعۡدِهِۦ وَأَنتُمۡ ظَٰلِمُونَ","End":"٩٢"},{"SurahNumber":2,"VerseNumber":93,"Text":"وَإِذۡ أَخَذۡنَا مِيثَٰقَكُمۡ وَرَفَعۡنَا فَوۡقَكُمُ ٱلطُّورَ خُذُواْ مَآ ءَاتَيۡنَٰكُم بِقُوَّةٖ وَٱسۡمَعُواْۖ قَالُواْ سَمِعۡنَا وَعَصَيۡنَا وَأُشۡرِبُواْ فِي قُلُوبِهِمُ ٱلۡعِجۡلَ بِكُفۡرِهِمۡۚ قُلۡ بِئۡسَمَا يَأۡمُرُكُم بِهِۦٓ إِيمَٰنُكُمۡ إِن كُنتُم مُّؤۡمِنِينَ","End":"٩٣"},{"SurahNumber":2,"VerseNumber":94,"Text":"قُلۡ إِن كَانَتۡ لَكُمُ ٱلدَّارُ ٱلۡأٓخِرَةُ عِندَ ٱللَّهِ خَالِصَةٗ مِّن دُونِ ٱلنَّاسِ فَتَمَنَّوُاْ ٱلۡمَوۡتَ إِن كُنتُمۡ صَٰدِقِينَ","End":"٩٤"},{"SurahNumber":2,"VerseNumber":95,"Text":"وَلَن يَتَمَنَّوۡهُ أَبَدَۢا بِمَا قَدَّمَتۡ أَيۡدِيهِمۡۚ وَٱللَّهُ عَلِيمُۢ بِٱلظَّـٰلِمِينَ","End":"٩٥"},{"SurahNumber":2,"VerseNumber":96,"Text":"وَلَتَجِدَنَّهُمۡ أَحۡرَصَ ٱلنَّاسِ عَلَىٰ حَيَوٰةٖ وَمِنَ ٱلَّذِينَ أَشۡرَكُواْۚ يَوَدُّ أَحَدُهُمۡ لَوۡ يُعَمَّرُ أَلۡفَ سَنَةٖ وَمَا هُوَ بِمُزَحۡزِحِهِۦ مِنَ ٱلۡعَذَابِ أَن يُعَمَّرَۗ وَٱللَّهُ بَصِيرُۢ بِمَا يَعۡمَلُونَ","End":"٩٦"},{"SurahNumber":2,"VerseNumber":97,"Text":"قُلۡ مَن كَانَ عَدُوّٗا لِّـجِبۡرِيلَ فَإِنَّهُۥ نَزَّلَهُۥ عَلَىٰ قَلۡبِكَ بِإِذۡنِ ٱللَّهِ مُصَدِّقٗا لِّمَا بَيۡنَ يَدَيۡهِ وَهُدٗى وَبُشۡرَىٰ لِلۡمُؤۡمِنِينَ","End":"٩٧"},{"SurahNumber":2,"VerseNumber":98,"Text":"مَن كَانَ عَدُوّٗا لِّلَّهِ وَمَلَـٰٓئِكَتِهِۦ وَرُسُلِهِۦ وَجِبۡرِيلَ وَمِيكَىٰلَ فَإِنَّ ٱللَّهَ عَدُوّٞ لِّلۡكَٰفِرِينَ","End":"٩٨"},{"SurahNumber":2,"VerseNumber":99,"Text":"وَلَقَدۡ أَنزَلۡنَآ إِلَيۡكَ ءَايَٰتِۭ بَيِّنَٰتٖۖ وَمَا يَكۡفُرُ بِهَآ إِلَّا ٱلۡفَٰسِقُونَ","End":"٩٩"},{"SurahNumber":2,"VerseNumber":100,"Text":"أَوَكُلَّمَا عَٰهَدُواْ عَهۡدٗا نَّبَذَهُۥ فَرِيقٞ مِّنۡهُمۚ بَلۡ أَكۡثَرُهُمۡ لَا يُؤۡمِنُونَ","End":"١٠٠"},{"SurahNumber":2,"VerseNumber":101,"Text":"وَلَمَّا جَآءَهُمۡ رَسُولٞ مِّنۡ عِندِ ٱللَّهِ مُصَدِّقٞ لِّمَا مَعَهُمۡ نَبَذَ فَرِيقٞ مِّنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ كِتَٰبَ ٱللَّهِ وَرَآءَ ظُهُورِهِمۡ كَأَنَّهُمۡ لَا يَعۡلَمُونَ","End":"١٠١"},{"SurahNumber":2,"VerseNumber":102,"Text":"وَٱتَّبَعُواْ مَا تَتۡلُواْ ٱلشَّيَٰطِينُ عَلَىٰ مُلۡكِ سُلَيۡمَٰنَۖ وَمَا كَفَرَ سُلَيۡمَٰنُ وَلَٰكِنَّ ٱلشَّيَٰطِينَ كَفَرُواْ يُعَلِّمُونَ ٱلنَّاسَ ٱلسِّحۡرَ وَمَآ أُنزِلَ عَلَى ٱلۡمَلَكَيۡنِ بِبَابِلَ هَٰرُوتَ وَمَٰرُوتَۚ وَمَا يُعَلِّمَانِ مِنۡ أَحَدٍ حَتَّىٰ يَقُولَآ إِنَّمَا نَحۡنُ فِتۡنَةٞ فَلَا تَكۡفُرۡۖ فَيَتَعَلَّمُونَ مِنۡهُمَا مَا يُفَرِّقُونَ بِهِۦ بَيۡنَ ٱلۡمَرۡءِ وَزَوۡجِهِۦۚ وَمَا هُم بِضَآرِّينَ بِهِۦ مِنۡ أَحَدٍ إِلَّا بِإِذۡنِ ٱللَّهِۚ وَيَتَعَلَّمُونَ مَا يَضُرُّهُمۡ وَلَا يَنفَعُهُمۡۚ وَلَقَدۡ عَلِمُواْ لَمَنِ ٱشۡتَرَىٰهُ مَا لَهُۥ فِي ٱلۡأٓخِرَةِ مِنۡ خَلَٰقٖۚ وَلَبِئۡسَ مَا شَرَوۡاْ بِهِۦٓ أَنفُسَهُمۡۚ لَوۡ كَانُواْ يَعۡلَمُونَ","End":"١٠٢"},{"SurahNumber":2,"VerseNumber":103,"Text":"وَلَوۡ أَنَّهُمۡ ءَامَنُواْ وَٱتَّقَوۡاْ لَمَثُوبَةٞ مِّنۡ عِندِ ٱللَّهِ خَيۡرٞۚ لَّوۡ كَانُواْ يَعۡلَمُونَ","End":"١٠٣"},{"SurahNumber":2,"VerseNumber":104,"Text":"يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَقُولُواْ رَٰعِنَا وَقُولُواْ ٱنظُرۡنَا وَٱسۡمَعُواْۗ وَلِلۡكَٰفِرِينَ عَذَابٌ أَلِيمٞ","End":"١٠٤"},{"SurahNumber":2,"VerseNumber":105,"Text":"مَّا يَوَدُّ ٱلَّذِينَ كَفَرُواْ مِنۡ أَهۡلِ ٱلۡكِتَٰبِ وَلَا ٱلۡمُشۡرِكِينَ أَن يُنَزَّلَ عَلَيۡكُم مِّنۡ خَيۡرٖ مِّن رَّبِّكُمۡۚ وَٱللَّهُ يَخۡتَصُّ بِرَحۡمَتِهِۦ مَن يَشَآءُۚ وَٱللَّهُ ذُو ٱلۡفَضۡلِ ٱلۡعَظِيمِ","End":"١٠٥"},{"SurahNumber":2,"VerseNumber":106,"Text":"۞مَا نَنسَخۡ مِنۡ ءَايَةٍ أَوۡ نُنسِهَا نَأۡتِ بِخَيۡرٖ مِّنۡهَآ أَوۡ مِثۡلِهَآۗ أَلَمۡ تَعۡلَمۡ أَنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ","End":"١٠٦"},{"SurahNumber":2,"VerseNumber":107,"Text":"أَلَمۡ تَعۡلَمۡ أَنَّ ٱللَّهَ لَهُۥ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۗ وَمَا لَكُم مِّن دُونِ ٱللَّهِ مِن وَلِيّٖ وَلَا نَصِيرٍ","End":"١٠٧"},{"SurahNumber":2,"VerseNumber":108,"Text":"أَمۡ تُرِيدُونَ أَن تَسۡـَٔلُواْ رَسُولَكُمۡ كَمَا سُئِلَ مُوسَىٰ مِن قَبۡلُۗ وَمَن يَتَبَدَّلِ ٱلۡكُفۡرَ بِٱلۡإِيمَٰنِ فَقَدۡ ضَلَّ سَوَآءَ ٱلسَّبِيلِ","End":"١٠٨"},{"SurahNumber":2,"VerseNumber":109,"Text":"وَدَّ كَثِيرٞ مِّنۡ أَهۡلِ ٱلۡكِتَٰبِ لَوۡ يَرُدُّونَكُم مِّنۢ بَعۡدِ إِيمَٰنِكُمۡ كُفَّارًا حَسَدٗا مِّنۡ عِندِ أَنفُسِهِم مِّنۢ بَعۡدِ مَا تَبَيَّنَ لَهُمُ ٱلۡحَقُّۖ فَٱعۡفُواْ وَٱصۡفَحُواْ حَتَّىٰ يَأۡتِيَ ٱللَّهُ بِأَمۡرِهِۦٓۗ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","End":"١٠٩"},{"SurahNumber":2,"VerseNumber":110,"Text":"وَأَقِيمُواْ ٱلصَّلَوٰةَ وَءَاتُواْ ٱلزَّكَوٰةَۚ وَمَا تُقَدِّمُواْ لِأَنفُسِكُم مِّنۡ خَيۡرٖ تَجِدُوهُ عِندَ ٱللَّهِۗ إِنَّ ٱللَّهَ بِمَا تَعۡمَلُونَ بَصِيرٞ","End":"١١٠"},{"SurahNumber":2,"VerseNumber":111,"Text":"وَقَالُواْ لَن يَدۡخُلَ ٱلۡجَنَّةَ إِلَّا مَن كَانَ هُودًا أَوۡ نَصَٰرَىٰۗ تِلۡكَ أَمَانِيُّهُمۡۗ قُلۡ هَاتُواْ بُرۡهَٰنَكُمۡ إِن كُنتُمۡ صَٰدِقِينَ","End":"١١١"},{"SurahNumber":2,"VerseNumber":112,"Text":"بَلَىٰۚ مَنۡ أَسۡلَمَ وَجۡهَهُۥ لِلَّهِ وَهُوَ مُحۡسِنٞ فَلَهُۥٓ أَجۡرُهُۥ عِندَ رَبِّهِۦ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ","End":"١١٢"},{"SurahNumber":2,"VerseNumber":113,"Text":"وَقَالَتِ ٱلۡيَهُودُ لَيۡسَتِ ٱلنَّصَٰرَىٰ عَلَىٰ شَيۡءٖ وَقَالَتِ ٱلنَّصَٰرَىٰ لَيۡسَتِ ٱلۡيَهُودُ عَلَىٰ شَيۡءٖ وَهُمۡ يَتۡلُونَ ٱلۡكِتَٰبَۗ كَذَٰلِكَ قَالَ ٱلَّذِينَ لَا يَعۡلَمُونَ مِثۡلَ قَوۡلِهِمۡۚ فَٱللَّهُ يَحۡكُمُ بَيۡنَهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ فِيمَا كَانُواْ فِيهِ يَخۡتَلِفُونَ","End":"١١٣"},{"SurahNumber":2,"VerseNumber":114,"Text":"وَمَنۡ أَظۡلَمُ مِمَّن مَّنَعَ مَسَٰجِدَ ٱللَّهِ أَن يُذۡكَرَ فِيهَا ٱسۡمُهُۥ وَسَعَىٰ فِي خَرَابِهَآۚ أُوْلَـٰٓئِكَ مَا كَانَ لَهُمۡ أَن يَدۡخُلُوهَآ إِلَّا خَآئِفِينَۚ لَهُمۡ فِي ٱلدُّنۡيَا خِزۡيٞ وَلَهُمۡ فِي ٱلۡأٓخِرَةِ عَذَابٌ عَظِيمٞ","End":"١١٤"},{"SurahNumber":2,"VerseNumber":115,"Text":"وَلِلَّهِ ٱلۡمَشۡرِقُ وَٱلۡمَغۡرِبُۚ فَأَيۡنَمَا تُوَلُّواْ فَثَمَّ وَجۡهُ ٱللَّهِۚ إِنَّ ٱللَّهَ وَٰسِعٌ عَلِيمٞ","End":"١١٥"},{"SurahNumber":2,"VerseNumber":116,"Text":"وَقَالُواْ ٱتَّخَذَ ٱللَّهُ وَلَدٗاۗ سُبۡحَٰنَهُۥۖ بَل لَّهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ كُلّٞ لَّهُۥ قَٰنِتُونَ","End":"١١٦"},{"SurahNumber":2,"VerseNumber":117,"Text":"بَدِيعُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ وَإِذَا قَضَىٰٓ أَمۡرٗا فَإِنَّمَا يَقُولُ لَهُۥ كُن فَيَكُونُ","End":"١١٧"},{"SurahNumber":2,"VerseNumber":118,"Text":"وَقَالَ ٱلَّذِينَ لَا يَعۡلَمُونَ لَوۡلَا يُكَلِّمُنَا ٱللَّهُ أَوۡ تَأۡتِينَآ ءَايَةٞۗ كَذَٰلِكَ قَالَ ٱلَّذِينَ مِن قَبۡلِهِم مِّثۡلَ قَوۡلِهِمۡۘ تَشَٰبَهَتۡ قُلُوبُهُمۡۗ قَدۡ بَيَّنَّا ٱلۡأٓيَٰتِ لِقَوۡمٖ يُوقِنُونَ","End":"١١٨"},{"SurahNumber":2,"VerseNumber":119,"Text":"إِنَّآ أَرۡسَلۡنَٰكَ بِٱلۡحَقِّ بَشِيرٗا وَنَذِيرٗاۖ وَلَا تُسۡـَٔلُ عَنۡ أَصۡحَٰبِ ٱلۡجَحِيمِ","End":"١١٩"},{"SurahNumber":2,"VerseNumber":120,"Text":"وَلَن تَرۡضَىٰ عَنكَ ٱلۡيَهُودُ وَلَا ٱلنَّصَٰرَىٰ حَتَّىٰ تَتَّبِعَ مِلَّتَهُمۡۗ قُلۡ إِنَّ هُدَى ٱللَّهِ هُوَ ٱلۡهُدَىٰۗ وَلَئِنِ ٱتَّبَعۡتَ أَهۡوَآءَهُم بَعۡدَ ٱلَّذِي جَآءَكَ مِنَ ٱلۡعِلۡمِ مَا لَكَ مِنَ ٱللَّهِ مِن وَلِيّٖ وَلَا نَصِيرٍ","End":"١٢٠"},{"SurahNumber":2,"VerseNumber":121,"Text":"ٱلَّذِينَ ءَاتَيۡنَٰهُمُ ٱلۡكِتَٰبَ يَتۡلُونَهُۥ حَقَّ تِلَاوَتِهِۦٓ أُوْلَـٰٓئِكَ يُؤۡمِنُونَ بِهِۦۗ وَمَن يَكۡفُرۡ بِهِۦ فَأُوْلَـٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ","End":"١٢١"},{"SurahNumber":2,"VerseNumber":122,"Text":"يَٰبَنِيٓ إِسۡرَـٰٓءِيلَ ٱذۡكُرُواْ نِعۡمَتِيَ ٱلَّتِيٓ أَنۡعَمۡتُ عَلَيۡكُمۡ وَأَنِّي فَضَّلۡتُكُمۡ عَلَى ٱلۡعَٰلَمِينَ","End":"١٢٢"},{"SurahNumber":2,"VerseNumber":123,"Text":"وَٱتَّقُواْ يَوۡمٗا لَّا تَجۡزِي نَفۡسٌ عَن نَّفۡسٖ شَيۡـٔٗا وَلَا يُقۡبَلُ مِنۡهَا عَدۡلٞ وَلَا تَنفَعُهَا شَفَٰعَةٞ وَلَا هُمۡ يُنصَرُونَ","End":"١٢٣"},{"SurahNumber":2,"VerseNumber":124,"Text":"۞وَإِذِ ٱبۡتَلَىٰٓ إِبۡرَٰهِـۧمَ رَبُّهُۥ بِكَلِمَٰتٖ فَأَتَمَّهُنَّۖ قَالَ إِنِّي جَاعِلُكَ لِلنَّاسِ إِمَامٗاۖ قَالَ وَمِن ذُرِّيَّتِيۖ قَالَ لَا يَنَالُ عَهۡدِي ٱلظَّـٰلِمِينَ","End":"١٢٤"},{"SurahNumber":2,"VerseNumber":125,"Text":"وَإِذۡ جَعَلۡنَا ٱلۡبَيۡتَ مَثَابَةٗ لِّلنَّاسِ وَأَمۡنٗا وَٱتَّخِذُواْ مِن مَّقَامِ إِبۡرَٰهِـۧمَ مُصَلّٗىۖ وَعَهِدۡنَآ إِلَىٰٓ إِبۡرَٰهِـۧمَ وَإِسۡمَٰعِيلَ أَن طَهِّرَا بَيۡتِيَ لِلطَّآئِفِينَ وَٱلۡعَٰكِفِينَ وَٱلرُّكَّعِ ٱلسُّجُودِ","End":"١٢٥"},{"SurahNumber":2,"VerseNumber":126,"Text":"وَإِذۡ قَالَ إِبۡرَٰهِـۧمُ رَبِّ ٱجۡعَلۡ هَٰذَا بَلَدًا ءَامِنٗا وَٱرۡزُقۡ أَهۡلَهُۥ مِنَ ٱلثَّمَرَٰتِ مَنۡ ءَامَنَ مِنۡهُم بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِۚ قَالَ وَمَن كَفَرَ فَأُمَتِّعُهُۥ قَلِيلٗا ثُمَّ أَضۡطَرُّهُۥٓ إِلَىٰ عَذَابِ ٱلنَّارِۖ وَبِئۡسَ ٱلۡمَصِيرُ","End":"١٢٦"},{"SurahNumber":2,"VerseNumber":127,"Text":"وَإِذۡ يَرۡفَعُ إِبۡرَٰهِـۧمُ ٱلۡقَوَاعِدَ مِنَ ٱلۡبَيۡتِ وَإِسۡمَٰعِيلُ رَبَّنَا تَقَبَّلۡ مِنَّآۖ إِنَّكَ أَنتَ ٱلسَّمِيعُ ٱلۡعَلِيمُ","End":"١٢٧"},{"SurahNumber":2,"VerseNumber":128,"Text":"رَبَّنَا وَٱجۡعَلۡنَا مُسۡلِمَيۡنِ لَكَ وَمِن ذُرِّيَّتِنَآ أُمَّةٗ مُّسۡلِمَةٗ لَّكَ وَأَرِنَا مَنَاسِكَنَا وَتُبۡ عَلَيۡنَآۖ إِنَّكَ أَنتَ ٱلتَّوَّابُ ٱلرَّحِيمُ","End":"١٢٨"},{"SurahNumber":2,"VerseNumber":129,"Text":"رَبَّنَا وَٱبۡعَثۡ فِيهِمۡ رَسُولٗا مِّنۡهُمۡ يَتۡلُواْ عَلَيۡهِمۡ ءَايَٰتِكَ وَيُعَلِّمُهُمُ ٱلۡكِتَٰبَ وَٱلۡحِكۡمَةَ وَيُزَكِّيهِمۡۖ إِنَّكَ أَنتَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","End":"١٢٩"},{"SurahNumber":2,"VerseNumber":130,"Text":"وَمَن يَرۡغَبُ عَن مِّلَّةِ إِبۡرَٰهِـۧمَ إِلَّا مَن سَفِهَ نَفۡسَهُۥۚ وَلَقَدِ ٱصۡطَفَيۡنَٰهُ فِي ٱلدُّنۡيَاۖ وَإِنَّهُۥ فِي ٱلۡأٓخِرَةِ لَمِنَ ٱلصَّـٰلِحِينَ","End":"١٣٠"},{"SurahNumber":2,"VerseNumber":131,"Text":"إِذۡ قَالَ لَهُۥ رَبُّهُۥٓ أَسۡلِمۡۖ قَالَ أَسۡلَمۡتُ لِرَبِّ ٱلۡعَٰلَمِينَ","End":"١٣١"},{"SurahNumber":2,"VerseNumber":132,"Text":"وَوَصَّىٰ بِهَآ إِبۡرَٰهِـۧمُ بَنِيهِ وَيَعۡقُوبُ يَٰبَنِيَّ إِنَّ ٱللَّهَ ٱصۡطَفَىٰ لَكُمُ ٱلدِّينَ فَلَا تَمُوتُنَّ إِلَّا وَأَنتُم مُّسۡلِمُونَ","End":"١٣٢"},{"SurahNumber":2,"VerseNumber":133,"Text":"أَمۡ كُنتُمۡ شُهَدَآءَ إِذۡ حَضَرَ يَعۡقُوبَ ٱلۡمَوۡتُ إِذۡ قَالَ لِبَنِيهِ مَا تَعۡبُدُونَ مِنۢ بَعۡدِيۖ قَالُواْ نَعۡبُدُ إِلَٰهَكَ وَإِلَٰهَ ءَابَآئِكَ إِبۡرَٰهِـۧمَ وَإِسۡمَٰعِيلَ وَإِسۡحَٰقَ إِلَٰهٗا وَٰحِدٗا وَنَحۡنُ لَهُۥ مُسۡلِمُونَ","End":"١٣٣"},{"SurahNumber":2,"VerseNumber":134,"Text":"تِلۡكَ أُمَّةٞ قَدۡ خَلَتۡۖ لَهَا مَا كَسَبَتۡ وَلَكُم مَّا كَسَبۡتُمۡۖ وَلَا تُسۡـَٔلُونَ عَمَّا كَانُواْ يَعۡمَلُونَ","End":"١٣٤"},{"SurahNumber":2,"VerseNumber":135,"Text":"وَقَالُواْ كُونُواْ هُودًا أَوۡ نَصَٰرَىٰ تَهۡتَدُواْۗ قُلۡ بَلۡ مِلَّةَ إِبۡرَٰهِـۧمَ حَنِيفٗاۖ وَمَا كَانَ مِنَ ٱلۡمُشۡرِكِينَ","End":"١٣٥"},{"SurahNumber":2,"VerseNumber":136,"Text":"قُولُوٓاْ ءَامَنَّا بِٱللَّهِ وَمَآ أُنزِلَ إِلَيۡنَا وَمَآ أُنزِلَ إِلَىٰٓ إِبۡرَٰهِـۧمَ وَإِسۡمَٰعِيلَ وَإِسۡحَٰقَ وَيَعۡقُوبَ وَٱلۡأَسۡبَاطِ وَمَآ أُوتِيَ مُوسَىٰ وَعِيسَىٰ وَمَآ أُوتِيَ ٱلنَّبِيُّونَ مِن رَّبِّهِمۡ لَا نُفَرِّقُ بَيۡنَ أَحَدٖ مِّنۡهُمۡ وَنَحۡنُ لَهُۥ مُسۡلِمُونَ","End":"١٣٦"},{"SurahNumber":2,"VerseNumber":137,"Text":"فَإِنۡ ءَامَنُواْ بِمِثۡلِ مَآ ءَامَنتُم بِهِۦ فَقَدِ ٱهۡتَدَواْۖ وَّإِن تَوَلَّوۡاْ فَإِنَّمَا هُمۡ فِي شِقَاقٖۖ فَسَيَكۡفِيكَهُمُ ٱللَّهُۚ وَهُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ","End":"١٣٧"},{"SurahNumber":2,"VerseNumber":138,"Text":"صِبۡغَةَ ٱللَّهِ وَمَنۡ أَحۡسَنُ مِنَ ٱللَّهِ صِبۡغَةٗۖ وَنَحۡنُ لَهُۥ عَٰبِدُونَ","End":"١٣٨"},{"SurahNumber":2,"VerseNumber":139,"Text":"قُلۡ أَتُحَآجُّونَنَا فِي ٱللَّهِ وَهُوَ رَبُّنَا وَرَبُّكُمۡ وَلَنَآ أَعۡمَٰلُنَا وَلَكُمۡ أَعۡمَٰلُكُمۡ وَنَحۡنُ لَهُۥ مُخۡلِصُونَ","End":"١٣٩"},{"SurahNumber":2,"VerseNumber":140,"Text":"أَمۡ تَقُولُونَ إِنَّ إِبۡرَٰهِـۧمَ وَإِسۡمَٰعِيلَ وَإِسۡحَٰقَ وَيَعۡقُوبَ وَٱلۡأَسۡبَاطَ كَانُواْ هُودًا أَوۡ نَصَٰرَىٰۗ قُلۡ ءَأَنتُمۡ أَعۡلَمُ أَمِ ٱللَّهُۗ وَمَنۡ أَظۡلَمُ مِمَّن كَتَمَ شَهَٰدَةً عِندَهُۥ مِنَ ٱللَّهِۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعۡمَلُونَ","End":"١٤٠"},{"SurahNumber":2,"VerseNumber":141,"Text":"تِلۡكَ أُمَّةٞ قَدۡ خَلَتۡۖ لَهَا مَا كَسَبَتۡ وَلَكُم مَّا كَسَبۡتُمۡۖ وَلَا تُسۡـَٔلُونَ عَمَّا كَانُواْ يَعۡمَلُونَ","End":"١٤١"},{"SurahNumber":2,"VerseNumber":142,"Text":"۞سَيَقُولُ ٱلسُّفَهَآءُ مِنَ ٱلنَّاسِ مَا وَلَّىٰهُمۡ عَن قِبۡلَتِهِمُ ٱلَّتِي كَانُواْ عَلَيۡهَاۚ قُل لِّلَّهِ ٱلۡمَشۡرِقُ وَٱلۡمَغۡرِبُۚ يَهۡدِي مَن يَشَآءُ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ","End":"١٤٢"},{"SurahNumber":2,"VerseNumber":143,"Text":"وَكَذَٰلِكَ جَعَلۡنَٰكُمۡ أُمَّةٗ وَسَطٗا لِّتَكُونُواْ شُهَدَآءَ عَلَى ٱلنَّاسِ وَيَكُونَ ٱلرَّسُولُ عَلَيۡكُمۡ شَهِيدٗاۗ وَمَا جَعَلۡنَا ٱلۡقِبۡلَةَ ٱلَّتِي كُنتَ عَلَيۡهَآ إِلَّا لِنَعۡلَمَ مَن يَتَّبِعُ ٱلرَّسُولَ مِمَّن يَنقَلِبُ عَلَىٰ عَقِبَيۡهِۚ وَإِن كَانَتۡ لَكَبِيرَةً إِلَّا عَلَى ٱلَّذِينَ هَدَى ٱللَّهُۗ وَمَا كَانَ ٱللَّهُ لِيُضِيعَ إِيمَٰنَكُمۡۚ إِنَّ ٱللَّهَ بِٱلنَّاسِ لَرَءُوفٞ رَّحِيمٞ","End":"١٤٣"},{"SurahNumber":2,"VerseNumber":144,"Text":"قَدۡ نَرَىٰ تَقَلُّبَ وَجۡهِكَ فِي ٱلسَّمَآءِۖ فَلَنُوَلِّيَنَّكَ قِبۡلَةٗ تَرۡضَىٰهَاۚ فَوَلِّ وَجۡهَكَ شَطۡرَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِۚ وَحَيۡثُ مَا كُنتُمۡ فَوَلُّواْ وُجُوهَكُمۡ شَطۡرَهُۥۗ وَإِنَّ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ لَيَعۡلَمُونَ أَنَّهُ ٱلۡحَقُّ مِن رَّبِّهِمۡۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا يَعۡمَلُونَ","End":"١٤٤"},{"SurahNumber":2,"VerseNumber":145,"Text":"وَلَئِنۡ أَتَيۡتَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ بِكُلِّ ءَايَةٖ مَّا تَبِعُواْ قِبۡلَتَكَۚ وَمَآ أَنتَ بِتَابِعٖ قِبۡلَتَهُمۡۚ وَمَا بَعۡضُهُم بِتَابِعٖ قِبۡلَةَ بَعۡضٖۚ وَلَئِنِ ٱتَّبَعۡتَ أَهۡوَآءَهُم مِّنۢ بَعۡدِ مَا جَآءَكَ مِنَ ٱلۡعِلۡمِ إِنَّكَ إِذٗا لَّمِنَ ٱلظَّـٰلِمِينَ","End":"١٤٥"},{"SurahNumber":2,"VerseNumber":146,"Text":"ٱلَّذِينَ ءَاتَيۡنَٰهُمُ ٱلۡكِتَٰبَ يَعۡرِفُونَهُۥ كَمَا يَعۡرِفُونَ أَبۡنَآءَهُمۡۖ وَإِنَّ فَرِيقٗا مِّنۡهُمۡ لَيَكۡتُمُونَ ٱلۡحَقَّ وَهُمۡ يَعۡلَمُونَ","End":"١٤٦"},{"SurahNumber":2,"VerseNumber":147,"Text":"ٱلۡحَقُّ مِن رَّبِّكَ فَلَا تَكُونَنَّ مِنَ ٱلۡمُمۡتَرِينَ","End":"١٤٧"},{"SurahNumber":2,"VerseNumber":148,"Text":"وَلِكُلّٖ وِجۡهَةٌ هُوَ مُوَلِّيهَاۖ فَٱسۡتَبِقُواْ ٱلۡخَيۡرَٰتِۚ أَيۡنَ مَا تَكُونُواْ يَأۡتِ بِكُمُ ٱللَّهُ جَمِيعًاۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","End":"١٤٨"},{"SurahNumber":2,"VerseNumber":149,"Text":"وَمِنۡ حَيۡثُ خَرَجۡتَ فَوَلِّ وَجۡهَكَ شَطۡرَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِۖ وَإِنَّهُۥ لَلۡحَقُّ مِن رَّبِّكَۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعۡمَلُونَ","End":"١٤٩"},{"SurahNumber":2,"VerseNumber":150,"Text":"وَمِنۡ حَيۡثُ خَرَجۡتَ فَوَلِّ وَجۡهَكَ شَطۡرَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِۚ وَحَيۡثُ مَا كُنتُمۡ فَوَلُّواْ وُجُوهَكُمۡ شَطۡرَهُۥ لِئَلَّا يَكُونَ لِلنَّاسِ عَلَيۡكُمۡ حُجَّةٌ إِلَّا ٱلَّذِينَ ظَلَمُواْ مِنۡهُمۡ فَلَا تَخۡشَوۡهُمۡ وَٱخۡشَوۡنِي وَلِأُتِمَّ نِعۡمَتِي عَلَيۡكُمۡ وَلَعَلَّكُمۡ تَهۡتَدُونَ","End":"١٥٠"},{"SurahNumber":2,"VerseNumber":151,"Text":"كَمَآ أَرۡسَلۡنَا فِيكُمۡ رَسُولٗا مِّنكُمۡ يَتۡلُواْ عَلَيۡكُمۡ ءَايَٰتِنَا وَيُزَكِّيكُمۡ وَيُعَلِّمُكُمُ ٱلۡكِتَٰبَ وَٱلۡحِكۡمَةَ وَيُعَلِّمُكُم مَّا لَمۡ تَكُونُواْ تَعۡلَمُونَ","End":"١٥١"},{"SurahNumber":2,"VerseNumber":152,"Text":"فَٱذۡكُرُونِيٓ أَذۡكُرۡكُمۡ وَٱشۡكُرُواْ لِي وَلَا تَكۡفُرُونِ","End":"١٥٢"},{"SurahNumber":2,"VerseNumber":153,"Text":"يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱسۡتَعِينُواْ بِٱلصَّبۡرِ وَٱلصَّلَوٰةِۚ إِنَّ ٱللَّهَ مَعَ ٱلصَّـٰبِرِينَ","End":"١٥٣"},{"SurahNumber":2,"VerseNumber":154,"Text":"وَلَا تَقُولُواْ لِمَن يُقۡتَلُ فِي سَبِيلِ ٱللَّهِ أَمۡوَٰتُۢۚ بَلۡ أَحۡيَآءٞ وَلَٰكِن لَّا تَشۡعُرُونَ","End":"١٥٤"},{"SurahNumber":2,"VerseNumber":155,"Text":"وَلَنَبۡلُوَنَّكُم بِشَيۡءٖ مِّنَ ٱلۡخَوۡفِ وَٱلۡجُوعِ وَنَقۡصٖ مِّنَ ٱلۡأَمۡوَٰلِ وَٱلۡأَنفُسِ وَٱلثَّمَرَٰتِۗ وَبَشِّرِ ٱلصَّـٰبِرِينَ","End":"١٥٥"},{"SurahNumber":2,"VerseNumber":156,"Text":"ٱلَّذِينَ إِذَآ أَصَٰبَتۡهُم مُّصِيبَةٞ قَالُوٓاْ إِنَّا لِلَّهِ وَإِنَّآ إِلَيۡهِ رَٰجِعُونَ","End":"١٥٦"},{"SurahNumber":2,"VerseNumber":157,"Text":"أُوْلَـٰٓئِكَ عَلَيۡهِمۡ صَلَوَٰتٞ مِّن رَّبِّهِمۡ وَرَحۡمَةٞۖ وَأُوْلَـٰٓئِكَ هُمُ ٱلۡمُهۡتَدُونَ","End":"١٥٧"},{"SurahNumber":2,"VerseNumber":158,"Text":"۞إِنَّ ٱلصَّفَا وَٱلۡمَرۡوَةَ مِن شَعَآئِرِ ٱللَّهِۖ فَمَنۡ حَجَّ ٱلۡبَيۡتَ أَوِ ٱعۡتَمَرَ فَلَا جُنَاحَ عَلَيۡهِ أَن يَطَّوَّفَ بِهِمَاۚ وَمَن تَطَوَّعَ خَيۡرٗا فَإِنَّ ٱللَّهَ شَاكِرٌ عَلِيمٌ","End":"١٥٨"},{"SurahNumber":2,"VerseNumber":159,"Text":"إِنَّ ٱلَّذِينَ يَكۡتُمُونَ مَآ أَنزَلۡنَا مِنَ ٱلۡبَيِّنَٰتِ وَٱلۡهُدَىٰ مِنۢ بَعۡدِ مَا بَيَّنَّـٰهُ لِلنَّاسِ فِي ٱلۡكِتَٰبِ أُوْلَـٰٓئِكَ يَلۡعَنُهُمُ ٱللَّهُ وَيَلۡعَنُهُمُ ٱللَّـٰعِنُونَ","End":"١٥٩"},{"SurahNumber":2,"VerseNumber":160,"Text":"إِلَّا ٱلَّذِينَ تَابُواْ وَأَصۡلَحُواْ وَبَيَّنُواْ فَأُوْلَـٰٓئِكَ أَتُوبُ عَلَيۡهِمۡ وَأَنَا ٱلتَّوَّابُ ٱلرَّحِيمُ","End":"١٦٠"},{"SurahNumber":2,"VerseNumber":161,"Text":"إِنَّ ٱلَّذِينَ كَفَرُواْ وَمَاتُواْ وَهُمۡ كُفَّارٌ أُوْلَـٰٓئِكَ عَلَيۡهِمۡ لَعۡنَةُ ٱللَّهِ وَٱلۡمَلَـٰٓئِكَةِ وَٱلنَّاسِ أَجۡمَعِينَ","End":"١٦١"},{"SurahNumber":2,"VerseNumber":162,"Text":"خَٰلِدِينَ فِيهَا لَا يُخَفَّفُ عَنۡهُمُ ٱلۡعَذَابُ وَلَا هُمۡ يُنظَرُونَ","End":"١٦٢"},{"SurahNumber":2,"VerseNumber":163,"Text":"وَإِلَٰهُكُمۡ إِلَٰهٞ وَٰحِدٞۖ لَّآ إِلَٰهَ إِلَّا هُوَ ٱلرَّحۡمَٰنُ ٱلرَّحِيمُ","End":"١٦٣"},{"SurahNumber":2,"VerseNumber":164,"Text":"إِنَّ فِي خَلۡقِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَٱخۡتِلَٰفِ ٱلَّيۡلِ وَٱلنَّهَارِ وَٱلۡفُلۡكِ ٱلَّتِي تَجۡرِي فِي ٱلۡبَحۡرِ بِمَا يَنفَعُ ٱلنَّاسَ وَمَآ أَنزَلَ ٱللَّهُ مِنَ ٱلسَّمَآءِ مِن مَّآءٖ فَأَحۡيَا بِهِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَا وَبَثَّ فِيهَا مِن كُلِّ دَآبَّةٖ وَتَصۡرِيفِ ٱلرِّيَٰحِ وَٱلسَّحَابِ ٱلۡمُسَخَّرِ بَيۡنَ ٱلسَّمَآءِ وَٱلۡأَرۡضِ لَأٓيَٰتٖ لِّقَوۡمٖ يَعۡقِلُونَ","End":"١٦٤"},{"SurahNumber":2,"VerseNumber":165,"Text":"وَمِنَ ٱلنَّاسِ مَن يَتَّخِذُ مِن دُونِ ٱللَّهِ أَندَادٗا يُحِبُّونَهُمۡ كَحُبِّ ٱللَّهِۖ وَٱلَّذِينَ ءَامَنُوٓاْ أَشَدُّ حُبّٗا لِّلَّهِۗ وَلَوۡ يَرَى ٱلَّذِينَ ظَلَمُوٓاْ إِذۡ يَرَوۡنَ ٱلۡعَذَابَ أَنَّ ٱلۡقُوَّةَ لِلَّهِ جَمِيعٗا وَأَنَّ ٱللَّهَ شَدِيدُ ٱلۡعَذَابِ","End":"١٦٥"},{"SurahNumber":2,"VerseNumber":166,"Text":"إِذۡ تَبَرَّأَ ٱلَّذِينَ ٱتُّبِعُواْ مِنَ ٱلَّذِينَ ٱتَّبَعُواْ وَرَأَوُاْ ٱلۡعَذَابَ وَتَقَطَّعَتۡ بِهِمُ ٱلۡأَسۡبَابُ","End":"١٦٦"},{"SurahNumber":2,"VerseNumber":167,"Text":"وَقَالَ ٱلَّذِينَ ٱتَّبَعُواْ لَوۡ أَنَّ لَنَا كَرَّةٗ فَنَتَبَرَّأَ مِنۡهُمۡ كَمَا تَبَرَّءُواْ مِنَّاۗ كَذَٰلِكَ يُرِيهِمُ ٱللَّهُ أَعۡمَٰلَهُمۡ حَسَرَٰتٍ عَلَيۡهِمۡۖ وَمَا هُم بِخَٰرِجِينَ مِنَ ٱلنَّارِ","End":"١٦٧"},{"SurahNumber":2,"VerseNumber":168,"Text":"يَـٰٓأَيُّهَا ٱلنَّاسُ كُلُواْ مِمَّا فِي ٱلۡأَرۡضِ حَلَٰلٗا طَيِّبٗا وَلَا تَتَّبِعُواْ خُطُوَٰتِ ٱلشَّيۡطَٰنِۚ إِنَّهُۥ لَكُمۡ عَدُوّٞ مُّبِينٌ","End":"١٦٨"},{"SurahNumber":2,"VerseNumber":169,"Text":"إِنَّمَا يَأۡمُرُكُم بِٱلسُّوٓءِ وَٱلۡفَحۡشَآءِ وَأَن تَقُولُواْ عَلَى ٱللَّهِ مَا لَا تَعۡلَمُونَ","End":"١٦٩"},{"SurahNumber":2,"VerseNumber":170,"Text":"وَإِذَا قِيلَ لَهُمُ ٱتَّبِعُواْ مَآ أَنزَلَ ٱللَّهُ قَالُواْ بَلۡ نَتَّبِعُ مَآ أَلۡفَيۡنَا عَلَيۡهِ ءَابَآءَنَآۚ أَوَلَوۡ كَانَ ءَابَآؤُهُمۡ لَا يَعۡقِلُونَ شَيۡـٔٗا وَلَا يَهۡتَدُونَ","End":"١٧٠"},{"SurahNumber":2,"VerseNumber":171,"Text":"وَمَثَلُ ٱلَّذِينَ كَفَرُواْ كَمَثَلِ ٱلَّذِي يَنۡعِقُ بِمَا لَا يَسۡمَعُ إِلَّا دُعَآءٗ وَنِدَآءٗۚ صُمُّۢ بُكۡمٌ عُمۡيٞ فَهُمۡ لَا يَعۡقِلُونَ","End":"١٧١"},{"SurahNumber":2,"VerseNumber":172,"Text":"يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ كُلُواْ مِن طَيِّبَٰتِ مَا رَزَقۡنَٰكُمۡ وَٱشۡكُرُواْ لِلَّهِ إِن كُنتُمۡ إِيَّاهُ تَعۡبُدُونَ","End":"١٧٢"},{"SurahNumber":2,"VerseNumber":173,"Text":"إِنَّمَا حَرَّمَ عَلَيۡكُمُ ٱلۡمَيۡتَةَ وَٱلدَّمَ وَلَحۡمَ ٱلۡخِنزِيرِ وَمَآ أُهِلَّ بِهِۦ لِغَيۡرِ ٱللَّهِۖ فَمَنِ ٱضۡطُرَّ غَيۡرَ بَاغٖ وَلَا عَادٖ فَلَآ إِثۡمَ عَلَيۡهِۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ","End":"١٧٣"},{"SurahNumber":2,"VerseNumber":174,"Text":"إِنَّ ٱلَّذِينَ يَكۡتُمُونَ مَآ أَنزَلَ ٱللَّهُ مِنَ ٱلۡكِتَٰبِ وَيَشۡتَرُونَ بِهِۦ ثَمَنٗا قَلِيلًا أُوْلَـٰٓئِكَ مَا يَأۡكُلُونَ فِي بُطُونِهِمۡ إِلَّا ٱلنَّارَ وَلَا يُكَلِّمُهُمُ ٱللَّهُ يَوۡمَ ٱلۡقِيَٰمَةِ وَلَا يُزَكِّيهِمۡ وَلَهُمۡ عَذَابٌ أَلِيمٌ","End":"١٧٤"},{"SurahNumber":2,"VerseNumber":175,"Text":"أُوْلَـٰٓئِكَ ٱلَّذِينَ ٱشۡتَرَوُاْ ٱلضَّلَٰلَةَ بِٱلۡهُدَىٰ وَٱلۡعَذَابَ بِٱلۡمَغۡفِرَةِۚ فَمَآ أَصۡبَرَهُمۡ عَلَى ٱلنَّارِ","End":"١٧٥"},{"SurahNumber":2,"VerseNumber":176,"Text":"ذَٰلِكَ بِأَنَّ ٱللَّهَ نَزَّلَ ٱلۡكِتَٰبَ بِٱلۡحَقِّۗ وَإِنَّ ٱلَّذِينَ ٱخۡتَلَفُواْ فِي ٱلۡكِتَٰبِ لَفِي شِقَاقِۭ بَعِيدٖ","End":"١٧٦"},{"SurahNumber":2,"VerseNumber":177,"Text":"۞لَّيۡسَ ٱلۡبِرَّ أَن تُوَلُّواْ وُجُوهَكُمۡ قِبَلَ ٱلۡمَشۡرِقِ وَٱلۡمَغۡرِبِ وَلَٰكِنَّ ٱلۡبِرَّ مَنۡ ءَامَنَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ وَٱلۡمَلَـٰٓئِكَةِ وَٱلۡكِتَٰبِ وَٱلنَّبِيِّـۧنَ وَءَاتَى ٱلۡمَالَ عَلَىٰ حُبِّهِۦ ذَوِي ٱلۡقُرۡبَىٰ وَٱلۡيَتَٰمَىٰ وَٱلۡمَسَٰكِينَ وَٱبۡنَ ٱلسَّبِيلِ وَٱلسَّآئِلِينَ وَفِي ٱلرِّقَابِ وَأَقَامَ ٱلصَّلَوٰةَ وَءَاتَى ٱلزَّكَوٰةَ وَٱلۡمُوفُونَ بِعَهۡدِهِمۡ إِذَا عَٰهَدُواْۖ وَٱلصَّـٰبِرِينَ فِي ٱلۡبَأۡسَآءِ وَٱلضَّرَّآءِ وَحِينَ ٱلۡبَأۡسِۗ أُوْلَـٰٓئِكَ ٱلَّذِينَ صَدَقُواْۖ وَأُوْلَـٰٓئِكَ هُمُ ٱلۡمُتَّقُونَ","End":"١٧٧"},{"SurahNumber":2,"VerseNumber":178,"Text":"يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ كُتِبَ عَلَيۡكُمُ ٱلۡقِصَاصُ فِي ٱلۡقَتۡلَىۖ ٱلۡحُرُّ بِٱلۡحُرِّ وَٱلۡعَبۡدُ بِٱلۡعَبۡدِ وَٱلۡأُنثَىٰ بِٱلۡأُنثَىٰۚ فَمَنۡ عُفِيَ لَهُۥ مِنۡ أَخِيهِ شَيۡءٞ فَٱتِّبَاعُۢ بِٱلۡمَعۡرُوفِ وَأَدَآءٌ إِلَيۡهِ بِإِحۡسَٰنٖۗ ذَٰلِكَ تَخۡفِيفٞ مِّن رَّبِّكُمۡ وَرَحۡمَةٞۗ فَمَنِ ٱعۡتَدَىٰ بَعۡدَ ذَٰلِكَ فَلَهُۥ عَذَابٌ أَلِيمٞ","End":"١٧٨"},{"SurahNumber":2,"VerseNumber":179,"Text":"وَلَكُمۡ فِي ٱلۡقِصَاصِ حَيَوٰةٞ يَـٰٓأُوْلِي ٱلۡأَلۡبَٰبِ لَعَلَّكُمۡ تَتَّقُونَ","End":"١٧٩"},{"SurahNumber":2,"VerseNumber":180,"Text":"كُتِبَ عَلَيۡكُمۡ إِذَا حَضَرَ أَحَدَكُمُ ٱلۡمَوۡتُ إِن تَرَكَ خَيۡرًا ٱلۡوَصِيَّةُ لِلۡوَٰلِدَيۡنِ وَٱلۡأَقۡرَبِينَ بِٱلۡمَعۡرُوفِۖ حَقًّا عَلَى ٱلۡمُتَّقِينَ","End":"١٨٠"},{"SurahNumber":2,"VerseNumber":181,"Text":"فَمَنۢ بَدَّلَهُۥ بَعۡدَ مَا سَمِعَهُۥ فَإِنَّمَآ إِثۡمُهُۥ عَلَى ٱلَّذِينَ يُبَدِّلُونَهُۥٓۚ إِنَّ ٱللَّهَ سَمِيعٌ عَلِيمٞ","End":"١٨١"},{"SurahNumber":2,"VerseNumber":182,"Text":"فَمَنۡ خَافَ مِن مُّوصٖ جَنَفًا أَوۡ إِثۡمٗا فَأَصۡلَحَ بَيۡنَهُمۡ فَلَآ إِثۡمَ عَلَيۡهِۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","End":"١٨٢"},{"SurahNumber":2,"VerseNumber":183,"Text":"يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ كُتِبَ عَلَيۡكُمُ ٱلصِّيَامُ كَمَا كُتِبَ عَلَى ٱلَّذِينَ مِن قَبۡلِكُمۡ لَعَلَّكُمۡ تَتَّقُونَ","End":"١٨٣"},{"SurahNumber":2,"VerseNumber":184,"Text":"أَيَّامٗا مَّعۡدُودَٰتٖۚ فَمَن كَانَ مِنكُم مَّرِيضًا أَوۡ عَلَىٰ سَفَرٖ فَعِدَّةٞ مِّنۡ أَيَّامٍ أُخَرَۚ وَعَلَى ٱلَّذِينَ يُطِيقُونَهُۥ فِدۡيَةٞ طَعَامُ مِسۡكِينٖۖ فَمَن تَطَوَّعَ خَيۡرٗا فَهُوَ خَيۡرٞ لَّهُۥۚ وَأَن تَصُومُواْ خَيۡرٞ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ","End":"١٨٤"},{"SurahNumber":2,"VerseNumber":185,"Text":"شَهۡرُ رَمَضَانَ ٱلَّذِيٓ أُنزِلَ فِيهِ ٱلۡقُرۡءَانُ هُدٗى لِّلنَّاسِ وَبَيِّنَٰتٖ مِّنَ ٱلۡهُدَىٰ وَٱلۡفُرۡقَانِۚ فَمَن شَهِدَ مِنكُمُ ٱلشَّهۡرَ فَلۡيَصُمۡهُۖ وَمَن كَانَ مَرِيضًا أَوۡ عَلَىٰ سَفَرٖ فَعِدَّةٞ مِّنۡ أَيَّامٍ أُخَرَۗ يُرِيدُ ٱللَّهُ بِكُمُ ٱلۡيُسۡرَ وَلَا يُرِيدُ بِكُمُ ٱلۡعُسۡرَ وَلِتُكۡمِلُواْ ٱلۡعِدَّةَ وَلِتُكَبِّرُواْ ٱللَّهَ عَلَىٰ مَا هَدَىٰكُمۡ وَلَعَلَّكُمۡ تَشۡكُرُونَ","End":"١٨٥"},{"SurahNumber":2,"VerseNumber":186,"Text":"وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌۖ أُجِيبُ دَعۡوَةَ ٱلدَّاعِ إِذَا دَعَانِۖ فَلۡيَسۡتَجِيبُواْ لِي وَلۡيُؤۡمِنُواْ بِي لَعَلَّهُمۡ يَرۡشُدُونَ","End":"١٨٦"},{"SurahNumber":2,"VerseNumber":187,"Text":"أُحِلَّ لَكُمۡ لَيۡلَةَ ٱلصِّيَامِ ٱلرَّفَثُ إِلَىٰ نِسَآئِكُمۡۚ هُنَّ لِبَاسٞ لَّكُمۡ وَأَنتُمۡ لِبَاسٞ لَّهُنَّۗ عَلِمَ ٱللَّهُ أَنَّكُمۡ كُنتُمۡ تَخۡتَانُونَ أَنفُسَكُمۡ فَتَابَ عَلَيۡكُمۡ وَعَفَا عَنكُمۡۖ فَٱلۡـَٰٔنَ بَٰشِرُوهُنَّ وَٱبۡتَغُواْ مَا كَتَبَ ٱللَّهُ لَكُمۡۚ وَكُلُواْ وَٱشۡرَبُواْ حَتَّىٰ يَتَبَيَّنَ لَكُمُ ٱلۡخَيۡطُ ٱلۡأَبۡيَضُ مِنَ ٱلۡخَيۡطِ ٱلۡأَسۡوَدِ مِنَ ٱلۡفَجۡرِۖ ثُمَّ أَتِمُّواْ ٱلصِّيَامَ إِلَى ٱلَّيۡلِۚ وَلَا تُبَٰشِرُوهُنَّ وَأَنتُمۡ عَٰكِفُونَ فِي ٱلۡمَسَٰجِدِۗ تِلۡكَ حُدُودُ ٱللَّهِ فَلَا تَقۡرَبُوهَاۗ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ ءَايَٰتِهِۦ لِلنَّاسِ لَعَلَّهُمۡ يَتَّقُونَ","End":"١٨٧"},{"SurahNumber":2,"VerseNumber":188,"Text":"وَلَا تَأۡكُلُوٓاْ أَمۡوَٰلَكُم بَيۡنَكُم بِٱلۡبَٰطِلِ وَتُدۡلُواْ بِهَآ إِلَى ٱلۡحُكَّامِ لِتَأۡكُلُواْ فَرِيقٗا مِّنۡ أَمۡوَٰلِ ٱلنَّاسِ بِٱلۡإِثۡمِ وَأَنتُمۡ تَعۡلَمُونَ","End":"١٨٨"},{"SurahNumber":2,"VerseNumber":189,"Text":"۞يَسۡـَٔلُونَكَ عَنِ ٱلۡأَهِلَّةِۖ قُلۡ هِيَ مَوَٰقِيتُ لِلنَّاسِ وَٱلۡحَجِّۗ وَلَيۡسَ ٱلۡبِرُّ بِأَن تَأۡتُواْ ٱلۡبُيُوتَ مِن ظُهُورِهَا وَلَٰكِنَّ ٱلۡبِرَّ مَنِ ٱتَّقَىٰۗ وَأۡتُواْ ٱلۡبُيُوتَ مِنۡ أَبۡوَٰبِهَاۚ وَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تُفۡلِحُونَ","End":"١٨٩"},{"SurahNumber":2,"VerseNumber":190,"Text":"وَقَٰتِلُواْ فِي سَبِيلِ ٱللَّهِ ٱلَّذِينَ يُقَٰتِلُونَكُمۡ وَلَا تَعۡتَدُوٓاْۚ إِنَّ ٱللَّهَ لَا يُحِبُّ ٱلۡمُعۡتَدِينَ","End":"١٩٠"},{"SurahNumber":2,"VerseNumber":191,"Text":"وَٱقۡتُلُوهُمۡ حَيۡثُ ثَقِفۡتُمُوهُمۡ وَأَخۡرِجُوهُم مِّنۡ حَيۡثُ أَخۡرَجُوكُمۡۚ وَٱلۡفِتۡنَةُ أَشَدُّ مِنَ ٱلۡقَتۡلِۚ وَلَا تُقَٰتِلُوهُمۡ عِندَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ حَتَّىٰ يُقَٰتِلُوكُمۡ فِيهِۖ فَإِن قَٰتَلُوكُمۡ فَٱقۡتُلُوهُمۡۗ كَذَٰلِكَ جَزَآءُ ٱلۡكَٰفِرِينَ","End":"١٩١"},{"SurahNumber":2,"VerseNumber":192,"Text":"فَإِنِ ٱنتَهَوۡاْ فَإِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","End":"١٩٢"},{"SurahNumber":2,"VerseNumber":193,"Text":"وَقَٰتِلُوهُمۡ حَتَّىٰ لَا تَكُونَ فِتۡنَةٞ وَيَكُونَ ٱلدِّينُ لِلَّهِۖ فَإِنِ ٱنتَهَوۡاْ فَلَا عُدۡوَٰنَ إِلَّا عَلَى ٱلظَّـٰلِمِينَ","End":"١٩٣"},{"SurahNumber":2,"VerseNumber":194,"Text":"ٱلشَّهۡرُ ٱلۡحَرَامُ بِٱلشَّهۡرِ ٱلۡحَرَامِ وَٱلۡحُرُمَٰتُ قِصَاصٞۚ فَمَنِ ٱعۡتَدَىٰ عَلَيۡكُمۡ فَٱعۡتَدُواْ عَلَيۡهِ بِمِثۡلِ مَا ٱعۡتَدَىٰ عَلَيۡكُمۡۚ وَٱتَّقُواْ ٱللَّهَ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ مَعَ ٱلۡمُتَّقِينَ","End":"١٩٤"},{"SurahNumber":2,"VerseNumber":195,"Text":"وَأَنفِقُواْ فِي سَبِيلِ ٱللَّهِ وَلَا تُلۡقُواْ بِأَيۡدِيكُمۡ إِلَى ٱلتَّهۡلُكَةِ وَأَحۡسِنُوٓاْۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُحۡسِنِينَ","End":"١٩٥"},{"SurahNumber":2,"VerseNumber":196,"Text":"وَأَتِمُّواْ ٱلۡحَجَّ وَٱلۡعُمۡرَةَ لِلَّهِۚ فَإِنۡ أُحۡصِرۡتُمۡ فَمَا ٱسۡتَيۡسَرَ مِنَ ٱلۡهَدۡيِۖ وَلَا تَحۡلِقُواْ رُءُوسَكُمۡ حَتَّىٰ يَبۡلُغَ ٱلۡهَدۡيُ مَحِلَّهُۥۚ فَمَن كَانَ مِنكُم مَّرِيضًا أَوۡ بِهِۦٓ أَذٗى مِّن رَّأۡسِهِۦ فَفِدۡيَةٞ مِّن صِيَامٍ أَوۡ صَدَقَةٍ أَوۡ نُسُكٖۚ فَإِذَآ أَمِنتُمۡ فَمَن تَمَتَّعَ بِٱلۡعُمۡرَةِ إِلَى ٱلۡحَجِّ فَمَا ٱسۡتَيۡسَرَ مِنَ ٱلۡهَدۡيِۚ فَمَن لَّمۡ يَجِدۡ فَصِيَامُ ثَلَٰثَةِ أَيَّامٖ فِي ٱلۡحَجِّ وَسَبۡعَةٍ إِذَا رَجَعۡتُمۡۗ تِلۡكَ عَشَرَةٞ كَامِلَةٞۗ ذَٰلِكَ لِمَن لَّمۡ يَكُنۡ أَهۡلُهُۥ حَاضِرِي ٱلۡمَسۡجِدِ ٱلۡحَرَامِۚ وَٱتَّقُواْ ٱللَّهَ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ شَدِيدُ ٱلۡعِقَابِ","End":"١٩٦"},{"SurahNumber":2,"VerseNumber":197,"Text":"ٱلۡحَجُّ أَشۡهُرٞ مَّعۡلُومَٰتٞۚ فَمَن فَرَضَ فِيهِنَّ ٱلۡحَجَّ فَلَا رَفَثَ وَلَا فُسُوقَ وَلَا جِدَالَ فِي ٱلۡحَجِّۗ وَمَا تَفۡعَلُواْ مِنۡ خَيۡرٖ يَعۡلَمۡهُ ٱللَّهُۗ وَتَزَوَّدُواْ فَإِنَّ خَيۡرَ ٱلزَّادِ ٱلتَّقۡوَىٰۖ وَٱتَّقُونِ يَـٰٓأُوْلِي ٱلۡأَلۡبَٰبِ","End":"١٩٧"},{"SurahNumber":2,"VerseNumber":198,"Text":"لَيۡسَ عَلَيۡكُمۡ جُنَاحٌ أَن تَبۡتَغُواْ فَضۡلٗا مِّن رَّبِّكُمۡۚ فَإِذَآ أَفَضۡتُم مِّنۡ عَرَفَٰتٖ فَٱذۡكُرُواْ ٱللَّهَ عِندَ ٱلۡمَشۡعَرِ ٱلۡحَرَامِۖ وَٱذۡكُرُوهُ كَمَا هَدَىٰكُمۡ وَإِن كُنتُم مِّن قَبۡلِهِۦ لَمِنَ ٱلضَّآلِّينَ","End":"١٩٨"},{"SurahNumber":2,"VerseNumber":199,"Text":"ثُمَّ أَفِيضُواْ مِنۡ حَيۡثُ أَفَاضَ ٱلنَّاسُ وَٱسۡتَغۡفِرُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","End":"١٩٩"},{"SurahNumber":2,"VerseNumber":200,"Text":"فَإِذَا قَضَيۡتُم مَّنَٰسِكَكُمۡ فَٱذۡكُرُواْ ٱللَّهَ كَذِكۡرِكُمۡ ءَابَآءَكُمۡ أَوۡ أَشَدَّ ذِكۡرٗاۗ فَمِنَ ٱلنَّاسِ مَن يَقُولُ رَبَّنَآ ءَاتِنَا فِي ٱلدُّنۡيَا وَمَا لَهُۥ فِي ٱلۡأٓخِرَةِ مِنۡ خَلَٰقٖ","End":"٢٠٠"},{"SurahNumber":2,"VerseNumber":201,"Text":"وَمِنۡهُم مَّن يَقُولُ رَبَّنَآ ءَاتِنَا فِي ٱلدُّنۡيَا حَسَنَةٗ وَفِي ٱلۡأٓخِرَةِ حَسَنَةٗ وَقِنَا عَذَابَ ٱلنَّارِ","End":"٢٠١"},{"SurahNumber":2,"VerseNumber":202,"Text":"أُوْلَـٰٓئِكَ لَهُمۡ نَصِيبٞ مِّمَّا كَسَبُواْۚ وَٱللَّهُ سَرِيعُ ٱلۡحِسَابِ","End":"٢٠٢"},{"SurahNumber":2,"VerseNumber":203,"Text":"۞وَٱذۡكُرُواْ ٱللَّهَ فِيٓ أَيَّامٖ مَّعۡدُودَٰتٖۚ فَمَن تَعَجَّلَ فِي يَوۡمَيۡنِ فَلَآ إِثۡمَ عَلَيۡهِ وَمَن تَأَخَّرَ فَلَآ إِثۡمَ عَلَيۡهِۖ لِمَنِ ٱتَّقَىٰۗ وَٱتَّقُواْ ٱللَّهَ وَٱعۡلَمُوٓاْ أَنَّكُمۡ إِلَيۡهِ تُحۡشَرُونَ","End":"٢٠٣"},{"SurahNumber":2,"VerseNumber":204,"Text":"وَمِنَ ٱلنَّاسِ مَن يُعۡجِبُكَ قَوۡلُهُۥ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَيُشۡهِدُ ٱللَّهَ عَلَىٰ مَا فِي قَلۡبِهِۦ وَهُوَ أَلَدُّ ٱلۡخِصَامِ","End":"٢٠٤"},{"SurahNumber":2,"VerseNumber":205,"Text":"وَإِذَا تَوَلَّىٰ سَعَىٰ فِي ٱلۡأَرۡضِ لِيُفۡسِدَ فِيهَا وَيُهۡلِكَ ٱلۡحَرۡثَ وَٱلنَّسۡلَۚ وَٱللَّهُ لَا يُحِبُّ ٱلۡفَسَادَ","End":"٢٠٥"},{"SurahNumber":2,"VerseNumber":206,"Text":"وَإِذَا قِيلَ لَهُ ٱتَّقِ ٱللَّهَ أَخَذَتۡهُ ٱلۡعِزَّةُ بِٱلۡإِثۡمِۚ فَحَسۡبُهُۥ جَهَنَّمُۖ وَلَبِئۡسَ ٱلۡمِهَادُ","End":"٢٠٦"},{"SurahNumber":2,"VerseNumber":207,"Text":"وَمِنَ ٱلنَّاسِ مَن يَشۡرِي نَفۡسَهُ ٱبۡتِغَآءَ مَرۡضَاتِ ٱللَّهِۚ وَٱللَّهُ رَءُوفُۢ بِٱلۡعِبَادِ","End":"٢٠٧"},{"SurahNumber":2,"VerseNumber":208,"Text":"يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱدۡخُلُواْ فِي ٱلسِّلۡمِ كَآفَّةٗ وَلَا تَتَّبِعُواْ خُطُوَٰتِ ٱلشَّيۡطَٰنِۚ إِنَّهُۥ لَكُمۡ عَدُوّٞ مُّبِينٞ","End":"٢٠٨"},{"SurahNumber":2,"VerseNumber":209,"Text":"فَإِن زَلَلۡتُم مِّنۢ بَعۡدِ مَا جَآءَتۡكُمُ ٱلۡبَيِّنَٰتُ فَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ عَزِيزٌ حَكِيمٌ","End":"٢٠٩"},{"SurahNumber":2,"VerseNumber":210,"Text":"هَلۡ يَنظُرُونَ إِلَّآ أَن يَأۡتِيَهُمُ ٱللَّهُ فِي ظُلَلٖ مِّنَ ٱلۡغَمَامِ وَٱلۡمَلَـٰٓئِكَةُ وَقُضِيَ ٱلۡأَمۡرُۚ وَإِلَى ٱللَّهِ تُرۡجَعُ ٱلۡأُمُورُ","End":"٢١٠"},{"SurahNumber":2,"VerseNumber":211,"Text":"سَلۡ بَنِيٓ إِسۡرَـٰٓءِيلَ كَمۡ ءَاتَيۡنَٰهُم مِّنۡ ءَايَةِۭ بَيِّنَةٖۗ وَمَن يُبَدِّلۡ نِعۡمَةَ ٱللَّهِ مِنۢ بَعۡدِ مَا جَآءَتۡهُ فَإِنَّ ٱللَّهَ شَدِيدُ ٱلۡعِقَابِ","End":"٢١١"},{"SurahNumber":2,"VerseNumber":212,"Text":"زُيِّنَ لِلَّذِينَ كَفَرُواْ ٱلۡحَيَوٰةُ ٱلدُّنۡيَا وَيَسۡخَرُونَ مِنَ ٱلَّذِينَ ءَامَنُواْۘ وَٱلَّذِينَ ٱتَّقَوۡاْ فَوۡقَهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِۗ وَٱللَّهُ يَرۡزُقُ مَن يَشَآءُ بِغَيۡرِ حِسَابٖ","End":"٢١٢"},{"SurahNumber":2,"VerseNumber":213,"Text":"كَانَ ٱلنَّاسُ أُمَّةٗ وَٰحِدَةٗ فَبَعَثَ ٱللَّهُ ٱلنَّبِيِّـۧنَ مُبَشِّرِينَ وَمُنذِرِينَ وَأَنزَلَ مَعَهُمُ ٱلۡكِتَٰبَ بِٱلۡحَقِّ لِيَحۡكُمَ بَيۡنَ ٱلنَّاسِ فِيمَا ٱخۡتَلَفُواْ فِيهِۚ وَمَا ٱخۡتَلَفَ فِيهِ إِلَّا ٱلَّذِينَ أُوتُوهُ مِنۢ بَعۡدِ مَا جَآءَتۡهُمُ ٱلۡبَيِّنَٰتُ بَغۡيَۢا بَيۡنَهُمۡۖ فَهَدَى ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ لِمَا ٱخۡتَلَفُواْ فِيهِ مِنَ ٱلۡحَقِّ بِإِذۡنِهِۦۗ وَٱللَّهُ يَهۡدِي مَن يَشَآءُ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٍ","End":"٢١٣"},{"SurahNumber":2,"VerseNumber":214,"Text":"أَمۡ حَسِبۡتُمۡ أَن تَدۡخُلُواْ ٱلۡجَنَّةَ وَلَمَّا يَأۡتِكُم مَّثَلُ ٱلَّذِينَ خَلَوۡاْ مِن قَبۡلِكُمۖ مَّسَّتۡهُمُ ٱلۡبَأۡسَآءُ وَٱلضَّرَّآءُ وَزُلۡزِلُواْ حَتَّىٰ يَقُولَ ٱلرَّسُولُ وَٱلَّذِينَ ءَامَنُواْ مَعَهُۥ مَتَىٰ نَصۡرُ ٱللَّهِۗ أَلَآ إِنَّ نَصۡرَ ٱللَّهِ قَرِيبٞ","End":"٢١٤"},{"SurahNumber":2,"VerseNumber":215,"Text":"يَسۡـَٔلُونَكَ مَاذَا يُنفِقُونَۖ قُلۡ مَآ أَنفَقۡتُم مِّنۡ خَيۡرٖ فَلِلۡوَٰلِدَيۡنِ وَٱلۡأَقۡرَبِينَ وَٱلۡيَتَٰمَىٰ وَٱلۡمَسَٰكِينِ وَٱبۡنِ ٱلسَّبِيلِۗ وَمَا تَفۡعَلُواْ مِنۡ خَيۡرٖ فَإِنَّ ٱللَّهَ بِهِۦ عَلِيمٞ","End":"٢١٥"},{"SurahNumber":2,"VerseNumber":216,"Text":"كُتِبَ عَلَيۡكُمُ ٱلۡقِتَالُ وَهُوَ كُرۡهٞ لَّكُمۡۖ وَعَسَىٰٓ أَن تَكۡرَهُواْ شَيۡـٔٗا وَهُوَ خَيۡرٞ لَّكُمۡۖ وَعَسَىٰٓ أَن تُحِبُّواْ شَيۡـٔٗا وَهُوَ شَرّٞ لَّكُمۡۚ وَٱللَّهُ يَعۡلَمُ وَأَنتُمۡ لَا تَعۡلَمُونَ","End":"٢١٦"},{"SurahNumber":2,"VerseNumber":217,"Text":"يَسۡـَٔلُونَكَ عَنِ ٱلشَّهۡرِ ٱلۡحَرَامِ قِتَالٖ فِيهِۖ قُلۡ قِتَالٞ فِيهِ كَبِيرٞۚ وَصَدٌّ عَن سَبِيلِ ٱللَّهِ وَكُفۡرُۢ بِهِۦ وَٱلۡمَسۡجِدِ ٱلۡحَرَامِ وَإِخۡرَاجُ أَهۡلِهِۦ مِنۡهُ أَكۡبَرُ عِندَ ٱللَّهِۚ وَٱلۡفِتۡنَةُ أَكۡبَرُ مِنَ ٱلۡقَتۡلِۗ وَلَا يَزَالُونَ يُقَٰتِلُونَكُمۡ حَتَّىٰ يَرُدُّوكُمۡ عَن دِينِكُمۡ إِنِ ٱسۡتَطَٰعُواْۚ وَمَن يَرۡتَدِدۡ مِنكُمۡ عَن دِينِهِۦ فَيَمُتۡ وَهُوَ كَافِرٞ فَأُوْلَـٰٓئِكَ حَبِطَتۡ أَعۡمَٰلُهُمۡ فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِۖ وَأُوْلَـٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ","End":"٢١٧"},{"SurahNumber":2,"VerseNumber":218,"Text":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَٱلَّذِينَ هَاجَرُواْ وَجَٰهَدُواْ فِي سَبِيلِ ٱللَّهِ أُوْلَـٰٓئِكَ يَرۡجُونَ رَحۡمَتَ ٱللَّهِۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ","End":"٢١٨"},{"SurahNumber":2,"VerseNumber":219,"Text":"۞يَسۡـَٔلُونَكَ عَنِ ٱلۡخَمۡرِ وَٱلۡمَيۡسِرِۖ قُلۡ فِيهِمَآ إِثۡمٞ كَبِيرٞ وَمَنَٰفِعُ لِلنَّاسِ وَإِثۡمُهُمَآ أَكۡبَرُ مِن نَّفۡعِهِمَاۗ وَيَسۡـَٔلُونَكَ مَاذَا يُنفِقُونَۖ قُلِ ٱلۡعَفۡوَۗ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمُ ٱلۡأٓيَٰتِ لَعَلَّكُمۡ تَتَفَكَّرُونَ","End":"٢١٩"},{"SurahNumber":2,"VerseNumber":220,"Text":"فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِۗ وَيَسۡـَٔلُونَكَ عَنِ ٱلۡيَتَٰمَىٰۖ قُلۡ إِصۡلَاحٞ لَّهُمۡ خَيۡرٞۖ وَإِن تُخَالِطُوهُمۡ فَإِخۡوَٰنُكُمۡۚ وَٱللَّهُ يَعۡلَمُ ٱلۡمُفۡسِدَ مِنَ ٱلۡمُصۡلِحِۚ وَلَوۡ شَآءَ ٱللَّهُ لَأَعۡنَتَكُمۡۚ إِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٞ","End":"٢٢٠"},{"SurahNumber":2,"VerseNumber":221,"Text":"وَلَا تَنكِحُواْ ٱلۡمُشۡرِكَٰتِ حَتَّىٰ يُؤۡمِنَّۚ وَلَأَمَةٞ مُّؤۡمِنَةٌ خَيۡرٞ مِّن مُّشۡرِكَةٖ وَلَوۡ أَعۡجَبَتۡكُمۡۗ وَلَا تُنكِحُواْ ٱلۡمُشۡرِكِينَ حَتَّىٰ يُؤۡمِنُواْۚ وَلَعَبۡدٞ مُّؤۡمِنٌ خَيۡرٞ مِّن مُّشۡرِكٖ وَلَوۡ أَعۡجَبَكُمۡۗ أُوْلَـٰٓئِكَ يَدۡعُونَ إِلَى ٱلنَّارِۖ وَٱللَّهُ يَدۡعُوٓاْ إِلَى ٱلۡجَنَّةِ وَٱلۡمَغۡفِرَةِ بِإِذۡنِهِۦۖ وَيُبَيِّنُ ءَايَٰتِهِۦ لِلنَّاسِ لَعَلَّهُمۡ يَتَذَكَّرُونَ","End":"٢٢١"},{"SurahNumber":2,"VerseNumber":222,"Text":"وَيَسۡـَٔلُونَكَ عَنِ ٱلۡمَحِيضِۖ قُلۡ هُوَ أَذٗى فَٱعۡتَزِلُواْ ٱلنِّسَآءَ فِي ٱلۡمَحِيضِ وَلَا تَقۡرَبُوهُنَّ حَتَّىٰ يَطۡهُرۡنَۖ فَإِذَا تَطَهَّرۡنَ فَأۡتُوهُنَّ مِنۡ حَيۡثُ أَمَرَكُمُ ٱللَّهُۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلتَّوَّـٰبِينَ وَيُحِبُّ ٱلۡمُتَطَهِّرِينَ","End":"٢٢٢"},{"SurahNumber":2,"VerseNumber":223,"Text":"نِسَآؤُكُمۡ حَرۡثٞ لَّكُمۡ فَأۡتُواْ حَرۡثَكُمۡ أَنَّىٰ شِئۡتُمۡۖ وَقَدِّمُواْ لِأَنفُسِكُمۡۚ وَٱتَّقُواْ ٱللَّهَ وَٱعۡلَمُوٓاْ أَنَّكُم مُّلَٰقُوهُۗ وَبَشِّرِ ٱلۡمُؤۡمِنِينَ","End":"٢٢٣"},{"SurahNumber":2,"VerseNumber":224,"Text":"وَلَا تَجۡعَلُواْ ٱللَّهَ عُرۡضَةٗ لِّأَيۡمَٰنِكُمۡ أَن تَبَرُّواْ وَتَتَّقُواْ وَتُصۡلِحُواْ بَيۡنَ ٱلنَّاسِۚ وَٱللَّهُ سَمِيعٌ عَلِيمٞ","End":"٢٢٤"},{"SurahNumber":2,"VerseNumber":225,"Text":"لَّا يُؤَاخِذُكُمُ ٱللَّهُ بِٱللَّغۡوِ فِيٓ أَيۡمَٰنِكُمۡ وَلَٰكِن يُؤَاخِذُكُم بِمَا كَسَبَتۡ قُلُوبُكُمۡۗ وَٱللَّهُ غَفُورٌ حَلِيمٞ","End":"٢٢٥"},{"SurahNumber":2,"VerseNumber":226,"Text":"لِّلَّذِينَ يُؤۡلُونَ مِن نِّسَآئِهِمۡ تَرَبُّصُ أَرۡبَعَةِ أَشۡهُرٖۖ فَإِن فَآءُو فَإِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","End":"٢٢٦"},{"SurahNumber":2,"VerseNumber":227,"Text":"وَإِنۡ عَزَمُواْ ٱلطَّلَٰقَ فَإِنَّ ٱللَّهَ سَمِيعٌ عَلِيمٞ","End":"٢٢٧"},{"SurahNumber":2,"VerseNumber":228,"Text":"وَٱلۡمُطَلَّقَٰتُ يَتَرَبَّصۡنَ بِأَنفُسِهِنَّ ثَلَٰثَةَ قُرُوٓءٖۚ وَلَا يَحِلُّ لَهُنَّ أَن يَكۡتُمۡنَ مَا خَلَقَ ٱللَّهُ فِيٓ أَرۡحَامِهِنَّ إِن كُنَّ يُؤۡمِنَّ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِۚ وَبُعُولَتُهُنَّ أَحَقُّ بِرَدِّهِنَّ فِي ذَٰلِكَ إِنۡ أَرَادُوٓاْ إِصۡلَٰحٗاۚ وَلَهُنَّ مِثۡلُ ٱلَّذِي عَلَيۡهِنَّ بِٱلۡمَعۡرُوفِۚ وَلِلرِّجَالِ عَلَيۡهِنَّ دَرَجَةٞۗ وَٱللَّهُ عَزِيزٌ حَكِيمٌ","End":"٢٢٨"},{"SurahNumber":2,"VerseNumber":229,"Text":"ٱلطَّلَٰقُ مَرَّتَانِۖ فَإِمۡسَاكُۢ بِمَعۡرُوفٍ أَوۡ تَسۡرِيحُۢ بِإِحۡسَٰنٖۗ وَلَا يَحِلُّ لَكُمۡ أَن تَأۡخُذُواْ مِمَّآ ءَاتَيۡتُمُوهُنَّ شَيۡـًٔا إِلَّآ أَن يَخَافَآ أَلَّا يُقِيمَا حُدُودَ ٱللَّهِۖ فَإِنۡ خِفۡتُمۡ أَلَّا يُقِيمَا حُدُودَ ٱللَّهِ فَلَا جُنَاحَ عَلَيۡهِمَا فِيمَا ٱفۡتَدَتۡ بِهِۦۗ تِلۡكَ حُدُودُ ٱللَّهِ فَلَا تَعۡتَدُوهَاۚ وَمَن يَتَعَدَّ حُدُودَ ٱللَّهِ فَأُوْلَـٰٓئِكَ هُمُ ٱلظَّـٰلِمُونَ","End":"٢٢٩"},{"SurahNumber":2,"VerseNumber":230,"Text":"فَإِن طَلَّقَهَا فَلَا تَحِلُّ لَهُۥ مِنۢ بَعۡدُ حَتَّىٰ تَنكِحَ زَوۡجًا غَيۡرَهُۥۗ فَإِن طَلَّقَهَا فَلَا جُنَاحَ عَلَيۡهِمَآ أَن يَتَرَاجَعَآ إِن ظَنَّآ أَن يُقِيمَا حُدُودَ ٱللَّهِۗ وَتِلۡكَ حُدُودُ ٱللَّهِ يُبَيِّنُهَا لِقَوۡمٖ يَعۡلَمُونَ","End":"٢٣٠"},{"SurahNumber":2,"VerseNumber":231,"Text":"وَإِذَا طَلَّقۡتُمُ ٱلنِّسَآءَ فَبَلَغۡنَ أَجَلَهُنَّ فَأَمۡسِكُوهُنَّ بِمَعۡرُوفٍ أَوۡ سَرِّحُوهُنَّ بِمَعۡرُوفٖۚ وَلَا تُمۡسِكُوهُنَّ ضِرَارٗا لِّتَعۡتَدُواْۚ وَمَن يَفۡعَلۡ ذَٰلِكَ فَقَدۡ ظَلَمَ نَفۡسَهُۥۚ وَلَا تَتَّخِذُوٓاْ ءَايَٰتِ ٱللَّهِ هُزُوٗاۚ وَٱذۡكُرُواْ نِعۡمَتَ ٱللَّهِ عَلَيۡكُمۡ وَمَآ أَنزَلَ عَلَيۡكُم مِّنَ ٱلۡكِتَٰبِ وَٱلۡحِكۡمَةِ يَعِظُكُم بِهِۦۚ وَٱتَّقُواْ ٱللَّهَ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ بِكُلِّ شَيۡءٍ عَلِيمٞ","End":"٢٣١"},{"SurahNumber":2,"VerseNumber":232,"Text":"وَإِذَا طَلَّقۡتُمُ ٱلنِّسَآءَ فَبَلَغۡنَ أَجَلَهُنَّ فَلَا تَعۡضُلُوهُنَّ أَن يَنكِحۡنَ أَزۡوَٰجَهُنَّ إِذَا تَرَٰضَوۡاْ بَيۡنَهُم بِٱلۡمَعۡرُوفِۗ ذَٰلِكَ يُوعَظُ بِهِۦ مَن كَانَ مِنكُمۡ يُؤۡمِنُ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِۗ ذَٰلِكُمۡ أَزۡكَىٰ لَكُمۡ وَأَطۡهَرُۚ وَٱللَّهُ يَعۡلَمُ وَأَنتُمۡ لَا تَعۡلَمُونَ","End":"٢٣٢"},{"SurahNumber":2,"VerseNumber":233,"Text":"۞وَٱلۡوَٰلِدَٰتُ يُرۡضِعۡنَ أَوۡلَٰدَهُنَّ حَوۡلَيۡنِ كَامِلَيۡنِۖ لِمَنۡ أَرَادَ أَن يُتِمَّ ٱلرَّضَاعَةَۚ وَعَلَى ٱلۡمَوۡلُودِ لَهُۥ رِزۡقُهُنَّ وَكِسۡوَتُهُنَّ بِٱلۡمَعۡرُوفِۚ لَا تُكَلَّفُ نَفۡسٌ إِلَّا وُسۡعَهَاۚ لَا تُضَآرَّ وَٰلِدَةُۢ بِوَلَدِهَا وَلَا مَوۡلُودٞ لَّهُۥ بِوَلَدِهِۦۚ وَعَلَى ٱلۡوَارِثِ مِثۡلُ ذَٰلِكَۗ فَإِنۡ أَرَادَا فِصَالًا عَن تَرَاضٖ مِّنۡهُمَا وَتَشَاوُرٖ فَلَا جُنَاحَ عَلَيۡهِمَاۗ وَإِنۡ أَرَدتُّمۡ أَن تَسۡتَرۡضِعُوٓاْ أَوۡلَٰدَكُمۡ فَلَا جُنَاحَ عَلَيۡكُمۡ إِذَا سَلَّمۡتُم مَّآ ءَاتَيۡتُم بِٱلۡمَعۡرُوفِۗ وَٱتَّقُواْ ٱللَّهَ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ بِمَا تَعۡمَلُونَ بَصِيرٞ","End":"٢٣٣"},{"SurahNumber":2,"VerseNumber":234,"Text":"وَٱلَّذِينَ يُتَوَفَّوۡنَ مِنكُمۡ وَيَذَرُونَ أَزۡوَٰجٗا يَتَرَبَّصۡنَ بِأَنفُسِهِنَّ أَرۡبَعَةَ أَشۡهُرٖ وَعَشۡرٗاۖ فَإِذَا بَلَغۡنَ أَجَلَهُنَّ فَلَا جُنَاحَ عَلَيۡكُمۡ فِيمَا فَعَلۡنَ فِيٓ أَنفُسِهِنَّ بِٱلۡمَعۡرُوفِۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرٞ","End":"٢٣٤"},{"SurahNumber":2,"VerseNumber":235,"Text":"وَلَا جُنَاحَ عَلَيۡكُمۡ فِيمَا عَرَّضۡتُم بِهِۦ مِنۡ خِطۡبَةِ ٱلنِّسَآءِ أَوۡ أَكۡنَنتُمۡ فِيٓ أَنفُسِكُمۡۚ عَلِمَ ٱللَّهُ أَنَّكُمۡ سَتَذۡكُرُونَهُنَّ وَلَٰكِن لَّا تُوَاعِدُوهُنَّ سِرًّا إِلَّآ أَن تَقُولُواْ قَوۡلٗا مَّعۡرُوفٗاۚ وَلَا تَعۡزِمُواْ عُقۡدَةَ ٱلنِّكَاحِ حَتَّىٰ يَبۡلُغَ ٱلۡكِتَٰبُ أَجَلَهُۥۚ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ يَعۡلَمُ مَا فِيٓ أَنفُسِكُمۡ فَٱحۡذَرُوهُۚ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ غَفُورٌ حَلِيمٞ","End":"٢٣٥"},{"SurahNumber":2,"VerseNumber":236,"Text":"لَّا جُنَاحَ عَلَيۡكُمۡ إِن طَلَّقۡتُمُ ٱلنِّسَآءَ مَا لَمۡ تَمَسُّوهُنَّ أَوۡ تَفۡرِضُواْ لَهُنَّ فَرِيضَةٗۚ وَمَتِّعُوهُنَّ عَلَى ٱلۡمُوسِعِ قَدَرُهُۥ وَعَلَى ٱلۡمُقۡتِرِ قَدَرُهُۥ مَتَٰعَۢا بِٱلۡمَعۡرُوفِۖ حَقًّا عَلَى ٱلۡمُحۡسِنِينَ","End":"٢٣٦"},{"SurahNumber":2,"VerseNumber":237,"Text":"وَإِن طَلَّقۡتُمُوهُنَّ مِن قَبۡلِ أَن تَمَسُّوهُنَّ وَقَدۡ فَرَضۡتُمۡ لَهُنَّ فَرِيضَةٗ فَنِصۡفُ مَا فَرَضۡتُمۡ إِلَّآ أَن يَعۡفُونَ أَوۡ يَعۡفُوَاْ ٱلَّذِي بِيَدِهِۦ عُقۡدَةُ ٱلنِّكَاحِۚ وَأَن تَعۡفُوٓاْ أَقۡرَبُ لِلتَّقۡوَىٰۚ وَلَا تَنسَوُاْ ٱلۡفَضۡلَ بَيۡنَكُمۡۚ إِنَّ ٱللَّهَ بِمَا تَعۡمَلُونَ بَصِيرٌ","End":"٢٣٧"},{"SurahNumber":2,"VerseNumber":238,"Text":"حَٰفِظُواْ عَلَى ٱلصَّلَوَٰتِ وَٱلصَّلَوٰةِ ٱلۡوُسۡطَىٰ وَقُومُواْ لِلَّهِ قَٰنِتِينَ","End":"٢٣٨"},{"SurahNumber":2,"VerseNumber":239,"Text":"فَإِنۡ خِفۡتُمۡ فَرِجَالًا أَوۡ رُكۡبَانٗاۖ فَإِذَآ أَمِنتُمۡ فَٱذۡكُرُواْ ٱللَّهَ كَمَا عَلَّمَكُم مَّا لَمۡ تَكُونُواْ تَعۡلَمُونَ","End":"٢٣٩"},{"SurahNumber":2,"VerseNumber":240,"Text":"وَٱلَّذِينَ يُتَوَفَّوۡنَ مِنكُمۡ وَيَذَرُونَ أَزۡوَٰجٗا وَصِيَّةٗ لِّأَزۡوَٰجِهِم مَّتَٰعًا إِلَى ٱلۡحَوۡلِ غَيۡرَ إِخۡرَاجٖۚ فَإِنۡ خَرَجۡنَ فَلَا جُنَاحَ عَلَيۡكُمۡ فِي مَا فَعَلۡنَ فِيٓ أَنفُسِهِنَّ مِن مَّعۡرُوفٖۗ وَٱللَّهُ عَزِيزٌ حَكِيمٞ","End":"٢٤٠"},{"SurahNumber":2,"VerseNumber":241,"Text":"وَلِلۡمُطَلَّقَٰتِ مَتَٰعُۢ بِٱلۡمَعۡرُوفِۖ حَقًّا عَلَى ٱلۡمُتَّقِينَ","End":"٢٤١"},{"SurahNumber":2,"VerseNumber":242,"Text":"كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمۡ ءَايَٰتِهِۦ لَعَلَّكُمۡ تَعۡقِلُونَ","End":"٢٤٢"},{"SurahNumber":2,"VerseNumber":243,"Text":"۞أَلَمۡ تَرَ إِلَى ٱلَّذِينَ خَرَجُواْ مِن دِيَٰرِهِمۡ وَهُمۡ أُلُوفٌ حَذَرَ ٱلۡمَوۡتِ فَقَالَ لَهُمُ ٱللَّهُ مُوتُواْ ثُمَّ أَحۡيَٰهُمۡۚ إِنَّ ٱللَّهَ لَذُو فَضۡلٍ عَلَى ٱلنَّاسِ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَشۡكُرُونَ","End":"٢٤٣"},{"SurahNumber":2,"VerseNumber":244,"Text":"وَقَٰتِلُواْ فِي سَبِيلِ ٱللَّهِ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ سَمِيعٌ عَلِيمٞ","End":"٢٤٤"},{"SurahNumber":2,"VerseNumber":245,"Text":"مَّن ذَا ٱلَّذِي يُقۡرِضُ ٱللَّهَ قَرۡضًا حَسَنٗا فَيُضَٰعِفَهُۥ لَهُۥٓ أَضۡعَافٗا كَثِيرَةٗۚ وَٱللَّهُ يَقۡبِضُ وَيَبۡصُۜطُ وَإِلَيۡهِ تُرۡجَعُونَ","End":"٢٤٥"},{"SurahNumber":2,"VerseNumber":246,"Text":"أَلَمۡ تَرَ إِلَى ٱلۡمَلَإِ مِنۢ بَنِيٓ إِسۡرَـٰٓءِيلَ مِنۢ بَعۡدِ مُوسَىٰٓ إِذۡ قَالُواْ لِنَبِيّٖ لَّهُمُ ٱبۡعَثۡ لَنَا مَلِكٗا نُّقَٰتِلۡ فِي سَبِيلِ ٱللَّهِۖ قَالَ هَلۡ عَسَيۡتُمۡ إِن كُتِبَ عَلَيۡكُمُ ٱلۡقِتَالُ أَلَّا تُقَٰتِلُواْۖ قَالُواْ وَمَا لَنَآ أَلَّا نُقَٰتِلَ فِي سَبِيلِ ٱللَّهِ وَقَدۡ أُخۡرِجۡنَا مِن دِيَٰرِنَا وَأَبۡنَآئِنَاۖ فَلَمَّا كُتِبَ عَلَيۡهِمُ ٱلۡقِتَالُ تَوَلَّوۡاْ إِلَّا قَلِيلٗا مِّنۡهُمۡۚ وَٱللَّهُ عَلِيمُۢ بِٱلظَّـٰلِمِينَ","End":"٢٤٦"},{"SurahNumber":2,"VerseNumber":247,"Text":"وَقَالَ لَهُمۡ نَبِيُّهُمۡ إِنَّ ٱللَّهَ قَدۡ بَعَثَ لَكُمۡ طَالُوتَ مَلِكٗاۚ قَالُوٓاْ أَنَّىٰ يَكُونُ لَهُ ٱلۡمُلۡكُ عَلَيۡنَا وَنَحۡنُ أَحَقُّ بِٱلۡمُلۡكِ مِنۡهُ وَلَمۡ يُؤۡتَ سَعَةٗ مِّنَ ٱلۡمَالِۚ قَالَ إِنَّ ٱللَّهَ ٱصۡطَفَىٰهُ عَلَيۡكُمۡ وَزَادَهُۥ بَسۡطَةٗ فِي ٱلۡعِلۡمِ وَٱلۡجِسۡمِۖ وَٱللَّهُ يُؤۡتِي مُلۡكَهُۥ مَن يَشَآءُۚ وَٱللَّهُ وَٰسِعٌ عَلِيمٞ","End":"٢٤٧"},{"SurahNumber":2,"VerseNumber":248,"Text":"وَقَالَ لَهُمۡ نَبِيُّهُمۡ إِنَّ ءَايَةَ مُلۡكِهِۦٓ أَن يَأۡتِيَكُمُ ٱلتَّابُوتُ فِيهِ سَكِينَةٞ مِّن رَّبِّكُمۡ وَبَقِيَّةٞ مِّمَّا تَرَكَ ءَالُ مُوسَىٰ وَءَالُ هَٰرُونَ تَحۡمِلُهُ ٱلۡمَلَـٰٓئِكَةُۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لَّكُمۡ إِن كُنتُم مُّؤۡمِنِينَ","End":"٢٤٨"},{"SurahNumber":2,"VerseNumber":249,"Text":"فَلَمَّا فَصَلَ طَالُوتُ بِٱلۡجُنُودِ قَالَ إِنَّ ٱللَّهَ مُبۡتَلِيكُم بِنَهَرٖ فَمَن شَرِبَ مِنۡهُ فَلَيۡسَ مِنِّي وَمَن لَّمۡ يَطۡعَمۡهُ فَإِنَّهُۥ مِنِّيٓ إِلَّا مَنِ ٱغۡتَرَفَ غُرۡفَةَۢ بِيَدِهِۦۚ فَشَرِبُواْ مِنۡهُ إِلَّا قَلِيلٗا مِّنۡهُمۡۚ فَلَمَّا جَاوَزَهُۥ هُوَ وَٱلَّذِينَ ءَامَنُواْ مَعَهُۥ قَالُواْ لَا طَاقَةَ لَنَا ٱلۡيَوۡمَ بِجَالُوتَ وَجُنُودِهِۦۚ قَالَ ٱلَّذِينَ يَظُنُّونَ أَنَّهُم مُّلَٰقُواْ ٱللَّهِ كَم مِّن فِئَةٖ قَلِيلَةٍ غَلَبَتۡ فِئَةٗ كَثِيرَةَۢ بِإِذۡنِ ٱللَّهِۗ وَٱللَّهُ مَعَ ٱلصَّـٰبِرِينَ","End":"٢٤٩"},{"SurahNumber":2,"VerseNumber":250,"Text":"وَلَمَّا بَرَزُواْ لِجَالُوتَ وَجُنُودِهِۦ قَالُواْ رَبَّنَآ أَفۡرِغۡ عَلَيۡنَا صَبۡرٗا وَثَبِّتۡ أَقۡدَامَنَا وَٱنصُرۡنَا عَلَى ٱلۡقَوۡمِ ٱلۡكَٰفِرِينَ","End":"٢٥٠"},{"SurahNumber":2,"VerseNumber":251,"Text":"فَهَزَمُوهُم بِإِذۡنِ ٱللَّهِ وَقَتَلَ دَاوُۥدُ جَالُوتَ وَءَاتَىٰهُ ٱللَّهُ ٱلۡمُلۡكَ وَٱلۡحِكۡمَةَ وَعَلَّمَهُۥ مِمَّا يَشَآءُۗ وَلَوۡلَا دَفۡعُ ٱللَّهِ ٱلنَّاسَ بَعۡضَهُم بِبَعۡضٖ لَّفَسَدَتِ ٱلۡأَرۡضُ وَلَٰكِنَّ ٱللَّهَ ذُو فَضۡلٍ عَلَى ٱلۡعَٰلَمِينَ","End":"٢٥١"},{"SurahNumber":2,"VerseNumber":252,"Text":"تِلۡكَ ءَايَٰتُ ٱللَّهِ نَتۡلُوهَا عَلَيۡكَ بِٱلۡحَقِّۚ وَإِنَّكَ لَمِنَ ٱلۡمُرۡسَلِينَ","End":"٢٥٢"},{"SurahNumber":2,"VerseNumber":253,"Text":"۞تِلۡكَ ٱلرُّسُلُ فَضَّلۡنَا بَعۡضَهُمۡ عَلَىٰ بَعۡضٖۘ مِّنۡهُم مَّن كَلَّمَ ٱللَّهُۖ وَرَفَعَ بَعۡضَهُمۡ دَرَجَٰتٖۚ وَءَاتَيۡنَا عِيسَى ٱبۡنَ مَرۡيَمَ ٱلۡبَيِّنَٰتِ وَأَيَّدۡنَٰهُ بِرُوحِ ٱلۡقُدُسِۗ وَلَوۡ شَآءَ ٱللَّهُ مَا ٱقۡتَتَلَ ٱلَّذِينَ مِنۢ بَعۡدِهِم مِّنۢ بَعۡدِ مَا جَآءَتۡهُمُ ٱلۡبَيِّنَٰتُ وَلَٰكِنِ ٱخۡتَلَفُواْ فَمِنۡهُم مَّنۡ ءَامَنَ وَمِنۡهُم مَّن كَفَرَۚ وَلَوۡ شَآءَ ٱللَّهُ مَا ٱقۡتَتَلُواْ وَلَٰكِنَّ ٱللَّهَ يَفۡعَلُ مَا يُرِيدُ","End":"٢٥٣"},{"SurahNumber":2,"VerseNumber":254,"Text":"يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ أَنفِقُواْ مِمَّا رَزَقۡنَٰكُم مِّن قَبۡلِ أَن يَأۡتِيَ يَوۡمٞ لَّا بَيۡعٞ فِيهِ وَلَا خُلَّةٞ وَلَا شَفَٰعَةٞۗ وَٱلۡكَٰفِرُونَ هُمُ ٱلظَّـٰلِمُونَ","End":"٢٥٤"},{"SurahNumber":2,"VerseNumber":255,"Text":"ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡحَيُّ ٱلۡقَيُّومُۚ لَا تَأۡخُذُهُۥ سِنَةٞ وَلَا نَوۡمٞۚ لَّهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ مَن ذَا ٱلَّذِي يَشۡفَعُ عِندَهُۥٓ إِلَّا بِإِذۡنِهِۦۚ يَعۡلَمُ مَا بَيۡنَ أَيۡدِيهِمۡ وَمَا خَلۡفَهُمۡۖ وَلَا يُحِيطُونَ بِشَيۡءٖ مِّنۡ عِلۡمِهِۦٓ إِلَّا بِمَا شَآءَۚ وَسِعَ كُرۡسِيُّهُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَۖ وَلَا يَـُٔودُهُۥ حِفۡظُهُمَاۚ وَهُوَ ٱلۡعَلِيُّ ٱلۡعَظِيمُ","End":"٢٥٥"},{"SurahNumber":2,"VerseNumber":256,"Text":"لَآ إِكۡرَاهَ فِي ٱلدِّينِۖ قَد تَّبَيَّنَ ٱلرُّشۡدُ مِنَ ٱلۡغَيِّۚ فَمَن يَكۡفُرۡ بِٱلطَّـٰغُوتِ وَيُؤۡمِنۢ بِٱللَّهِ فَقَدِ ٱسۡتَمۡسَكَ بِٱلۡعُرۡوَةِ ٱلۡوُثۡقَىٰ لَا ٱنفِصَامَ لَهَاۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ","End":"٢٥٦"},{"SurahNumber":2,"VerseNumber":257,"Text":"ٱللَّهُ وَلِيُّ ٱلَّذِينَ ءَامَنُواْ يُخۡرِجُهُم مِّنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِۖ وَٱلَّذِينَ كَفَرُوٓاْ أَوۡلِيَآؤُهُمُ ٱلطَّـٰغُوتُ يُخۡرِجُونَهُم مِّنَ ٱلنُّورِ إِلَى ٱلظُّلُمَٰتِۗ أُوْلَـٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ","End":"٢٥٧"},{"SurahNumber":2,"VerseNumber":258,"Text":"أَلَمۡ تَرَ إِلَى ٱلَّذِي حَآجَّ إِبۡرَٰهِـۧمَ فِي رَبِّهِۦٓ أَنۡ ءَاتَىٰهُ ٱللَّهُ ٱلۡمُلۡكَ إِذۡ قَالَ إِبۡرَٰهِـۧمُ رَبِّيَ ٱلَّذِي يُحۡيِۦ وَيُمِيتُ قَالَ أَنَا۠ أُحۡيِۦ وَأُمِيتُۖ قَالَ إِبۡرَٰهِـۧمُ فَإِنَّ ٱللَّهَ يَأۡتِي بِٱلشَّمۡسِ مِنَ ٱلۡمَشۡرِقِ فَأۡتِ بِهَا مِنَ ٱلۡمَغۡرِبِ فَبُهِتَ ٱلَّذِي كَفَرَۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّـٰلِمِينَ","End":"٢٥٨"},{"SurahNumber":2,"VerseNumber":259,"Text":"أَوۡ كَٱلَّذِي مَرَّ عَلَىٰ قَرۡيَةٖ وَهِيَ خَاوِيَةٌ عَلَىٰ عُرُوشِهَا قَالَ أَنَّىٰ يُحۡيِۦ هَٰذِهِ ٱللَّهُ بَعۡدَ مَوۡتِهَاۖ فَأَمَاتَهُ ٱللَّهُ مِاْئَةَ عَامٖ ثُمَّ بَعَثَهُۥۖ قَالَ كَمۡ لَبِثۡتَۖ قَالَ لَبِثۡتُ يَوۡمًا أَوۡ بَعۡضَ يَوۡمٖۖ قَالَ بَل لَّبِثۡتَ مِاْئَةَ عَامٖ فَٱنظُرۡ إِلَىٰ طَعَامِكَ وَشَرَابِكَ لَمۡ يَتَسَنَّهۡۖ وَٱنظُرۡ إِلَىٰ حِمَارِكَ وَلِنَجۡعَلَكَ ءَايَةٗ لِّلنَّاسِۖ وَٱنظُرۡ إِلَى ٱلۡعِظَامِ كَيۡفَ نُنشِزُهَا ثُمَّ نَكۡسُوهَا لَحۡمٗاۚ فَلَمَّا تَبَيَّنَ لَهُۥ قَالَ أَعۡلَمُ أَنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","End":"٢٥٩"},{"SurahNumber":2,"VerseNumber":260,"Text":"وَإِذۡ قَالَ إِبۡرَٰهِـۧمُ رَبِّ أَرِنِي كَيۡفَ تُحۡيِ ٱلۡمَوۡتَىٰۖ قَالَ أَوَلَمۡ تُؤۡمِنۖ قَالَ بَلَىٰ وَلَٰكِن لِّيَطۡمَئِنَّ قَلۡبِيۖ قَالَ فَخُذۡ أَرۡبَعَةٗ مِّنَ ٱلطَّيۡرِ فَصُرۡهُنَّ إِلَيۡكَ ثُمَّ ٱجۡعَلۡ عَلَىٰ كُلِّ جَبَلٖ مِّنۡهُنَّ جُزۡءٗا ثُمَّ ٱدۡعُهُنَّ يَأۡتِينَكَ سَعۡيٗاۚ وَٱعۡلَمۡ أَنَّ ٱللَّهَ عَزِيزٌ حَكِيمٞ","End":"٢٦٠"},{"SurahNumber":2,"VerseNumber":261,"Text":"مَّثَلُ ٱلَّذِينَ يُنفِقُونَ أَمۡوَٰلَهُمۡ فِي سَبِيلِ ٱللَّهِ كَمَثَلِ حَبَّةٍ أَنۢبَتَتۡ سَبۡعَ سَنَابِلَ فِي كُلِّ سُنۢبُلَةٖ مِّاْئَةُ حَبَّةٖۗ وَٱللَّهُ يُضَٰعِفُ لِمَن يَشَآءُۚ وَٱللَّهُ وَٰسِعٌ عَلِيمٌ","End":"٢٦١"},{"SurahNumber":2,"VerseNumber":262,"Text":"ٱلَّذِينَ يُنفِقُونَ أَمۡوَٰلَهُمۡ فِي سَبِيلِ ٱللَّهِ ثُمَّ لَا يُتۡبِعُونَ مَآ أَنفَقُواْ مَنّٗا وَلَآ أَذٗى لَّهُمۡ أَجۡرُهُمۡ عِندَ رَبِّهِمۡ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ","End":"٢٦٢"},{"SurahNumber":2,"VerseNumber":263,"Text":"۞قَوۡلٞ مَّعۡرُوفٞ وَمَغۡفِرَةٌ خَيۡرٞ مِّن صَدَقَةٖ يَتۡبَعُهَآ أَذٗىۗ وَٱللَّهُ غَنِيٌّ حَلِيمٞ","End":"٢٦٣"},{"SurahNumber":2,"VerseNumber":264,"Text":"يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تُبۡطِلُواْ صَدَقَٰتِكُم بِٱلۡمَنِّ وَٱلۡأَذَىٰ كَٱلَّذِي يُنفِقُ مَالَهُۥ رِئَآءَ ٱلنَّاسِ وَلَا يُؤۡمِنُ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِۖ فَمَثَلُهُۥ كَمَثَلِ صَفۡوَانٍ عَلَيۡهِ تُرَابٞ فَأَصَابَهُۥ وَابِلٞ فَتَرَكَهُۥ صَلۡدٗاۖ لَّا يَقۡدِرُونَ عَلَىٰ شَيۡءٖ مِّمَّا كَسَبُواْۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡكَٰفِرِينَ","End":"٢٦٤"},{"SurahNumber":2,"VerseNumber":265,"Text":"وَمَثَلُ ٱلَّذِينَ يُنفِقُونَ أَمۡوَٰلَهُمُ ٱبۡتِغَآءَ مَرۡضَاتِ ٱللَّهِ وَتَثۡبِيتٗا مِّنۡ أَنفُسِهِمۡ كَمَثَلِ جَنَّةِۭ بِرَبۡوَةٍ أَصَابَهَا وَابِلٞ فَـَٔاتَتۡ أُكُلَهَا ضِعۡفَيۡنِ فَإِن لَّمۡ يُصِبۡهَا وَابِلٞ فَطَلّٞۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٌ","End":"٢٦٥"},{"SurahNumber":2,"VerseNumber":266,"Text":"أَيَوَدُّ أَحَدُكُمۡ أَن تَكُونَ لَهُۥ جَنَّةٞ مِّن نَّخِيلٖ وَأَعۡنَابٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ لَهُۥ فِيهَا مِن كُلِّ ٱلثَّمَرَٰتِ وَأَصَابَهُ ٱلۡكِبَرُ وَلَهُۥ ذُرِّيَّةٞ ضُعَفَآءُ فَأَصَابَهَآ إِعۡصَارٞ فِيهِ نَارٞ فَٱحۡتَرَقَتۡۗ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمُ ٱلۡأٓيَٰتِ لَعَلَّكُمۡ تَتَفَكَّرُونَ","End":"٢٦٦"},{"SurahNumber":2,"VerseNumber":267,"Text":"يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ أَنفِقُواْ مِن طَيِّبَٰتِ مَا كَسَبۡتُمۡ وَمِمَّآ أَخۡرَجۡنَا لَكُم مِّنَ ٱلۡأَرۡضِۖ وَلَا تَيَمَّمُواْ ٱلۡخَبِيثَ مِنۡهُ تُنفِقُونَ وَلَسۡتُم بِـَٔاخِذِيهِ إِلَّآ أَن تُغۡمِضُواْ فِيهِۚ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ غَنِيٌّ حَمِيدٌ","End":"٢٦٧"},{"SurahNumber":2,"VerseNumber":268,"Text":"ٱلشَّيۡطَٰنُ يَعِدُكُمُ ٱلۡفَقۡرَ وَيَأۡمُرُكُم بِٱلۡفَحۡشَآءِۖ وَٱللَّهُ يَعِدُكُم مَّغۡفِرَةٗ مِّنۡهُ وَفَضۡلٗاۗ وَٱللَّهُ وَٰسِعٌ عَلِيمٞ","End":"٢٦٨"},{"SurahNumber":2,"VerseNumber":269,"Text":"يُؤۡتِي ٱلۡحِكۡمَةَ مَن يَشَآءُۚ وَمَن يُؤۡتَ ٱلۡحِكۡمَةَ فَقَدۡ أُوتِيَ خَيۡرٗا كَثِيرٗاۗ وَمَا يَذَّكَّرُ إِلَّآ أُوْلُواْ ٱلۡأَلۡبَٰبِ","End":"٢٦٩"},{"SurahNumber":2,"VerseNumber":270,"Text":"وَمَآ أَنفَقۡتُم مِّن نَّفَقَةٍ أَوۡ نَذَرۡتُم مِّن نَّذۡرٖ فَإِنَّ ٱللَّهَ يَعۡلَمُهُۥۗ وَمَا لِلظَّـٰلِمِينَ مِنۡ أَنصَارٍ","End":"٢٧٠"},{"SurahNumber":2,"VerseNumber":271,"Text":"إِن تُبۡدُواْ ٱلصَّدَقَٰتِ فَنِعِمَّا هِيَۖ وَإِن تُخۡفُوهَا وَتُؤۡتُوهَا ٱلۡفُقَرَآءَ فَهُوَ خَيۡرٞ لَّكُمۡۚ وَيُكَفِّرُ عَنكُم مِّن سَيِّـَٔاتِكُمۡۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرٞ","End":"٢٧١"},{"SurahNumber":2,"VerseNumber":272,"Text":"۞لَّيۡسَ عَلَيۡكَ هُدَىٰهُمۡ وَلَٰكِنَّ ٱللَّهَ يَهۡدِي مَن يَشَآءُۗ وَمَا تُنفِقُواْ مِنۡ خَيۡرٖ فَلِأَنفُسِكُمۡۚ وَمَا تُنفِقُونَ إِلَّا ٱبۡتِغَآءَ وَجۡهِ ٱللَّهِۚ وَمَا تُنفِقُواْ مِنۡ خَيۡرٖ يُوَفَّ إِلَيۡكُمۡ وَأَنتُمۡ لَا تُظۡلَمُونَ","End":"٢٧٢"},{"SurahNumber":2,"VerseNumber":273,"Text":"لِلۡفُقَرَآءِ ٱلَّذِينَ أُحۡصِرُواْ فِي سَبِيلِ ٱللَّهِ لَا يَسۡتَطِيعُونَ ضَرۡبٗا فِي ٱلۡأَرۡضِ يَحۡسَبُهُمُ ٱلۡجَاهِلُ أَغۡنِيَآءَ مِنَ ٱلتَّعَفُّفِ تَعۡرِفُهُم بِسِيمَٰهُمۡ لَا يَسۡـَٔلُونَ ٱلنَّاسَ إِلۡحَافٗاۗ وَمَا تُنفِقُواْ مِنۡ خَيۡرٖ فَإِنَّ ٱللَّهَ بِهِۦ عَلِيمٌ","End":"٢٧٣"},{"SurahNumber":2,"VerseNumber":274,"Text":"ٱلَّذِينَ يُنفِقُونَ أَمۡوَٰلَهُم بِٱلَّيۡلِ وَٱلنَّهَارِ سِرّٗا وَعَلَانِيَةٗ فَلَهُمۡ أَجۡرُهُمۡ عِندَ رَبِّهِمۡ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ","End":"٢٧٤"},{"SurahNumber":2,"VerseNumber":275,"Text":"ٱلَّذِينَ يَأۡكُلُونَ ٱلرِّبَوٰاْ لَا يَقُومُونَ إِلَّا كَمَا يَقُومُ ٱلَّذِي يَتَخَبَّطُهُ ٱلشَّيۡطَٰنُ مِنَ ٱلۡمَسِّۚ ذَٰلِكَ بِأَنَّهُمۡ قَالُوٓاْ إِنَّمَا ٱلۡبَيۡعُ مِثۡلُ ٱلرِّبَوٰاْۗ وَأَحَلَّ ٱللَّهُ ٱلۡبَيۡعَ وَحَرَّمَ ٱلرِّبَوٰاْۚ فَمَن جَآءَهُۥ مَوۡعِظَةٞ مِّن رَّبِّهِۦ فَٱنتَهَىٰ فَلَهُۥ مَا سَلَفَ وَأَمۡرُهُۥٓ إِلَى ٱللَّهِۖ وَمَنۡ عَادَ فَأُوْلَـٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ","End":"٢٧٥"},{"SurahNumber":2,"VerseNumber":276,"Text":"يَمۡحَقُ ٱللَّهُ ٱلرِّبَوٰاْ وَيُرۡبِي ٱلصَّدَقَٰتِۗ وَٱللَّهُ لَا يُحِبُّ كُلَّ كَفَّارٍ أَثِيمٍ","End":"٢٧٦"},{"SurahNumber":2,"VerseNumber":277,"Text":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّـٰلِحَٰتِ وَأَقَامُواْ ٱلصَّلَوٰةَ وَءَاتَوُاْ ٱلزَّكَوٰةَ لَهُمۡ أَجۡرُهُمۡ عِندَ رَبِّهِمۡ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ","End":"٢٧٧"},{"SurahNumber":2,"VerseNumber":278,"Text":"يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَذَرُواْ مَا بَقِيَ مِنَ ٱلرِّبَوٰٓاْ إِن كُنتُم مُّؤۡمِنِينَ","End":"٢٧٨"},{"SurahNumber":2,"VerseNumber":279,"Text":"فَإِن لَّمۡ تَفۡعَلُواْ فَأۡذَنُواْ بِحَرۡبٖ مِّنَ ٱللَّهِ وَرَسُولِهِۦۖ وَإِن تُبۡتُمۡ فَلَكُمۡ رُءُوسُ أَمۡوَٰلِكُمۡ لَا تَظۡلِمُونَ وَلَا تُظۡلَمُونَ","End":"٢٧٩"},{"SurahNumber":2,"VerseNumber":280,"Text":"وَإِن كَانَ ذُو عُسۡرَةٖ فَنَظِرَةٌ إِلَىٰ مَيۡسَرَةٖۚ وَأَن تَصَدَّقُواْ خَيۡرٞ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ","End":"٢٨٠"},{"SurahNumber":2,"VerseNumber":281,"Text":"وَٱتَّقُواْ يَوۡمٗا تُرۡجَعُونَ فِيهِ إِلَى ٱللَّهِۖ ثُمَّ تُوَفَّىٰ كُلُّ نَفۡسٖ مَّا كَسَبَتۡ وَهُمۡ لَا يُظۡلَمُونَ","End":"٢٨١"},{"SurahNumber":2,"VerseNumber":282,"Text":"يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا تَدَايَنتُم بِدَيۡنٍ إِلَىٰٓ أَجَلٖ مُّسَمّٗى فَٱكۡتُبُوهُۚ وَلۡيَكۡتُب بَّيۡنَكُمۡ كَاتِبُۢ بِٱلۡعَدۡلِۚ وَلَا يَأۡبَ كَاتِبٌ أَن يَكۡتُبَ كَمَا عَلَّمَهُ ٱللَّهُۚ فَلۡيَكۡتُبۡ وَلۡيُمۡلِلِ ٱلَّذِي عَلَيۡهِ ٱلۡحَقُّ وَلۡيَتَّقِ ٱللَّهَ رَبَّهُۥ وَلَا يَبۡخَسۡ مِنۡهُ شَيۡـٔٗاۚ فَإِن كَانَ ٱلَّذِي عَلَيۡهِ ٱلۡحَقُّ سَفِيهًا أَوۡ ضَعِيفًا أَوۡ لَا يَسۡتَطِيعُ أَن يُمِلَّ هُوَ فَلۡيُمۡلِلۡ وَلِيُّهُۥ بِٱلۡعَدۡلِۚ وَٱسۡتَشۡهِدُواْ شَهِيدَيۡنِ مِن رِّجَالِكُمۡۖ فَإِن لَّمۡ يَكُونَا رَجُلَيۡنِ فَرَجُلٞ وَٱمۡرَأَتَانِ مِمَّن تَرۡضَوۡنَ مِنَ ٱلشُّهَدَآءِ أَن تَضِلَّ إِحۡدَىٰهُمَا فَتُذَكِّرَ إِحۡدَىٰهُمَا ٱلۡأُخۡرَىٰۚ وَلَا يَأۡبَ ٱلشُّهَدَآءُ إِذَا مَا دُعُواْۚ وَلَا تَسۡـَٔمُوٓاْ أَن تَكۡتُبُوهُ صَغِيرًا أَوۡ كَبِيرًا إِلَىٰٓ أَجَلِهِۦۚ ذَٰلِكُمۡ أَقۡسَطُ عِندَ ٱللَّهِ وَأَقۡوَمُ لِلشَّهَٰدَةِ وَأَدۡنَىٰٓ أَلَّا تَرۡتَابُوٓاْ إِلَّآ أَن تَكُونَ تِجَٰرَةً حَاضِرَةٗ تُدِيرُونَهَا بَيۡنَكُمۡ فَلَيۡسَ عَلَيۡكُمۡ جُنَاحٌ أَلَّا تَكۡتُبُوهَاۗ وَأَشۡهِدُوٓاْ إِذَا تَبَايَعۡتُمۡۚ وَلَا يُضَآرَّ كَاتِبٞ وَلَا شَهِيدٞۚ وَإِن تَفۡعَلُواْ فَإِنَّهُۥ فُسُوقُۢ بِكُمۡۗ وَٱتَّقُواْ ٱللَّهَۖ وَيُعَلِّمُكُمُ ٱللَّهُۗ وَٱللَّهُ بِكُلِّ شَيۡءٍ عَلِيمٞ","End":"٢٨٢"},{"SurahNumber":2,"VerseNumber":283,"Text":"۞وَإِن كُنتُمۡ عَلَىٰ سَفَرٖ وَلَمۡ تَجِدُواْ كَاتِبٗا فَرِهَٰنٞ مَّقۡبُوضَةٞۖ فَإِنۡ أَمِنَ بَعۡضُكُم بَعۡضٗا فَلۡيُؤَدِّ ٱلَّذِي ٱؤۡتُمِنَ أَمَٰنَتَهُۥ وَلۡيَتَّقِ ٱللَّهَ رَبَّهُۥۗ وَلَا تَكۡتُمُواْ ٱلشَّهَٰدَةَۚ وَمَن يَكۡتُمۡهَا فَإِنَّهُۥٓ ءَاثِمٞ قَلۡبُهُۥۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ عَلِيمٞ","End":"٢٨٣"},{"SurahNumber":2,"VerseNumber":284,"Text":"لِّلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ وَإِن تُبۡدُواْ مَا فِيٓ أَنفُسِكُمۡ أَوۡ تُخۡفُوهُ يُحَاسِبۡكُم بِهِ ٱللَّهُۖ فَيَغۡفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ","End":"٢٨٤"},{"SurahNumber":2,"VerseNumber":285,"Text":"ءَامَنَ ٱلرَّسُولُ بِمَآ أُنزِلَ إِلَيۡهِ مِن رَّبِّهِۦ وَٱلۡمُؤۡمِنُونَۚ كُلٌّ ءَامَنَ بِٱللَّهِ وَمَلَـٰٓئِكَتِهِۦ وَكُتُبِهِۦ وَرُسُلِهِۦ لَا نُفَرِّقُ بَيۡنَ أَحَدٖ مِّن رُّسُلِهِۦۚ وَقَالُواْ سَمِعۡنَا وَأَطَعۡنَاۖ غُفۡرَانَكَ رَبَّنَا وَإِلَيۡكَ ٱلۡمَصِيرُ","End":"٢٨٥"},{"SurahNumber":2,"VerseNumber":286,"Text":"لَا يُكَلِّفُ ٱللَّهُ نَفۡسًا إِلَّا وُسۡعَهَاۚ لَهَا مَا كَسَبَتۡ وَعَلَيۡهَا مَا ٱكۡتَسَبَتۡۗ رَبَّنَا لَا تُؤَاخِذۡنَآ إِن نَّسِينَآ أَوۡ أَخۡطَأۡنَاۚ رَبَّنَا وَلَا تَحۡمِلۡ عَلَيۡنَآ إِصۡرٗا كَمَا حَمَلۡتَهُۥ عَلَى ٱلَّذِينَ مِن قَبۡلِنَاۚ رَبَّنَا وَلَا تُحَمِّلۡنَا مَا لَا طَاقَةَ لَنَا بِهِۦۖ وَٱعۡفُ عَنَّا وَٱغۡفِرۡ لَنَا وَٱرۡحَمۡنَآۚ أَنتَ مَوۡلَىٰنَا فَٱنصُرۡنَا عَلَى ٱلۡقَوۡمِ ٱلۡكَٰفِرِينَ","End":"٢٨٦"}],"Translations":[{"LanguageCode":"ara","Language":"Arabic","Name":"ara-quran-la","Author":"Quran Transliteration","Source":"http://tanzil.net","Direction":"ltr","Translations":[{"SurahNumber":2,"VerseNumber":1,"Text":"Aliflammeem"},{"SurahNumber":2,"VerseNumber":2,"Text":"Thalika alkitabu la rayba feehi hudan lilmuttaqeena"},{"SurahNumber":2,"VerseNumber":3,"Text":"Allatheena yuminoona bialghaybi wayuqeemoona alssalata wamimma razaqnahum yunfiqoona"},{"SurahNumber":2,"VerseNumber":4,"Text":"Waallatheena yuminoona bima onzila ilayka wama onzila min qablika wabialakhirati hum yooqinoona"},{"SurahNumber":2,"VerseNumber":5,"Text":"Olaika AAala hudan min rabbihim waolaika humu almuflihoona"},{"SurahNumber":2,"VerseNumber":6,"Text":"Inna allatheena kafaroo sawaon AAalayhim aanthartahum am lam tunthirhum la yuminoona"},{"SurahNumber":2,"VerseNumber":7,"Text":"Khatama Allahu AAala quloobihim waAAala samAAihim waAAala absarihim ghishawatun walahum AAathabun AAatheemun"},{"SurahNumber":2,"VerseNumber":8,"Text":"Wamina alnnasi man yaqoolu amanna biAllahi wabialyawmi alakhiri wama hum bimumineena"},{"SurahNumber":2,"VerseNumber":9,"Text":"YukhadiAAoona Allaha waallatheena amanoo wama yakhdaAAoona illa anfusahum wama yashAAuroona"},{"SurahNumber":2,"VerseNumber":10,"Text":"Fee quloobihim maradun fazadahumu Allahu maradan walahum AAathabun aleemun bima kanoo yakthiboona"},{"SurahNumber":2,"VerseNumber":11,"Text":"Waitha qeela lahum la tufsidoo fee alardi qaloo innama nahnu muslihoona"},{"SurahNumber":2,"VerseNumber":12,"Text":"Ala innahum humu almufsidoona walakin la yashAAuroona"},{"SurahNumber":2,"VerseNumber":13,"Text":"Waitha qeela lahum aminoo kama amana alnnasu qaloo anuminu kama amana alssufahao ala innahum humu alssufahao walakin la yaAAlamoona"},{"SurahNumber":2,"VerseNumber":14,"Text":"Waitha laqoo allatheena amanoo qaloo amanna waitha khalaw ila shayateenihim qaloo inna maAAakum innama nahnu mustahzioona"},{"SurahNumber":2,"VerseNumber":15,"Text":"Allahu yastahzio bihim wayamudduhum fee tughyanihim yaAAmahoona"},{"SurahNumber":2,"VerseNumber":16,"Text":"Olaika allatheena ishtarawoo alddalalata bialhuda fama rabihat tijaratuhum wama kanoo muhtadeena"},{"SurahNumber":2,"VerseNumber":17,"Text":"Mathaluhum kamathali allathee istawqada naran falamma adaat ma hawlahu thahaba Allahu binoorihim watarakahum fee thulumatin la yubsiroona"},{"SurahNumber":2,"VerseNumber":18,"Text":"Summun bukmun AAumyun fahum la yarjiAAoona"},{"SurahNumber":2,"VerseNumber":19,"Text":"Aw kasayyibin mina alssamai feehi thulumatun waraAAdun wabarqun yajAAaloona asabiAAahum fee athanihim mina alssawaAAiqi hathara almawti waAllahu muheetun bialkafireena"},{"SurahNumber":2,"VerseNumber":20,"Text":"Yakadu albarqu yakhtafu absarahum kullama adaa lahum mashaw feehi waitha athlama AAalayhim qamoo walaw shaa Allahu lathahaba bisamAAihim waabsarihim inna Allaha AAala kulli shayin qadeerun"},{"SurahNumber":2,"VerseNumber":21,"Text":"Ya ayyuha alnnasu oAAbudoo rabbakumu allathee khalaqakum waallatheena min qablikum laAAallakum tattaqoona"},{"SurahNumber":2,"VerseNumber":22,"Text":"Allathee jaAAala lakumu alarda firashan waalssamaa binaan waanzala mina alssamai maan faakhraja bihi mina alththamarati rizqan lakum fala tajAAaloo lillahi andadan waantum taAAlamoona"},{"SurahNumber":2,"VerseNumber":23,"Text":"Wain kuntum fee raybin mimma nazzalna AAala AAabdina fatoo bisooratin min mithlihi waodAAoo shuhadaakum min dooni Allahi in kuntum sadiqeena"},{"SurahNumber":2,"VerseNumber":24,"Text":"Fain lam tafAAaloo walan tafAAaloo faittaqoo alnnara allatee waqooduha alnnasu waalhijaratu oAAiddat lilkafireena"},{"SurahNumber":2,"VerseNumber":25,"Text":"Wabashshiri allatheena amanoo waAAamiloo alssalihati anna lahum jannatin tajree min tahtiha alanharu kullama ruziqoo minha min thamaratin rizqan qaloo hatha allathee ruziqna min qablu waotoo bihi mutashabihan walahum feeha azwajun mutahharatun wahum feeha khalidoona"},{"SurahNumber":2,"VerseNumber":26,"Text":"Inna Allaha la yastahyee an yadriba mathalan ma baAAoodatan fama fawqaha faamma allatheena amanoo fayaAAlamoona annahu alhaqqu min rabbihim waamma allatheena kafaroo fayaqooloona matha arada Allahu bihatha mathalan yudillu bihi katheeran wayahdee bihi katheeran wama yudillu bihi illa alfasiqeena"},{"SurahNumber":2,"VerseNumber":27,"Text":"Allatheena yanqudoona AAahda Allahi min baAAdi meethaqihi wayaqtaAAoona ma amara Allahu bihi an yoosala wayufsidoona fee alardi olaika humu alkhasiroona"},{"SurahNumber":2,"VerseNumber":28,"Text":"Kayfa takfuroona biAllahi wakuntum amwatan faahyakum thumma yumeetukum thumma yuhyeekum thumma ilayhi turjaAAoona"},{"SurahNumber":2,"VerseNumber":29,"Text":"Huwa allathee khalaqa lakum ma fee alardi jameeAAan thumma istawa ila alssamai fasawwahunna sabAAa samawatin wahuwa bikulli shayin AAaleemun"},{"SurahNumber":2,"VerseNumber":30,"Text":"Waith qala rabbuka lilmalaikati innee jaAAilun fee alardi khaleefatan qaloo atajAAalu feeha man yufsidu feeha wayasfiku alddimaa wanahnu nusabbihu bihamdika wanuqaddisu laka qala innee aAAlamu ma la taAAlamoona"},{"SurahNumber":2,"VerseNumber":31,"Text":"WaAAallama adama alasmaa kullaha thumma AAaradahum AAala almalaikati faqala anbioonee biasmai haolai in kuntum sadiqeena"},{"SurahNumber":2,"VerseNumber":32,"Text":"Qaloo subhanaka la AAilma lana illa ma AAallamtana innaka anta alAAaleemu alhakeemu"},{"SurahNumber":2,"VerseNumber":33,"Text":"Qala ya adamu anbihum biasmaihim falamma anbaahum biasmaihim qala alam aqul lakum innee aAAlamu ghayba alssamawati waalardi waaAAlamu ma tubdoona wama kuntum taktumoona"},{"SurahNumber":2,"VerseNumber":34,"Text":"Waith qulna lilmalaikati osjudoo liadama fasajadoo illa ibleesa aba waistakbara wakana mina alkafireena"},{"SurahNumber":2,"VerseNumber":35,"Text":"Waqulna ya adamu oskun anta wazawjuka aljannata wakula minha raghadan haythu shituma wala taqraba hathihi alshshajarata fatakoona mina alththalimeena"},{"SurahNumber":2,"VerseNumber":36,"Text":"Faazallahuma alshshaytanu AAanha faakhrajahuma mimma kana feehi waqulna ihbitoo baAAdukum libaAAdin AAaduwwun walakum fee alardi mustaqarrun wamataAAun ila heenin"},{"SurahNumber":2,"VerseNumber":37,"Text":"Fatalaqqa adamu min rabbihi kalimatin fataba AAalayhi innahu huwa alttawwabu alrraheemu"},{"SurahNumber":2,"VerseNumber":38,"Text":"Qulna ihbitoo minha jameeAAan faimma yatiyannakum minnee hudan faman tabiAAa hudaya fala khawfun AAalayhim wala hum yahzanoona"},{"SurahNumber":2,"VerseNumber":39,"Text":"Waallatheena kafaroo wakaththaboo biayatina olaika ashabu alnnari hum feeha khalidoona"},{"SurahNumber":2,"VerseNumber":40,"Text":"Ya banee israeela othkuroo niAAmatiya allatee anAAamtu AAalaykum waawfoo biAAahdee oofi biAAahdikum waiyyaya fairhabooni"},{"SurahNumber":2,"VerseNumber":41,"Text":"Waaminoo bima anzaltu musaddiqan lima maAAakum wala takoonoo awwala kafirin bihi wala tashtaroo biayatee thamanan qaleelan waiyyaya faittaqooni"},{"SurahNumber":2,"VerseNumber":42,"Text":"Wala talbisoo alhaqqa bialbatili wataktumoo alhaqqa waantum taAAlamoona"},{"SurahNumber":2,"VerseNumber":43,"Text":"Waaqeemoo alssalata waatoo alzzakata wairkaAAoo maAAa alrrakiAAeena"},{"SurahNumber":2,"VerseNumber":44,"Text":"Atamuroona alnnasa bialbirri watansawna anfusakum waantum tatloona alkitaba afala taAAqiloona"},{"SurahNumber":2,"VerseNumber":45,"Text":"WaistaAAeenoo bialssabri waalssalati wainnaha lakabeeratun illa AAala alkhashiAAeena"},{"SurahNumber":2,"VerseNumber":46,"Text":"Allatheena yathunnoona annahum mulaqoo rabbihim waannahum ilayhi rajiAAoona"},{"SurahNumber":2,"VerseNumber":47,"Text":"Ya banee israeela othkuroo niAAmatiya allatee anAAamtu AAalaykum waannee faddaltukum AAala alAAalameena"},{"SurahNumber":2,"VerseNumber":48,"Text":"Waittaqoo yawman la tajzee nafsun AAan nafsin shayan wala yuqbalu minha shafaAAatun wala yukhathu minha AAadlun wala hum yunsaroona"},{"SurahNumber":2,"VerseNumber":49,"Text":"Waith najjaynakum min ali firAAawna yasoomoonakum sooa alAAathabi yuthabbihoona abnaakum wayastahyoona nisaakum wafee thalikum balaon min rabbikum AAatheemun"},{"SurahNumber":2,"VerseNumber":50,"Text":"Waith faraqna bikumu albahra faanjaynakum waaghraqna ala firAAawna waantum tanthuroona"},{"SurahNumber":2,"VerseNumber":51,"Text":"Waith waAAadna moosa arbaAAeena laylatan thumma ittakhathtumu alAAijla min baAAdihi waantum thalimoona"},{"SurahNumber":2,"VerseNumber":52,"Text":"Thumma AAafawna AAankum min baAAdi thalika laAAallakum tashkuroona"},{"SurahNumber":2,"VerseNumber":53,"Text":"Waith atayna moosa alkitaba waalfurqana laAAallakum tahtadoona"},{"SurahNumber":2,"VerseNumber":54,"Text":"Waith qala moosa liqawmihi ya qawmi innakum thalamtum anfusakum biittikhathikumu alAAijla fatooboo ila bariikum faoqtuloo anfusakum thalikum khayrun lakum AAinda bariikum fataba AAalaykum innahu huwa alttawwabu alrraheemu"},{"SurahNumber":2,"VerseNumber":55,"Text":"Waith qultum ya moosa lan numina laka hatta nara Allaha jahratan faakhathatkumu alssaAAiqatu waantum tanthuroona"},{"SurahNumber":2,"VerseNumber":56,"Text":"Thumma baAAathnakum min baAAdi mawtikum laAAallakum tashkuroona"},{"SurahNumber":2,"VerseNumber":57,"Text":"Wathallalna AAalaykumu alghamama waanzalna AAalaykumu almanna waalssalwa kuloo min tayyibati ma razaqnakum wama thalamoona walakin kanoo anfusahum yathlimoona"},{"SurahNumber":2,"VerseNumber":58,"Text":"Waith qulna odkhuloo hathihi alqaryata fakuloo minha haythu shitum raghadan waodkhuloo albaba sujjadan waqooloo hittatun naghfir lakum khatayakum wasanazeedu almuhsineena"},{"SurahNumber":2,"VerseNumber":59,"Text":"Fabaddala allatheena thalamoo qawlan ghayra allathee qeela lahum faanzalna AAala allatheena thalamoo rijzan mina alssamai bima kanoo yafsuqoona"},{"SurahNumber":2,"VerseNumber":60,"Text":"Waithi istasqa moosa liqawmihi faqulna idrib biAAasaka alhajara fainfajarat minhu ithnata AAashrata AAaynan qad AAalima kullu onasin mashrabahum kuloo waishraboo min rizqi Allahi wala taAAthaw fee alardi mufsideena"},{"SurahNumber":2,"VerseNumber":61,"Text":"Waith qultum ya moosa lan nasbira AAala taAAamin wahidin faodAAu lana rabbaka yukhrij lana mimma tunbitu alardu min baqliha waqiththaiha wafoomiha waAAadasiha wabasaliha qala atastabdiloona allathee huwa adna biallathee huwa khayrun ihbitoo misran fainna lakum ma saaltum waduribat AAalayhimu alththillatu waalmaskanatu wabaoo bighadabin mina Allahi thalika biannahum kanoo yakfuroona biayati Allahi wayaqtuloona alnnabiyyeena bighayri alhaqqi thalika bima AAasaw wakanoo yaAAtadoona"},{"SurahNumber":2,"VerseNumber":62,"Text":"Inna allatheena amanoo waallatheena hadoo waalnnasara waalssabieena man amana biAllahi waalyawmi alakhiri waAAamila salihan falahum ajruhum AAinda rabbihim wala khawfun AAalayhim wala hum yahzanoona"},{"SurahNumber":2,"VerseNumber":63,"Text":"Waith akhathna meethaqakum warafaAAna fawqakumu alttoora khuthoo ma ataynakum biquwwatin waothkuroo ma feehi laAAallakum tattaqoona"},{"SurahNumber":2,"VerseNumber":64,"Text":"Thumma tawallaytum min baAAdi thalika falawla fadlu Allahi AAalaykum warahmatuhu lakuntum mina alkhasireena"},{"SurahNumber":2,"VerseNumber":65,"Text":"Walaqad AAalimtumu allatheena iAAtadaw minkum fee alssabti faqulna lahum koonoo qiradatan khasieena"},{"SurahNumber":2,"VerseNumber":66,"Text":"FajaAAalnaha nakalan lima bayna yadayha wama khalfaha wamawAAithatan lilmuttaqeena"},{"SurahNumber":2,"VerseNumber":67,"Text":"Waith qala moosa liqawmihi inna Allaha yamurukum an tathbahoo baqaratan qaloo atattakhithuna huzuwan qala aAAoothu biAllahi an akoona mina aljahileena"},{"SurahNumber":2,"VerseNumber":68,"Text":"Qaloo odAAu lana rabbaka yubayyin lana ma hiya qala innahu yaqoolu innaha baqaratun la faridun wala bikrun AAawanun bayna thalika faifAAaloo ma tumaroona"},{"SurahNumber":2,"VerseNumber":69,"Text":"Qaloo odAAu lana rabbaka yubayyin lana ma lawnuha qala innahu yaqoolu innaha baqaratun safrao faqiAAun lawnuha tasurru alnnathireena"},{"SurahNumber":2,"VerseNumber":70,"Text":"Qaloo odAAu lana rabbaka yubayyin lana ma hiya inna albaqara tashabaha AAalayna wainna in shaa Allahu lamuhtadoona"},{"SurahNumber":2,"VerseNumber":71,"Text":"Qala innahu yaqoolu innaha baqaratun la thaloolun tutheeru alarda wala tasqee alhartha musallamatun la shiyata feeha qaloo alana jita bialhaqqi fathabahooha wama kadoo yafAAaloona"},{"SurahNumber":2,"VerseNumber":72,"Text":"Waith qataltum nafsan faiddaratum feeha waAllahu mukhrijun ma kuntum taktumoona"},{"SurahNumber":2,"VerseNumber":73,"Text":"Faqulna idriboohu bibaAAdiha kathalika yuhyee Allahu almawta wayureekum ayatihi laAAallakum taAAqiloona"},{"SurahNumber":2,"VerseNumber":74,"Text":"Thumma qasat quloobukum min baAAdi thalika fahiya kaalhijarati aw ashaddu qaswatan wainna mina alhijarati lama yatafajjaru minhu alanharu wainna minha lama yashshaqqaqu fayakhruju minhu almao wainna minha lama yahbitu min khashyati Allahi wama Allahu bighafilin AAamma taAAmaloona"},{"SurahNumber":2,"VerseNumber":75,"Text":"AfatatmaAAoona an yuminoo lakum waqad kana fareequn minhum yasmaAAoona kalama Allahi thumma yuharrifoonahu min baAAdi ma AAaqaloohu wahum yaAAlamoona"},{"SurahNumber":2,"VerseNumber":76,"Text":"Waitha laqoo allatheena amanoo qaloo amanna waitha khala baAAduhum ila baAAdin qaloo atuhaddithoonahum bima fataha Allahu AAalaykum liyuhajjookum bihi AAinda rabbikum afala taAAqiloona"},{"SurahNumber":2,"VerseNumber":77,"Text":"Awala yaAAlamoona anna Allaha yaAAlamu ma yusirroona wama yuAAlinoona"},{"SurahNumber":2,"VerseNumber":78,"Text":"Waminhum ommiyyoona la yaAAlamoona alkitaba illa amaniyya wain hum illa yathunnoona"},{"SurahNumber":2,"VerseNumber":79,"Text":"Fawaylun lillatheena yaktuboona alkitaba biaydeehim thumma yaqooloona hatha min AAindi Allahi liyashtaroo bihi thamanan qaleelan fawaylun lahum mimma katabat aydeehim wawaylun lahum mimma yaksiboona"},{"SurahNumber":2,"VerseNumber":80,"Text":"Waqaloo lan tamassana alnnaru illa ayyaman maAAdoodatan qul attakhathtum AAinda Allahi AAahdan falan yukhlifa Allahu AAahdahu am taqooloona AAala Allahi ma la taAAlamoona"},{"SurahNumber":2,"VerseNumber":81,"Text":"Bala man kasaba sayyiatan waahatat bihi khateeatuhu faolaika ashabu alnnari hum feeha khalidoona"},{"SurahNumber":2,"VerseNumber":82,"Text":"Waallatheena amanoo waAAamiloo alssalihati olaika ashabu aljannati hum feeha khalidoona"},{"SurahNumber":2,"VerseNumber":83,"Text":"Waith akhathna meethaqa banee israeela la taAAbudoona illa Allaha wabialwalidayni ihsanan wathee alqurba waalyatama waalmasakeeni waqooloo lilnnasi husnan waaqeemoo alssalata waatoo alzzakata thumma tawallaytum illa qaleelan minkum waantum muAAridoona"},{"SurahNumber":2,"VerseNumber":84,"Text":"Waith akhathna meethaqakum la tasfikoona dimaakum wala tukhrijoona anfusakum min diyarikum thumma aqrartum waantum tashhadoona"},{"SurahNumber":2,"VerseNumber":85,"Text":"Thumma antum haolai taqtuloona anfusakum watukhrijoona fareeqan minkum min diyarihim tathaharoona AAalayhim bialithmi waalAAudwani wain yatookum osara tufadoohum wahuwa muharramun AAalaykum ikhrajuhum afatuminoona bibaAAdi alkitabi watakfuroona bibaAAdin fama jazao man yafAAalu thalika minkum illa khizyun fee alhayati alddunya wayawma alqiyamati yuraddoona ila ashaddi alAAathabi wama Allahu bighafilin AAamma taAAmaloona"},{"SurahNumber":2,"VerseNumber":86,"Text":"Olaika allatheena ishtarawoo alhayata alddunya bialakhirati fala yukhaffafu AAanhumu alAAathabu wala hum yunsaroona"},{"SurahNumber":2,"VerseNumber":87,"Text":"Walaqad atayna moosa alkitaba waqaffayna min baAAdihi bialrrusuli waatayna AAeesa ibna maryama albayyinati waayyadnahu biroohi alqudusi afakullama jaakum rasoolun bima la tahwa anfusukumu istakbartum fafareeqan kaththabtum wafareeqan taqtuloona"},{"SurahNumber":2,"VerseNumber":88,"Text":"Waqaloo quloobuna ghulfun bal laAAanahumu Allahu bikufrihim faqaleelan ma yuminoona"},{"SurahNumber":2,"VerseNumber":89,"Text":"Walamma jaahum kitabun min AAindi Allahi musaddiqun lima maAAahum wakanoo min qablu yastaftihoona AAala allatheena kafaroo falamma jaahum ma AAarafoo kafaroo bihi falaAAnatu Allahi AAala alkafireena"},{"SurahNumber":2,"VerseNumber":90,"Text":"Bisama ishtaraw bihi anfusahum an yakfuroo bima anzala Allahu baghyan an yunazzila Allahu min fadlihi AAala man yashao min AAibadihi fabaoo bighadabin AAala ghadabin walilkafireena AAathabun muheenun"},{"SurahNumber":2,"VerseNumber":91,"Text":"Waitha qeela lahum aminoo bima anzala Allahu qaloo numinu bima onzila AAalayna wayakfuroona bima waraahu wahuwa alhaqqu musaddiqan lima maAAahum qul falima taqtuloona anbiyaa Allahi min qablu in kuntum mumineena"},{"SurahNumber":2,"VerseNumber":92,"Text":"Walaqad jaakum moosa bialbayyinati thumma ittakhathtumu alAAijla min baAAdihi waantum thalimoona"},{"SurahNumber":2,"VerseNumber":93,"Text":"Waith akhathna meethaqakum warafaAAna fawqakumu alttoora khuthoo ma ataynakum biquwwatin waismaAAoo qaloo samiAAna waAAasayna waoshriboo fee quloobihimu alAAijla bikufrihim qul bisama yamurukum bihi eemanukum in kuntum mumineena"},{"SurahNumber":2,"VerseNumber":94,"Text":"Qul in kanat lakumu alddaru alakhiratu AAinda Allahi khalisatan min dooni alnnasi fatamannawoo almawta in kuntum sadiqeena"},{"SurahNumber":2,"VerseNumber":95,"Text":"Walan yatamannawhu abadan bima qaddamat aydeehim waAllahu AAaleemun bialththalimeena"},{"SurahNumber":2,"VerseNumber":96,"Text":"Walatajidannahum ahrasa alnnasi AAala hayatin wamina allatheena ashrakoo yawaddu ahaduhum law yuAAammaru alfa sanatin wama huwa bimuzahzihihi mina alAAathabi an yuAAammara waAllahu baseerun bima yaAAmaloona"},{"SurahNumber":2,"VerseNumber":97,"Text":"Qul man kana AAaduwwan lijibreela fainnahu nazzalahu AAala qalbika biithni Allahi musaddiqan lima bayna yadayhi wahudan wabushra lilmumineena"},{"SurahNumber":2,"VerseNumber":98,"Text":"Man kana AAaduwwan lillahi wamalaikatihi warusulihi wajibreela wameekala fainna Allaha AAaduwwun lilkafireena"},{"SurahNumber":2,"VerseNumber":99,"Text":"Walaqad anzalna ilayka ayatin bayyinatin wama yakfuru biha illa alfasiqoona"},{"SurahNumber":2,"VerseNumber":100,"Text":"Awakullama AAahadoo AAahdan nabathahu fareequn minhum bal aktharuhum la yuminoona"},{"SurahNumber":2,"VerseNumber":101,"Text":"Walamma jaahum rasoolun min AAindi Allahi musaddiqun lima maAAahum nabatha fareequn mina allatheena ootoo alkitaba kitaba Allahi waraa thuhoorihim kaannahum la yaAAlamoona"},{"SurahNumber":2,"VerseNumber":102,"Text":"WaittabaAAoo ma tatloo alshshayateenu AAala mulki sulaymana wama kafara sulaymanu walakinna alshshayateena kafaroo yuAAallimoona alnnasa alssihra wama onzila AAala almalakayni bibabila haroota wamaroota wama yuAAallimani min ahadin hatta yaqoola innama nahnu fitnatun fala takfur fayataAAallamoona minhuma ma yufarriqoona bihi bayna almari wazawjihi wama hum bidarreena bihi min ahadin illa biithni Allahi wayataAAallamoona ma yadurruhum wala yanfaAAuhum walaqad AAalimoo lamani ishtarahu ma lahu fee alakhirati min khalaqin walabisa ma sharaw bihi anfusahum law kanoo yaAAlamoona"},{"SurahNumber":2,"VerseNumber":103,"Text":"Walaw annahum amanoo waittaqaw lamathoobatun min AAindi Allahi khayrun law kanoo yaAAlamoona"},{"SurahNumber":2,"VerseNumber":104,"Text":"Ya ayyuha allatheena amanoo la taqooloo raAAina waqooloo onthurna waismaAAoo walilkafireena AAathabun aleemun"},{"SurahNumber":2,"VerseNumber":105,"Text":"Ma yawaddu allatheena kafaroo min ahli alkitabi wala almushrikeena an yunazzala AAalaykum min khayrin min rabbikum waAllahu yakhtassu birahmatihi man yashao waAllahu thoo alfadli alAAatheemi"},{"SurahNumber":2,"VerseNumber":106,"Text":"Ma nansakh min ayatin aw nunsiha nati bikhayrin minha aw mithliha alam taAAlam anna Allaha AAala kulli shayin qadeerun"},{"SurahNumber":2,"VerseNumber":107,"Text":"Alam taAAlam anna Allaha lahu mulku alssamawati waalardi wama lakum min dooni Allahi min waliyyin wala naseerin"},{"SurahNumber":2,"VerseNumber":108,"Text":"Am tureedoona an tasaloo rasoolakum kama suila moosa min qablu waman yatabaddali alkufra bialeemani faqad dalla sawaa alssabeeli"},{"SurahNumber":2,"VerseNumber":109,"Text":"Wadda katheerun min ahli alkitabi law yaruddoonakum min baAAdi eemanikum kuffaran hasadan min AAindi anfusihim min baAAdi ma tabayyana lahumu alhaqqu faoAAfoo waisfahoo hatta yatiya Allahu biamrihi inna Allaha AAala kulli shayin qadeerun"},{"SurahNumber":2,"VerseNumber":110,"Text":"Waaqeemoo alssalata waatoo alzzakata wama tuqaddimoo lianfusikum min khayrin tajidoohu AAinda Allahi inna Allaha bima taAAmaloona baseerun"},{"SurahNumber":2,"VerseNumber":111,"Text":"Waqaloo lan yadkhula aljannata illa man kana hoodan aw nasara tilka amaniyyuhum qul hatoo burhanakum in kuntum sadiqeena"},{"SurahNumber":2,"VerseNumber":112,"Text":"Bala man aslama wajhahu lillahi wahuwa muhsinun falahu ajruhu AAinda rabbihi wala khawfun AAalayhim wala hum yahzanoona"},{"SurahNumber":2,"VerseNumber":113,"Text":"Waqalati alyahoodu laysati alnnasara AAala shayin waqalati alnnasara laysati alyahoodu AAala shayin wahum yatloona alkitaba kathalika qala allatheena la yaAAlamoona mithla qawlihim faAllahu yahkumu baynahum yawma alqiyamati feema kanoo feehi yakhtalifoona"},{"SurahNumber":2,"VerseNumber":114,"Text":"Waman athlamu mimman manaAAa masajida Allahi an yuthkara feeha ismuhu wasaAAa fee kharabiha olaika ma kana lahum an yadkhulooha illa khaifeena lahum fee alddunya khizyun walahum fee alakhirati AAathabun AAatheemun"},{"SurahNumber":2,"VerseNumber":115,"Text":"Walillahi almashriqu waalmaghribu faaynama tuwalloo fathamma wajhu Allahi inna Allaha wasiAAun AAaleemun"},{"SurahNumber":2,"VerseNumber":116,"Text":"Waqaloo itakhatha Allahu waladan subhanahu bal lahu ma fee alssamawati waalardi kullun lahu qanitoona"},{"SurahNumber":2,"VerseNumber":117,"Text":"BadeeAAu alssamawati waalardi waitha qada amran fainnama yaqoolu lahu kun fayakoonu"},{"SurahNumber":2,"VerseNumber":118,"Text":"Waqala allatheena la yaAAlamoona lawla yukallimuna Allahu aw tateena ayatun kathalika qala allatheena min qablihim mithla qawlihim tashabahat quloobuhum qad bayyanna alayati liqawmin yooqinoona"},{"SurahNumber":2,"VerseNumber":119,"Text":"Inna arsalnaka bialhaqqi basheeran wanatheeran wala tusalu Aaan ashabi aljaheemi"},{"SurahNumber":2,"VerseNumber":120,"Text":"Walan tarda AAanka alyahoodu wala alnnasara hatta tattabiAAa millatahum qul inna huda Allahi huwa alhuda walaini ittabaAAta ahwaahum baAAda allathee jaaka mina alAAilmi ma laka mina Allahi min waliyyin wala naseerin"},{"SurahNumber":2,"VerseNumber":121,"Text":"Allatheena ataynahumu alkitaba yatloonahu haqqa tilawatihi olaika yuminoona bihi waman yakfur bihi faolaika humu alkhasiroona"},{"SurahNumber":2,"VerseNumber":122,"Text":"Ya banee israeela othkuroo niAAmatiya allatee anAAamtu AAalaykum waannee faddaltukum AAala alAAalameena"},{"SurahNumber":2,"VerseNumber":123,"Text":"Waittaqoo yawman la tajzee nafsun AAan nafsin shayan wala yuqbalu minha AAadlun wala tanfaAAuha shafaAAatun wala hum yunsaroona"},{"SurahNumber":2,"VerseNumber":124,"Text":"Waithi ibtala ibraheema rabbuhu bikalimatin faatammahunna qala innee jaAAiluka lilnnasi imaman qala wamin thurriyyatee qala la yanalu AAahdee alththalimeena"},{"SurahNumber":2,"VerseNumber":125,"Text":"Waith jaAAalna albayta mathabatan lilnnasi waamnan waittakhithoo min maqami ibraheema musallan waAAahidna ila ibraheema waismaAAeela an tahhira baytiya lilttaifeena waalAAakifeena waalrrukkaAAi alssujoodi"},{"SurahNumber":2,"VerseNumber":126,"Text":"Waith qala ibraheemu rabbi ijAAal hatha baladan aminan waorzuq ahlahu mina alththamarati man amana minhum biAllahi waalyawmi alakhiri qala waman kafara faomattiAAuhu qaleelan thumma adtarruhu ila AAathabi alnnari wabisa almaseeru"},{"SurahNumber":2,"VerseNumber":127,"Text":"Waith yarfaAAu ibraheemu alqawaAAida mina albayti waismaAAeelu rabbana taqabbal minna innaka anta alssameeAAu alAAaleemu"},{"SurahNumber":2,"VerseNumber":128,"Text":"Rabbana waijAAalna muslimayni laka wamin thurriyyatina ommatan muslimatan laka waarina manasikana watub AAalayna innaka anta alttawwabu alrraheemu"},{"SurahNumber":2,"VerseNumber":129,"Text":"Rabbana waibAAath feehim rasoolan minhum yatloo AAalayhim ayatika wayuAAallimuhumu alkitaba waalhikmata wayuzakkeehim innaka anta alAAazeezu alhakeemu"},{"SurahNumber":2,"VerseNumber":130,"Text":"Waman yarghabu AAan millati ibraheema illa man safiha nafsahu walaqadi istafaynahu fee alddunya wainnahu fee alakhirati lamina alssaliheena"},{"SurahNumber":2,"VerseNumber":131,"Text":"Ith qala lahu rabbuhu aslim qala aslamtu lirabbi alAAalameena"},{"SurahNumber":2,"VerseNumber":132,"Text":"Wawassa biha ibraheemu baneehi wayaAAqoobu ya baniyya inna Allaha istafa lakumu alddeena fala tamootunna illa waantum muslimoona"},{"SurahNumber":2,"VerseNumber":133,"Text":"Am kuntum shuhadaa ith hadara yaAAqooba almawtu ith qala libaneehi ma taAAbudoona min baAAdee qaloo naAAbudu ilahaka wailaha abaika ibraheema waismaAAeela waishaqa ilahan wahidan wanahnu lahu muslimoona"},{"SurahNumber":2,"VerseNumber":134,"Text":"Tilka ommatun qad khalat laha ma kasabat walakum ma kasabtum wala tusaloona AAamma kano yaAAmaloona"},{"SurahNumber":2,"VerseNumber":135,"Text":"Waqaloo koonoo hoodan aw nasara tahtadoo qul bal millata ibraheema haneefan wama kana mina almushrikeena"},{"SurahNumber":2,"VerseNumber":136,"Text":"Qooloo amanna biAllahi wama onzila ilayna wama onzila ila ibraheema waismaAAeela waishaqa wayaAAqooba waalasbati wama ootiya moosa waAAeesa wama ootiya alnnabiyyoona min rabbihim la nufarriqu bayna ahadin minhum wanahnu lahu muslimoona"},{"SurahNumber":2,"VerseNumber":137,"Text":"Fain amanoo bimithli ma amantum bihi faqadi ihtadaw wain tawallaw fainnama hum fee shiqaqin fasayakfeekahumu Allahu wahuwa alssameeAAu alAAaleemu"},{"SurahNumber":2,"VerseNumber":138,"Text":"Sibghata Allahi waman ahsanu mina Allahi sibghatan wanahnu lahu AAabidoona"},{"SurahNumber":2,"VerseNumber":139,"Text":"Qul atuhajjoonana fee Allahi wahuwa rabbuna warabbukum walana aAAmaluna walakum aAAmalukum wanahnu lahu mukhlisoona"},{"SurahNumber":2,"VerseNumber":140,"Text":"Am taqooloona inna ibraheema waismaAAeela waishaqa wayaAAqooba waalasbata kanoo hoodan aw nasara qul aantum aAAlamu ami Allahu waman athlamu mimman katama shahadatan AAindahu mina Allahi wama Allahu bighafilin AAamma taAAmaloona"},{"SurahNumber":2,"VerseNumber":141,"Text":"Tilka ommatun qad khalat laha ma kasabat walakum ma kasabtum wala tusaloona AAamma kanoo yaAAmaloona"},{"SurahNumber":2,"VerseNumber":142,"Text":"Sayaqoolu alssufahao mina alnnasi ma wallahum AAan qiblatihimu allatee kanoo AAalayha qul lillahi almashriqu waalmaghribu yahdee man yashao ila siratin mustaqeemin"},{"SurahNumber":2,"VerseNumber":143,"Text":"Wakathalika jaAAalnakum ommatan wasatan litakoonoo shuhadaa AAala alnnasi wayakoona alrrasoolu AAalaykum shaheedan wama jaAAalna alqiblata allatee kunta AAalayha illa linaAAlama man yattabiAAu alrrasoola mimman yanqalibu AAala AAaqibayhi wain kanat lakabeeratan illa AAala allatheena hada Allahu wama kana Allahu liyudeeAAa eemanakum inna Allaha bialnnasi laraoofun raheemun"},{"SurahNumber":2,"VerseNumber":144,"Text":"Qad nara taqalluba wajhika fee alssamai falanuwalliyannaka qiblatan tardaha fawalli wajhaka shatra almasjidi alharami wahaythu ma kuntum fawalloo wujoohakum shatrahu wainna allatheena ootoo alkitaba layaAAlamoona annahu alhaqqu min rabbihim wama Allahu bighafilin AAamma yaAAmaloona"},{"SurahNumber":2,"VerseNumber":145,"Text":"Walain atayta allatheena ootoo alkitaba bikulli ayatin ma tabiAAoo qiblataka wama anta bitabiAAin qiblatahum wama baAAduhum bitabiAAin qiblata baAAdin walaini ittabaAAta ahwaahum min baAAdi ma jaaka mina alAAilmi innaka ithan lamina alththalimeena"},{"SurahNumber":2,"VerseNumber":146,"Text":"Allatheena ataynahumu alkitaba yaAArifoonahu kama yaAArifoona abnaahum wainna fareeqan minhum layaktumoona alhaqqa wahum yaAAlamoona"},{"SurahNumber":2,"VerseNumber":147,"Text":"Alhaqqu min rabbika fala takoonanna mina almumtareena"},{"SurahNumber":2,"VerseNumber":148,"Text":"Walikullin wijhatun huwa muwalleeha faistabiqoo alkhayrati ayna ma takoonoo yati bikumu Allahu jameeAAan inna Allaha AAala kulli shayin qadeerun"},{"SurahNumber":2,"VerseNumber":149,"Text":"Wamin haythu kharajta fawalli wajhaka shatra almasjidi alharami wainnahu lalhaqqu min rabbika wama Allahu bighafilin AAamma taAAmaloona"},{"SurahNumber":2,"VerseNumber":150,"Text":"Wamin haythu kharajta fawalli wajhaka shatra almasjidi alharami wahaythu ma kuntum fawalloo wujoohakum shatrahu lialla yakoona lilnnasi AAalaykum hujjatun illa allatheena thalamoo minhum fala takhshawhum waikhshawnee waliotimma niAAmatee AAalaykum walaAAallakum tahtadoona"},{"SurahNumber":2,"VerseNumber":151,"Text":"Kama arsalna feekum rasoolan minkum yatloo AAalaykum ayatina wayuzakkeekum wayuAAallimukumu alkitaba waalhikmata wayuAAallimukum ma lam takoonoo taAAlamoona"},{"SurahNumber":2,"VerseNumber":152,"Text":"Faothkuroonee athkurkum waoshkuroo lee wala takfurooni"},{"SurahNumber":2,"VerseNumber":153,"Text":"Ya ayyuha allatheena amanoo istaAAeenoo bialssabri waalssalati inna Allaha maAAa alssabireena"},{"SurahNumber":2,"VerseNumber":154,"Text":"Wala taqooloo liman yuqtalu fee sabeeli Allahi amwatun bal ahyaon walakin la tashAAuroona"},{"SurahNumber":2,"VerseNumber":155,"Text":"Walanabluwannakum bishayin mina alkhawfi waaljooAAi wanaqsin mina alamwali waalanfusi waalththamarati wabashshiri alssabireena"},{"SurahNumber":2,"VerseNumber":156,"Text":"Allatheena itha asabathum museebatun qaloo inna lillahi wainna ilayhi rajiAAoona"},{"SurahNumber":2,"VerseNumber":157,"Text":"Olaika AAalayhim salawatun min rabbihim warahmatun waolaika humu almuhtadoona"},{"SurahNumber":2,"VerseNumber":158,"Text":"Inna alssafa waalmarwata min shaAAairi Allahi faman hajja albayta awi iAAtamara fala junaha AAalayhi an yattawwafa bihima waman tatawwaAAa khayran fainna Allaha shakirun AAaleemun"},{"SurahNumber":2,"VerseNumber":159,"Text":"Inna allatheena yaktumoona ma anzalna mina albayyinati waalhuda min baAAdi ma bayyannahu lilnnasi fee alkitabi olaika yalAAanuhumu Allahu wayalAAanuhumu allaAAinoona"},{"SurahNumber":2,"VerseNumber":160,"Text":"Illa allatheena taboo waaslahoo wabayyanoo faolaika atoobu AAalayhim waana alttawwabu alrraheemu"},{"SurahNumber":2,"VerseNumber":161,"Text":"Inna allatheena kafaroo wamatoo wahum kuffarun olaika AAalayhim laAAnatu Allahi waalmalaikati waalnnasi ajmaAAeena"},{"SurahNumber":2,"VerseNumber":162,"Text":"Khalideena feeha la yukhaffafu AAanhumu alAAathabu wala hum yuntharoona"},{"SurahNumber":2,"VerseNumber":163,"Text":"Wailahukum ilahun wahidun la ilaha illa huwa alrrahmanu alrraheemu"},{"SurahNumber":2,"VerseNumber":164,"Text":"Inna fee khalqi alssamawati waalardi waikhtilafi allayli waalnnahari waalfulki allatee tajree fee albahri bima yanfaAAu alnnasa wama anzala Allahu mina alssamai min main faahya bihi alarda baAAda mawtiha wabaththa feeha min kulli dabbatin watasreefi alrriyahi waalssahabi almusakhkhari bayna alssamai waalardi laayatin liqawmin yaAAqiloona"},{"SurahNumber":2,"VerseNumber":165,"Text":"Wamina alnnasi man yattakhithu min dooni Allahi andadan yuhibboonahum kahubbi Allahi waallatheena amanoo ashaddu hubban lillahi walaw yara allatheena thalamoo ith yarawna alAAathaba anna alquwwata lillahi jameeAAan waanna Allaha shadeedu alAAathabi"},{"SurahNumber":2,"VerseNumber":166,"Text":"Ith tabarraa allatheena ittubiAAoo mina allatheena ittabaAAoo waraawoo alAAathaba wataqattaAAat bihimu alasbabu"},{"SurahNumber":2,"VerseNumber":167,"Text":"Waqala allatheena ittabaAAoo law anna lana karratan fanatabarraa minhum kama tabarraoo minna kathalika yureehimu Allahu aAAmalahum hasaratin AAalayhim wama hum bikharijeena mina alnnari"},{"SurahNumber":2,"VerseNumber":168,"Text":"Ya ayyuha alnnasu kuloo mimma fee alardi halalan tayyiban wala tattabiAAoo khutuwati alshshaytani innahu lakum AAaduwwun mubeenun"},{"SurahNumber":2,"VerseNumber":169,"Text":"Innama yamurukum bialssooi waalfahshai waan taqooloo AAala Allahi ma la taAAlamoona"},{"SurahNumber":2,"VerseNumber":170,"Text":"Waitha qeela lahumu ittabiAAoo ma anzala Allahu qaloo bal nattabiAAu ma alfayna AAalayhi abaana awalaw kana abaohum la yaAAqiloona shayan wala yahtadoona"},{"SurahNumber":2,"VerseNumber":171,"Text":"Wamathalu allatheena kafaroo kamathali allathee yanAAiqu bima la yasmaAAu illa duAAaan wanidaan summun bukmun AAumyun fahum la yaAAqiloona"},{"SurahNumber":2,"VerseNumber":172,"Text":"Ya ayyuha allatheena amanoo kuloo min tayyibati ma razaqnakum waoshkuroo lillahi in kuntum iyyahu taAAbudoona"},{"SurahNumber":2,"VerseNumber":173,"Text":"Innama harrama AAalaykumu almaytata waalddama walahma alkhinzeeri wama ohilla bihi lighayri Allahi famani idturra ghayra baghin wala AAadin fala ithma AAalayhi inna Allaha ghafoorun raheemun"},{"SurahNumber":2,"VerseNumber":174,"Text":"Inna allatheena yaktumoona ma anzala Allahu mina alkitabi wayashtaroona bihi thamanan qaleelan olaika ma yakuloona fee butoonihim illa alnnara wala yukallimuhumu Allahu yawma alqiyamati wala yuzakkeehim walahum AAathabun aleemun"},{"SurahNumber":2,"VerseNumber":175,"Text":"Olaika allatheena ishtarawoo alddalalata bialhuda waalAAathaba bialmaghfirati fama asbarahum AAala alnnari"},{"SurahNumber":2,"VerseNumber":176,"Text":"Thalika bianna Allaha nazzala alkitaba bialhaqqi wainna allatheena ikhtalafoo fee alkitabi lafee shiqaqin baAAeedin"},{"SurahNumber":2,"VerseNumber":177,"Text":"Laysa albirra an tuwalloo wujoohakum qibala almashriqi waalmaghribi walakinna albirra man amana biAllahi waalyawmi alakhiri waalmalaikati waalkitabi waalnnabiyyeena waata almala AAala hubbihi thawee alqurba waalyatama waalmasakeena waibna alssabeeli waalssaileena wafee alrriqabi waaqama alssalata waata alzzakata waalmoofoona biAAahdihim itha AAahadoo waalssabireena fee albasai waalddarrai waheena albasi olaika allatheena sadaqoo waolaika humu almuttaqoona"},{"SurahNumber":2,"VerseNumber":178,"Text":"Ya ayyuha allatheena amanoo kutiba AAalaykumu alqisasu fee alqatla alhurru bialhurri waalAAabdu bialAAabdi waalontha bialontha faman AAufiya lahu min akheehi shayon faittibaAAun bialmaAAroofi waadaon ilayhi biihsanin thalika takhfeefun min rabbikum warahmatun famani iAAtada baAAda thalika falahu AAathabun aleemun"},{"SurahNumber":2,"VerseNumber":179,"Text":"Walakum fee alqisasi hayatun ya olee alalbabi laAAallakum tattaqoona"},{"SurahNumber":2,"VerseNumber":180,"Text":"Kutiba AAalaykum itha hadara ahadakumu almawtu in taraka khayran alwasiyyatu lilwalidayni waalaqrabeena bialmaAAroofi haqqan AAala almuttaqeena"},{"SurahNumber":2,"VerseNumber":181,"Text":"Faman baddalahu baAAdama samiAAahu fainnama ithmuhu AAala allatheena yubaddiloonahu inna Allaha sameeAAun AAaleemun"},{"SurahNumber":2,"VerseNumber":182,"Text":"Faman khafa min moosin janafan aw ithman faaslaha baynahum fala ithma AAalayhi inna Allaha ghafoorun raheemun"},{"SurahNumber":2,"VerseNumber":183,"Text":"Ya ayyuha allatheena amanoo kutiba AAalaykumu alssiyamu kama kutiba AAala allatheena min qablikum laAAallakum tattaqoona"},{"SurahNumber":2,"VerseNumber":184,"Text":"Ayyaman maAAdoodatin faman kana minkum mareedan aw AAala safarin faAAiddatun min ayyamin okhara waAAala allatheena yuteeqoonahu fidyatun taAAamu miskeenin faman tatawwaAAa khayran fahuwa khayrun lahu waan tasoomoo khayrun lakum in kuntum taAAlamoona"},{"SurahNumber":2,"VerseNumber":185,"Text":"Shahru ramadana allathee onzila feehi alquranu hudan lilnnasi wabayyinatin mina alhuda waalfurqani faman shahida minkumu alshshahra falyasumhu waman kana mareedan aw AAala safarin faAAiddatun min ayyamin okhara yureedu Allahu bikumu alyusra wala yureedu bikumu alAAusra walitukmiloo alAAiddata walitukabbiroo Allaha AAala ma hadakum walaAAallakum tashkuroona"},{"SurahNumber":2,"VerseNumber":186,"Text":"Waitha saalaka AAibadee AAannee fainnee qareebun ojeebu daAAwata alddaAAi itha daAAani falyastajeeboo lee walyuminoo bee laAAallahum yarshudoona"},{"SurahNumber":2,"VerseNumber":187,"Text":"Ohilla lakum laylata alssiyami alrrafathu ila nisaikum hunna libasun lakum waantum libasun lahunna AAalima Allahu annakum kuntum takhtanoona anfusakum fataba AAalaykum waAAafa AAankum faalana bashiroohunna waibtaghoo ma kataba Allahu lakum wakuloo waishraboo hatta yatabayyana lakumu alkhaytu alabyadu mina alkhayti alaswadi mina alfajri thumma atimmoo alssiyama ila allayli wala tubashiroohunna waantum AAakifoona fee almasajidi tilka hudoodu Allahi fala taqrabooha kathalika yubayyinu Allahu ayatihi lilnnasi laAAallahum yattaqoona"},{"SurahNumber":2,"VerseNumber":188,"Text":"Wala takuloo amwalakum baynakum bialbatili watudloo biha ila alhukkami litakuloo fareeqan min amwali alnnasi bialithmi waantum taAAlamoona"},{"SurahNumber":2,"VerseNumber":189,"Text":"Yasaloonaka AAani alahillati qul hiya mawaqeetu lilnnasi waalhajji walaysa albirru bian tatoo albuyoota min thuhooriha walakinna albirra mani ittaqa watoo albuyoota min abwabiha waittaqoo Allaha laAAallakum tuflihoona"},{"SurahNumber":2,"VerseNumber":190,"Text":"Waqatiloo fee sabeeli Allahi allatheena yuqatiloonakum wala taAAtadoo inna Allaha la yuhibbu almuAAtadeena"},{"SurahNumber":2,"VerseNumber":191,"Text":"Waoqtuloohum haythu thaqiftumoohum waakhrijoohum min haythu akhrajookum waalfitnatu ashaddu mina alqatli wala tuqatiloohum AAinda almasjidi alharami hatta yuqatilookum feehi fain qatalookum faoqtuloohum kathalika jazao alkafireena"},{"SurahNumber":2,"VerseNumber":192,"Text":"Faini intahaw fainna Allaha ghafoorun raheemun"},{"SurahNumber":2,"VerseNumber":193,"Text":"Waqatiloohum hatta la takoona fitnatun wayakoona alddeenu lillahi faini intahaw fala AAudwana illa AAala alththalimeena"},{"SurahNumber":2,"VerseNumber":194,"Text":"Alshshahru alharamu bialshshahri alharami waalhurumatu qisasun famani iAAtada AAalaykum faiAAtadoo AAalayhi bimithli ma iAAtada AAalaykum waittaqoo Allaha waiAAlamoo anna Allaha maAAa almuttaqeena"},{"SurahNumber":2,"VerseNumber":195,"Text":"Waanfiqoo fee sabeeli Allahi wala tulqoo biaydeekum ila alttahlukati waahsinoo inna Allaha yuhibbu almuhsineena"},{"SurahNumber":2,"VerseNumber":196,"Text":"Waatimmoo alhajja waalAAumrata lillahi fain ohsirtum fama istaysara mina alhadyi wala tahliqoo ruoosakum hatta yablugha alhadyu mahillahu faman kana minkum mareedan aw bihi athan min rasihi fafidyatun min siyamin aw sadaqatin aw nusukin faitha amintum faman tamattaAAa bialAAumrati ila alhajji fama istaysara mina alhadyi faman lam yajid fasiyamu thalathati ayyamin fee alhajji wasabAAatin itha rajaAAtum tilka AAasharatun kamilatun thalika liman lam yakun ahluhu hadiree almasjidi alharami waittaqoo Allaha waiAAlamoo anna Allaha shadeedu alAAiqabi"},{"SurahNumber":2,"VerseNumber":197,"Text":"Alhajju ashhurun maAAloomatun faman farada feehinna alhajja fala rafatha wala fusooqa wala jidala fee alhajji wama tafAAaloo min khayrin yaAAlamhu Allahu watazawwadoo fainna khayra alzzadi alttaqwa waittaqooni ya olee alalbabi"},{"SurahNumber":2,"VerseNumber":198,"Text":"Laysa AAalaykum junahun an tabtaghoo fadlan min rabbikum faitha afadtum min AAarafatin faothkuroo Allaha AAinda almashAAari alharami waothkuroohu kama hadakum wain kuntum min qablihi lamina alddalleena"},{"SurahNumber":2,"VerseNumber":199,"Text":"Thumma afeedoo min haythu afada alnnasu waistaghfiroo Allaha inna Allaha ghafoorun raheemun"},{"SurahNumber":2,"VerseNumber":200,"Text":"Faitha qadaytum manasikakum faothkuroo Allaha kathikrikum abaakum aw ashadda thikran famina alnnasi man yaqoolu rabbana atina fee alddunya wama lahu fee alakhirati min khalaqin"},{"SurahNumber":2,"VerseNumber":201,"Text":"Waminhum man yaqoolu rabbana atina fee alddunya hasanatan wafee alakhirati hasanatan waqina AAathaba alnnari"},{"SurahNumber":2,"VerseNumber":202,"Text":"Olaika lahum naseebun mimma kasaboo waAllahu sareeAAu alhisabi"},{"SurahNumber":2,"VerseNumber":203,"Text":"Waothkuroo Allaha fee ayyamin maAAdoodatin faman taAAajjala fee yawmayni fala ithma AAalayhi waman taakhkhara fala ithma AAalayhi limani ittaqa waittaqoo Allaha waiAAlamoo annakum ilayhi tuhsharoona"},{"SurahNumber":2,"VerseNumber":204,"Text":"Wamina alnnasi man yuAAjibuka qawluhu fee alhayati alddunya wayushhidu Allaha AAala ma fee qalbihi wahuwa aladdu alkhisami"},{"SurahNumber":2,"VerseNumber":205,"Text":"Waitha tawalla saAAa fee alardi liyufsida feeha wayuhlika alhartha waalnnasla waAllahu la yuhibbu alfasada"},{"SurahNumber":2,"VerseNumber":206,"Text":"Waitha qeela lahu ittaqi Allaha akhathathu alAAizzatu bialithmi fahasbuhu jahannamu walabisa almihadu"},{"SurahNumber":2,"VerseNumber":207,"Text":"Wamina alnnasi man yashree nafsahu ibtighaa mardati Allahi waAllahu raoofun bialAAibadi"},{"SurahNumber":2,"VerseNumber":208,"Text":"Ya ayyuha allatheena amanoo odkhuloo fee alssilmi kaffatan wala tattabiAAoo khutuwati alshshaytani innahu lakum AAaduwwun mubeenun"},{"SurahNumber":2,"VerseNumber":209,"Text":"Fain zalaltum min baAAdi ma jaatkumu albayyinatu faiAAlamoo anna Allaha AAazeezun hakeemun"},{"SurahNumber":2,"VerseNumber":210,"Text":"Hal yanthuroona illa an yatiyahumu Allahu fee thulalin mina alghamami waalmalaikatu waqudiya alamru waila Allahi turjaAAu alomooru"},{"SurahNumber":2,"VerseNumber":211,"Text":"Sal banee israeela kam ataynahum min ayatin bayyinatin waman yubaddil niAAmata Allahi min baAAdi ma jaathu fainna Allaha shadeedu alAAiqabi"},{"SurahNumber":2,"VerseNumber":212,"Text":"Zuyyina lillatheena kafaroo alhayatu alddunya wayaskharoona mina allatheena amanoo waallatheena ittaqaw fawqahum yawma alqiyamati waAllahu yarzuqu man yashao bighayri hisabin"},{"SurahNumber":2,"VerseNumber":213,"Text":"Kana alnnasu ommatan wahidatan fabaAAatha Allahu alnnabiyyeena mubashshireena wamunthireena waanzala maAAahumu alkitaba bialhaqqi liyahkuma bayna alnnasi feema ikhtalafoo feehi wama ikhtalafa feehi illa allatheena ootoohu min baAAdi ma jaathumu albayyinatu baghyan baynahum fahada Allahu allatheena amanoo lima ikhtalafoo feehi mina alhaqqi biithnihi waAllahu yahdee man yashao ila siratin mustaqeemin"},{"SurahNumber":2,"VerseNumber":214,"Text":"Am hasibtum an tadkhuloo aljannata walamma yatikum mathalu allatheena khalaw min qablikum massathumu albasao waalddarrao wazulziloo hatta yaqoola alrrasoolu waallatheena amanoo maAAahu mata nasru Allahi ala inna nasra Allahi qareebun"},{"SurahNumber":2,"VerseNumber":215,"Text":"Yasaloonaka matha yunfiqoona qul ma anfaqtum min khayrin falilwalidayni waalaqrabeena waalyatama waalmasakeeni waibni alssabeeli wama tafAAaloo min khayrin fainna Allaha bihi AAaleemun"},{"SurahNumber":2,"VerseNumber":216,"Text":"Kutiba AAalaykumu alqitalu wahuwa kurhun lakum waAAasa an takrahoo shayan wahuwa khayrun lakum waAAasa an tuhibboo shayan wahuwa sharrun lakum waAllahu yaAAlamu waantum la taAAlamoona"},{"SurahNumber":2,"VerseNumber":217,"Text":"Yasaloonaka AAani alshshahri alharami qitalin feehi qul qitalun feehi kabeerun wasaddun AAan sabeeli Allahi wakufrun bihi waalmasjidi alharami waikhraju ahlihi minhu akbaru AAinda Allahi waalfitnatu akbaru mina alqatli wala yazaloona yuqatiloonakum hatta yaruddookum AAan deenikum ini istataAAoo waman yartadid minkum AAan deenihi fayamut wahuwa kafirun faolaika habitat aAAmaluhum fee alddunya waalakhirati waolaika ashabu alnnari hum feeha khalidoona"},{"SurahNumber":2,"VerseNumber":218,"Text":"Inna allatheena amanoo waallatheena hajaroo wajahadoo fee sabeeli Allahi olaika yarjoona rahmata Allahi waAllahu ghafoorun raheemun"},{"SurahNumber":2,"VerseNumber":219,"Text":"Yasaloonaka AAani alkhamri waalmaysiri qul feehima ithmun kabeerun wamanafiAAu lilnnasi waithmuhuma akbaru min nafAAihima wayasaloonaka matha yunfiqoona quli alAAafwa kathalika yubayyinu Allahu lakumu alayati laAAallakum tatafakkaroona"},{"SurahNumber":2,"VerseNumber":220,"Text":"Fee alddunya waalakhirati wayasaloonaka AAani alyatama qul islahun lahum khayrun wain tukhalitoohum faikhwanukum waAllahu yaAAlamu almufsida mina almuslihi walaw shaa Allahu laaAAnatakum inna Allaha AAazeezun hakeemun"},{"SurahNumber":2,"VerseNumber":221,"Text":"Wala tankihoo almushrikati hatta yuminna walaamatun muminatun khayrun min mushrikatin walaw aAAjabatkum wala tunkihoo almushrikeena hatta yuminoo walaAAabdun muminun khayrun min mushrikin walaw aAAjabakum olaika yadAAoona ila alnnari waAllahu yadAAoo ila aljannati waalmaghfirati biithnihi wayubayyinu ayatihi lilnnasi laAAallahum yatathakkaroona"},{"SurahNumber":2,"VerseNumber":222,"Text":"Wayasaloonaka AAani almaheedi qul huwa athan faiAAtaziloo alnnisaa fee almaheedi wala taqraboohunna hatta yathurna faitha tatahharna fatoohunna min haythu amarakumu Allahu inna Allaha yuhibbu alttawwabeena wayuhibbu almutatahhireena"},{"SurahNumber":2,"VerseNumber":223,"Text":"Nisaokum harthun lakum fatoo harthakum anna shitum waqaddimoo lianfusikum waittaqoo Allaha waiAAlamoo annakum mulaqoohu wabashshiri almumineena"},{"SurahNumber":2,"VerseNumber":224,"Text":"Wala tajAAaloo Allaha AAurdatan liaymanikum an tabarroo watattaqoo watuslihoo bayna alnnasi waAllahu sameeAAun AAaleemun"},{"SurahNumber":2,"VerseNumber":225,"Text":"La yuakhithukumu Allahu biallaghwi fee aymanikum walakin yuakhithukum bima kasabat quloobukum waAllahu ghafoorun haleemun"},{"SurahNumber":2,"VerseNumber":226,"Text":"Lillatheena yuloona min nisaihim tarabbusu arbaAAati ashhurin fain faoo fainna Allaha ghafoorun raheemun"},{"SurahNumber":2,"VerseNumber":227,"Text":"Wain AAazamoo alttalaqa fainna Allaha sameeAAun AAaleemun"},{"SurahNumber":2,"VerseNumber":228,"Text":"Waalmutallaqatu yatarabbasna bianfusihinna thalathata qurooin wala yahillu lahunna an yaktumna ma khalaqa Allahu fee arhamihinna in kunna yuminna biAllahi waalyawmi alakhiri wabuAAoolatuhunna ahaqqu biraddihinna fee thalika in aradoo islahan walahunna mithlu allathee AAalayhinna bialmaAAroofi walilrrijali AAalayhinna darajatun waAllahu AAazeezun hakeemun"},{"SurahNumber":2,"VerseNumber":229,"Text":"Alttalaqu marratani faimsakun bimaAAroofin aw tasreehun biihsanin wala yahillu lakum an takhuthoo mimma ataytumoohunna shayan illa an yakhafa alla yuqeema hudooda Allahi fain khiftum alla yuqeema hudooda Allahi fala junaha AAalayhima feema iftadat bihi tilka hudoodu Allahi fala taAAtadooha waman yataAAadda hudooda Allahi faolaika humu alththalimoona"},{"SurahNumber":2,"VerseNumber":230,"Text":"Fain tallaqaha fala tahillu lahu min baAAdu hatta tankiha zawjan ghayrahu fain tallaqaha fala junaha AAalayhima an yatarajaAAa in thanna an yuqeema hudooda Allahi watilka hudoodu Allahi yubayyinuha liqawmin yaAAlamoona"},{"SurahNumber":2,"VerseNumber":231,"Text":"Waitha tallaqtumu alnnisaa fabalaghna ajalahunna faamsikoohunna bimaAAroofin aw sarrihoohunna bimaAAroofin wala tumsikoohunna diraran litaAAtadoo waman yafAAal thalika faqad thalama nafsahu wala tattakhithoo ayati Allahi huzuwan waothkuroo niAAmata Allahi AAalaykum wama anzala AAalaykum mina alkitabi waalhikmati yaAAithukum bihi waittaqoo Allaha waiAAlamoo anna Allaha bikulli shayin AAaleemun"},{"SurahNumber":2,"VerseNumber":232,"Text":"Waitha tallaqtumu alnnisaa fabalaghna ajalahunna fala taAAduloohunna an yankihna azwajahunna itha taradaw baynahum bialmaAAroofi thalika yooAAathu bihi man kana minkum yuminu biAllahi waalyawmi alakhiri thalikum azka lakum waatharu waAllahu yaAAlamu waantum la taAAlamoona"},{"SurahNumber":2,"VerseNumber":233,"Text":"Waalwalidatu yurdiAAna awladahunna hawlayni kamilayni liman arada an yutimma alrradaAAata waAAala almawloodi lahu rizquhunna wakiswatuhunna bialmaAAroofi la tukallafu nafsun illa wusAAaha la tudarra walidatun biwaladiha wala mawloodun lahu biwaladihi waAAala alwarithi mithlu thalika fain arada fisalan AAan taradin minhuma watashawurin fala junaha AAalayhima wain aradtum an tastardiAAoo awladakum fala junaha AAalaykum itha sallamtum ma ataytum bialmaAAroofi waittaqoo Allaha waiAAlamoo anna Allaha bima taAAmaloona baseerun"},{"SurahNumber":2,"VerseNumber":234,"Text":"Waallatheena yutawaffawna minkum wayatharoona azwajan yatarabbasna bianfusihinna arbaAAata ashhurin waAAashran faitha balaghna ajalahunna fala junaha AAalaykum feema faAAalna fee anfusihinna bialmaAAroofi waAllahu bima taAAmaloona khabeerun"},{"SurahNumber":2,"VerseNumber":235,"Text":"Wala junaha AAalaykum feema AAarradtum bihi min khitbati alnnisai aw aknantum fee anfusikum AAalima Allahu annakum satathkuroonahunna walakin la tuwaAAidoohunna sirran illa an taqooloo qawlan maAAroofan wala taAAzimoo AAuqdata alnnikahi hatta yablugha alkitabu ajalahu waiAAlamoo anna Allaha yaAAlamu ma fee anfusikum faihtharoohu waiAAlamoo anna Allaha ghafoorun haleemun"},{"SurahNumber":2,"VerseNumber":236,"Text":"La junaha AAalaykum in tallaqtumu alnnisaa ma lam tamassoohunna aw tafridoo lahunna fareedatan wamattiAAoohunna AAala almoosiAAi qadaruhu waAAala almuqtiri qadaruhu mataAAan bialmaAAroofi haqqan AAala almuhsineena"},{"SurahNumber":2,"VerseNumber":237,"Text":"Wain tallaqtumoohunna min qabli an tamassoohunna waqad faradtum lahunna fareedatan fanisfu ma faradtum illa an yaAAfoona aw yaAAfuwa allathee biyadihi AAuqdatu alnnikahi waan taAAfoo aqrabu lilttaqwa wala tansawoo alfadla baynakum inna Allaha bima taAAmaloona baseerun"},{"SurahNumber":2,"VerseNumber":238,"Text":"Hafithoo AAala alssalawati waalssalati alwusta waqoomoo lillahi qaniteena"},{"SurahNumber":2,"VerseNumber":239,"Text":"Fain khiftum farijalan aw rukbanan faitha amintum faothkuroo Allaha kama AAallamakum ma lam takoonoo taAAlamoona"},{"SurahNumber":2,"VerseNumber":240,"Text":"Waallatheena yutawaffawna minkum wayatharoona azwajan wasiyyatan liazwajihim mataAAan ila alhawli ghayra ikhrajin fain kharajna fala junaha AAalaykum fee ma faAAalna fee anfusihinna min maAAroofin waAllahu AAazeezun hakeemun"},{"SurahNumber":2,"VerseNumber":241,"Text":"Walilmutallaqati mataAAun bialmaAAroofi haqqan AAala almuttaqeena"},{"SurahNumber":2,"VerseNumber":242,"Text":"Kathalika yubayyinu Allahu lakum ayatihi laAAallakum taAAqiloona"},{"SurahNumber":2,"VerseNumber":243,"Text":"Alam tara ila allatheena kharajoo min diyarihim wahum oloofun hathara almawti faqala lahumu Allahu mootoo thumma ahyahum inna Allaha lathoo fadlin AAala alnnasi walakinna akthara alnnasi la yashkuroona"},{"SurahNumber":2,"VerseNumber":244,"Text":"Waqatiloo fee sabeeli Allahi waiAAlamoo anna Allaha sameeAAun AAaleemun"},{"SurahNumber":2,"VerseNumber":245,"Text":"Man tha allathee yuqridu Allaha qardan hasanan fayudaAAifahu lahu adAAafan katheeratan waAllahu yaqbidu wayabsutu wailayhi turjaAAoona"},{"SurahNumber":2,"VerseNumber":246,"Text":"Alam tara ila almalai min banee israeela min baAAdi moosa ith qaloo linabiyyin lahumu ibAAath lana malikan nuqatil fee sabeeli Allahi qala hal AAasaytum in kutiba AAalaykumu alqitalu alla tuqatiloo qaloo wama lana alla nuqatila fee sabeeli Allahi waqad okhrijna min diyarina waabnaina falamma kutiba AAalayhimu alqitalu tawallaw illa qaleelan minhum waAllahu AAaleemun bialththalimeena"},{"SurahNumber":2,"VerseNumber":247,"Text":"Waqala lahum nabiyyuhum inna Allaha qad baAAatha lakum taloota malikan qaloo anna yakoonu lahu almulku AAalayna wanahnu ahaqqu bialmulki minhu walam yuta saAAatan mina almali qala inna Allaha istafahu AAalaykum wazadahu bastatan fee alAAilmi waaljismi waAllahu yutee mulkahu man yashao waAllahu wasiAAun AAaleemun"},{"SurahNumber":2,"VerseNumber":248,"Text":"Waqala lahum nabiyyuhum inna ayata mulkihi an yatiyakumu alttabootu feehi sakeenatun min rabbikum wabaqiyyatun mimma taraka alu moosa waalu haroona tahmiluhu almalaikatu inna fee thalika laayatan lakum in kuntum mumineena"},{"SurahNumber":2,"VerseNumber":249,"Text":"Falamma fasala talootu bialjunoodi qala inna Allaha mubtaleekum binaharin faman shariba minhu falaysa minnee waman lam yatAAamhu fainnahu minnee illa mani ightarafa ghurfatan biyadihi fashariboo minhu illa qaleelan minhum falamma jawazahu huwa waallatheena amanoo maAAahu qaloo la taqata lana alyawma bijaloota wajunoodihi qala allatheena yathunnoona annahum mulaqoo Allahi kam min fiatin qaleelatin ghalabat fiatan katheeratan biithni Allahi waAllahu maAAa alssabireena"},{"SurahNumber":2,"VerseNumber":250,"Text":"Walamma barazoo lijaloota wajunoodihi qaloo rabbana afrigh AAalayna sabran wathabbit aqdamana waonsurna AAala alqawmi alkafireena"},{"SurahNumber":2,"VerseNumber":251,"Text":"Fahazamoohum biithni Allahi waqatala dawoodu jaloota waatahu Allahu almulka waalhikmata waAAallamahu mimma yashao walawla dafAAu Allahi alnnasa baAAdahum bibaAAdin lafasadati alardu walakinna Allaha thoo fadlin AAala alAAalameena"},{"SurahNumber":2,"VerseNumber":252,"Text":"Tilka ayatu Allahi natlooha AAalayka bialhaqqi wainnaka lamina almursaleena"},{"SurahNumber":2,"VerseNumber":253,"Text":"Tilka alrrusulu faddalna baAAdahum AAala baAAdin minhum man kallama Allahu warafaAAa baAAdahum darajatin waatayna AAeesa ibna maryama albayyinati waayyadnahu biroohi alqudusi walaw shaa Allahu ma iqtatala allatheena min baAAdihim min baAAdi ma jaathumu albayyinatu walakini ikhtalafoo faminhum man amana waminhum man kafara walaw shaa Allahu ma iqtataloo walakinna Allaha yafAAalu ma yureedu"},{"SurahNumber":2,"VerseNumber":254,"Text":"Ya ayyuha allatheena amanoo anfiqoo mimma razaqnakum min qabli an yatiya yawmun la bayAAun feehi wala khullatun wala shafaAAatun waalkafiroona humu alththalimoona"},{"SurahNumber":2,"VerseNumber":255,"Text":"Allahu la ilaha illa huwa alhayyu alqayyoomu la takhuthuhu sinatun wala nawmun lahu ma fee alssamawati wama fee alardi man tha allathee yashfaAAu AAindahu illa biithnihi yaAAlamu ma bayna aydeehim wama khalfahum wala yuheetoona bishayin min AAilmihi illa bima shaa wasiAAa kursiyyuhu alssamawati waalarda wala yaooduhu hifthuhuma wahuwa alAAaliyyu alAAatheemu"},{"SurahNumber":2,"VerseNumber":256,"Text":"La ikraha fee alddeeni qad tabayyana alrrushdu mina alghayyi faman yakfur bialttaghooti wayumin biAllahi faqadi istamsaka bialAAurwati alwuthqa la infisama laha waAllahu sameeAAun AAaleemun"},{"SurahNumber":2,"VerseNumber":257,"Text":"Allahu waliyyu allatheena amanoo yukhrijuhum mina alththulumati ila alnnoori waallatheena kafaroo awliyaohumu alttaghootu yukhrijoonahum mina alnnoori ila alththulumati olaika ashabu alnnari hum feeha khalidoona"},{"SurahNumber":2,"VerseNumber":258,"Text":"Alam tara ila allathee hajja ibraheema fee rabbihi an atahu Allahu almulka ith qala ibraheemu rabbiya allathee yuhyee wayumeetu qala ana ohyee waomeetu qala ibraheemu fainna Allaha yatee bialshshamsi mina almashriqi fati biha mina almaghribi fabuhita allathee kafara waAllahu la yahdee alqawma alththalimeena"},{"SurahNumber":2,"VerseNumber":259,"Text":"Aw kaallathee marra AAala qaryatin wahiya khawiyatun AAala AAurooshiha qala anna yuhyee hathihi Allahu baAAda mawtiha faamatahu Allahu miata AAamin thumma baAAathahu qala kam labithta qala labithtu yawman aw baAAda yawmin qala bal labithta miata AAamin faonthur ila taAAamika washarabika lam yatasannah waonthur ila himarika walinajAAalaka ayatan lilnnasi waonthur ila alAAithami kayfa nunshizuha thumma naksooha lahman falamma tabayyana lahu qala aAAlamu anna Allaha AAala kulli shayin qadeerun"},{"SurahNumber":2,"VerseNumber":260,"Text":"Waith qala ibraheemu rabbi arinee kayfa tuhyee almawta qala awalam tumin qala bala walakin liyatmainna qalbee qala fakhuth arbaAAatan mina alttayri fasurhunna ilayka thumma ijAAal AAala kulli jabalin minhunna juzan thumma odAAuhunna yateenaka saAAyan waiAAlam anna Allaha AAazeezun hakeemun"},{"SurahNumber":2,"VerseNumber":261,"Text":"Mathalu allatheena yunfiqoona amwalahum fee sabeeli Allahi kamathali habbatin anbatat sabAAa sanabila fee kulli sunbulatin miatu habbatin waAllahu yudaAAifu liman yashao waAllahu wasiAAun AAaleemun"},{"SurahNumber":2,"VerseNumber":262,"Text":"Allatheena yunfiqoona amwalahum fee sabeeli Allahi thumma la yutbiAAoona ma anfaqoo mannan wala athan lahum ajruhum AAinda rabbihim wala khawfun AAalayhim wala hum yahzanoona"},{"SurahNumber":2,"VerseNumber":263,"Text":"Qawlun maAAroofun wamaghfiratun khayrun min sadaqatin yatbaAAuha athan waAllahu ghaniyyun haleemun"},{"SurahNumber":2,"VerseNumber":264,"Text":"Ya ayyuha allatheena amanoo la tubtiloo sadaqatikum bialmanni waalatha kaallathee yunfiqu malahu riaa alnnasi wala yuminu biAllahi waalyawmi alakhiri famathaluhu kamathali safwanin AAalayhi turabun faasabahu wabilun fatarakahu saldan la yaqdiroona AAala shayin mimma kasaboo waAllahu la yahdee alqawma alkafireena"},{"SurahNumber":2,"VerseNumber":265,"Text":"Wamathalu allatheena yunfiqoona amwalahumu ibtighaa mardati Allahi watathbeetan min anfusihim kamathali jannatin birabwatin asabaha wabilun faatat okulaha diAAfayni fain lam yusibha wabilun fatallun waAllahu bima taAAmaloona baseerun"},{"SurahNumber":2,"VerseNumber":266,"Text":"Ayawaddu ahadukum an takoona lahu jannatun min nakheelin waaAAnabin tajree min tahtiha alanharu lahu feeha min kulli alththamarati waasabahu alkibaru walahu thurriyyatun duAAafao faasabaha iAAsarun feehi narun faihtaraqat kathalika yubayyinu Allahu lakumu alayati laAAallakum tatafakkaroona"},{"SurahNumber":2,"VerseNumber":267,"Text":"Ya ayyuha allatheena amanoo anfiqoo min tayyibati ma kasabtum wamimma akhrajna lakum mina alardi wala tayammamoo alkhabeetha minhu tunfiqoona walastum biakhitheehi illa an tughmidoo feehi waiAAlamoo anna Allaha ghaniyyun hameedun"},{"SurahNumber":2,"VerseNumber":268,"Text":"Alshshaytanu yaAAidukumu alfaqra wayamurukum bialfahshai waAllahu yaAAidukum maghfiratan minhu wafadlan waAllahu wasiAAun AAaleemun"},{"SurahNumber":2,"VerseNumber":269,"Text":"Yutee alhikmata man yashao waman yuta alhikmata faqad ootiya khayran katheeran wama yaththakkaru illa oloo alalbabi"},{"SurahNumber":2,"VerseNumber":270,"Text":"Wama anfaqtum min nafaqatin aw nathartum min nathrin fainna Allaha yaAAlamuhu wama lilththalimeena min ansarin"},{"SurahNumber":2,"VerseNumber":271,"Text":"In tubdoo alssadaqati faniAAimma hiya wain tukhfooha watutooha alfuqaraa fahuwa khayrun lakum wayukaffiru AAankum min sayyiatikum waAllahu bima taAAmaloona khabeerun"},{"SurahNumber":2,"VerseNumber":272,"Text":"Laysa AAalayka hudahum walakinna Allaha yahdee man yashao wama tunfiqoo min khayrin falianfusikum wama tunfiqoona illa ibtighaa wajhi Allahi wama tunfiqoo min khayrin yuwaffa ilaykum waantum la tuthlamoona"},{"SurahNumber":2,"VerseNumber":273,"Text":"Lilfuqarai allatheena ohsiroo fee sabeeli Allahi la yastateeAAoona darban fee alardi yahsabuhumu aljahilu aghniyaa mina alttaAAaffufi taAArifuhum biseemahum la yasaloona alnnasa ilhafan wama tunfiqoo min khayrin fainna Allaha bihi AAaleemun"},{"SurahNumber":2,"VerseNumber":274,"Text":"Allatheena yunfiqoona amwalahum biallayli waalnnahari sirran waAAalaniyatan falahum ajruhum AAinda rabbihim wala khawfun AAalayhim wala hum yahzanoona"},{"SurahNumber":2,"VerseNumber":275,"Text":"Allatheena yakuloona alrriba la yaqoomoona illa kama yaqoomu allathee yatakhabbatuhu alshshaytanu mina almassi thalika biannahum qaloo innama albayAAu mithlu alrriba waahalla Allahu albayAAa waharrama alrriba faman jaahu mawAAithatun min rabbihi faintaha falahu ma salafa waamruhu ila Allahi waman AAada faolaika ashabu alnnari hum feeha khalidoona"},{"SurahNumber":2,"VerseNumber":276,"Text":"Yamhaqu Allahu alrriba wayurbee alssadaqati waAllahu la yuhibbu kulla kaffarin atheemin"},{"SurahNumber":2,"VerseNumber":277,"Text":"Inna allatheena amanoo waAAamiloo alssalihati waaqamoo alssalata waatawoo alzzakata lahum ajruhum AAinda rabbihim wala khawfun AAalayhim wala hum yahzanoona"},{"SurahNumber":2,"VerseNumber":278,"Text":"Ya ayyuha allatheena amanoo ittaqoo Allaha watharoo ma baqiya mina alrriba in kuntum mumineena"},{"SurahNumber":2,"VerseNumber":279,"Text":"Fain lam tafAAaloo fathanoo biharbin mina Allahi warasoolihi wain tubtum falakum ruoosu amwalikum la tathlimoona wala tuthlamoona"},{"SurahNumber":2,"VerseNumber":280,"Text":"Wain kana thoo AAusratin fanathiratun ila maysaratin waan tasaddaqoo khayrun lakum in kuntum taAAlamoona"},{"SurahNumber":2,"VerseNumber":281,"Text":"Waittaqoo yawman turjaAAoona feehi ila Allahi thumma tuwaffa kullu nafsin ma kasabat wahum la yuthlamoona"},{"SurahNumber":2,"VerseNumber":282,"Text":"Ya ayyuha allatheena amanoo itha tadayantum bidaynin ila ajalin musamman faoktuboohu walyaktub baynakum katibun bialAAadli wala yaba katibun an yaktuba kama AAallamahu Allahu falyaktub walyumlili allathee AAalayhi alhaqqu walyattaqi Allaha rabbahu wala yabkhas minhu shayan fain kana allathee AAalayhi alhaqqu safeehan aw daAAeefan aw la yastateeAAu an yumilla huwa falyumlil waliyyuhu bialAAadli waistashhidoo shaheedayni min rijalikum fain lam yakoona rajulayni farajulun waimraatani mimman tardawna mina alshshuhadai an tadilla ihdahuma fatuthakkira ihdahuma alokhra wala yaba alshshuhadao itha ma duAAoo wala tasamoo an taktuboohu sagheeran aw kabeeran ila ajalihi thalikum aqsatu AAinda Allahi waaqwamu lilshshahadati waadna alla tartaboo illa an takoona tijaratan hadiratan tudeeroonaha baynakum falaysa AAalaykum junahun alla taktubooha waashhidoo itha tabayaAAtum wala yudarra katibun wala shaheedun wain tafAAaloo fainnahu fusooqun bikum waittaqoo Allaha wayuAAallimukumu Allahu waAllahu bikulli shayin AAaleemun"},{"SurahNumber":2,"VerseNumber":283,"Text":"Wain kuntum AAala safarin walam tajidoo katiban farihanun maqboodatun fain amina baAAdukum baAAdan falyuaddi allathee itumina amanatahu walyattaqi Allaha rabbahu wala taktumoo alshshahadata waman yaktumha fainnahu athimun qalbuhu waAllahu bima taAAmaloona AAaleemun"},{"SurahNumber":2,"VerseNumber":284,"Text":"Lillahi ma fee alssamawati wama fee alardi wain tubdoo ma fee anfusikum aw tukhfoohu yuhasibkum bihi Allahu fayaghfiru liman yashao wayuAAaththibu man yashao waAllahu AAala kulli shayin qadeerun"},{"SurahNumber":2,"VerseNumber":285,"Text":"Amana alrrasoolu bima onzila ilayhi min rabbihi waalmuminoona kullun amana biAllahi wamalaikatihi wakutubihi warusulihi la nufarriqu bayna ahadin min rusulihi waqaloo samiAAna waataAAna ghufranaka rabbana wailayka almaseeru"},{"SurahNumber":2,"VerseNumber":286,"Text":"La yukallifu Allahu nafsan illa wusAAaha laha ma kasabat waAAalayha ma iktasabat rabbana la tuakhithna in naseena aw akhtana rabbana wala tahmil AAalayna isran kama hamaltahu AAala allatheena min qablina rabbana wala tuhammilna ma la taqata lana bihi waoAAfu AAanna waighfir lana wairhamna anta mawlana faonsurna AAala alqawmi alkafireena"}]},{"LanguageCode":"eng","Language":"English","Name":"eng-mustafakhattabg","Author":"Mustafa Khattab God Edition","Source":"","Direction":"ltr","Translations":[{"SurahNumber":2,"VerseNumber":1,"Text":"Alif-Lãm-Mĩm"},{"SurahNumber":2,"VerseNumber":2,"Text":"This is the Book! There is no doubt about it—a guide for those mindful ˹of God˺"},{"SurahNumber":2,"VerseNumber":3,"Text":"who believe in the unseen, establish prayer, and donate from what We have provided for them"},{"SurahNumber":2,"VerseNumber":4,"Text":"and who believe in what has been revealed to you ˹O Prophet˺ and what was revealed before you, and have sure faith in the Hereafter"},{"SurahNumber":2,"VerseNumber":5,"Text":"It is they who are ˹truly˺ guided by their Lord, and it is they who will be successful"},{"SurahNumber":2,"VerseNumber":6,"Text":"As for those who persist in disbelief, it is the same whether you warn them or not—they will never believe"},{"SurahNumber":2,"VerseNumber":7,"Text":"God has sealed their hearts and their hearing, and their sight is covered. They will suffer a tremendous punishment"},{"SurahNumber":2,"VerseNumber":8,"Text":"And there are some who say, “We believe in God and the Last Day,” yet they are not ˹true˺ believers"},{"SurahNumber":2,"VerseNumber":9,"Text":"They seek to deceive God and the believers, yet they only deceive themselves, but they fail to perceive it"},{"SurahNumber":2,"VerseNumber":10,"Text":"There is sickness in their hearts, and God ˹only˺ lets their sickness increase. They will suffer a painful punishment for their lies"},{"SurahNumber":2,"VerseNumber":11,"Text":"When they are told, “Do not spread corruption in the land,” they reply, “We are only peace-makers!”"},{"SurahNumber":2,"VerseNumber":12,"Text":"Indeed, it is they who are the corruptors, but they fail to perceive it"},{"SurahNumber":2,"VerseNumber":13,"Text":"And when they are told, “Believe as others believe,” they reply, “Will we believe as the fools believe?” Indeed, it is they who are fools, but they do not know"},{"SurahNumber":2,"VerseNumber":14,"Text":"When they meet the believers they say, “We believe.” But when alone with their evil associates they say, “We are definitely with you; we were only mocking.”"},{"SurahNumber":2,"VerseNumber":15,"Text":"God will throw their mockery back at them, leaving them to continue wandering blindly in their defiance"},{"SurahNumber":2,"VerseNumber":16,"Text":"They are the ones who trade guidance for misguidance. But this trade is profitless, and they are not ˹rightly˺ guided"},{"SurahNumber":2,"VerseNumber":17,"Text":"Their example is that of someone who kindles a fire, but when it lights up all around them, God takes away their light, leaving them in complete darkness—unable to see"},{"SurahNumber":2,"VerseNumber":18,"Text":"They are ˹wilfully˺ deaf, dumb, and blind, so they will never return ˹to the Right Path˺"},{"SurahNumber":2,"VerseNumber":19,"Text":"Or ˹those caught in˺ a rainstorm from the sky with darkness, thunder, and lightning. They press their fingers into their ears at the sound of every thunder-clap for fear of death. And God encompasses the disbelievers ˹by His might˺"},{"SurahNumber":2,"VerseNumber":20,"Text":"It is as if the lightning were about to snatch away their sight. Whenever lightning strikes, they walk in its light, but when darkness covers them, they stand still. Had God willed, He could have taken away their hearing and sight. Surely God is Most Capable of everything"},{"SurahNumber":2,"VerseNumber":21,"Text":"O humanity! Worship your Lord, Who created you and those before you, so that you may become mindful ˹of Him˺"},{"SurahNumber":2,"VerseNumber":22,"Text":"˹He is the One˺ Who has made the earth a place of settlement for you and the sky a canopy; and sends down rain from the sky, causing fruits to grow as a provision for you. So do not knowingly set up equals to God ˹in worship˺"},{"SurahNumber":2,"VerseNumber":23,"Text":"And if you are in doubt about what We have revealed to Our servant, then produce a sûrah like it and call your helpers other than God, if what you say is true"},{"SurahNumber":2,"VerseNumber":24,"Text":"But if you are unable to do so—and you will never be able to do so—then fear the Fire fuelled with people and stones, which is prepared for the disbelievers"},{"SurahNumber":2,"VerseNumber":25,"Text":"Give good news ˹O Prophet˺ to those who believe and do good that they will have Gardens under which rivers flow. Whenever provided with fruit, they will say, “This is what we were given before,” for they will be served fruit that looks similar ˹but tastes different˺. They will have pure spouses, and they will be there forever"},{"SurahNumber":2,"VerseNumber":26,"Text":"Surely God does not shy away from using the parable of a mosquito or what is even smaller. As for the believers, they know that it is the truth from their Lord. And as for the disbelievers, they argue, “What does God mean by such a parable?” Through this ˹test˺, He leaves many to stray, and guides many. And He leaves none to stray except the rebellious—"},{"SurahNumber":2,"VerseNumber":27,"Text":"those who violate God’s covenant after it has been affirmed, break whatever ˹ties˺ God has ordered to be maintained, and spread corruption in the land. It is they who are the ˹true˺ losers"},{"SurahNumber":2,"VerseNumber":28,"Text":"How can you deny God? You were lifeless and He gave you life, then He will cause you to die and again bring you to life, and then to Him you will ˹all˺ be returned"},{"SurahNumber":2,"VerseNumber":29,"Text":"He is the One Who created everything in the earth for you. Then He turned towards the heaven, forming it into seven heavens. And He has ˹perfect˺ knowledge of all things"},{"SurahNumber":2,"VerseNumber":30,"Text":"˹Remember˺ when your Lord said to the angels, “I am going to place a successive ˹human˺ authority on earth.” They asked ˹God˺, “Will You place in it someone who will spread corruption there and shed blood while we glorify Your praises and proclaim Your holiness?” God responded, “I know what you do not know.”"},{"SurahNumber":2,"VerseNumber":31,"Text":"He taught Adam the names of all things, then He presented them to the angels and said, “Tell Me the names of these, if what you say is true?”"},{"SurahNumber":2,"VerseNumber":32,"Text":"They replied, “Glory be to You! We have no knowledge except what You have taught us. You are truly the All-Knowing, All-Wise.”"},{"SurahNumber":2,"VerseNumber":33,"Text":"God said, “O Adam! Inform them of their names.” Then when Adam did, God said, “Did I not tell you that I know the secrets of the heavens and the earth, and I know what you reveal and what you conceal?”"},{"SurahNumber":2,"VerseNumber":34,"Text":"And ˹remember˺ when We said to the angels, “Prostrate before Adam,” so they all did—but not Iblîs, who refused and acted arrogantly, becoming unfaithful"},{"SurahNumber":2,"VerseNumber":35,"Text":"We cautioned, “O Adam! Live with your wife in Paradise and eat as freely as you please, but do not approach this tree, or else you will be wrongdoers.”"},{"SurahNumber":2,"VerseNumber":36,"Text":"But Satan deceived them—leading to their fall from the ˹blissful˺ state they were in, and We said, “Descend from the heavens ˹to the earth˺ as enemies to each other. You will find in the earth a residence and provision for your appointed stay.”"},{"SurahNumber":2,"VerseNumber":37,"Text":"Then Adam was inspired with words ˹of prayer˺ by his Lord, so He accepted his repentance. Surely He is the Accepter of Repentance, Most Merciful"},{"SurahNumber":2,"VerseNumber":38,"Text":"We said, “Descend all of you! Then when guidance comes to you from Me, whoever follows it, there will be no fear for them, nor will they grieve"},{"SurahNumber":2,"VerseNumber":39,"Text":"But those who disbelieve and deny Our signs will be the residents of the Fire. They will be there forever.”"},{"SurahNumber":2,"VerseNumber":40,"Text":"O children of Israel! Remember My favours upon you. Fulfil your covenant and I will fulfil Mine, and stand in awe of Me ˹alone˺"},{"SurahNumber":2,"VerseNumber":41,"Text":"Believe in My revelations which confirm your Scriptures. Do not be the first to deny them or trade them for a fleeting gain. And be mindful of Me"},{"SurahNumber":2,"VerseNumber":42,"Text":"Do not mix truth with falsehood or hide the truth knowingly"},{"SurahNumber":2,"VerseNumber":43,"Text":"Establish prayer, pay alms-tax, and bow down with those who bow down"},{"SurahNumber":2,"VerseNumber":44,"Text":"Do you preach righteousness and fail to practice it yourselves, although you read the Scripture? Do you not understand"},{"SurahNumber":2,"VerseNumber":45,"Text":"And seek help through patience and prayer. Indeed, it is a burden except for the humble—"},{"SurahNumber":2,"VerseNumber":46,"Text":"those who are certain that they will meet their Lord and to Him they will return"},{"SurahNumber":2,"VerseNumber":47,"Text":"O Children of Israel! Remember ˹all˺ the favours I granted you and how I honoured you above the others"},{"SurahNumber":2,"VerseNumber":48,"Text":"Guard yourselves against the Day on which no soul will be of help to another. No intercession will be accepted, no ransom taken, and no help will be given"},{"SurahNumber":2,"VerseNumber":49,"Text":"˹Remember˺ how We delivered you from the people of Pharaoh, who afflicted you with dreadful torment, slaughtering your sons and keeping your women. That was a severe test from your Lord"},{"SurahNumber":2,"VerseNumber":50,"Text":"And ˹remember˺ when We parted the sea, rescued you, and drowned Pharaoh’s people before your very eyes"},{"SurahNumber":2,"VerseNumber":51,"Text":"And ˹remember˺ when We appointed forty nights for Moses, then you worshipped the calf in his absence, acting wrongfully"},{"SurahNumber":2,"VerseNumber":52,"Text":"Even then We ˹still˺ forgave you so perhaps you would be grateful"},{"SurahNumber":2,"VerseNumber":53,"Text":"And ˹remember˺ when We gave Moses the Scripture—the standard ˹to distinguish between right and wrong˺ that perhaps you would be ˹rightly˺ guided"},{"SurahNumber":2,"VerseNumber":54,"Text":"And ˹remember˺ when Moses said to his people, “O my people! Surely you have wronged yourselves by worshipping the calf, so turn in repentance to your Creator and execute ˹the calf-worshippers among˺ yourselves. That is best for you in the sight of your Creator.” Then He accepted your repentance. Surely He is the Accepter of Repentance, Most Merciful"},{"SurahNumber":2,"VerseNumber":55,"Text":"And ˹remember˺ when you said, “O Moses! We will never believe you until we see God with our own eyes,” so a thunderbolt struck you while you were looking on"},{"SurahNumber":2,"VerseNumber":56,"Text":"Then We brought you back to life after your death, so that perhaps you would be grateful"},{"SurahNumber":2,"VerseNumber":57,"Text":"And ˹remember when˺ We shaded you with clouds and sent down to you manna and quails, ˹saying˺, “Eat from the good things We have provided for you.” The evildoers ˹certainly˺ did not wrong Us, but wronged themselves"},{"SurahNumber":2,"VerseNumber":58,"Text":"And ˹remember˺ when We said, “Enter this city and eat freely from wherever you please; enter the gate with humility, saying, ‘Absolve us.’ We will forgive your sins and multiply the reward for the good-doers.”"},{"SurahNumber":2,"VerseNumber":59,"Text":"But the wrongdoers changed the words they were commanded to say. So We sent down a punishment from the heavens upon them for their rebelliousness"},{"SurahNumber":2,"VerseNumber":60,"Text":"And ˹remember˺ when Moses prayed for water for his people, We said, “Strike the rock with your staff.” Then twelve springs gushed out, ˹and˺ each tribe knew its drinking place. ˹We then said,˺ “Eat and drink of God’s provisions, and do not go about spreading corruption in the land.”"},{"SurahNumber":2,"VerseNumber":61,"Text":"And ˹remember˺ when you said, “O Moses! We cannot endure the same meal ˹every day˺. So ˹just˺ call upon your Lord on our behalf, He will bring forth for us some of what the earth produces of herbs, cucumbers, garlic, lentils, and onions.” Moses scolded ˹them˺, “Do you exchange what is better for what is worse? ˹You can˺ go down to any village and you will find what you have asked for.” They were stricken with disgrace and misery, and they invited the displeasure of God for rejecting God’s signs and unjustly killing the prophets. This is ˹a fair reward˺ for their disobedience and violations"},{"SurahNumber":2,"VerseNumber":62,"Text":"Indeed, the believers, Jews, Christians, and Sabians—whoever ˹truly˺ believes in God and the Last Day and does good will have their reward with their Lord. And there will be no fear for them, nor will they grieve"},{"SurahNumber":2,"VerseNumber":63,"Text":"And ˹remember˺ when We took a covenant from you and raised the mountain above you ˹saying˺, “Hold firmly to that ˹Scripture˺ which We have given you and observe its teachings so perhaps you will become mindful ˹of God˺.”"},{"SurahNumber":2,"VerseNumber":64,"Text":"Yet you turned away afterwards. Had it not been for God’s grace and mercy upon you, you would have certainly been of the losers"},{"SurahNumber":2,"VerseNumber":65,"Text":"You are already aware of those of you who broke the Sabbath. We said to them, “Be disgraced apes!”"},{"SurahNumber":2,"VerseNumber":66,"Text":"So We made their fate an example to present and future generations, and a lesson to the God-fearing"},{"SurahNumber":2,"VerseNumber":67,"Text":"And ˹remember˺ when Moses said to his people, “God commands you to sacrifice a cow.” They replied, “Are you mocking us?” Moses responded, “I seek refuge in God from acting foolishly!”"},{"SurahNumber":2,"VerseNumber":68,"Text":"They said, “Call upon your Lord to clarify for us what type ˹of cow˺ it should be!” He replied, “God says, ‘The cow should neither be old nor young but in between. So do as you are commanded!’”"},{"SurahNumber":2,"VerseNumber":69,"Text":"They said, “Call upon your Lord to specify for us its colour.” He replied, “God says, ‘It should be a bright yellow cow—pleasant to see.’”"},{"SurahNumber":2,"VerseNumber":70,"Text":"Again they said, “Call upon your Lord so that He may make clear to us which cow, for all cows look the same to us. Then, God willing, we will be guided ˹to the right one˺.”"},{"SurahNumber":2,"VerseNumber":71,"Text":"He replied, “God says, ‘It should have been used neither to till the soil nor water the fields; wholesome and without blemish.’” They said, “Now you have come with the truth.” Yet they still slaughtered it hesitantly"},{"SurahNumber":2,"VerseNumber":72,"Text":"˹This is˺ when a man was killed and you disputed who the killer was, but God revealed what you concealed"},{"SurahNumber":2,"VerseNumber":73,"Text":"So We instructed, “Strike the dead body with a piece of the cow.” This is how ˹easily˺ God brings the dead to life, showing you His signs so that you may understand"},{"SurahNumber":2,"VerseNumber":74,"Text":"Even then your hearts became hardened like a rock or even harder, for some rocks gush rivers; others split, spilling water; while others are humbled in awe of God. And God is never unaware of what you do"},{"SurahNumber":2,"VerseNumber":75,"Text":"Do you ˹believers still˺ expect them to be true to you, though a group of them would hear the word of God then knowingly corrupt it after understanding it"},{"SurahNumber":2,"VerseNumber":76,"Text":"When they meet the believers they say, “We believe.” But in private they say ˹to each other˺, “Will you disclose to the believers the knowledge God has revealed to you, so that they may use it against you before your Lord? Do you not understand?”"},{"SurahNumber":2,"VerseNumber":77,"Text":"Do they not know that God is aware of what they conceal and what they reveal"},{"SurahNumber":2,"VerseNumber":78,"Text":"And among them are the illiterate who know nothing about the Scripture except lies, and ˹so˺ they ˹wishfully˺ speculate"},{"SurahNumber":2,"VerseNumber":79,"Text":"So woe to those who distort the Scripture with their own hands then say, “This is from God”—seeking a fleeting gain! So woe to them for what their hands have written, and woe to them for what they have earned"},{"SurahNumber":2,"VerseNumber":80,"Text":"˹Some of˺ the Jews claim, “The Fire will not touch us except for a number of days.” Say, ˹O Prophet,˺ “Have you taken a pledge from God—for God never breaks His word—or are you ˹just˺ saying about God what you do not know?”"},{"SurahNumber":2,"VerseNumber":81,"Text":"But no! Those who commit evil and are engrossed in sin will be the residents of the Fire. They will be there forever"},{"SurahNumber":2,"VerseNumber":82,"Text":"And those who believe and do good will be the residents of Paradise. They will be there forever"},{"SurahNumber":2,"VerseNumber":83,"Text":"And ˹remember˺ when We took a covenant from the children of Israel ˹stating˺, “Worship none but God; be kind to parents, relatives, orphans and the needy; speak kindly to people; establish prayer; and pay alms-tax.” But you ˹Israelites˺ turned away—except for a few of you—and were indifferent"},{"SurahNumber":2,"VerseNumber":84,"Text":"And ˹remember˺ when We took your covenant that you would neither shed each other’s blood nor expel each other from their homes, you gave your pledge and bore witness"},{"SurahNumber":2,"VerseNumber":85,"Text":"But here you are, killing each other and expelling some of your people from their homes, aiding one another in sin and aggression; and when those ˹expelled˺ come to you as captives, you still ransom them—though expelling them was unlawful for you. Do you believe in some of the Scripture and reject the rest? Is there any reward for those who do so among you other than disgrace in this worldly life and being subjected to the harshest punishment on the Day of Judgment? For God is never unaware of what you do"},{"SurahNumber":2,"VerseNumber":86,"Text":"These are the ones who trade the Hereafter for the life of this world. So their punishment will not be reduced, nor will they be helped"},{"SurahNumber":2,"VerseNumber":87,"Text":"Indeed, We gave Moses the Book and sent after him successive messengers. And We gave Jesus, son of Mary, clear proofs and supported him with the holy spirit. Why is it that every time a messenger comes to you ˹Israelites˺ with something you do not like, you become arrogant, rejecting some and killing others"},{"SurahNumber":2,"VerseNumber":88,"Text":"They say, “Our hearts are unreceptive!” In fact, God has condemned them for their disbelief. They have but little faith"},{"SurahNumber":2,"VerseNumber":89,"Text":"Although they used to pray for victory ˹by means of the Prophet˺ over the polytheists, when there came to them a Book from God which they recognized, confirming the Scripture they had ˹in their hands˺, they rejected it. So may God’s condemnation be upon the disbelievers"},{"SurahNumber":2,"VerseNumber":90,"Text":"Miserable is the price they have sold their souls for—denying God’s revelation and resenting God for granting His grace to whoever He wills of His servants! They have earned wrath upon wrath. And such disbelievers will suffer a humiliating punishment"},{"SurahNumber":2,"VerseNumber":91,"Text":"When it is said to them: “Believe in what God has revealed,” they reply, “We only believe in what was sent down to us,” and they deny what came afterwards, though it is the truth confirming their own Scriptures! Ask ˹them, O Prophet˺, “Why then did you kill God’s prophets before, if you are ˹truly˺ believers?”"},{"SurahNumber":2,"VerseNumber":92,"Text":"Indeed, Moses came to you with clear proofs, then you worshipped the calf in his absence, acting wrongfully"},{"SurahNumber":2,"VerseNumber":93,"Text":"And when We took your covenant and raised the mountain above you ˹saying˺, “Hold firmly to that ˹Scripture˺ which We have given you and obey,” they answered, “We hear and disobey.” The love of the calf was rooted in their hearts because of their disbelief. Say, ˹O Prophet,˺ “How evil is what your ˹so-called˺ belief prompts you to do, if you ˹actually˺ believe ˹in the Torah˺!”"},{"SurahNumber":2,"VerseNumber":94,"Text":"Say, ˹O Prophet,˺ “If the ˹eternal˺ Home of the Hereafter with God is exclusively for you ˹Israelites˺ out of all humanity, then wish for death if what you say is true!”"},{"SurahNumber":2,"VerseNumber":95,"Text":"But they will never wish for that because of what their hands have done. And God has ˹perfect˺ knowledge of the wrongdoers"},{"SurahNumber":2,"VerseNumber":96,"Text":"You will surely find them clinging to life more eagerly than any other people, even more than polytheists. Each one of them wishes to live a thousand years. But even if they were to live that long, it would not save them from the punishment. And God is All-Seeing of what they do"},{"SurahNumber":2,"VerseNumber":97,"Text":"Say, ˹O Prophet,˺ “Whoever is an enemy of Gabriel should know that he revealed this ˹Quran˺ to your heart by God’s Will, confirming what came before it—a guide and good news for the believers.”"},{"SurahNumber":2,"VerseNumber":98,"Text":"Whoever is an enemy of God, His angels, His messengers, Gabriel, and Michael, then ˹let them know that˺ God is certainly the enemy of the disbelievers"},{"SurahNumber":2,"VerseNumber":99,"Text":"Indeed, We have sent down to you ˹O Prophet˺ clear revelations. ˹But˺ none will deny them except the rebellious"},{"SurahNumber":2,"VerseNumber":100,"Text":"Why is it that every time they make a covenant, a group of them casts it aside? In fact, most of them do not believe"},{"SurahNumber":2,"VerseNumber":101,"Text":"Now, when a messenger from God has come to them—confirming their own Scriptures—some of the People of the Book cast the Book of God behind their backs as if they did not know"},{"SurahNumber":2,"VerseNumber":102,"Text":"They ˹instead˺ followed the magic promoted by the devils during the reign of Solomon. Never did Solomon disbelieve, rather the devils disbelieved. They taught magic to the people, along with what had been revealed to the two angels, Hârût and Mârût, in Babylon. The two angels never taught anyone without saying, “We are only a test ˹for you˺, so do not abandon ˹your˺ faith.” Yet people learned ˹magic˺ that caused a rift ˹even˺ between husband and wife; although their magic could not harm anyone except by God’s Will. They learned what harmed them and did not benefit them—although they already knew that whoever buys into magic would have no share in the Hereafter. Miserable indeed was the price for which they sold their souls, if only they knew"},{"SurahNumber":2,"VerseNumber":103,"Text":"If only they were faithful and mindful ˹of God˺, there would have been a better reward from God, if only they knew"},{"SurahNumber":2,"VerseNumber":104,"Text":"O believers! Do not say, “Râ’ina.” [Herd us!] But say, “Unẓurna,” [Tend to us!] and listen ˹attentively˺. And the disbelievers will suffer a painful punishment"},{"SurahNumber":2,"VerseNumber":105,"Text":"The disbelievers from the People of the Book and the polytheists would not want you to receive any blessing from your Lord, but God selects whoever He wills for His mercy. And God is the Lord of infinite bounty"},{"SurahNumber":2,"VerseNumber":106,"Text":"If We ever abrogate a verse or cause it to be forgotten, We replace it with a better or similar one. Do you not know that God is Most Capable of everything"},{"SurahNumber":2,"VerseNumber":107,"Text":"Do you not know that the kingdom of the heavens and the earth belongs ˹only˺ to God, and you have no guardian or helper besides God"},{"SurahNumber":2,"VerseNumber":108,"Text":"Or do you ˹believers˺ intend to ask of your Messenger as Moses was asked before? But whoever trades belief for disbelief has truly strayed from the Right Way"},{"SurahNumber":2,"VerseNumber":109,"Text":"Many among the People of the Book wish they could turn you ˹believers˺ back to disbelief because of their envy, after the truth has been made clear to them. Pardon and bear with them until God delivers His decision. Surely God is Most Capable of everything"},{"SurahNumber":2,"VerseNumber":110,"Text":"Establish prayer, and pay alms-tax. Whatever good you send forth for yourselves, you will ˹certainly˺ find ˹its reward˺ with God. Surely God is All-Seeing of what you do"},{"SurahNumber":2,"VerseNumber":111,"Text":"The Jews and Christians each claim that none will enter Paradise except those of their own faith. These are their desires. Reply, ˹O Prophet,˺ “Show ˹me˺ your proof if what you say is true.”"},{"SurahNumber":2,"VerseNumber":112,"Text":"But no! Whoever submits themselves to God and does good will have their reward with their Lord. And there will be no fear for them, nor will they grieve"},{"SurahNumber":2,"VerseNumber":113,"Text":"The Jews say, “The Christians have nothing to stand on” and the Christians say, “The Jews have nothing to stand on,” although both recite the Scriptures. And those ˹pagans˺ who have no knowledge say the same ˹about people of faith˺. Surely God will judge between them on the Day of Judgment regarding their dispute"},{"SurahNumber":2,"VerseNumber":114,"Text":"Who does more wrong than those who prevent God’s Name from being mentioned in His places of worship and strive to destroy them? Such people have no right to enter these places except with fear. For them is disgrace in this world, and they will suffer a tremendous punishment in the Hereafter"},{"SurahNumber":2,"VerseNumber":115,"Text":"To God belong the east and the west, so wherever you turn you are facing ˹towards˺ God. Surely God is All-Encompassing, All-Knowing"},{"SurahNumber":2,"VerseNumber":116,"Text":"They say, “God has offspring.” Glory be to Him! In fact, to Him belongs whatever is in the heavens and the earth—all are subject to His Will"},{"SurahNumber":2,"VerseNumber":117,"Text":"˹He is˺ the Originator of the heavens and the earth! When He decrees a matter, He simply tells it, “Be!” And it is"},{"SurahNumber":2,"VerseNumber":118,"Text":"Those who have no knowledge say, “If only God would speak to us or a sign would come to us!” The same was said by those who came before. Their hearts are all alike. Indeed, We have made the signs clear for people of sure faith"},{"SurahNumber":2,"VerseNumber":119,"Text":"We have surely sent you with the truth ˹O Prophet˺ as a deliverer of good news and a warner. And you will not be accountable for the residents of the Hellfire"},{"SurahNumber":2,"VerseNumber":120,"Text":"Never will the Jews or Christians be pleased with you, until you follow their faith. Say, “God’s guidance is the only ˹true˺ guidance.” And if you were to follow their desires after ˹all˺ the knowledge that has come to you, there would be none to protect or help you against God"},{"SurahNumber":2,"VerseNumber":121,"Text":"Those We have given the Book follow it as it should be followed. It is they who ˹truly˺ believe in it. As for those who reject it, it is they who are the losers"},{"SurahNumber":2,"VerseNumber":122,"Text":"O Children of Israel! Remember My favours upon you and how I honoured you above the others"},{"SurahNumber":2,"VerseNumber":123,"Text":"And guard yourselves against the Day when no soul will be of any help to another. No ransom will be taken, no intercession accepted, and no help will be given"},{"SurahNumber":2,"VerseNumber":124,"Text":"˹Remember˺ when Abraham was tested by his Lord with ˹certain˺ commandments, which he fulfilled. God said, “I will certainly make you into a role model for the people.” Abraham asked, “What about my offspring?” God replied, “My covenant is not extended to the wrongdoers.”"},{"SurahNumber":2,"VerseNumber":125,"Text":"And ˹remember˺ when We made the Sacred House a centre and a sanctuary for the people ˹saying˺, “˹You may˺ take the standing-place of Abraham as a site of prayer.” And We entrusted Abraham and Ishmael to purify My House for those who circle it, who meditate in it, and who bow and prostrate themselves ˹in prayer˺"},{"SurahNumber":2,"VerseNumber":126,"Text":"And ˹remember˺ when Abraham said, “My Lord, make this city ˹of Mecca˺ secure and provide fruits to its people—those among them who believe in God and the Last Day.” He answered, “As for those who disbelieve, I will let them enjoy themselves for a little while, then I will condemn them to the torment of the Fire. What an evil destination!”"},{"SurahNumber":2,"VerseNumber":127,"Text":"And ˹remember˺ when Abraham raised the foundation of the House with Ishmael, ˹both praying,˺ “Our Lord! Accept ˹this˺ from us. You are indeed the All-Hearing, All-Knowing"},{"SurahNumber":2,"VerseNumber":128,"Text":"Our Lord! Make us both ˹fully˺ submit to You and from our descendants a nation that will submit to you. Show us our rituals, and turn to us in grace. You are truly the Accepter of Repentance, Most Merciful"},{"SurahNumber":2,"VerseNumber":129,"Text":"Our Lord! Raise from among them a messenger who will recite to them Your revelations, teach them the Book and wisdom, and purify them. Indeed, You ˹alone˺ are the Almighty, All-Wise.”"},{"SurahNumber":2,"VerseNumber":130,"Text":"And who would reject the faith of Abraham except a fool! We certainly chose him in this life, and in the Hereafter he will surely be among the righteous"},{"SurahNumber":2,"VerseNumber":131,"Text":"When his Lord ordered him, “Submit ˹to My Will˺,” he responded, “I submit to the Lord of all worlds.”"},{"SurahNumber":2,"VerseNumber":132,"Text":"This was the advice of Abraham—as well as Jacob—to his children, ˹saying˺, “Indeed, God has chosen for you this faith; so do not die except in ˹a state of full˺ submission.”"},{"SurahNumber":2,"VerseNumber":133,"Text":"Or did you witness when death came to Jacob? He asked his children, “Who will you worship after my passing?” They replied, “We will ˹continue to˺ worship your God, the God of your forefathers—Abraham, Ishmael, and Isaac—the One God. And to Him we ˹all˺ submit.”"},{"SurahNumber":2,"VerseNumber":134,"Text":"That was a community that had already gone before. For them is what they earned and for you is what you have earned. And you will not be accountable for what they have done"},{"SurahNumber":2,"VerseNumber":135,"Text":"The Jews and Christians each say, “Follow our faith to be ˹rightly˺ guided.” Say, ˹O Prophet,˺ “No! We follow the faith of Abraham, the upright—who was not a polytheist.”"},{"SurahNumber":2,"VerseNumber":136,"Text":"Say, ˹O believers,˺ “We believe in God and what has been revealed to us; and what was revealed to Abraham, Ishmael, Isaac, Jacob, and his descendants; and what was given to Moses, Jesus, and other prophets from their Lord. We make no distinction between any of them. And to God we all submit.”"},{"SurahNumber":2,"VerseNumber":137,"Text":"So if they believe in what you believe, then they will indeed be ˹rightly˺ guided. But if they turn away, they are simply opposed ˹to the truth˺. But God will spare you their evil. For He is the All-Hearing, All-Knowing"},{"SurahNumber":2,"VerseNumber":138,"Text":"This is the ˹natural˺ Way of God. And who is better than God in ordaining a way? And we worship ˹none but˺ Him"},{"SurahNumber":2,"VerseNumber":139,"Text":"Say, “Would you dispute with us about God, while He is our Lord and your Lord? We are accountable for our deeds and you for yours. And we are devoted to Him ˹alone˺"},{"SurahNumber":2,"VerseNumber":140,"Text":"Do you claim that Abraham, Ishmael, Isaac, Jacob, and his descendants were all Jews or Christians?” Say, “Who is more knowledgeable: you or God?” Who does more wrong than those who hide the testimony they received from God? And God is never unaware of what you do"},{"SurahNumber":2,"VerseNumber":141,"Text":"That was a community that had already gone before. For them is what they earned and for you is what you have earned. And you will not be accountable for what they have done"},{"SurahNumber":2,"VerseNumber":142,"Text":"The foolish among the people will ask, “Why did they turn away from the direction of prayer they used to face?” Say, ˹O Prophet,˺ “The east and west belong ˹only˺ to God. He guides whoever He wills to the Straight Path.”"},{"SurahNumber":2,"VerseNumber":143,"Text":"And so We have made you ˹believers˺ an upright community so that you may be witnesses over humanity and that the Messenger may be a witness over you. We assigned your former direction of prayer only to distinguish those who would remain faithful to the Messenger from those who would lose faith. It was certainly a difficult test except for those ˹rightly˺ guided by God. And God would never discount your ˹previous acts of˺ faith. Surely God is Ever Gracious and Most Merciful to humanity"},{"SurahNumber":2,"VerseNumber":144,"Text":"Indeed, We see you ˹O Prophet˺ turning your face towards heaven. Now We will make you turn towards a direction ˹of prayer˺ that will please you. So turn your face towards the Sacred Mosque ˹in Mecca˺—wherever you are, turn your faces towards it. Those who were given the Scripture certainly know this to be the truth from their Lord. And God is never unaware of what they do"},{"SurahNumber":2,"VerseNumber":145,"Text":"Even if you were to bring every proof to the People of the Book, they would not accept your direction ˹of prayer˺, nor would you accept theirs; nor would any of them accept the direction ˹of prayer˺ of another. And if you were to follow their desires after ˹all˺ the knowledge that has come to you, then you would certainly be one of the wrongdoers"},{"SurahNumber":2,"VerseNumber":146,"Text":"Those We have given the Scripture recognize this ˹Prophet˺ as they recognize their own children. Yet a group of them hides the truth knowingly"},{"SurahNumber":2,"VerseNumber":147,"Text":"˹This is˺ the truth from your Lord, so do not ever be one of those who doubt"},{"SurahNumber":2,"VerseNumber":148,"Text":"Everyone turns to their own direction ˹of prayer˺. So compete with one another in doing good. Wherever you are, God will bring you all together ˹for judgment˺. Surely God is Most Capable of everything"},{"SurahNumber":2,"VerseNumber":149,"Text":"Wherever you are ˹O Prophet˺, turn your face towards the Sacred Mosque. This is certainly the truth from your Lord. And God is never unaware of what you ˹all˺ do"},{"SurahNumber":2,"VerseNumber":150,"Text":"Wherever you are ˹O Prophet˺, turn your face towards the Sacred Mosque. And wherever you ˹believers˺ are, face towards it, so that people will have no argument against you, except the wrongdoers among them. Do not fear them; fear Me, so that I may ˹continue to˺ perfect My favour upon you and so you may be ˹rightly˺ guided"},{"SurahNumber":2,"VerseNumber":151,"Text":"Since We have sent you a messenger from among yourselves—reciting to you Our revelations, purifying you, teaching you the Book and wisdom, and teaching you what you never knew—"},{"SurahNumber":2,"VerseNumber":152,"Text":"remember Me; I will remember you. And thank Me, and never be ungrateful"},{"SurahNumber":2,"VerseNumber":153,"Text":"O believers! Seek comfort in patience and prayer. God is truly with those who are patient"},{"SurahNumber":2,"VerseNumber":154,"Text":"Never say that those martyred in the cause of God are dead—in fact, they are alive! But you do not perceive it"},{"SurahNumber":2,"VerseNumber":155,"Text":"We will certainly test you with a touch of fear and famine and loss of property, life, and crops. Give good news to those who patiently endure—"},{"SurahNumber":2,"VerseNumber":156,"Text":"who, when faced with a disaster, say, “Surely to God we belong and to Him we will ˹all˺ return.”"},{"SurahNumber":2,"VerseNumber":157,"Text":"They are the ones who will receive God’s blessings and mercy. And it is they who are ˹rightly˺ guided"},{"SurahNumber":2,"VerseNumber":158,"Text":"Indeed, ˹the hills of˺ Ṣafa and Marwah are among the symbols of God. So whoever performs the pilgrimage or minor pilgrimage, let them walk between ˹the two hills˺. And whoever does good willingly, God is truly Appreciative, All-Knowing"},{"SurahNumber":2,"VerseNumber":159,"Text":"Those who hide the clear proofs and guidance that We have revealed—after We made it clear for humanity in the Book—will be condemned by God and ˹all˺ those who condemn"},{"SurahNumber":2,"VerseNumber":160,"Text":"As for those who repent, mend their ways, and let the truth be known, they are the ones to whom I will turn ˹in forgiveness˺, for I am the Accepter of Repentance, Most Merciful"},{"SurahNumber":2,"VerseNumber":161,"Text":"Surely those who disbelieve and die as disbelievers are condemned by God, the angels, and all of humanity"},{"SurahNumber":2,"VerseNumber":162,"Text":"They will be in Hell forever. Their punishment will not be lightened, nor will they be delayed ˹from it˺"},{"SurahNumber":2,"VerseNumber":163,"Text":"Your God is ˹only˺ One God. There is no god ˹worthy of worship˺ except Him—the Most Compassionate, Most Merciful"},{"SurahNumber":2,"VerseNumber":164,"Text":"Indeed, in the creation of the heavens and the earth; the alternation of the day and the night; the ships that sail the sea for the benefit of humanity; the rain sent down by God from the skies, reviving the earth after its death; the scattering of all kinds of creatures throughout; the shifting of the winds; and the clouds drifting between the heavens and the earth—˹in all of this˺ are surely signs for people of understanding"},{"SurahNumber":2,"VerseNumber":165,"Text":"Still there are some who take others as God’s equal—they love them as they should love God—but the ˹true˺ believers love God even more. If only the wrongdoers could see the ˹horrible˺ punishment ˹awaiting them˺, they would certainly realize that all power belongs to God and that God is indeed severe in punishment"},{"SurahNumber":2,"VerseNumber":166,"Text":"˹Consider the Day˺ when those who misled others will disown their followers—when they face the torment—and the bonds that united them will be cut off"},{"SurahNumber":2,"VerseNumber":167,"Text":"The ˹misled˺ followers will cry, “If only we could have a second chance, we would disown them as they disowned us.” And so God will make them remorseful of their misdeeds. And they will never ˹be able to˺ leave the Fire"},{"SurahNumber":2,"VerseNumber":168,"Text":"O humanity! Eat from what is lawful and good on the earth and do not follow Satan’s footsteps. He is truly your sworn enemy"},{"SurahNumber":2,"VerseNumber":169,"Text":"He only incites you to commit evil and indecency, and to claim against God what you do not know"},{"SurahNumber":2,"VerseNumber":170,"Text":"When it is said to them, “Follow what God has revealed,” they reply, “No! We ˹only˺ follow what we found our forefathers practicing.” ˹Would they still do so,˺ even if their forefathers had ˹absolutely˺ no understanding or guidance"},{"SurahNumber":2,"VerseNumber":171,"Text":"The example of the disbelievers ˹not responding to the Messenger’s warning˺ is like a flock not comprehending the calls and cries of the shepherd. ˹They are wilfully˺ deaf, dumb and blind so they have no understanding"},{"SurahNumber":2,"VerseNumber":172,"Text":"O believers! Eat from the good things We have provided for you. And give thanks to God if you ˹truly˺ worship Him ˹alone˺"},{"SurahNumber":2,"VerseNumber":173,"Text":"He has only forbidden you ˹to eat˺ carrion, blood, swine, and what is slaughtered in the name of any other than God. But if someone is compelled by necessity—neither driven by desire nor exceeding immediate need—they will not be sinful. Surely God is All-Forgiving, Most Merciful"},{"SurahNumber":2,"VerseNumber":174,"Text":"Indeed, those who hide God’s revelations, trading them for a fleeting gain consume nothing but fire into their bellies. God will neither speak to them on the Day of Judgment, nor will He purify them. And they will suffer a painful punishment"},{"SurahNumber":2,"VerseNumber":175,"Text":"They are the ones who trade guidance for misguidance and forgiveness for punishment. How persistent are they in pursuit of the Fire"},{"SurahNumber":2,"VerseNumber":176,"Text":"That is because God has revealed the Book in truth. And surely those who differ regarding it are totally engrossed in opposition"},{"SurahNumber":2,"VerseNumber":177,"Text":"Righteousness is not in turning your faces towards the east or the west. Rather, the righteous are those who believe in God, the Last Day, the angels, the Books, and the prophets; who give charity out of their cherished wealth to relatives, orphans, the poor, ˹needy˺ travellers, beggars, and for freeing captives; who establish prayer, pay alms-tax, and keep the pledges they make; and who are patient in times of suffering, adversity, and in ˹the heat of˺ battle. It is they who are true ˹in faith˺, and it is they who are mindful ˹of God˺"},{"SurahNumber":2,"VerseNumber":178,"Text":"O believers! ˹The law of˺ retaliation is set for you in cases of murder—a free man for a free man, a slave for a slave, and a female for a female. But if the offender is pardoned by the victim’s guardian, then blood-money should be decided fairly and payment should be made courteously. This is a concession and a mercy from your Lord. But whoever transgresses after that will suffer a painful punishment"},{"SurahNumber":2,"VerseNumber":179,"Text":"There is ˹security of˺ life for you in ˹the law of˺ retaliation, O people of reason, so that you may become mindful ˹of God˺"},{"SurahNumber":2,"VerseNumber":180,"Text":"It is prescribed that when death approaches any of you—if they leave something of value—a will should be made in favour of parents and immediate family with fairness. ˹This is˺ an obligation on those who are mindful ˹of God˺"},{"SurahNumber":2,"VerseNumber":181,"Text":"But whoever changes the will after hearing it, the blame will only be on those who made the change. Indeed, God is All-Hearing, All-Knowing"},{"SurahNumber":2,"VerseNumber":182,"Text":"Whoever suspects an error or an injustice in the will and brings about a ˹fair˺ settlement among the parties will not be sinful. Surely God is All-Forgiving, Most Merciful"},{"SurahNumber":2,"VerseNumber":183,"Text":"O believers! Fasting is prescribed for you—as it was for those before you—so perhaps you will become mindful ˹of God˺"},{"SurahNumber":2,"VerseNumber":184,"Text":"˹Fast a˺ prescribed number of days. But whoever of you is ill or on a journey, then ˹let them fast˺ an equal number of days ˹after Ramaḍân˺. For those who can only fast with extreme difficulty, compensation can be made by feeding a needy person ˹for every day not fasted˺. But whoever volunteers to give more, it is better for them. And to fast is better for you, if only you knew"},{"SurahNumber":2,"VerseNumber":185,"Text":"Ramaḍân is the month in which the Quran was revealed as a guide for humanity with clear proofs of guidance and the standard ˹to distinguish between right and wrong˺. So whoever is present this month, let them fast. But whoever is ill or on a journey, then ˹let them fast˺ an equal number of days ˹after Ramaḍân˺. God intends ease for you, not hardship, so that you may complete the prescribed period and proclaim the greatness of God for guiding you, and perhaps you will be grateful"},{"SurahNumber":2,"VerseNumber":186,"Text":"When My servants ask you ˹O Prophet˺ about Me: I am truly near. I respond to one’s prayer when they call upon Me. So let them respond ˹with obedience˺ to Me and believe in Me, perhaps they will be guided ˹to the Right Way˺"},{"SurahNumber":2,"VerseNumber":187,"Text":"It has been made permissible for you to be intimate with your wives during the nights preceding the fast. Your spouses are a garment for you as you are for them. God knows that you were deceiving yourselves. So He has accepted your repentance and pardoned you. So now you may be intimate with them and seek what God has prescribed for you. ˹You may˺ eat and drink until you see the light of dawn breaking the darkness of night, then complete the fast until nightfall. Do not be intimate with your spouses while you are meditating in the mosques. These are the limits set by God, so do not exceed them. This is how God makes His revelations clear to people, so they may become mindful ˹of Him˺"},{"SurahNumber":2,"VerseNumber":188,"Text":"Do not consume one another’s wealth unjustly, nor deliberately bribe authorities in order to devour a portion of others’ property, knowing that it is a sin"},{"SurahNumber":2,"VerseNumber":189,"Text":"They ask you ˹O Prophet˺ about the phases of the moon. Say, “They are a means for people to determine time and pilgrimage.” Righteousness is not in entering your houses from the back doors. Rather, righteousness is to be mindful ˹of God˺. So enter your homes through their ˹proper˺ doors, and be mindful of God so you may be successful"},{"SurahNumber":2,"VerseNumber":190,"Text":"Fight in the cause of God ˹only˺ against those who wage war against you, but do not exceed the limits. God does not like transgressors"},{"SurahNumber":2,"VerseNumber":191,"Text":"Kill them wherever you come upon them and drive them out of the places from which they have driven you out. For persecution is far worse than killing. And do not fight them at the Sacred Mosque unless they attack you there. If they do so, then fight them—that is the reward of the disbelievers"},{"SurahNumber":2,"VerseNumber":192,"Text":"But if they cease, then surely God is All-Forgiving, Most Merciful"},{"SurahNumber":2,"VerseNumber":193,"Text":"Fight against them ˹if they persecute you˺ until there is no more persecution, and ˹your˺ devotion will be to God ˹alone˺. If they stop ˹persecuting you˺, let there be no hostility except against the aggressors"},{"SurahNumber":2,"VerseNumber":194,"Text":"˹There will be retaliation in˺ a sacred month for ˹an offence in˺ a sacred month, and all violations will bring about retaliation. So, if anyone attacks you, retaliate in the same manner. ˹But˺ be mindful of God, and know that God is with those mindful ˹of Him˺"},{"SurahNumber":2,"VerseNumber":195,"Text":"Spend in the cause of God and do not let your own hands throw you into destruction ˹by withholding˺. And do good, for God certainly loves the good-doers"},{"SurahNumber":2,"VerseNumber":196,"Text":"Complete the pilgrimage and minor pilgrimage for God. But if prevented ˹from proceeding˺, then ˹offer˺ whatever sacrificial animals you can afford. And do not shave your heads until the sacrificial animal reaches its destination. But if any of you is ill or has a scalp ailment ˹requiring shaving˺, then compensate either by fasting, charity, or a sacrificial offering. In times of peace, you may combine the pilgrimage and minor pilgrimage then make the sacrificial offering you can afford. Whoever cannot afford that ˹offering˺, let them fast three days during pilgrimage and seven after returning ˹home˺—completing ten. These offerings are for those who do not live near the Sacred House. And be mindful of God, and know that God is severe in punishment"},{"SurahNumber":2,"VerseNumber":197,"Text":"˹Commitment to˺ pilgrimage is made in appointed months. Whoever commits to ˹performing˺ pilgrimage, let them stay away from intimate relations, foul language, and arguments during pilgrimage. Whatever good you do, God ˹fully˺ knows of it. Take ˹necessary˺ provisions ˹for the journey˺—surely the best provision is righteousness. And be mindful of Me, O people of reason"},{"SurahNumber":2,"VerseNumber":198,"Text":"There is no blame on you for seeking the bounty of your Lord ˹during this journey˺. When you return from ’Arafât, praise God near the sacred place and praise Him for having guided you, for surely before this ˹guidance˺ you were astray"},{"SurahNumber":2,"VerseNumber":199,"Text":"Then go forth with the rest of the pilgrims. And seek God’s forgiveness. Surely God is All-Forgiving, Most Merciful"},{"SurahNumber":2,"VerseNumber":200,"Text":"When you have fulfilled your sacred rites, praise God as you used to praise your forefathers ˹before Islam˺, or even more passionately. There are some who say, “Our Lord! Grant us ˹Your bounties˺ in this world,” but they will have no share in the Hereafter"},{"SurahNumber":2,"VerseNumber":201,"Text":"Yet there are others who say, “Our Lord! Grant us the good of this world and the Hereafter, and protect us from the torment of the Fire.”"},{"SurahNumber":2,"VerseNumber":202,"Text":"It is they who will receive a ˹heavenly˺ reward for the good they have done. Surely God is swift in reckoning"},{"SurahNumber":2,"VerseNumber":203,"Text":"And remember God during ˹these˺ appointed days. Whoever departs swiftly on the second day is not sinful, neither are those who stay behind ˹till the third—seeking additional reward˺, so long as they are mindful ˹of their Lord˺. And be mindful of God, and know that to Him you will ˹all˺ be gathered"},{"SurahNumber":2,"VerseNumber":204,"Text":"There are some ˹hypocrites˺ who impress you with their views regarding worldly affairs and openly call upon God to witness what is in their hearts, yet they are your worst adversaries"},{"SurahNumber":2,"VerseNumber":205,"Text":"And when they leave ˹you˺, they strive throughout the land to spread mischief in it and destroy crops and cattle. God does not like mischief"},{"SurahNumber":2,"VerseNumber":206,"Text":"When it is said to them, “Fear God,” pride carries them off to sin. Hell will be their proper place. What an evil place to rest"},{"SurahNumber":2,"VerseNumber":207,"Text":"And there are those who would dedicate their lives to God’s pleasure. And God is Ever Gracious to ˹His˺ servants"},{"SurahNumber":2,"VerseNumber":208,"Text":"O believers! Enter into Islam wholeheartedly and do not follow Satan’s footsteps. Surely he is your sworn enemy"},{"SurahNumber":2,"VerseNumber":209,"Text":"If you falter after receiving the clear proofs, then know that God is indeed Almighty, All-Wise"},{"SurahNumber":2,"VerseNumber":210,"Text":"Are they waiting for God ˹Himself˺ to come to them in the shade of clouds, along with the angels? ˹If He did˺, then the matter would be settled ˹at once˺. And to God ˹all˺ matters will be returned ˹for judgment˺"},{"SurahNumber":2,"VerseNumber":211,"Text":"Ask the Children of Israel how many clear signs We have given them. And whoever trades God’s favour—after receiving it—˹for disbelief˺ should know that God is indeed severe in punishment"},{"SurahNumber":2,"VerseNumber":212,"Text":"The life of this world has been made appealing to the disbelievers, and they mock the believers. Those who are mindful ˹of God˺ will rank above them on the Day of Judgment. And God provides for whoever He wills without limit"},{"SurahNumber":2,"VerseNumber":213,"Text":"Humanity had once been one community ˹of believers before they lost faith˺. Then God raised prophets as deliverers of good news and as warners, and revealed to them the Scriptures in truth to judge among people regarding their disputes. And no one disputed the Scriptures except the very people who received them after clear proofs had come to them—out of jealousy. Then God, by His grace, has guided the believers to the truth regarding those disputes. And God guides whoever He wills to the Straight Path"},{"SurahNumber":2,"VerseNumber":214,"Text":"Do you think you will be admitted into Paradise without being tested like those before you? They were afflicted with suffering and adversity and were so ˹violently˺ shaken that ˹even˺ the Messenger and the believers with him cried out, “When will God’s help come?” Indeed, God’s help is ˹always˺ near"},{"SurahNumber":2,"VerseNumber":215,"Text":"They ask you ˹O Prophet in˺ what ˹way˺ they should donate. Say, “Whatever donations you give are for parents, relatives, orphans, the poor, and ˹needy˺ travellers. Whatever good you do is certainly well known to God.”"},{"SurahNumber":2,"VerseNumber":216,"Text":"Fighting has been made obligatory upon you ˹believers˺, though you dislike it. Perhaps you dislike something which is good for you and like something which is bad for you. God knows and you do not know"},{"SurahNumber":2,"VerseNumber":217,"Text":"They ask you ˹O Prophet˺ about fighting in the sacred months. Say, “Fighting during these months is a great sin. But hindering ˹others˺ from the Path of God, rejecting Him, and expelling the worshippers from the Sacred Mosque is ˹a˺ greater ˹sin˺ in the sight of God. For persecution is far worse than killing. And they will not stop fighting you until they turn you away from your faith—if they can. And whoever among you renounces their own faith and dies a disbeliever, their deeds will become void in this life and in the Hereafter. It is they who will be the residents of the Fire. They will be there forever.”"},{"SurahNumber":2,"VerseNumber":218,"Text":"Surely those who have believed, emigrated, and struggled in the Way of God—they can hope for God’s mercy. And God is All-Forgiving, Most Merciful"},{"SurahNumber":2,"VerseNumber":219,"Text":"They ask you ˹O Prophet˺ about intoxicants and gambling. Say, “There is great evil in both, as well as some benefit for people—but the evil outweighs the benefit.” They ˹also˺ ask you ˹O Prophet˺ what they should donate. Say, “Whatever you can spare.” This is how God makes His revelations clear to you ˹believers˺, so perhaps you may reflect"},{"SurahNumber":2,"VerseNumber":220,"Text":"upon this world and the Hereafter. And they ask you ˹O Prophet˺ concerning orphans. Say, “Improving their condition is best. And if you partner with them, they are bonded with you ˹in faith˺. And God knows who intends harm and who intends good. Had God willed, He could have made it difficult for you. Surely God is Almighty, All-Wise.”"},{"SurahNumber":2,"VerseNumber":221,"Text":"Do not marry polytheistic women until they believe; for a believing slave-woman is better than a free polytheist, even though she may look pleasant to you. And do not marry your women to polytheistic men until they believe, for a believing slave-man is better than a free polytheist, even though he may look pleasant to you. They invite ˹you˺ to the Fire while God invites ˹you˺ to Paradise and forgiveness by His grace. He makes His revelations clear to the people so perhaps they will be mindful"},{"SurahNumber":2,"VerseNumber":222,"Text":"They ask you ˹O Prophet˺ about menstruation. Say, “Beware of its harm! So keep away, and do not have intercourse with your wives during their monthly cycles until they are purified. When they purify themselves, then you may approach them in the manner specified by God. Surely God loves those who always turn to Him in repentance and those who purify themselves.”"},{"SurahNumber":2,"VerseNumber":223,"Text":"Your wives are like farmland for you, so approach them ˹consensually˺ as you please. And send forth something good for yourselves. Be mindful of God, and know that you will meet Him. And give good news to the believers"},{"SurahNumber":2,"VerseNumber":224,"Text":"Do not use God’s Name in your oaths as an excuse for not doing good, not guarding against evil, or not making peace between people. And God is All-Hearing, All-Knowing"},{"SurahNumber":2,"VerseNumber":225,"Text":"God will not hold you accountable for unintentional oaths, but for what you intended in your hearts. And God is All-Forgiving, Most Forbearing"},{"SurahNumber":2,"VerseNumber":226,"Text":"Those who swear not to have intercourse with their wives must wait for four months. If they change their mind, then God is certainly All-Forgiving, Most Merciful"},{"SurahNumber":2,"VerseNumber":227,"Text":"But if they settle on divorce, then God is indeed All-Hearing, All-Knowing"},{"SurahNumber":2,"VerseNumber":228,"Text":"Divorced women must wait three monthly cycles ˹before they can re-marry˺. It is not lawful for them to conceal what God has created in their wombs, if they ˹truly˺ believe in God and the Last Day. And their husbands reserve the right to take them back within that period if they desire reconciliation. Women have rights similar to those of men equitably, although men have a degree ˹of responsibility˺ above them. And God is Almighty, All-Wise"},{"SurahNumber":2,"VerseNumber":229,"Text":"Divorce may be retracted twice, then the husband must retain ˹his wife˺ with honour or separate ˹from her˺ with grace. It is not lawful for husbands to take back anything of the dowry given to their wives, unless the couple fears not being able to keep within the limits of God. So if you fear they will not be able to keep within the limits of God, there is no blame if the wife compensates the husband to obtain divorce. These are the limits set by God, so do not transgress them. And whoever transgresses the limits of God, they are the ˹true˺ wrongdoers"},{"SurahNumber":2,"VerseNumber":230,"Text":"So if a husband divorces his wife ˹three times˺, then it is not lawful for him to remarry her until after she has married another man and then is divorced. Then it is permissible for them to reunite, as long as they feel they are able to maintain the limits of God. These are the limits set by God, which He makes clear for people of knowledge"},{"SurahNumber":2,"VerseNumber":231,"Text":"When you divorce women and they have ˹almost˺ reached the end of their waiting period, either retain them honourably or let them go honourably. But do not retain them ˹only˺ to harm them ˹or˺ to take advantage ˹of them˺. Whoever does that surely wrongs his own soul. Do not take God’s revelations lightly. Remember God’s favours upon you as well as the Book and wisdom He has sent down for your guidance. Be mindful of God, and know that God has ˹perfect˺ knowledge of all things"},{"SurahNumber":2,"VerseNumber":232,"Text":"When you have divorced women and they have reached the end of their waiting period, do not prevent them from re-marrying their ex-husbands if they come to an honourable agreement. This is enjoined on whoever has faith in God and the Last Day. This is purer and more dignifying for you. God knows and you do not know"},{"SurahNumber":2,"VerseNumber":233,"Text":"˹Divorced˺ mothers will breastfeed their offspring for two whole years, for those who wish to complete the nursing ˹of their child˺. The child’s father will provide reasonable maintenance and clothing for the mother ˹during that period˺. No one will be charged with more than they can bear. No mother or father should be made to suffer for their child. The ˹father’s˺ heirs are under the same obligation. But if both sides decide—after mutual consultation and consent—to wean a child, then there is no blame on them. If you decide to have your children nursed by a wet-nurse, it is permissible as long as you pay fairly. Be mindful of God, and know that God is All-Seeing of what you do"},{"SurahNumber":2,"VerseNumber":234,"Text":"As for those of you who die and leave widows behind, let them observe a waiting period of four months and ten days. When they have reached the end of this period, then you are not accountable for what they decide for themselves in a reasonable manner. And God is All-Aware of what you do"},{"SurahNumber":2,"VerseNumber":235,"Text":"There is no blame on you for subtly showing interest in ˹divorced or widowed˺ women or for hiding ˹the intention˺ in your hearts. God knows that you are considering them ˹for marriage˺. But do not make a secret commitment with them—you can only show interest in them appropriately. Do not commit to the bond of marriage until the waiting period expires. Know that God is aware of what is in your hearts, so beware of Him. And know that God is All-Forgiving, Most Forbearing"},{"SurahNumber":2,"VerseNumber":236,"Text":"There is no blame if you divorce women before the marriage is consummated or the dowry is settled. But give them a ˹suitable˺ compensation—the rich according to his means and the poor according to his. A reasonable compensation is an obligation on the good-doers"},{"SurahNumber":2,"VerseNumber":237,"Text":"And if you divorce them before consummating the marriage but after deciding on a dowry, pay half of the dowry, unless the wife graciously waives it or the husband graciously pays in full. Graciousness is closer to righteousness. And do not forget kindness among yourselves. Surely God is All-Seeing of what you do"},{"SurahNumber":2,"VerseNumber":238,"Text":"Observe the ˹five obligatory˺ prayers—especially the middle prayer—and stand in true devotion to God"},{"SurahNumber":2,"VerseNumber":239,"Text":"If you are in danger, pray on foot or while riding. But when you are safe, ˹take time to˺ remember God for teaching you what you did not know"},{"SurahNumber":2,"VerseNumber":240,"Text":"Those of you who die leaving widows should bequeath for them a year’s maintenance without forcing them out. But if they choose to leave, you are not accountable for what they reasonably decide for themselves. And God is Almighty, All-Wise"},{"SurahNumber":2,"VerseNumber":241,"Text":"Reasonable provisions must be made for divorced women—a duty on those mindful ˹of God˺"},{"SurahNumber":2,"VerseNumber":242,"Text":"This is how God makes His revelations clear to you, so perhaps you will understand"},{"SurahNumber":2,"VerseNumber":243,"Text":"Have you ˹O Prophet˺ not seen those who fled their homes in the thousands for fear of death? God said to them, “Die!” then He gave them life. Surely God is ever Bountiful to humanity, but most people are ungrateful"},{"SurahNumber":2,"VerseNumber":244,"Text":"Fight in the cause of God, and know that God is All-Hearing, All-Knowing"},{"SurahNumber":2,"VerseNumber":245,"Text":"Who will lend to God a good loan which God will multiply many times over? It is God ˹alone˺ who decreases and increases ˹wealth˺. And to Him you will ˹all˺ be returned"},{"SurahNumber":2,"VerseNumber":246,"Text":"Have you not seen those chiefs of the Children of Israel after Moses? They said to one of their prophets, “Appoint for us a king, ˹and˺ we will fight in the cause of God.” He said, “Are you not going to cower if ordered to fight?” They replied, “How could we refuse to fight in the cause of God, while we were driven out of our homes and ˹separated from˺ our children?” But when they were ordered to fight, they fled, except for a few of them. And God has ˹perfect˺ knowledge of the wrongdoers"},{"SurahNumber":2,"VerseNumber":247,"Text":"Their prophet told them, “God has appointed Saul to be your king.” They protested, “How can he be our king when some of us are more deserving of kingship than he, and he has not been blessed with vast riches?” He replied, “God has chosen him over you and blessed him with knowledge and stature. God grants kingship to whoever He wills. And God is All-Bountiful, All-Knowing.”"},{"SurahNumber":2,"VerseNumber":248,"Text":"Their prophet further told them, “The sign of Saul’s kingship is that the Ark will come to you—containing reassurance from your Lord and relics of the family of Moses and the family of Aaron, which will be carried by the angels. Surely in this is a sign for you, if you ˹truly˺ believe.”"},{"SurahNumber":2,"VerseNumber":249,"Text":"When Saul marched forth with his army, he cautioned: “God will test you with a river. So whoever drinks ˹his fill˺ from it is not with me, and whoever does not taste it—except a sip from the hollow of his hands—is definitely with me.” They all drank ˹their fill˺ except for a few! When he and the ˹remaining˺ faithful with him crossed the river, they said, “Now we are no match for Goliath and his warriors.” But those ˹believers˺ who were certain they would meet God reasoned, “How many times has a small force vanquished a mighty army by the Will of God! And God is ˹always˺ with the steadfast.”"},{"SurahNumber":2,"VerseNumber":250,"Text":"When they advanced to face Goliath and his warriors, they prayed, “Our Lord! Shower us with perseverance, make our steps firm, and give us victory over the disbelieving people.”"},{"SurahNumber":2,"VerseNumber":251,"Text":"So they defeated them by God’s Will, and David killed Goliath. And God blessed David with kingship and wisdom and taught him what He willed. Had God not repelled a group of people by ˹the might of˺ another, corruption would have dominated the earth, but God is Gracious to all"},{"SurahNumber":2,"VerseNumber":252,"Text":"These are God’s revelations which We recite to you ˹O Prophet˺ in truth. And you are truly one of the messengers"},{"SurahNumber":2,"VerseNumber":253,"Text":"We have chosen some of those messengers above others. God spoke directly to some, and raised some high in rank. To Jesus, son of Mary, We gave clear proofs and supported him with the holy spirit. If God had willed, succeeding generations would not have fought ˹among themselves˺ after receiving the clear proofs. But they differed—some believed while others disbelieved. Yet if God had willed, they would not have fought one another. But God does what He wills"},{"SurahNumber":2,"VerseNumber":254,"Text":"O believers! Donate from what We have provided for you before the arrival of a Day when there will be no bargaining, friendship, or intercession. Those who disbelieve are ˹truly˺ the wrongdoers"},{"SurahNumber":2,"VerseNumber":255,"Text":"God! There is no god ˹worthy of worship˺ except Him, the Ever-Living, All-Sustaining. Neither drowsiness nor sleep overtakes Him. To Him belongs whatever is in the heavens and whatever is on the earth. Who could possibly intercede with Him without His permission? He ˹fully˺ knows what is ahead of them and what is behind them, but no one can grasp any of His knowledge—except what He wills ˹to reveal˺. His Seat encompasses the heavens and the earth, and the preservation of both does not tire Him. For He is the Most High, the Greatest"},{"SurahNumber":2,"VerseNumber":256,"Text":"Let there be no compulsion in religion, for the truth stands out clearly from falsehood. So whoever renounces false gods and believes in God has certainly grasped the firmest, unfailing hand-hold. And God is All-Hearing, All-Knowing"},{"SurahNumber":2,"VerseNumber":257,"Text":"God is the Guardian of the believers—He brings them out of darkness and into light. As for the disbelievers, their guardians are false gods who lead them out of light and into darkness. It is they who will be the residents of the Fire. They will be there forever"},{"SurahNumber":2,"VerseNumber":258,"Text":"Are you ˹O Prophet˺ not aware of the one who argued with Abraham about his Lord because God had granted him kingship? ˹Remember˺ when Abraham said, “My Lord is the One Who has power to give life and cause death.” He argued, “I too have the power to give life and cause death.” Abraham challenged ˹him˺, “God causes the sun to rise from the east. So make it rise from the west.” And so the disbeliever was dumbstruck. And God does not guide the wrongdoing people"},{"SurahNumber":2,"VerseNumber":259,"Text":"Or ˹are you not aware of˺ the one who passed by a city which was in ruins. He wondered, “How could God bring this back to life after its destruction?” So God caused him to die for a hundred years then brought him back to life. God asked, “How long have you remained ˹in this state˺?” He replied, “Perhaps a day or part of a day.” God said, “No! You have remained here for a hundred years! Just look at your food and drink—they have not spoiled. ˹But now˺ look at ˹the remains of˺ your donkey! And ˹so˺ We have made you into a sign for humanity. And look at the bones ˹of the donkey˺, how We bring them together then clothe them with flesh!” When this was made clear to him, he declared, “˹Now˺ I know that God is Most Capable of everything.”"},{"SurahNumber":2,"VerseNumber":260,"Text":"And ˹remember˺ when Abraham said, “My Lord! Show me how you give life to the dead.” God responded, “Do you not believe?” Abraham replied, “Yes I do, but just so my heart can be reassured.” God said, “Then bring four birds, train them to come to you, ˹then cut them into pieces,˺ and scatter them on different hilltops. Then call them back, they will fly to you in haste. And ˹so you will˺ know that God is Almighty, All-Wise.”"},{"SurahNumber":2,"VerseNumber":261,"Text":"The example of those who spend their wealth in the cause of God is that of a grain that sprouts into seven ears, each bearing one hundred grains. And God multiplies ˹the reward even more˺ to whoever He wills. For God is All-Bountiful, All-Knowing"},{"SurahNumber":2,"VerseNumber":262,"Text":"Those who spend their wealth in the cause of God and do not follow their charity with reminders of their generosity or hurtful words—they will get their reward from their Lord, and there will be no fear for them, nor will they grieve"},{"SurahNumber":2,"VerseNumber":263,"Text":"Kind words and forgiveness are better than charity followed by injury. And God is Self-Sufficient, Most Forbearing"},{"SurahNumber":2,"VerseNumber":264,"Text":"O believers! Do not waste your charity with reminders ˹of your generosity˺ or hurtful words, like those who donate their wealth just to show off and do not believe in God or the Last Day. Their example is that of a hard barren rock covered with a thin layer of soil hit by a strong rain—leaving it just a bare stone. Such people are unable to preserve the reward of their charity. God does not guide ˹such˺ disbelieving people"},{"SurahNumber":2,"VerseNumber":265,"Text":"And the example of those who donate their wealth, seeking God’s pleasure and believing the reward is certain, is that of a garden on a fertile hill: when heavy rain falls, it yields up twice its normal produce. If no heavy rain falls, a drizzle is sufficient. And God is All-Seeing of what you do"},{"SurahNumber":2,"VerseNumber":266,"Text":"Would any of you wish to have a garden with palm trees, grapevines, and all kinds of fruits with rivers flowing underneath and as they grow very old with dependent children, a fiery whirlwind hits the garden, burning it all up? This is how God makes His revelations clear to you, so perhaps you will reflect"},{"SurahNumber":2,"VerseNumber":267,"Text":"O believers! Donate from the best of what you have earned and of what We have produced for you from the earth. Do not pick out worthless things for donation, which you yourselves would only accept with closed eyes. And know that God is Self-Sufficient, Praiseworthy"},{"SurahNumber":2,"VerseNumber":268,"Text":"The Devil threatens you with ˹the prospect of˺ poverty and bids you to the shameful deed ˹of stinginess˺, while God promises you forgiveness and ˹great˺ bounties from Him. And God is All-Bountiful, All-Knowing"},{"SurahNumber":2,"VerseNumber":269,"Text":"God grants wisdom to whoever He wills. And whoever is granted wisdom is certainly blessed with a great privilege. But none will be mindful ˹of this˺ except people of reason"},{"SurahNumber":2,"VerseNumber":270,"Text":"Whatever charities you give or vows you make are surely known to God. And the wrongdoers will have no helpers"},{"SurahNumber":2,"VerseNumber":271,"Text":"To give charity publicly is good, but to give to the poor privately is better for you, and will absolve you of your sins. And God is All-Aware of what you do"},{"SurahNumber":2,"VerseNumber":272,"Text":"You are not responsible for people’s guidance ˹O Prophet˺—it is God Who guides whoever He wills. Whatever you ˹believers˺ spend in charity, it is for your own good—as long as you do so seeking the pleasure of God. Whatever you donate will be paid back to you in full, and you will not be wronged"},{"SurahNumber":2,"VerseNumber":273,"Text":"˹Charity is˺ for the needy who are too engaged in the cause of God to move about in the land ˹for work˺. Those unfamiliar with their situation will think they are not in need ˹of charity˺ because they do not beg. You can recognize them by their appearance. They do not beg people persistently. Whatever you give in charity is certainly well known to God"},{"SurahNumber":2,"VerseNumber":274,"Text":"Those who spend their wealth in charity day and night, secretly and openly—their reward is with their Lord, and there will be no fear for them, nor will they grieve"},{"SurahNumber":2,"VerseNumber":275,"Text":"Those who consume interest will stand ˹on Judgment Day˺ like those driven to madness by Satan’s touch. That is because they say, “Trade is no different than interest.” But God has permitted trading and forbidden interest. Whoever refrains—after having received warning from their Lord—may keep their previous gains, and their case is left to God. As for those who persist, it is they who will be the residents of the Fire. They will be there forever"},{"SurahNumber":2,"VerseNumber":276,"Text":"God has made interest fruitless and charity fruitful. And God does not like any ungrateful evildoer"},{"SurahNumber":2,"VerseNumber":277,"Text":"Indeed, those who believe, do good, establish prayer, and pay alms-tax will receive their reward from their Lord, and there will be no fear for them, nor will they grieve"},{"SurahNumber":2,"VerseNumber":278,"Text":"O believers! Fear God, and give up outstanding interest if you are ˹true˺ believers"},{"SurahNumber":2,"VerseNumber":279,"Text":"If you do not, then beware of a war with God and His Messenger! But if you repent, you may retain your principal—neither inflicting nor suffering harm"},{"SurahNumber":2,"VerseNumber":280,"Text":"If it is difficult for someone to repay a debt, postpone it until a time of ease. And if you waive it as an act of charity, it will be better for you, if only you knew"},{"SurahNumber":2,"VerseNumber":281,"Text":"Be mindful of the Day when you will ˹all˺ be returned to God, then every soul will be paid in full for what it has done, and none will be wronged"},{"SurahNumber":2,"VerseNumber":282,"Text":"O believers! When you contract a loan for a fixed period of time, commit it to writing. Let the scribe maintain justice between the parties. The scribe should not refuse to write as God has taught them to write. They will write what the debtor dictates, bearing God in mind and not defrauding the debt. If the debtor is incompetent, weak, or unable to dictate, let their guardian dictate for them with justice. Call upon two of your men to witness. If two men cannot be found, then one man and two women of your choice will witness—so if one of the women forgets the other may remind her. The witnesses must not refuse when they are summoned. You must not be against writing ˹contracts˺ for a fixed period—whether the sum is small or great. This is more just ˹for you˺ in the sight of God, and more convenient to establish evidence and remove doubts. However, if you conduct an immediate transaction among yourselves, then there is no need for you to record it, but call upon witnesses when a deal is finalized. Let no harm come to the scribe or witnesses. If you do, then you have gravely exceeded ˹your limits˺. Be mindful of God, for God ˹is the One Who˺ teaches you. And God has ˹perfect˺ knowledge of all things"},{"SurahNumber":2,"VerseNumber":283,"Text":"If you are on a journey and a scribe cannot be found, then a security can be taken. If you trust one another, then ˹there is no need for a security, but˺ the debtor should honour this trust ˹by repaying the debt˺—and let them fear God, their Lord. And do not conceal the testimony, for whoever conceals it, their hearts are indeed sinful. And God ˹fully˺ knows what you do"},{"SurahNumber":2,"VerseNumber":284,"Text":"To God ˹alone˺ belongs whatever is in the heavens and whatever is on the earth. Whether you reveal what is in your hearts or conceal it, God will call you to account for it. He forgives whoever He wills, and punishes whoever He wills. And God is Most Capable of everything"},{"SurahNumber":2,"VerseNumber":285,"Text":"The Messenger ˹firmly˺ believes in what has been revealed to him from his Lord, and so do the believers. They ˹all˺ believe in God, His angels, His Books, and His messengers. ˹They proclaim,˺ “We make no distinction between any of His messengers.” And they say, “We hear and obey. ˹We seek˺ Your forgiveness, our Lord! And to You ˹alone˺ is the final return.”"},{"SurahNumber":2,"VerseNumber":286,"Text":"God does not require of any soul more than what it can afford. All good will be for its own benefit, and all evil will be to its own loss. ˹The believers pray,˺ “Our Lord! Do not punish us if we forget or make a mistake. Our Lord! Do not place a burden on us like the one you placed on those before us. Our Lord! Do not burden us with what we cannot bear. Pardon us, forgive us, and have mercy on us. You are our ˹only˺ Guardian. So grant us victory over the disbelieving people.”"}]}]}