{"SurahNumber":21,"HasBismillah":true,"Verses":[{"SurahNumber":21,"VerseNumber":1,"Text":"ٱقۡتَرَبَ لِلنَّاسِ حِسَابُهُمۡ وَهُمۡ فِي غَفۡلَةٖ مُّعۡرِضُونَ","End":"١"},{"SurahNumber":21,"VerseNumber":2,"Text":"مَا يَأۡتِيهِم مِّن ذِكۡرٖ مِّن رَّبِّهِم مُّحۡدَثٍ إِلَّا ٱسۡتَمَعُوهُ وَهُمۡ يَلۡعَبُونَ","End":"٢"},{"SurahNumber":21,"VerseNumber":3,"Text":"لَاهِيَةٗ قُلُوبُهُمۡۗ وَأَسَرُّواْ ٱلنَّجۡوَى ٱلَّذِينَ ظَلَمُواْ هَلۡ هَٰذَآ إِلَّا بَشَرٞ مِّثۡلُكُمۡۖ أَفَتَأۡتُونَ ٱلسِّحۡرَ وَأَنتُمۡ تُبۡصِرُونَ","End":"٣"},{"SurahNumber":21,"VerseNumber":4,"Text":"قَالَ رَبِّي يَعۡلَمُ ٱلۡقَوۡلَ فِي ٱلسَّمَآءِ وَٱلۡأَرۡضِۖ وَهُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ","End":"٤"},{"SurahNumber":21,"VerseNumber":5,"Text":"بَلۡ قَالُوٓاْ أَضۡغَٰثُ أَحۡلَٰمِۭ بَلِ ٱفۡتَرَىٰهُ بَلۡ هُوَ شَاعِرٞ فَلۡيَأۡتِنَا بِـَٔايَةٖ كَمَآ أُرۡسِلَ ٱلۡأَوَّلُونَ","End":"٥"},{"SurahNumber":21,"VerseNumber":6,"Text":"مَآ ءَامَنَتۡ قَبۡلَهُم مِّن قَرۡيَةٍ أَهۡلَكۡنَٰهَآۖ أَفَهُمۡ يُؤۡمِنُونَ","End":"٦"},{"SurahNumber":21,"VerseNumber":7,"Text":"وَمَآ أَرۡسَلۡنَا قَبۡلَكَ إِلَّا رِجَالٗا نُّوحِيٓ إِلَيۡهِمۡۖ فَسۡـَٔلُوٓاْ أَهۡلَ ٱلذِّكۡرِ إِن كُنتُمۡ لَا تَعۡلَمُونَ","End":"٧"},{"SurahNumber":21,"VerseNumber":8,"Text":"وَمَا جَعَلۡنَٰهُمۡ جَسَدٗا لَّا يَأۡكُلُونَ ٱلطَّعَامَ وَمَا كَانُواْ خَٰلِدِينَ","End":"٨"},{"SurahNumber":21,"VerseNumber":9,"Text":"ثُمَّ صَدَقۡنَٰهُمُ ٱلۡوَعۡدَ فَأَنجَيۡنَٰهُمۡ وَمَن نَّشَآءُ وَأَهۡلَكۡنَا ٱلۡمُسۡرِفِينَ","End":"٩"},{"SurahNumber":21,"VerseNumber":10,"Text":"لَقَدۡ أَنزَلۡنَآ إِلَيۡكُمۡ كِتَٰبٗا فِيهِ ذِكۡرُكُمۡۚ أَفَلَا تَعۡقِلُونَ","End":"١٠"},{"SurahNumber":21,"VerseNumber":11,"Text":"وَكَمۡ قَصَمۡنَا مِن قَرۡيَةٖ كَانَتۡ ظَالِمَةٗ وَأَنشَأۡنَا بَعۡدَهَا قَوۡمًا ءَاخَرِينَ","End":"١١"},{"SurahNumber":21,"VerseNumber":12,"Text":"فَلَمَّآ أَحَسُّواْ بَأۡسَنَآ إِذَا هُم مِّنۡهَا يَرۡكُضُونَ","End":"١٢"},{"SurahNumber":21,"VerseNumber":13,"Text":"لَا تَرۡكُضُواْ وَٱرۡجِعُوٓاْ إِلَىٰ مَآ أُتۡرِفۡتُمۡ فِيهِ وَمَسَٰكِنِكُمۡ لَعَلَّكُمۡ تُسۡـَٔلُونَ","End":"١٣"},{"SurahNumber":21,"VerseNumber":14,"Text":"قَالُواْ يَٰوَيۡلَنَآ إِنَّا كُنَّا ظَٰلِمِينَ","End":"١٤"},{"SurahNumber":21,"VerseNumber":15,"Text":"فَمَا زَالَت تِّلۡكَ دَعۡوَىٰهُمۡ حَتَّىٰ جَعَلۡنَٰهُمۡ حَصِيدًا خَٰمِدِينَ","End":"١٥"},{"SurahNumber":21,"VerseNumber":16,"Text":"وَمَا خَلَقۡنَا ٱلسَّمَآءَ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَا لَٰعِبِينَ","End":"١٦"},{"SurahNumber":21,"VerseNumber":17,"Text":"لَوۡ أَرَدۡنَآ أَن نَّتَّخِذَ لَهۡوٗا لَّٱتَّخَذۡنَٰهُ مِن لَّدُنَّآ إِن كُنَّا فَٰعِلِينَ","End":"١٧"},{"SurahNumber":21,"VerseNumber":18,"Text":"بَلۡ نَقۡذِفُ بِٱلۡحَقِّ عَلَى ٱلۡبَٰطِلِ فَيَدۡمَغُهُۥ فَإِذَا هُوَ زَاهِقٞۚ وَلَكُمُ ٱلۡوَيۡلُ مِمَّا تَصِفُونَ","End":"١٨"},{"SurahNumber":21,"VerseNumber":19,"Text":"وَلَهُۥ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَمَنۡ عِندَهُۥ لَا يَسۡتَكۡبِرُونَ عَنۡ عِبَادَتِهِۦ وَلَا يَسۡتَحۡسِرُونَ","End":"١٩"},{"SurahNumber":21,"VerseNumber":20,"Text":"يُسَبِّحُونَ ٱلَّيۡلَ وَٱلنَّهَارَ لَا يَفۡتُرُونَ","End":"٢٠"},{"SurahNumber":21,"VerseNumber":21,"Text":"أَمِ ٱتَّخَذُوٓاْ ءَالِهَةٗ مِّنَ ٱلۡأَرۡضِ هُمۡ يُنشِرُونَ","End":"٢١"},{"SurahNumber":21,"VerseNumber":22,"Text":"لَوۡ كَانَ فِيهِمَآ ءَالِهَةٌ إِلَّا ٱللَّهُ لَفَسَدَتَاۚ فَسُبۡحَٰنَ ٱللَّهِ رَبِّ ٱلۡعَرۡشِ عَمَّا يَصِفُونَ","End":"٢٢"},{"SurahNumber":21,"VerseNumber":23,"Text":"لَا يُسۡـَٔلُ عَمَّا يَفۡعَلُ وَهُمۡ يُسۡـَٔلُونَ","End":"٢٣"},{"SurahNumber":21,"VerseNumber":24,"Text":"أَمِ ٱتَّخَذُواْ مِن دُونِهِۦٓ ءَالِهَةٗۖ قُلۡ هَاتُواْ بُرۡهَٰنَكُمۡۖ هَٰذَا ذِكۡرُ مَن مَّعِيَ وَذِكۡرُ مَن قَبۡلِيۚ بَلۡ أَكۡثَرُهُمۡ لَا يَعۡلَمُونَ ٱلۡحَقَّۖ فَهُم مُّعۡرِضُونَ","End":"٢٤"},{"SurahNumber":21,"VerseNumber":25,"Text":"وَمَآ أَرۡسَلۡنَا مِن قَبۡلِكَ مِن رَّسُولٍ إِلَّا نُوحِيٓ إِلَيۡهِ أَنَّهُۥ لَآ إِلَٰهَ إِلَّآ أَنَا۠ فَٱعۡبُدُونِ","End":"٢٥"},{"SurahNumber":21,"VerseNumber":26,"Text":"وَقَالُواْ ٱتَّخَذَ ٱلرَّحۡمَٰنُ وَلَدٗاۗ سُبۡحَٰنَهُۥۚ بَلۡ عِبَادٞ مُّكۡرَمُونَ","End":"٢٦"},{"SurahNumber":21,"VerseNumber":27,"Text":"لَا يَسۡبِقُونَهُۥ بِٱلۡقَوۡلِ وَهُم بِأَمۡرِهِۦ يَعۡمَلُونَ","End":"٢٧"},{"SurahNumber":21,"VerseNumber":28,"Text":"يَعۡلَمُ مَا بَيۡنَ أَيۡدِيهِمۡ وَمَا خَلۡفَهُمۡ وَلَا يَشۡفَعُونَ إِلَّا لِمَنِ ٱرۡتَضَىٰ وَهُم مِّنۡ خَشۡيَتِهِۦ مُشۡفِقُونَ","End":"٢٨"},{"SurahNumber":21,"VerseNumber":29,"Text":"۞وَمَن يَقُلۡ مِنۡهُمۡ إِنِّيٓ إِلَٰهٞ مِّن دُونِهِۦ فَذَٰلِكَ نَجۡزِيهِ جَهَنَّمَۚ كَذَٰلِكَ نَجۡزِي ٱلظَّـٰلِمِينَ","End":"٢٩"},{"SurahNumber":21,"VerseNumber":30,"Text":"أَوَلَمۡ يَرَ ٱلَّذِينَ كَفَرُوٓاْ أَنَّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ كَانَتَا رَتۡقٗا فَفَتَقۡنَٰهُمَاۖ وَجَعَلۡنَا مِنَ ٱلۡمَآءِ كُلَّ شَيۡءٍ حَيٍّۚ أَفَلَا يُؤۡمِنُونَ","End":"٣٠"},{"SurahNumber":21,"VerseNumber":31,"Text":"وَجَعَلۡنَا فِي ٱلۡأَرۡضِ رَوَٰسِيَ أَن تَمِيدَ بِهِمۡ وَجَعَلۡنَا فِيهَا فِجَاجٗا سُبُلٗا لَّعَلَّهُمۡ يَهۡتَدُونَ","End":"٣١"},{"SurahNumber":21,"VerseNumber":32,"Text":"وَجَعَلۡنَا ٱلسَّمَآءَ سَقۡفٗا مَّحۡفُوظٗاۖ وَهُمۡ عَنۡ ءَايَٰتِهَا مُعۡرِضُونَ","End":"٣٢"},{"SurahNumber":21,"VerseNumber":33,"Text":"وَهُوَ ٱلَّذِي خَلَقَ ٱلَّيۡلَ وَٱلنَّهَارَ وَٱلشَّمۡسَ وَٱلۡقَمَرَۖ كُلّٞ فِي فَلَكٖ يَسۡبَحُونَ","End":"٣٣"},{"SurahNumber":21,"VerseNumber":34,"Text":"وَمَا جَعَلۡنَا لِبَشَرٖ مِّن قَبۡلِكَ ٱلۡخُلۡدَۖ أَفَإِيْن مِّتَّ فَهُمُ ٱلۡخَٰلِدُونَ","End":"٣٤"},{"SurahNumber":21,"VerseNumber":35,"Text":"كُلُّ نَفۡسٖ ذَآئِقَةُ ٱلۡمَوۡتِۗ وَنَبۡلُوكُم بِٱلشَّرِّ وَٱلۡخَيۡرِ فِتۡنَةٗۖ وَإِلَيۡنَا تُرۡجَعُونَ","End":"٣٥"},{"SurahNumber":21,"VerseNumber":36,"Text":"وَإِذَا رَءَاكَ ٱلَّذِينَ كَفَرُوٓاْ إِن يَتَّخِذُونَكَ إِلَّا هُزُوًا أَهَٰذَا ٱلَّذِي يَذۡكُرُ ءَالِهَتَكُمۡ وَهُم بِذِكۡرِ ٱلرَّحۡمَٰنِ هُمۡ كَٰفِرُونَ","End":"٣٦"},{"SurahNumber":21,"VerseNumber":37,"Text":"خُلِقَ ٱلۡإِنسَٰنُ مِنۡ عَجَلٖۚ سَأُوْرِيكُمۡ ءَايَٰتِي فَلَا تَسۡتَعۡجِلُونِ","End":"٣٧"},{"SurahNumber":21,"VerseNumber":38,"Text":"وَيَقُولُونَ مَتَىٰ هَٰذَا ٱلۡوَعۡدُ إِن كُنتُمۡ صَٰدِقِينَ","End":"٣٨"},{"SurahNumber":21,"VerseNumber":39,"Text":"لَوۡ يَعۡلَمُ ٱلَّذِينَ كَفَرُواْ حِينَ لَا يَكُفُّونَ عَن وُجُوهِهِمُ ٱلنَّارَ وَلَا عَن ظُهُورِهِمۡ وَلَا هُمۡ يُنصَرُونَ","End":"٣٩"},{"SurahNumber":21,"VerseNumber":40,"Text":"بَلۡ تَأۡتِيهِم بَغۡتَةٗ فَتَبۡهَتُهُمۡ فَلَا يَسۡتَطِيعُونَ رَدَّهَا وَلَا هُمۡ يُنظَرُونَ","End":"٤٠"},{"SurahNumber":21,"VerseNumber":41,"Text":"وَلَقَدِ ٱسۡتُهۡزِئَ بِرُسُلٖ مِّن قَبۡلِكَ فَحَاقَ بِٱلَّذِينَ سَخِرُواْ مِنۡهُم مَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ","End":"٤١"},{"SurahNumber":21,"VerseNumber":42,"Text":"قُلۡ مَن يَكۡلَؤُكُم بِٱلَّيۡلِ وَٱلنَّهَارِ مِنَ ٱلرَّحۡمَٰنِۚ بَلۡ هُمۡ عَن ذِكۡرِ رَبِّهِم مُّعۡرِضُونَ","End":"٤٢"},{"SurahNumber":21,"VerseNumber":43,"Text":"أَمۡ لَهُمۡ ءَالِهَةٞ تَمۡنَعُهُم مِّن دُونِنَاۚ لَا يَسۡتَطِيعُونَ نَصۡرَ أَنفُسِهِمۡ وَلَا هُم مِّنَّا يُصۡحَبُونَ","End":"٤٣"},{"SurahNumber":21,"VerseNumber":44,"Text":"بَلۡ مَتَّعۡنَا هَـٰٓؤُلَآءِ وَءَابَآءَهُمۡ حَتَّىٰ طَالَ عَلَيۡهِمُ ٱلۡعُمُرُۗ أَفَلَا يَرَوۡنَ أَنَّا نَأۡتِي ٱلۡأَرۡضَ نَنقُصُهَا مِنۡ أَطۡرَافِهَآۚ أَفَهُمُ ٱلۡغَٰلِبُونَ","End":"٤٤"},{"SurahNumber":21,"VerseNumber":45,"Text":"قُلۡ إِنَّمَآ أُنذِرُكُم بِٱلۡوَحۡيِۚ وَلَا يَسۡمَعُ ٱلصُّمُّ ٱلدُّعَآءَ إِذَا مَا يُنذَرُونَ","End":"٤٥"},{"SurahNumber":21,"VerseNumber":46,"Text":"وَلَئِن مَّسَّتۡهُمۡ نَفۡحَةٞ مِّنۡ عَذَابِ رَبِّكَ لَيَقُولُنَّ يَٰوَيۡلَنَآ إِنَّا كُنَّا ظَٰلِمِينَ","End":"٤٦"},{"SurahNumber":21,"VerseNumber":47,"Text":"وَنَضَعُ ٱلۡمَوَٰزِينَ ٱلۡقِسۡطَ لِيَوۡمِ ٱلۡقِيَٰمَةِ فَلَا تُظۡلَمُ نَفۡسٞ شَيۡـٔٗاۖ وَإِن كَانَ مِثۡقَالَ حَبَّةٖ مِّنۡ خَرۡدَلٍ أَتَيۡنَا بِهَاۗ وَكَفَىٰ بِنَا حَٰسِبِينَ","End":"٤٧"},{"SurahNumber":21,"VerseNumber":48,"Text":"وَلَقَدۡ ءَاتَيۡنَا مُوسَىٰ وَهَٰرُونَ ٱلۡفُرۡقَانَ وَضِيَآءٗ وَذِكۡرٗا لِّلۡمُتَّقِينَ","End":"٤٨"},{"SurahNumber":21,"VerseNumber":49,"Text":"ٱلَّذِينَ يَخۡشَوۡنَ رَبَّهُم بِٱلۡغَيۡبِ وَهُم مِّنَ ٱلسَّاعَةِ مُشۡفِقُونَ","End":"٤٩"},{"SurahNumber":21,"VerseNumber":50,"Text":"وَهَٰذَا ذِكۡرٞ مُّبَارَكٌ أَنزَلۡنَٰهُۚ أَفَأَنتُمۡ لَهُۥ مُنكِرُونَ","End":"٥٠"},{"SurahNumber":21,"VerseNumber":51,"Text":"۞وَلَقَدۡ ءَاتَيۡنَآ إِبۡرَٰهِيمَ رُشۡدَهُۥ مِن قَبۡلُ وَكُنَّا بِهِۦ عَٰلِمِينَ","End":"٥١"},{"SurahNumber":21,"VerseNumber":52,"Text":"إِذۡ قَالَ لِأَبِيهِ وَقَوۡمِهِۦ مَا هَٰذِهِ ٱلتَّمَاثِيلُ ٱلَّتِيٓ أَنتُمۡ لَهَا عَٰكِفُونَ","End":"٥٢"},{"SurahNumber":21,"VerseNumber":53,"Text":"قَالُواْ وَجَدۡنَآ ءَابَآءَنَا لَهَا عَٰبِدِينَ","End":"٥٣"},{"SurahNumber":21,"VerseNumber":54,"Text":"قَالَ لَقَدۡ كُنتُمۡ أَنتُمۡ وَءَابَآؤُكُمۡ فِي ضَلَٰلٖ مُّبِينٖ","End":"٥٤"},{"SurahNumber":21,"VerseNumber":55,"Text":"قَالُوٓاْ أَجِئۡتَنَا بِٱلۡحَقِّ أَمۡ أَنتَ مِنَ ٱللَّـٰعِبِينَ","End":"٥٥"},{"SurahNumber":21,"VerseNumber":56,"Text":"قَالَ بَل رَّبُّكُمۡ رَبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ ٱلَّذِي فَطَرَهُنَّ وَأَنَا۠ عَلَىٰ ذَٰلِكُم مِّنَ ٱلشَّـٰهِدِينَ","End":"٥٦"},{"SurahNumber":21,"VerseNumber":57,"Text":"وَتَٱللَّهِ لَأَكِيدَنَّ أَصۡنَٰمَكُم بَعۡدَ أَن تُوَلُّواْ مُدۡبِرِينَ","End":"٥٧"},{"SurahNumber":21,"VerseNumber":58,"Text":"فَجَعَلَهُمۡ جُذَٰذًا إِلَّا كَبِيرٗا لَّهُمۡ لَعَلَّهُمۡ إِلَيۡهِ يَرۡجِعُونَ","End":"٥٨"},{"SurahNumber":21,"VerseNumber":59,"Text":"قَالُواْ مَن فَعَلَ هَٰذَا بِـَٔالِهَتِنَآ إِنَّهُۥ لَمِنَ ٱلظَّـٰلِمِينَ","End":"٥٩"},{"SurahNumber":21,"VerseNumber":60,"Text":"قَالُواْ سَمِعۡنَا فَتٗى يَذۡكُرُهُمۡ يُقَالُ لَهُۥٓ إِبۡرَٰهِيمُ","End":"٦٠"},{"SurahNumber":21,"VerseNumber":61,"Text":"قَالُواْ فَأۡتُواْ بِهِۦ عَلَىٰٓ أَعۡيُنِ ٱلنَّاسِ لَعَلَّهُمۡ يَشۡهَدُونَ","End":"٦١"},{"SurahNumber":21,"VerseNumber":62,"Text":"قَالُوٓاْ ءَأَنتَ فَعَلۡتَ هَٰذَا بِـَٔالِهَتِنَا يَـٰٓإِبۡرَٰهِيمُ","End":"٦٢"},{"SurahNumber":21,"VerseNumber":63,"Text":"قَالَ بَلۡ فَعَلَهُۥ كَبِيرُهُمۡ هَٰذَا فَسۡـَٔلُوهُمۡ إِن كَانُواْ يَنطِقُونَ","End":"٦٣"},{"SurahNumber":21,"VerseNumber":64,"Text":"فَرَجَعُوٓاْ إِلَىٰٓ أَنفُسِهِمۡ فَقَالُوٓاْ إِنَّكُمۡ أَنتُمُ ٱلظَّـٰلِمُونَ","End":"٦٤"},{"SurahNumber":21,"VerseNumber":65,"Text":"ثُمَّ نُكِسُواْ عَلَىٰ رُءُوسِهِمۡ لَقَدۡ عَلِمۡتَ مَا هَـٰٓؤُلَآءِ يَنطِقُونَ","End":"٦٥"},{"SurahNumber":21,"VerseNumber":66,"Text":"قَالَ أَفَتَعۡبُدُونَ مِن دُونِ ٱللَّهِ مَا لَا يَنفَعُكُمۡ شَيۡـٔٗا وَلَا يَضُرُّكُمۡ","End":"٦٦"},{"SurahNumber":21,"VerseNumber":67,"Text":"أُفّٖ لَّكُمۡ وَلِمَا تَعۡبُدُونَ مِن دُونِ ٱللَّهِۚ أَفَلَا تَعۡقِلُونَ","End":"٦٧"},{"SurahNumber":21,"VerseNumber":68,"Text":"قَالُواْ حَرِّقُوهُ وَٱنصُرُوٓاْ ءَالِهَتَكُمۡ إِن كُنتُمۡ فَٰعِلِينَ","End":"٦٨"},{"SurahNumber":21,"VerseNumber":69,"Text":"قُلۡنَا يَٰنَارُ كُونِي بَرۡدٗا وَسَلَٰمًا عَلَىٰٓ إِبۡرَٰهِيمَ","End":"٦٩"},{"SurahNumber":21,"VerseNumber":70,"Text":"وَأَرَادُواْ بِهِۦ كَيۡدٗا فَجَعَلۡنَٰهُمُ ٱلۡأَخۡسَرِينَ","End":"٧٠"},{"SurahNumber":21,"VerseNumber":71,"Text":"وَنَجَّيۡنَٰهُ وَلُوطًا إِلَى ٱلۡأَرۡضِ ٱلَّتِي بَٰرَكۡنَا فِيهَا لِلۡعَٰلَمِينَ","End":"٧١"},{"SurahNumber":21,"VerseNumber":72,"Text":"وَوَهَبۡنَا لَهُۥٓ إِسۡحَٰقَ وَيَعۡقُوبَ نَافِلَةٗۖ وَكُلّٗا جَعَلۡنَا صَٰلِحِينَ","End":"٧٢"},{"SurahNumber":21,"VerseNumber":73,"Text":"وَجَعَلۡنَٰهُمۡ أَئِمَّةٗ يَهۡدُونَ بِأَمۡرِنَا وَأَوۡحَيۡنَآ إِلَيۡهِمۡ فِعۡلَ ٱلۡخَيۡرَٰتِ وَإِقَامَ ٱلصَّلَوٰةِ وَإِيتَآءَ ٱلزَّكَوٰةِۖ وَكَانُواْ لَنَا عَٰبِدِينَ","End":"٧٣"},{"SurahNumber":21,"VerseNumber":74,"Text":"وَلُوطًا ءَاتَيۡنَٰهُ حُكۡمٗا وَعِلۡمٗا وَنَجَّيۡنَٰهُ مِنَ ٱلۡقَرۡيَةِ ٱلَّتِي كَانَت تَّعۡمَلُ ٱلۡخَبَـٰٓئِثَۚ إِنَّهُمۡ كَانُواْ قَوۡمَ سَوۡءٖ فَٰسِقِينَ","End":"٧٤"},{"SurahNumber":21,"VerseNumber":75,"Text":"وَأَدۡخَلۡنَٰهُ فِي رَحۡمَتِنَآۖ إِنَّهُۥ مِنَ ٱلصَّـٰلِحِينَ","End":"٧٥"},{"SurahNumber":21,"VerseNumber":76,"Text":"وَنُوحًا إِذۡ نَادَىٰ مِن قَبۡلُ فَٱسۡتَجَبۡنَا لَهُۥ فَنَجَّيۡنَٰهُ وَأَهۡلَهُۥ مِنَ ٱلۡكَرۡبِ ٱلۡعَظِيمِ","End":"٧٦"},{"SurahNumber":21,"VerseNumber":77,"Text":"وَنَصَرۡنَٰهُ مِنَ ٱلۡقَوۡمِ ٱلَّذِينَ كَذَّبُواْ بِـَٔايَٰتِنَآۚ إِنَّهُمۡ كَانُواْ قَوۡمَ سَوۡءٖ فَأَغۡرَقۡنَٰهُمۡ أَجۡمَعِينَ","End":"٧٧"},{"SurahNumber":21,"VerseNumber":78,"Text":"وَدَاوُۥدَ وَسُلَيۡمَٰنَ إِذۡ يَحۡكُمَانِ فِي ٱلۡحَرۡثِ إِذۡ نَفَشَتۡ فِيهِ غَنَمُ ٱلۡقَوۡمِ وَكُنَّا لِحُكۡمِهِمۡ شَٰهِدِينَ","End":"٧٨"},{"SurahNumber":21,"VerseNumber":79,"Text":"فَفَهَّمۡنَٰهَا سُلَيۡمَٰنَۚ وَكُلًّا ءَاتَيۡنَا حُكۡمٗا وَعِلۡمٗاۚ وَسَخَّرۡنَا مَعَ دَاوُۥدَ ٱلۡجِبَالَ يُسَبِّحۡنَ وَٱلطَّيۡرَۚ وَكُنَّا فَٰعِلِينَ","End":"٧٩"},{"SurahNumber":21,"VerseNumber":80,"Text":"وَعَلَّمۡنَٰهُ صَنۡعَةَ لَبُوسٖ لَّكُمۡ لِتُحۡصِنَكُم مِّنۢ بَأۡسِكُمۡۖ فَهَلۡ أَنتُمۡ شَٰكِرُونَ","End":"٨٠"},{"SurahNumber":21,"VerseNumber":81,"Text":"وَلِسُلَيۡمَٰنَ ٱلرِّيحَ عَاصِفَةٗ تَجۡرِي بِأَمۡرِهِۦٓ إِلَى ٱلۡأَرۡضِ ٱلَّتِي بَٰرَكۡنَا فِيهَاۚ وَكُنَّا بِكُلِّ شَيۡءٍ عَٰلِمِينَ","End":"٨١"},{"SurahNumber":21,"VerseNumber":82,"Text":"وَمِنَ ٱلشَّيَٰطِينِ مَن يَغُوصُونَ لَهُۥ وَيَعۡمَلُونَ عَمَلٗا دُونَ ذَٰلِكَۖ وَكُنَّا لَهُمۡ حَٰفِظِينَ","End":"٨٢"},{"SurahNumber":21,"VerseNumber":83,"Text":"۞وَأَيُّوبَ إِذۡ نَادَىٰ رَبَّهُۥٓ أَنِّي مَسَّنِيَ ٱلضُّرُّ وَأَنتَ أَرۡحَمُ ٱلرَّـٰحِمِينَ","End":"٨٣"},{"SurahNumber":21,"VerseNumber":84,"Text":"فَٱسۡتَجَبۡنَا لَهُۥ فَكَشَفۡنَا مَا بِهِۦ مِن ضُرّٖۖ وَءَاتَيۡنَٰهُ أَهۡلَهُۥ وَمِثۡلَهُم مَّعَهُمۡ رَحۡمَةٗ مِّنۡ عِندِنَا وَذِكۡرَىٰ لِلۡعَٰبِدِينَ","End":"٨٤"},{"SurahNumber":21,"VerseNumber":85,"Text":"وَإِسۡمَٰعِيلَ وَإِدۡرِيسَ وَذَا ٱلۡكِفۡلِۖ كُلّٞ مِّنَ ٱلصَّـٰبِرِينَ","End":"٨٥"},{"SurahNumber":21,"VerseNumber":86,"Text":"وَأَدۡخَلۡنَٰهُمۡ فِي رَحۡمَتِنَآۖ إِنَّهُم مِّنَ ٱلصَّـٰلِحِينَ","End":"٨٦"},{"SurahNumber":21,"VerseNumber":87,"Text":"وَذَا ٱلنُّونِ إِذ ذَّهَبَ مُغَٰضِبٗا فَظَنَّ أَن لَّن نَّقۡدِرَ عَلَيۡهِ فَنَادَىٰ فِي ٱلظُّلُمَٰتِ أَن لَّآ إِلَٰهَ إِلَّآ أَنتَ سُبۡحَٰنَكَ إِنِّي كُنتُ مِنَ ٱلظَّـٰلِمِينَ","End":"٨٧"},{"SurahNumber":21,"VerseNumber":88,"Text":"فَٱسۡتَجَبۡنَا لَهُۥ وَنَجَّيۡنَٰهُ مِنَ ٱلۡغَمِّۚ وَكَذَٰلِكَ نُـۨجِي ٱلۡمُؤۡمِنِينَ","End":"٨٨"},{"SurahNumber":21,"VerseNumber":89,"Text":"وَزَكَرِيَّآ إِذۡ نَادَىٰ رَبَّهُۥ رَبِّ لَا تَذَرۡنِي فَرۡدٗا وَأَنتَ خَيۡرُ ٱلۡوَٰرِثِينَ","End":"٨٩"},{"SurahNumber":21,"VerseNumber":90,"Text":"فَٱسۡتَجَبۡنَا لَهُۥ وَوَهَبۡنَا لَهُۥ يَحۡيَىٰ وَأَصۡلَحۡنَا لَهُۥ زَوۡجَهُۥٓۚ إِنَّهُمۡ كَانُواْ يُسَٰرِعُونَ فِي ٱلۡخَيۡرَٰتِ وَيَدۡعُونَنَا رَغَبٗا وَرَهَبٗاۖ وَكَانُواْ لَنَا خَٰشِعِينَ","End":"٩٠"},{"SurahNumber":21,"VerseNumber":91,"Text":"وَٱلَّتِيٓ أَحۡصَنَتۡ فَرۡجَهَا فَنَفَخۡنَا فِيهَا مِن رُّوحِنَا وَجَعَلۡنَٰهَا وَٱبۡنَهَآ ءَايَةٗ لِّلۡعَٰلَمِينَ","End":"٩١"},{"SurahNumber":21,"VerseNumber":92,"Text":"إِنَّ هَٰذِهِۦٓ أُمَّتُكُمۡ أُمَّةٗ وَٰحِدَةٗ وَأَنَا۠ رَبُّكُمۡ فَٱعۡبُدُونِ","End":"٩٢"},{"SurahNumber":21,"VerseNumber":93,"Text":"وَتَقَطَّعُوٓاْ أَمۡرَهُم بَيۡنَهُمۡۖ كُلٌّ إِلَيۡنَا رَٰجِعُونَ","End":"٩٣"},{"SurahNumber":21,"VerseNumber":94,"Text":"فَمَن يَعۡمَلۡ مِنَ ٱلصَّـٰلِحَٰتِ وَهُوَ مُؤۡمِنٞ فَلَا كُفۡرَانَ لِسَعۡيِهِۦ وَإِنَّا لَهُۥ كَٰتِبُونَ","End":"٩٤"},{"SurahNumber":21,"VerseNumber":95,"Text":"وَحَرَٰمٌ عَلَىٰ قَرۡيَةٍ أَهۡلَكۡنَٰهَآ أَنَّهُمۡ لَا يَرۡجِعُونَ","End":"٩٥"},{"SurahNumber":21,"VerseNumber":96,"Text":"حَتَّىٰٓ إِذَا فُتِحَتۡ يَأۡجُوجُ وَمَأۡجُوجُ وَهُم مِّن كُلِّ حَدَبٖ يَنسِلُونَ","End":"٩٦"},{"SurahNumber":21,"VerseNumber":97,"Text":"وَٱقۡتَرَبَ ٱلۡوَعۡدُ ٱلۡحَقُّ فَإِذَا هِيَ شَٰخِصَةٌ أَبۡصَٰرُ ٱلَّذِينَ كَفَرُواْ يَٰوَيۡلَنَا قَدۡ كُنَّا فِي غَفۡلَةٖ مِّنۡ هَٰذَا بَلۡ كُنَّا ظَٰلِمِينَ","End":"٩٧"},{"SurahNumber":21,"VerseNumber":98,"Text":"إِنَّكُمۡ وَمَا تَعۡبُدُونَ مِن دُونِ ٱللَّهِ حَصَبُ جَهَنَّمَ أَنتُمۡ لَهَا وَٰرِدُونَ","End":"٩٨"},{"SurahNumber":21,"VerseNumber":99,"Text":"لَوۡ كَانَ هَـٰٓؤُلَآءِ ءَالِهَةٗ مَّا وَرَدُوهَاۖ وَكُلّٞ فِيهَا خَٰلِدُونَ","End":"٩٩"},{"SurahNumber":21,"VerseNumber":100,"Text":"لَهُمۡ فِيهَا زَفِيرٞ وَهُمۡ فِيهَا لَا يَسۡمَعُونَ","End":"١٠٠"},{"SurahNumber":21,"VerseNumber":101,"Text":"إِنَّ ٱلَّذِينَ سَبَقَتۡ لَهُم مِّنَّا ٱلۡحُسۡنَىٰٓ أُوْلَـٰٓئِكَ عَنۡهَا مُبۡعَدُونَ","End":"١٠١"},{"SurahNumber":21,"VerseNumber":102,"Text":"لَا يَسۡمَعُونَ حَسِيسَهَاۖ وَهُمۡ فِي مَا ٱشۡتَهَتۡ أَنفُسُهُمۡ خَٰلِدُونَ","End":"١٠٢"},{"SurahNumber":21,"VerseNumber":103,"Text":"لَا يَحۡزُنُهُمُ ٱلۡفَزَعُ ٱلۡأَكۡبَرُ وَتَتَلَقَّىٰهُمُ ٱلۡمَلَـٰٓئِكَةُ هَٰذَا يَوۡمُكُمُ ٱلَّذِي كُنتُمۡ تُوعَدُونَ","End":"١٠٣"},{"SurahNumber":21,"VerseNumber":104,"Text":"يَوۡمَ نَطۡوِي ٱلسَّمَآءَ كَطَيِّ ٱلسِّجِلِّ لِلۡكُتُبِۚ كَمَا بَدَأۡنَآ أَوَّلَ خَلۡقٖ نُّعِيدُهُۥۚ وَعۡدًا عَلَيۡنَآۚ إِنَّا كُنَّا فَٰعِلِينَ","End":"١٠٤"},{"SurahNumber":21,"VerseNumber":105,"Text":"وَلَقَدۡ كَتَبۡنَا فِي ٱلزَّبُورِ مِنۢ بَعۡدِ ٱلذِّكۡرِ أَنَّ ٱلۡأَرۡضَ يَرِثُهَا عِبَادِيَ ٱلصَّـٰلِحُونَ","End":"١٠٥"},{"SurahNumber":21,"VerseNumber":106,"Text":"إِنَّ فِي هَٰذَا لَبَلَٰغٗا لِّقَوۡمٍ عَٰبِدِينَ","End":"١٠٦"},{"SurahNumber":21,"VerseNumber":107,"Text":"وَمَآ أَرۡسَلۡنَٰكَ إِلَّا رَحۡمَةٗ لِّلۡعَٰلَمِينَ","End":"١٠٧"},{"SurahNumber":21,"VerseNumber":108,"Text":"قُلۡ إِنَّمَا يُوحَىٰٓ إِلَيَّ أَنَّمَآ إِلَٰهُكُمۡ إِلَٰهٞ وَٰحِدٞۖ فَهَلۡ أَنتُم مُّسۡلِمُونَ","End":"١٠٨"},{"SurahNumber":21,"VerseNumber":109,"Text":"فَإِن تَوَلَّوۡاْ فَقُلۡ ءَاذَنتُكُمۡ عَلَىٰ سَوَآءٖۖ وَإِنۡ أَدۡرِيٓ أَقَرِيبٌ أَم بَعِيدٞ مَّا تُوعَدُونَ","End":"١٠٩"},{"SurahNumber":21,"VerseNumber":110,"Text":"إِنَّهُۥ يَعۡلَمُ ٱلۡجَهۡرَ مِنَ ٱلۡقَوۡلِ وَيَعۡلَمُ مَا تَكۡتُمُونَ","End":"١١٠"},{"SurahNumber":21,"VerseNumber":111,"Text":"وَإِنۡ أَدۡرِي لَعَلَّهُۥ فِتۡنَةٞ لَّكُمۡ وَمَتَٰعٌ إِلَىٰ حِينٖ","End":"١١١"},{"SurahNumber":21,"VerseNumber":112,"Text":"قَٰلَ رَبِّ ٱحۡكُم بِٱلۡحَقِّۗ وَرَبُّنَا ٱلرَّحۡمَٰنُ ٱلۡمُسۡتَعَانُ عَلَىٰ مَا تَصِفُونَ","End":"١١٢"}],"Translations":[{"LanguageCode":"ara","Language":"Arabic","Name":"ara-quran-la","Author":"Quran Transliteration","Source":"http://tanzil.net","Direction":"ltr","Translations":[{"SurahNumber":21,"VerseNumber":1,"Text":"Iqtaraba lilnnasi hisabuhum wahum fee ghaflatin muAAridoona"},{"SurahNumber":21,"VerseNumber":2,"Text":"Ma yateehim min thikrin min rabbihim muhdathin illa istamaAAoohu wahum yalAAaboona"},{"SurahNumber":21,"VerseNumber":3,"Text":"Lahiyatan quloobuhum waasarroo alnnajwa allatheena thalamoo hal hatha illa basharun mithlukum afatatoona alssihra waantum tubsiroona"},{"SurahNumber":21,"VerseNumber":4,"Text":"Qala rabbee yaAAlamu alqawla fee alssamai waalardi wahuwa alssameeAAu alAAaleemu"},{"SurahNumber":21,"VerseNumber":5,"Text":"Bal qaloo adghathu ahlamin bali iftarahu bal huwa shaAAirun falyatina biayatin kama orsila alawwaloona"},{"SurahNumber":21,"VerseNumber":6,"Text":"Ma amanat qablahum min qaryatin ahlaknaha afahum yuminoona"},{"SurahNumber":21,"VerseNumber":7,"Text":"Wama arsalna qablaka illa rijalan noohee ilayhim faisaloo ahla alththikri in kuntum la taAAlamoona"},{"SurahNumber":21,"VerseNumber":8,"Text":"Wama jaAAalnahum jasadan la yakuloona alttaAAama wama kanoo khalideena"},{"SurahNumber":21,"VerseNumber":9,"Text":"Thumma sadaqnahumu alwaAAda faanjaynahum waman nashao waahlakna almusrifeena"},{"SurahNumber":21,"VerseNumber":10,"Text":"Laqad anzalna ilaykum kitaban feehi thikrukum afala taAAqiloona"},{"SurahNumber":21,"VerseNumber":11,"Text":"Wakam qasamna min qaryatin kanat thalimatan waanshana baAAdaha qawman akhareena"},{"SurahNumber":21,"VerseNumber":12,"Text":"Falamma ahassoo basana itha hum minha yarkudoona"},{"SurahNumber":21,"VerseNumber":13,"Text":"La tarkudoo wairjiAAoo ila ma otriftum feehi wamasakinikum laAAallakum tusaloona"},{"SurahNumber":21,"VerseNumber":14,"Text":"Qaloo ya waylana inna kunna thalimeena"},{"SurahNumber":21,"VerseNumber":15,"Text":"Fama zalat tilka daAAwahum hatta jaAAalnahum haseedan khamideena"},{"SurahNumber":21,"VerseNumber":16,"Text":"Wama khalaqna alssamaa waalarda wama baynahuma laAAibeena"},{"SurahNumber":21,"VerseNumber":17,"Text":"Law aradna an nattakhitha lahwan laittakhathnahu min ladunna in kunna faAAileena"},{"SurahNumber":21,"VerseNumber":18,"Text":"Bal naqthifu bialhaqqi AAala albatili fayadmaghuhu faitha huwa zahiqun walakumu alwaylu mimma tasifoona"},{"SurahNumber":21,"VerseNumber":19,"Text":"Walahu man fee alssamawati waalardi waman AAindahu la yastakbiroona AAan AAibadatihi wala yastahsiroona"},{"SurahNumber":21,"VerseNumber":20,"Text":"Yusabbihoona allayla waalnnahara la yafturoona"},{"SurahNumber":21,"VerseNumber":21,"Text":"Ami ittakhathoo alihatan mina alardi hum yunshiroona"},{"SurahNumber":21,"VerseNumber":22,"Text":"Law kana feehima alihatun illa Allahu lafasadata fasubhana Allahi rabbi alAAarshi AAamma yasifoona"},{"SurahNumber":21,"VerseNumber":23,"Text":"La yusalu AAamma yafAAalu wahum yusaloona"},{"SurahNumber":21,"VerseNumber":24,"Text":"Ami ittakhathoo min doonihi alihatan qul hatoo burhanakum hatha thikru man maAAiya wathikru man qablee bal aktharuhum la yaAAlamoona alhaqqa fahum muAAridoona"},{"SurahNumber":21,"VerseNumber":25,"Text":"Wama arsalna min qablika min rasoolin illa noohee ilayhi annahu la ilaha illa ana faoAAbudooni"},{"SurahNumber":21,"VerseNumber":26,"Text":"Waqaloo ittakhatha alrrahmanu waladan subhanahu bal AAibadun mukramoona"},{"SurahNumber":21,"VerseNumber":27,"Text":"La yasbiqoonahu bialqawli wahum biamrihi yaAAmaloona"},{"SurahNumber":21,"VerseNumber":28,"Text":"YaAAlamu ma bayna aydeehim wama khalfahum wala yashfaAAoona illa limani irtada wahum min khashyatihi mushfiqoona"},{"SurahNumber":21,"VerseNumber":29,"Text":"Waman yaqul minhum innee ilahun min doonihi fathalika najzeehi jahannama kathalika najzee alththalimeena"},{"SurahNumber":21,"VerseNumber":30,"Text":"Awalam yara allatheena kafaroo anna alssamawati waalarda kanata ratqan fafataqnahuma wajaAAalna mina almai kulla shayin hayyin afala yuminoona"},{"SurahNumber":21,"VerseNumber":31,"Text":"WajaAAalna fee alardi rawasiya an tameeda bihim wajaAAalna feeha fijajan subulan laAAallahum yahtadoona"},{"SurahNumber":21,"VerseNumber":32,"Text":"WajaAAalna alssamaa saqfan mahfoothan wahum AAan ayatiha muAAridoona"},{"SurahNumber":21,"VerseNumber":33,"Text":"Wahuwa allathee khalaqa allayla waalnnahara waalshshamsa waalqamara kullun fee falakin yasbahoona"},{"SurahNumber":21,"VerseNumber":34,"Text":"Wama jaAAalna libasharin min qablika alkhulda afain mitta fahumu alkhalidoona"},{"SurahNumber":21,"VerseNumber":35,"Text":"Kullu nafsin thaiqatu almawti wanablookum bialshsharri waalkhayri fitnatan wailayna turjaAAoona"},{"SurahNumber":21,"VerseNumber":36,"Text":"Waitha raaka allatheena kafaroo in yattakhithoonaka illa huzuwan ahatha allathee yathkuru alihatakum wahum bithikri alrrahmani hum kafiroona"},{"SurahNumber":21,"VerseNumber":37,"Text":"Khuliqa alinsanu min AAajalin saoreekum ayatee fala tastaAAjiloona"},{"SurahNumber":21,"VerseNumber":38,"Text":"Wayaqooloona mata hatha alwaAAdu in kuntum sadiqeena"},{"SurahNumber":21,"VerseNumber":39,"Text":"Law yaAAlamu allatheena kafaroo heena la yakuffoona AAan wujoohihimu alnnara wala AAan thuhoorihim wala hum yunsaroona"},{"SurahNumber":21,"VerseNumber":40,"Text":"Bal tateehim baghtatan fatabhatuhum fala yastateeAAoona raddaha wala hum yuntharoona"},{"SurahNumber":21,"VerseNumber":41,"Text":"Walaqadi istuhzia birusulin min qablika fahaqa biallatheena sakhiroo minhum ma kanoo bihi yastahzioona"},{"SurahNumber":21,"VerseNumber":42,"Text":"Qul man yaklaokum biallayli waalnnahari mina alrrahmani bal hum AAan thikri rabbihim muAAridoona"},{"SurahNumber":21,"VerseNumber":43,"Text":"Am lahum alihatun tamnaAAuhum min doonina la yastateeAAoona nasra anfusihim wala hum minna yushaboona"},{"SurahNumber":21,"VerseNumber":44,"Text":"Bal mattaAAna haolai waabaahum hatta tala AAalayhimu alAAumuru afala yarawna anna natee alarda nanqusuha min atrafiha afahumu alghaliboona"},{"SurahNumber":21,"VerseNumber":45,"Text":"Qul innama onthirukum bialwahyi wala yasmaAAu alssummu aldduAAaa itha ma yuntharoona"},{"SurahNumber":21,"VerseNumber":46,"Text":"Walain massathum nafhatun min AAathabi rabbika layaqoolunna ya waylana inna kunna thalimeena"},{"SurahNumber":21,"VerseNumber":47,"Text":"WanadaAAu almawazeena alqista liyawmi alqiyamati fala tuthlamu nafsun shayan wain kana mithqala habbatin min khardalin atayna biha wakafa bina hasibeena"},{"SurahNumber":21,"VerseNumber":48,"Text":"Walaqad atayna moosa waharoona alfurqana wadiyaan wathikran lilmuttaqeena"},{"SurahNumber":21,"VerseNumber":49,"Text":"Allatheena yakhshawna rabbahum bialghaybi wahum mina alssaAAati mushfiqoona"},{"SurahNumber":21,"VerseNumber":50,"Text":"Wahatha thikrun mubarakun anzalnahu afaantum lahu munkiroona"},{"SurahNumber":21,"VerseNumber":51,"Text":"Walaqad atayna ibraheema rushdahu min qablu wakunna bihi AAalimeena"},{"SurahNumber":21,"VerseNumber":52,"Text":"Ith qala liabeehi waqawmihi ma hathihi alttamatheelu allatee antum laha AAakifoona"},{"SurahNumber":21,"VerseNumber":53,"Text":"Qaloo wajadna abaana laha AAabideena"},{"SurahNumber":21,"VerseNumber":54,"Text":"Qala laqad kuntum antum waabaokum fee dalalin mubeenin"},{"SurahNumber":21,"VerseNumber":55,"Text":"Qaloo ajitana bialhaqqi am anta mina allaAAibeena"},{"SurahNumber":21,"VerseNumber":56,"Text":"Qala bal rabbukum rabbu alssamawati waalardi allathee fatarahunna waana AAala thalikum mina alshshahideena"},{"SurahNumber":21,"VerseNumber":57,"Text":"WataAllahi laakeedanna asnamakum baAAda an tuwalloo mudbireena"},{"SurahNumber":21,"VerseNumber":58,"Text":"FajaAAalahum juthathan illa kabeeran lahum laAAallahum ilayhi yarjiAAoona"},{"SurahNumber":21,"VerseNumber":59,"Text":"Qaloo man faAAala hatha bialihatina innahu lamina alththalimeena"},{"SurahNumber":21,"VerseNumber":60,"Text":"Qaloo samiAAna fatan yathkuruhum yuqalu lahu ibraheemu"},{"SurahNumber":21,"VerseNumber":61,"Text":"Qaloo fatoo bihi AAala aAAyuni alnnasi laAAallahum yashhadoona"},{"SurahNumber":21,"VerseNumber":62,"Text":"Qaloo aanta faAAalta hatha bialihatina ya ibraheemu"},{"SurahNumber":21,"VerseNumber":63,"Text":"Qala bal faAAalahu kabeeruhum hatha faisaloohum in kanoo yantiqoona"},{"SurahNumber":21,"VerseNumber":64,"Text":"FarajaAAoo ila anfusihim faqaloo innakum antumu alththalimoona"},{"SurahNumber":21,"VerseNumber":65,"Text":"Thumma nukisoo AAala ruoosihim laqad AAalimta ma haolai yantiqoona"},{"SurahNumber":21,"VerseNumber":66,"Text":"Qala afataAAbudoona min dooni Allahi ma la yanfaAAukum shayan wala yadurrukum"},{"SurahNumber":21,"VerseNumber":67,"Text":"Offin lakum walima taAAbudoona min dooni Allahi afala taAAqiloona"},{"SurahNumber":21,"VerseNumber":68,"Text":"Qaloo harriqoohu waonsuroo alihatakum in kuntum faAAileena"},{"SurahNumber":21,"VerseNumber":69,"Text":"Qulna ya naru koonee bardan wasalaman AAala ibraheema"},{"SurahNumber":21,"VerseNumber":70,"Text":"Waaradoo bihi kaydan fajaAAalnahumu alakhsareena"},{"SurahNumber":21,"VerseNumber":71,"Text":"Wanajjaynahu walootan ila alardi allatee barakna feeha lilAAalameena"},{"SurahNumber":21,"VerseNumber":72,"Text":"Wawahabna lahu ishaqa wayaAAqooba nafilatan wakullan jaAAalna saliheena"},{"SurahNumber":21,"VerseNumber":73,"Text":"WajaAAalnahum aimmatan yahdoona biamrina waawhayna ilayhim fiAAla alkhayrati waiqama alssalati waeetaa alzzakati wakanoo lana AAabideena"},{"SurahNumber":21,"VerseNumber":74,"Text":"Walootan ataynahu hukman waAAilman wanajjaynahu mina alqaryati allatee kanat taAAmalu alkhabaitha innahum kanoo qawma sawin fasiqeena"},{"SurahNumber":21,"VerseNumber":75,"Text":"Waadkhalnahu fee rahmatina innahu mina alssaliheena"},{"SurahNumber":21,"VerseNumber":76,"Text":"Wanoohan ith nada min qablu faistajabna lahu fanajjaynahu waahlahu mina alkarbi alAAatheemi"},{"SurahNumber":21,"VerseNumber":77,"Text":"Wanasarnahu mina alqawmi allatheena kaththaboo biayatina innahum kanoo qawma sawin faaghraqnahum ajmaAAeena"},{"SurahNumber":21,"VerseNumber":78,"Text":"Wadawooda wasulaymana ith yahkumani fee alharthi ith nafashat feehi ghanamu alqawmi wakunna lihukmihim shahideena"},{"SurahNumber":21,"VerseNumber":79,"Text":"Fafahhamnaha sulaymana wakullan atayna hukman waAAilman wasakhkharna maAAa dawooda aljibala yusabbihna waalttayra wakunna faAAileena"},{"SurahNumber":21,"VerseNumber":80,"Text":"WaAAallamnahu sanAAata laboosin lakum lituhsinakum min basikum fahal antum shakiroona"},{"SurahNumber":21,"VerseNumber":81,"Text":"Walisulaymana alrreeha AAasifatan tajree biamrihi ila alardi allatee barakna feeha wakunna bikulli shayin AAalimeena"},{"SurahNumber":21,"VerseNumber":82,"Text":"Wamina alshshayateeni man yaghoosoona lahu wayaAAmaloona AAamalan doona thalika wakunna lahum hafitheena"},{"SurahNumber":21,"VerseNumber":83,"Text":"Waayyooba ith nada rabbahu annee massaniya alddurru waanta arhamu alrrahimeena"},{"SurahNumber":21,"VerseNumber":84,"Text":"Faistajabna lahu fakashafna ma bihi min durrin waataynahu ahlahu wamithlahum maAAahum rahmatan min AAindina wathikra lilAAabideena"},{"SurahNumber":21,"VerseNumber":85,"Text":"WaismaAAeela waidreesa watha alkifli kullun mina alssabireena"},{"SurahNumber":21,"VerseNumber":86,"Text":"Waadkhalnahum fee rahmatina innahum mina alssaliheena"},{"SurahNumber":21,"VerseNumber":87,"Text":"Watha alnnooni ith thahaba mughadiban fathanna an lan naqdira AAalayhi fanada fee alththulumati an la ilaha illa anta subhanaka innee kuntu mina alththalimeena"},{"SurahNumber":21,"VerseNumber":88,"Text":"Faistajabna lahu wanajjaynahu mina alghammi wakathalika nunjee almumineena"},{"SurahNumber":21,"VerseNumber":89,"Text":"Wazakariyya ith nada rabbahu rabbi la tatharnee fardan waanta khayru alwaritheena"},{"SurahNumber":21,"VerseNumber":90,"Text":"Faistajabna lahu wawahabna lahu yahya waaslahna lahu zawjahu innahum kanoo yusariAAoona fee alkhayrati wayadAAoonana raghaban warahaban wakanoo lana khashiAAeena"},{"SurahNumber":21,"VerseNumber":91,"Text":"Waallatee ahsanat farjaha fanafakhna feeha min roohina wajaAAalnaha waibnaha ayatan lilAAalameena"},{"SurahNumber":21,"VerseNumber":92,"Text":"Inna hathihi ommatukum ommatan wahidatan waana rabbukum faoAAbudooni"},{"SurahNumber":21,"VerseNumber":93,"Text":"WataqattaAAoo amrahum baynahum kullun ilayna rajiAAoona"},{"SurahNumber":21,"VerseNumber":94,"Text":"Faman yaAAmal mina alssalihati wahuwa muminun fala kufrana lisaAAyihi wainna lahu katiboona"},{"SurahNumber":21,"VerseNumber":95,"Text":"Waharamun AAala qaryatin ahlaknaha annahum la yarjiAAoona"},{"SurahNumber":21,"VerseNumber":96,"Text":"Hatta itha futihat yajooju wamajooju wahum min kulli hadabin yansiloona"},{"SurahNumber":21,"VerseNumber":97,"Text":"Waiqtaraba alwaAAdu alhaqqu faitha hiya shakhisatun absaru allatheena kafaroo ya waylana qad kunna fee ghaflatin min hatha bal kunna thalimeena"},{"SurahNumber":21,"VerseNumber":98,"Text":"Innakum wama taAAbudoona min dooni Allahi hasabu jahannama antum laha waridoona"},{"SurahNumber":21,"VerseNumber":99,"Text":"Law kana haolai alihatan ma waradooha wakullun feeha khalidoona"},{"SurahNumber":21,"VerseNumber":100,"Text":"Lahum feeha zafeerun wahum feeha la yasmaAAoona"},{"SurahNumber":21,"VerseNumber":101,"Text":"Inna allatheena sabaqat lahum minna alhusna olaika AAanha mubAAadoona"},{"SurahNumber":21,"VerseNumber":102,"Text":"La yasmaAAoona haseesaha wahum fee ma ishtahat anfusuhum khalidoona"},{"SurahNumber":21,"VerseNumber":103,"Text":"La yahzunuhumu alfazaAAu alakbaru watatalaqqahumu almalaikatu hatha yawmukumu allathee kuntum tooAAadoona"},{"SurahNumber":21,"VerseNumber":104,"Text":"Yawma natwee alssamaa katayyi alssijlli lilkutubi kama badana awwala khalqin nuAAeeduhu waAAdan AAalayna inna kunna faAAileena"},{"SurahNumber":21,"VerseNumber":105,"Text":"Walaqad katabna fee alzzaboori min baAAdi alththikri anna alarda yarithuha AAibadiya alssalihoona"},{"SurahNumber":21,"VerseNumber":106,"Text":"Inna fee hatha labalaghan liqawmin AAabideena"},{"SurahNumber":21,"VerseNumber":107,"Text":"Wama arsalnaka illa rahmatan lilAAalameena"},{"SurahNumber":21,"VerseNumber":108,"Text":"Qul innama yooha ilayya annama ilahukum ilahun wahidun fahal antum muslimoona"},{"SurahNumber":21,"VerseNumber":109,"Text":"Fain tawallaw faqul athantukum AAala sawain wain adree aqareebun am baAAeedun ma tooAAadoona"},{"SurahNumber":21,"VerseNumber":110,"Text":"Innahu yaAAlamu aljahra mina alqawli wayaAAlamu ma taktumoona"},{"SurahNumber":21,"VerseNumber":111,"Text":"Wain adree laAAallahu fitnatun lakum wamataAAun ila heenin"},{"SurahNumber":21,"VerseNumber":112,"Text":"Qala rabbi ohkum bialhaqqi warabbuna alrrahmanu almustaAAanu AAala ma tasifoona"}]},{"LanguageCode":"eng","Language":"English","Name":"eng-mustafakhattabg","Author":"Mustafa Khattab God Edition","Source":"","Direction":"ltr","Translations":[{"SurahNumber":21,"VerseNumber":1,"Text":"˹The time of˺ people’s judgment has drawn near, yet they are heedlessly turning away"},{"SurahNumber":21,"VerseNumber":2,"Text":"Whatever new reminder comes to them from their Lord, they only listen to it jokingly"},{"SurahNumber":21,"VerseNumber":3,"Text":"with their hearts ˹totally˺ distracted. The evildoers would converse secretly, ˹saying,˺ “Is this ˹one˺ not human like yourselves? Would you fall for ˹this˺ witchcraft, even though you can ˹clearly˺ see?”"},{"SurahNumber":21,"VerseNumber":4,"Text":"The Prophet responded, “My Lord ˹fully˺ knows every word spoken in the heavens and the earth. For He is the All-Hearing, All-Knowing.”"},{"SurahNumber":21,"VerseNumber":5,"Text":"Yet they say, “This ˹Quran˺ is a set of confused dreams! No, he has fabricated it! No, he must be a poet! So let him bring us a ˹tangible˺ sign like those ˹prophets˺ sent before.”"},{"SurahNumber":21,"VerseNumber":6,"Text":"Not a ˹single˺ society We destroyed before them ever believed ˹after receiving the signs˺. Will these ˹pagans˺ then believe"},{"SurahNumber":21,"VerseNumber":7,"Text":"We did not send ˹messengers˺ before you ˹O Prophet˺ except mere men inspired by Us. If you ˹polytheists˺ do not know ˹this already˺, then ask those who have knowledge ˹of the Scriptures˺"},{"SurahNumber":21,"VerseNumber":8,"Text":"We did not give those messengers ˹supernatural˺ bodies that did not need food, nor were they immortal"},{"SurahNumber":21,"VerseNumber":9,"Text":"Then We fulfilled Our promise to them, saving them along with whoever We willed and destroying the transgressors"},{"SurahNumber":21,"VerseNumber":10,"Text":"We have surely revealed to you a Book, in which there is glory for you. Will you not then understand"},{"SurahNumber":21,"VerseNumber":11,"Text":"˹Imagine˺ how many societies of wrongdoers We have destroyed, raising up other people after them"},{"SurahNumber":21,"VerseNumber":12,"Text":"When the wrongdoers sensed ˹the arrival of˺ Our torment, they started to run away from their cities"},{"SurahNumber":21,"VerseNumber":13,"Text":"˹They were told,˺ “Do not run away! Return to your luxuries and your homes, so you may be questioned ˹about your fate˺.”"},{"SurahNumber":21,"VerseNumber":14,"Text":"They cried, “Woe to us! We have surely been wrongdoers.”"},{"SurahNumber":21,"VerseNumber":15,"Text":"They kept repeating their cry until We mowed them down, ˹leaving them˺ lifeless"},{"SurahNumber":21,"VerseNumber":16,"Text":"We did not create the heavens and the earth and everything in between for sport"},{"SurahNumber":21,"VerseNumber":17,"Text":"Had We intended to take ˹some˺ amusement, We could have found it in Our presence, if that had been Our Will"},{"SurahNumber":21,"VerseNumber":18,"Text":"In fact, We hurl the truth against falsehood, leaving it crushed, and it quickly vanishes. And woe be to you for what you claim"},{"SurahNumber":21,"VerseNumber":19,"Text":"To Him belong all those in the heavens and the earth. And those nearest to Him are not too proud to worship Him, nor do they tire"},{"SurahNumber":21,"VerseNumber":20,"Text":"They glorify ˹Him˺ day and night, never wavering"},{"SurahNumber":21,"VerseNumber":21,"Text":"Or have they taken gods from the earth, who can raise the dead"},{"SurahNumber":21,"VerseNumber":22,"Text":"Had there been other gods besides God in the heavens or the earth, both ˹realms˺ would have surely been corrupted. So Glorified is God, Lord of the Throne, far above what they claim"},{"SurahNumber":21,"VerseNumber":23,"Text":"He cannot be questioned about what He does, but they will ˹all˺ be questioned"},{"SurahNumber":21,"VerseNumber":24,"Text":"Or have they taken other gods besides Him? Say, ˹O Prophet,˺ “Show ˹me˺ your proof. Here is ˹the Quran,˺ the Reminder for those with me; along with ˹earlier Scriptures,˺ the Reminder for those before me.” But most of them do not know the truth, so they turn away"},{"SurahNumber":21,"VerseNumber":25,"Text":"We never sent a messenger before you ˹O Prophet˺ without revealing to him: “There is no god ˹worthy of worship˺ except Me, so worship Me ˹alone˺.”"},{"SurahNumber":21,"VerseNumber":26,"Text":"And they say, “The Most Compassionate has offspring!” Glory be to Him! In fact, those ˹angels˺ are only ˹His˺ honoured servants"},{"SurahNumber":21,"VerseNumber":27,"Text":"who do not speak until He has spoken, ˹only˺ acting at His command"},{"SurahNumber":21,"VerseNumber":28,"Text":"He ˹fully˺ knows what is ahead of them and what is behind them. They do not intercede except for whom He approves, and they tremble in awe of Him"},{"SurahNumber":21,"VerseNumber":29,"Text":"Whoever of them were to say, “I am a god besides Him,” they would be rewarded with Hell by Us. This is how We reward the wrongdoers"},{"SurahNumber":21,"VerseNumber":30,"Text":"Do the disbelievers not realize that the heavens and earth were ˹once˺ one mass then We split them apart? And We created from water every living thing. Will they not then believe"},{"SurahNumber":21,"VerseNumber":31,"Text":"And We have placed firm mountains upon the earth so it does not shake with them, and made in it broad pathways so they may find their way"},{"SurahNumber":21,"VerseNumber":32,"Text":"And We have made the sky a well-protected canopy, still they turn away from its signs"},{"SurahNumber":21,"VerseNumber":33,"Text":"And He is the One Who created the day and the night, the sun and the moon—each travelling in an orbit"},{"SurahNumber":21,"VerseNumber":34,"Text":"We have not granted immortality to any human before you ˹O Prophet˺: so if you die, will they live forever"},{"SurahNumber":21,"VerseNumber":35,"Text":"Every soul will taste death. And We test you ˹O humanity˺ with good and evil as a trial, then to Us you will ˹all˺ be returned"},{"SurahNumber":21,"VerseNumber":36,"Text":"When the disbelievers see you ˹O Prophet˺, they only make fun of you, ˹saying,˺ “Is this the one who speaks ˹ill˺ of your gods?” while they disbelieve at the mention of the Most Compassionate"},{"SurahNumber":21,"VerseNumber":37,"Text":"Humankind is made of haste. I will soon show you My signs, so do not ask Me to hasten them"},{"SurahNumber":21,"VerseNumber":38,"Text":"They ask ˹the believers˺, “When will this threat come to pass if what you say is true?”"},{"SurahNumber":21,"VerseNumber":39,"Text":"If only the disbelievers knew that a time will come when they will not be able to keep the Fire off their faces or backs, nor will they be helped"},{"SurahNumber":21,"VerseNumber":40,"Text":"In fact, the Hour will take them by surprise, leaving them stunned. So they will not be able to avert it, nor will it be delayed from them"},{"SurahNumber":21,"VerseNumber":41,"Text":"˹Other˺ messengers had already been ridiculed before you ˹O Prophet˺, but those who mocked them were overtaken by what they used to ridicule"},{"SurahNumber":21,"VerseNumber":42,"Text":"Ask ˹them, O Prophet,˺ “Who can defend you by day or by night against the Most Compassionate?” Still they turn away from the remembrance of their Lord"},{"SurahNumber":21,"VerseNumber":43,"Text":"Or do they have gods—other than Us—that can protect them? They cannot ˹even˺ protect themselves, nor will they be aided against Us"},{"SurahNumber":21,"VerseNumber":44,"Text":"In fact, We have allowed enjoyment for these ˹Meccans˺ and their forefathers for such a long time ˹that they took it for granted˺. Do they not see that We gradually reduce ˹their˺ land from its borders? Is it they who will then prevail"},{"SurahNumber":21,"VerseNumber":45,"Text":"Say, ˹O Prophet,˺ “I warn you only by revelation.” But the deaf cannot hear the call when they are warned"},{"SurahNumber":21,"VerseNumber":46,"Text":"If they were touched by even a breath of your Lord’s torment, they would certainly cry, “Woe to us! We have really been wrongdoers.”"},{"SurahNumber":21,"VerseNumber":47,"Text":"We will set up the scales of justice on the Day of Judgment, so no soul will be wronged in the least. And ˹even˺ if a deed is the weight of a mustard seed, We will bring it forth. And sufficient are We as a ˹vigilant˺ Reckoner"},{"SurahNumber":21,"VerseNumber":48,"Text":"Indeed, We granted Moses and Aaron the standard ˹to distinguish between right and wrong˺—a light and a reminder for the righteous"},{"SurahNumber":21,"VerseNumber":49,"Text":"who are in awe of their Lord without seeing Him, and are fearful of the Hour"},{"SurahNumber":21,"VerseNumber":50,"Text":"And this ˹Quran˺ is a blessed reminder which We have revealed. Will you ˹pagans˺ then deny it"},{"SurahNumber":21,"VerseNumber":51,"Text":"And indeed, We had granted Abraham sound judgment early on, for We knew him well ˹to be worthy of it˺"},{"SurahNumber":21,"VerseNumber":52,"Text":"˹Remember˺ when he questioned his father and his people, “What are these statues to which you are so devoted?”"},{"SurahNumber":21,"VerseNumber":53,"Text":"They replied, “We found our forefathers worshipping them.”"},{"SurahNumber":21,"VerseNumber":54,"Text":"He responded, “Indeed, you and your forefathers have been clearly astray.”"},{"SurahNumber":21,"VerseNumber":55,"Text":"They asked, “Have you come to us with the truth, or is this a joke?”"},{"SurahNumber":21,"VerseNumber":56,"Text":"He replied, “In fact, your Lord is the Lord of the heavens and the earth, Who created them ˹both˺. And to that I bear witness.”"},{"SurahNumber":21,"VerseNumber":57,"Text":"˹Then he said to himself,˺ “By God! I will surely plot against your idols after you have turned your backs and gone away.”"},{"SurahNumber":21,"VerseNumber":58,"Text":"So he smashed them into pieces, except the biggest of them, so they might turn to it ˹for answers˺"},{"SurahNumber":21,"VerseNumber":59,"Text":"They protested, “Who dared do this to our gods? It must be an evildoer!”"},{"SurahNumber":21,"VerseNumber":60,"Text":"Some said, “We heard a young man, called Abraham, speaking ˹ill˺ of them.”"},{"SurahNumber":21,"VerseNumber":61,"Text":"They demanded, “Bring him before the eyes of the people, so that they may witness ˹his trial˺.”"},{"SurahNumber":21,"VerseNumber":62,"Text":"They asked, “Was it you who did this to our gods, O Abraham?”"},{"SurahNumber":21,"VerseNumber":63,"Text":"He replied ˹sarcastically˺, “No, this one—the biggest of them—did it! So ask them, if they can talk!”"},{"SurahNumber":21,"VerseNumber":64,"Text":"So they came back to their senses, saying ˹to one another˺, “You yourselves are truly the wrongdoers!”"},{"SurahNumber":21,"VerseNumber":65,"Text":"Then they ˹quickly˺ regressed to their ˹original˺ mind-set, ˹arguing,˺ “You already know that those ˹idols˺ cannot talk.”"},{"SurahNumber":21,"VerseNumber":66,"Text":"He rebuked ˹them˺, “Do you then worship—instead of God—what can neither benefit nor harm you in any way"},{"SurahNumber":21,"VerseNumber":67,"Text":"Shame on you and whatever you worship instead of God! Do you not have any sense?”"},{"SurahNumber":21,"VerseNumber":68,"Text":"They concluded, “Burn him up to avenge your gods, if you must act.”"},{"SurahNumber":21,"VerseNumber":69,"Text":"We ordered, “O fire! Be cool and safe for Abraham!”"},{"SurahNumber":21,"VerseNumber":70,"Text":"They had sought to harm him, but We made them the worst losers"},{"SurahNumber":21,"VerseNumber":71,"Text":"Then We delivered him, along with Lot, to the land We had showered with blessings for all people"},{"SurahNumber":21,"VerseNumber":72,"Text":"And We blessed him with Isaac ˹as a son˺ and Jacob ˹as a grandson˺, as an additional favour—making all of them righteous"},{"SurahNumber":21,"VerseNumber":73,"Text":"We ˹also˺ made them leaders, guiding by Our command, and inspired them to do good deeds, establish prayer, and pay alms-tax. And they were devoted to Our worship"},{"SurahNumber":21,"VerseNumber":74,"Text":"And to Lot We gave wisdom and knowledge, and delivered him from the society engrossed in shameful practices. They were certainly an evil, rebellious people"},{"SurahNumber":21,"VerseNumber":75,"Text":"And We admitted him into Our mercy, ˹for˺ he was truly one of the righteous"},{"SurahNumber":21,"VerseNumber":76,"Text":"And ˹remember˺ when Noah had cried out to Us earlier, so We responded to him and delivered him and his family from the great distress"},{"SurahNumber":21,"VerseNumber":77,"Text":"And We made him prevail over those who had rejected Our signs. They were truly an evil people, so We drowned them all"},{"SurahNumber":21,"VerseNumber":78,"Text":"And ˹remember˺ when David and Solomon passed judgment regarding the crops ruined ˹at night˺ by someone’s sheep, and We were witness to their judgments"},{"SurahNumber":21,"VerseNumber":79,"Text":"We guided ˹young˺ Solomon to a fairer settlement, and granted each of them wisdom and knowledge. We subjected the mountains as well as the birds to hymn ˹Our praises˺ along with David. It is We Who did ˹it all˺"},{"SurahNumber":21,"VerseNumber":80,"Text":"We taught him the art of making body armour to protect you in battle. Will you then be grateful"},{"SurahNumber":21,"VerseNumber":81,"Text":"And to Solomon We subjected the raging winds, blowing by his command to the land We had showered with blessings. It is We Who know everything"},{"SurahNumber":21,"VerseNumber":82,"Text":"And ˹We subjected˺ some jinn that dived for him, and performed other duties. It is We Who kept them in check"},{"SurahNumber":21,"VerseNumber":83,"Text":"And ˹remember˺ when Job cried out to his Lord, “I have been touched with adversity, and You are the Most Merciful of the merciful.”"},{"SurahNumber":21,"VerseNumber":84,"Text":"So We answered his prayer and removed his adversity, and gave him back his family, twice as many, as a mercy from Us and a lesson for the ˹devoted˺ worshippers"},{"SurahNumber":21,"VerseNumber":85,"Text":"And ˹remember˺ Ishmael, Enoch, and Ⱬul-Kifl. They were all steadfast"},{"SurahNumber":21,"VerseNumber":86,"Text":"We admitted them into Our mercy, for they were truly of the righteous"},{"SurahNumber":21,"VerseNumber":87,"Text":"And ˹remember˺ when the Man of the Whale stormed off ˹from his city˺ in a rage, thinking We would not restrain him. Then in the ˹veils of˺ darkness he cried out, “There is no god ˹worthy of worship˺ except You. Glory be to You! I have certainly done wrong.”"},{"SurahNumber":21,"VerseNumber":88,"Text":"So We answered his prayer and rescued him from anguish. And so do We save the ˹true˺ believers"},{"SurahNumber":21,"VerseNumber":89,"Text":"And ˹remember˺ when Zachariah cried out to his Lord, “My Lord! Do not leave me childless, though You are the Best of Successors.”"},{"SurahNumber":21,"VerseNumber":90,"Text":"So We answered his prayer, granted him John, and made his wife fertile. Indeed, they used to race in doing good, and call upon Us with hope and fear, totally humbling themselves before Us"},{"SurahNumber":21,"VerseNumber":91,"Text":"And ˹remember˺ the one who guarded her chastity, so We breathed into her through Our angel, ˹Gabriel,˺ making her and her son a sign for all peoples"},{"SurahNumber":21,"VerseNumber":92,"Text":"˹O prophets!˺ Indeed, this religion of yours is ˹only˺ one, and I am your Lord, so worship Me ˹alone˺"},{"SurahNumber":21,"VerseNumber":93,"Text":"Yet the people have divided it into sects. But to Us they will all return"},{"SurahNumber":21,"VerseNumber":94,"Text":"So whoever does good and is a believer will never be denied ˹the reward for˺ their striving, for We are recording it all"},{"SurahNumber":21,"VerseNumber":95,"Text":"It is impossible for a society which We have destroyed to ever rise again"},{"SurahNumber":21,"VerseNumber":96,"Text":"until ˹after˺ Gog and Magog have broken loose ˹from the barrier˺, swarming down from every hill"},{"SurahNumber":21,"VerseNumber":97,"Text":"ushering in the True Promise. Then—behold!—the disbelievers will stare ˹in horror, crying,˺ “Oh, woe to us! We have truly been heedless of this. In fact, we have been wrongdoers.”"},{"SurahNumber":21,"VerseNumber":98,"Text":"Certainly you ˹disbelievers˺ and whatever you worship instead of God will be the fuel of Hell. You are ˹all˺ bound to enter it"},{"SurahNumber":21,"VerseNumber":99,"Text":"Had those idols been ˹true˺ gods, they would not have entered it. And they will be there forever"},{"SurahNumber":21,"VerseNumber":100,"Text":"In it they will groan, and will not be able to hear"},{"SurahNumber":21,"VerseNumber":101,"Text":"Surely those for whom We have destined the finest reward will be kept far away from Hell"},{"SurahNumber":21,"VerseNumber":102,"Text":"not even hearing the slightest hissing from it. And they will delight forever in what their souls desire"},{"SurahNumber":21,"VerseNumber":103,"Text":"The Supreme Horror ˹of that Day˺ will not disturb them, and the angels will greet them, ˹saying,˺ “This is your Day, which you have been promised.”"},{"SurahNumber":21,"VerseNumber":104,"Text":"On that Day We will roll up the heavens like a scroll of writings. Just as We produced the first creation, ˹so˺ shall We reproduce it. That is a promise binding on Us. We truly uphold ˹Our promises˺"},{"SurahNumber":21,"VerseNumber":105,"Text":"Surely, following the ˹heavenly˺ Record, We decreed in the Scriptures: “My righteous servants shall inherit the land.”"},{"SurahNumber":21,"VerseNumber":106,"Text":"Surely this ˹Quran˺ is sufficient ˹as a reminder˺ for those devoted to worship"},{"SurahNumber":21,"VerseNumber":107,"Text":"We have sent you ˹O Prophet˺ only as a mercy for the whole world"},{"SurahNumber":21,"VerseNumber":108,"Text":"Say, “What has been revealed to me is this: ‘Your God is only One God.’ Will you then submit?”"},{"SurahNumber":21,"VerseNumber":109,"Text":"If they turn away, then say, “I have warned you all equally. I do not know if what you are threatened with is near or far"},{"SurahNumber":21,"VerseNumber":110,"Text":"God surely knows what you say openly and whatever you hide"},{"SurahNumber":21,"VerseNumber":111,"Text":"I do not know if this ˹delay˺ is possibly a test for you and an enjoyment for a while.”"},{"SurahNumber":21,"VerseNumber":112,"Text":"˹In the end,˺ the Prophet said, “My Lord! Judge ˹between us˺ in truth. And our Lord is the Most Compassionate, Whose help is sought against what you claim.”"}]}]}