{"SurahNumber":27,"HasBismillah":true,"Verses":[{"SurahNumber":27,"VerseNumber":1,"Text":"طسٓۚ تِلۡكَ ءَايَٰتُ ٱلۡقُرۡءَانِ وَكِتَابٖ مُّبِينٍ","End":"١"},{"SurahNumber":27,"VerseNumber":2,"Text":"هُدٗى وَبُشۡرَىٰ لِلۡمُؤۡمِنِينَ","End":"٢"},{"SurahNumber":27,"VerseNumber":3,"Text":"ٱلَّذِينَ يُقِيمُونَ ٱلصَّلَوٰةَ وَيُؤۡتُونَ ٱلزَّكَوٰةَ وَهُم بِٱلۡأٓخِرَةِ هُمۡ يُوقِنُونَ","End":"٣"},{"SurahNumber":27,"VerseNumber":4,"Text":"إِنَّ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ زَيَّنَّا لَهُمۡ أَعۡمَٰلَهُمۡ فَهُمۡ يَعۡمَهُونَ","End":"٤"},{"SurahNumber":27,"VerseNumber":5,"Text":"أُوْلَـٰٓئِكَ ٱلَّذِينَ لَهُمۡ سُوٓءُ ٱلۡعَذَابِ وَهُمۡ فِي ٱلۡأٓخِرَةِ هُمُ ٱلۡأَخۡسَرُونَ","End":"٥"},{"SurahNumber":27,"VerseNumber":6,"Text":"وَإِنَّكَ لَتُلَقَّى ٱلۡقُرۡءَانَ مِن لَّدُنۡ حَكِيمٍ عَلِيمٍ","End":"٦"},{"SurahNumber":27,"VerseNumber":7,"Text":"إِذۡ قَالَ مُوسَىٰ لِأَهۡلِهِۦٓ إِنِّيٓ ءَانَسۡتُ نَارٗا سَـَٔاتِيكُم مِّنۡهَا بِخَبَرٍ أَوۡ ءَاتِيكُم بِشِهَابٖ قَبَسٖ لَّعَلَّكُمۡ تَصۡطَلُونَ","End":"٧"},{"SurahNumber":27,"VerseNumber":8,"Text":"فَلَمَّا جَآءَهَا نُودِيَ أَنۢ بُورِكَ مَن فِي ٱلنَّارِ وَمَنۡ حَوۡلَهَا وَسُبۡحَٰنَ ٱللَّهِ رَبِّ ٱلۡعَٰلَمِينَ","End":"٨"},{"SurahNumber":27,"VerseNumber":9,"Text":"يَٰمُوسَىٰٓ إِنَّهُۥٓ أَنَا ٱللَّهُ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","End":"٩"},{"SurahNumber":27,"VerseNumber":10,"Text":"وَأَلۡقِ عَصَاكَۚ فَلَمَّا رَءَاهَا تَهۡتَزُّ كَأَنَّهَا جَآنّٞ وَلَّىٰ مُدۡبِرٗا وَلَمۡ يُعَقِّبۡۚ يَٰمُوسَىٰ لَا تَخَفۡ إِنِّي لَا يَخَافُ لَدَيَّ ٱلۡمُرۡسَلُونَ","End":"١٠"},{"SurahNumber":27,"VerseNumber":11,"Text":"إِلَّا مَن ظَلَمَ ثُمَّ بَدَّلَ حُسۡنَۢا بَعۡدَ سُوٓءٖ فَإِنِّي غَفُورٞ رَّحِيمٞ","End":"١١"},{"SurahNumber":27,"VerseNumber":12,"Text":"وَأَدۡخِلۡ يَدَكَ فِي جَيۡبِكَ تَخۡرُجۡ بَيۡضَآءَ مِنۡ غَيۡرِ سُوٓءٖۖ فِي تِسۡعِ ءَايَٰتٍ إِلَىٰ فِرۡعَوۡنَ وَقَوۡمِهِۦٓۚ إِنَّهُمۡ كَانُواْ قَوۡمٗا فَٰسِقِينَ","End":"١٢"},{"SurahNumber":27,"VerseNumber":13,"Text":"فَلَمَّا جَآءَتۡهُمۡ ءَايَٰتُنَا مُبۡصِرَةٗ قَالُواْ هَٰذَا سِحۡرٞ مُّبِينٞ","End":"١٣"},{"SurahNumber":27,"VerseNumber":14,"Text":"وَجَحَدُواْ بِهَا وَٱسۡتَيۡقَنَتۡهَآ أَنفُسُهُمۡ ظُلۡمٗا وَعُلُوّٗاۚ فَٱنظُرۡ كَيۡفَ كَانَ عَٰقِبَةُ ٱلۡمُفۡسِدِينَ","End":"١٤"},{"SurahNumber":27,"VerseNumber":15,"Text":"وَلَقَدۡ ءَاتَيۡنَا دَاوُۥدَ وَسُلَيۡمَٰنَ عِلۡمٗاۖ وَقَالَا ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي فَضَّلَنَا عَلَىٰ كَثِيرٖ مِّنۡ عِبَادِهِ ٱلۡمُؤۡمِنِينَ","End":"١٥"},{"SurahNumber":27,"VerseNumber":16,"Text":"وَوَرِثَ سُلَيۡمَٰنُ دَاوُۥدَۖ وَقَالَ يَـٰٓأَيُّهَا ٱلنَّاسُ عُلِّمۡنَا مَنطِقَ ٱلطَّيۡرِ وَأُوتِينَا مِن كُلِّ شَيۡءٍۖ إِنَّ هَٰذَا لَهُوَ ٱلۡفَضۡلُ ٱلۡمُبِينُ","End":"١٦"},{"SurahNumber":27,"VerseNumber":17,"Text":"وَحُشِرَ لِسُلَيۡمَٰنَ جُنُودُهُۥ مِنَ ٱلۡجِنِّ وَٱلۡإِنسِ وَٱلطَّيۡرِ فَهُمۡ يُوزَعُونَ","End":"١٧"},{"SurahNumber":27,"VerseNumber":18,"Text":"حَتَّىٰٓ إِذَآ أَتَوۡاْ عَلَىٰ وَادِ ٱلنَّمۡلِ قَالَتۡ نَمۡلَةٞ يَـٰٓأَيُّهَا ٱلنَّمۡلُ ٱدۡخُلُواْ مَسَٰكِنَكُمۡ لَا يَحۡطِمَنَّكُمۡ سُلَيۡمَٰنُ وَجُنُودُهُۥ وَهُمۡ لَا يَشۡعُرُونَ","End":"١٨"},{"SurahNumber":27,"VerseNumber":19,"Text":"فَتَبَسَّمَ ضَاحِكٗا مِّن قَوۡلِهَا وَقَالَ رَبِّ أَوۡزِعۡنِيٓ أَنۡ أَشۡكُرَ نِعۡمَتَكَ ٱلَّتِيٓ أَنۡعَمۡتَ عَلَيَّ وَعَلَىٰ وَٰلِدَيَّ وَأَنۡ أَعۡمَلَ صَٰلِحٗا تَرۡضَىٰهُ وَأَدۡخِلۡنِي بِرَحۡمَتِكَ فِي عِبَادِكَ ٱلصَّـٰلِحِينَ","End":"١٩"},{"SurahNumber":27,"VerseNumber":20,"Text":"وَتَفَقَّدَ ٱلطَّيۡرَ فَقَالَ مَالِيَ لَآ أَرَى ٱلۡهُدۡهُدَ أَمۡ كَانَ مِنَ ٱلۡغَآئِبِينَ","End":"٢٠"},{"SurahNumber":27,"VerseNumber":21,"Text":"لَأُعَذِّبَنَّهُۥ عَذَابٗا شَدِيدًا أَوۡ لَأَاْذۡبَحَنَّهُۥٓ أَوۡ لَيَأۡتِيَنِّي بِسُلۡطَٰنٖ مُّبِينٖ","End":"٢١"},{"SurahNumber":27,"VerseNumber":22,"Text":"فَمَكَثَ غَيۡرَ بَعِيدٖ فَقَالَ أَحَطتُ بِمَا لَمۡ تُحِطۡ بِهِۦ وَجِئۡتُكَ مِن سَبَإِۭ بِنَبَإٖ يَقِينٍ","End":"٢٢"},{"SurahNumber":27,"VerseNumber":23,"Text":"إِنِّي وَجَدتُّ ٱمۡرَأَةٗ تَمۡلِكُهُمۡ وَأُوتِيَتۡ مِن كُلِّ شَيۡءٖ وَلَهَا عَرۡشٌ عَظِيمٞ","End":"٢٣"},{"SurahNumber":27,"VerseNumber":24,"Text":"وَجَدتُّهَا وَقَوۡمَهَا يَسۡجُدُونَ لِلشَّمۡسِ مِن دُونِ ٱللَّهِ وَزَيَّنَ لَهُمُ ٱلشَّيۡطَٰنُ أَعۡمَٰلَهُمۡ فَصَدَّهُمۡ عَنِ ٱلسَّبِيلِ فَهُمۡ لَا يَهۡتَدُونَ","End":"٢٤"},{"SurahNumber":27,"VerseNumber":25,"Text":"أَلَّاۤ يَسۡجُدُواْۤ لِلَّهِ ٱلَّذِي يُخۡرِجُ ٱلۡخَبۡءَ فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَيَعۡلَمُ مَا تُخۡفُونَ وَمَا تُعۡلِنُونَ","End":"٢٥"},{"SurahNumber":27,"VerseNumber":26,"Text":"ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ رَبُّ ٱلۡعَرۡشِ ٱلۡعَظِيمِ۩","End":"٢٦"},{"SurahNumber":27,"VerseNumber":27,"Text":"۞قَالَ سَنَنظُرُ أَصَدَقۡتَ أَمۡ كُنتَ مِنَ ٱلۡكَٰذِبِينَ","End":"٢٧"},{"SurahNumber":27,"VerseNumber":28,"Text":"ٱذۡهَب بِّكِتَٰبِي هَٰذَا فَأَلۡقِهۡ إِلَيۡهِمۡ ثُمَّ تَوَلَّ عَنۡهُمۡ فَٱنظُرۡ مَاذَا يَرۡجِعُونَ","End":"٢٨"},{"SurahNumber":27,"VerseNumber":29,"Text":"قَالَتۡ يَـٰٓأَيُّهَا ٱلۡمَلَؤُاْ إِنِّيٓ أُلۡقِيَ إِلَيَّ كِتَٰبٞ كَرِيمٌ","End":"٢٩"},{"SurahNumber":27,"VerseNumber":30,"Text":"إِنَّهُۥ مِن سُلَيۡمَٰنَ وَإِنَّهُۥ بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ","End":"٣٠"},{"SurahNumber":27,"VerseNumber":31,"Text":"أَلَّا تَعۡلُواْ عَلَيَّ وَأۡتُونِي مُسۡلِمِينَ","End":"٣١"},{"SurahNumber":27,"VerseNumber":32,"Text":"قَالَتۡ يَـٰٓأَيُّهَا ٱلۡمَلَؤُاْ أَفۡتُونِي فِيٓ أَمۡرِي مَا كُنتُ قَاطِعَةً أَمۡرًا حَتَّىٰ تَشۡهَدُونِ","End":"٣٢"},{"SurahNumber":27,"VerseNumber":33,"Text":"قَالُواْ نَحۡنُ أُوْلُواْ قُوَّةٖ وَأُوْلُواْ بَأۡسٖ شَدِيدٖ وَٱلۡأَمۡرُ إِلَيۡكِ فَٱنظُرِي مَاذَا تَأۡمُرِينَ","End":"٣٣"},{"SurahNumber":27,"VerseNumber":34,"Text":"قَالَتۡ إِنَّ ٱلۡمُلُوكَ إِذَا دَخَلُواْ قَرۡيَةً أَفۡسَدُوهَا وَجَعَلُوٓاْ أَعِزَّةَ أَهۡلِهَآ أَذِلَّةٗۚ وَكَذَٰلِكَ يَفۡعَلُونَ","End":"٣٤"},{"SurahNumber":27,"VerseNumber":35,"Text":"وَإِنِّي مُرۡسِلَةٌ إِلَيۡهِم بِهَدِيَّةٖ فَنَاظِرَةُۢ بِمَ يَرۡجِعُ ٱلۡمُرۡسَلُونَ","End":"٣٥"},{"SurahNumber":27,"VerseNumber":36,"Text":"فَلَمَّا جَآءَ سُلَيۡمَٰنَ قَالَ أَتُمِدُّونَنِ بِمَالٖ فَمَآ ءَاتَىٰنِۦَ ٱللَّهُ خَيۡرٞ مِّمَّآ ءَاتَىٰكُمۚ بَلۡ أَنتُم بِهَدِيَّتِكُمۡ تَفۡرَحُونَ","End":"٣٦"},{"SurahNumber":27,"VerseNumber":37,"Text":"ٱرۡجِعۡ إِلَيۡهِمۡ فَلَنَأۡتِيَنَّهُم بِجُنُودٖ لَّا قِبَلَ لَهُم بِهَا وَلَنُخۡرِجَنَّهُم مِّنۡهَآ أَذِلَّةٗ وَهُمۡ صَٰغِرُونَ","End":"٣٧"},{"SurahNumber":27,"VerseNumber":38,"Text":"قَالَ يَـٰٓأَيُّهَا ٱلۡمَلَؤُاْ أَيُّكُمۡ يَأۡتِينِي بِعَرۡشِهَا قَبۡلَ أَن يَأۡتُونِي مُسۡلِمِينَ","End":"٣٨"},{"SurahNumber":27,"VerseNumber":39,"Text":"قَالَ عِفۡرِيتٞ مِّنَ ٱلۡجِنِّ أَنَا۠ ءَاتِيكَ بِهِۦ قَبۡلَ أَن تَقُومَ مِن مَّقَامِكَۖ وَإِنِّي عَلَيۡهِ لَقَوِيٌّ أَمِينٞ","End":"٣٩"},{"SurahNumber":27,"VerseNumber":40,"Text":"قَالَ ٱلَّذِي عِندَهُۥ عِلۡمٞ مِّنَ ٱلۡكِتَٰبِ أَنَا۠ ءَاتِيكَ بِهِۦ قَبۡلَ أَن يَرۡتَدَّ إِلَيۡكَ طَرۡفُكَۚ فَلَمَّا رَءَاهُ مُسۡتَقِرًّا عِندَهُۥ قَالَ هَٰذَا مِن فَضۡلِ رَبِّي لِيَبۡلُوَنِيٓ ءَأَشۡكُرُ أَمۡ أَكۡفُرُۖ وَمَن شَكَرَ فَإِنَّمَا يَشۡكُرُ لِنَفۡسِهِۦۖ وَمَن كَفَرَ فَإِنَّ رَبِّي غَنِيّٞ كَرِيمٞ","End":"٤٠"},{"SurahNumber":27,"VerseNumber":41,"Text":"قَالَ نَكِّرُواْ لَهَا عَرۡشَهَا نَنظُرۡ أَتَهۡتَدِيٓ أَمۡ تَكُونُ مِنَ ٱلَّذِينَ لَا يَهۡتَدُونَ","End":"٤١"},{"SurahNumber":27,"VerseNumber":42,"Text":"فَلَمَّا جَآءَتۡ قِيلَ أَهَٰكَذَا عَرۡشُكِۖ قَالَتۡ كَأَنَّهُۥ هُوَۚ وَأُوتِينَا ٱلۡعِلۡمَ مِن قَبۡلِهَا وَكُنَّا مُسۡلِمِينَ","End":"٤٢"},{"SurahNumber":27,"VerseNumber":43,"Text":"وَصَدَّهَا مَا كَانَت تَّعۡبُدُ مِن دُونِ ٱللَّهِۖ إِنَّهَا كَانَتۡ مِن قَوۡمٖ كَٰفِرِينَ","End":"٤٣"},{"SurahNumber":27,"VerseNumber":44,"Text":"قِيلَ لَهَا ٱدۡخُلِي ٱلصَّرۡحَۖ فَلَمَّا رَأَتۡهُ حَسِبَتۡهُ لُجَّةٗ وَكَشَفَتۡ عَن سَاقَيۡهَاۚ قَالَ إِنَّهُۥ صَرۡحٞ مُّمَرَّدٞ مِّن قَوَارِيرَۗ قَالَتۡ رَبِّ إِنِّي ظَلَمۡتُ نَفۡسِي وَأَسۡلَمۡتُ مَعَ سُلَيۡمَٰنَ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ","End":"٤٤"},{"SurahNumber":27,"VerseNumber":45,"Text":"وَلَقَدۡ أَرۡسَلۡنَآ إِلَىٰ ثَمُودَ أَخَاهُمۡ صَٰلِحًا أَنِ ٱعۡبُدُواْ ٱللَّهَ فَإِذَا هُمۡ فَرِيقَانِ يَخۡتَصِمُونَ","End":"٤٥"},{"SurahNumber":27,"VerseNumber":46,"Text":"قَالَ يَٰقَوۡمِ لِمَ تَسۡتَعۡجِلُونَ بِٱلسَّيِّئَةِ قَبۡلَ ٱلۡحَسَنَةِۖ لَوۡلَا تَسۡتَغۡفِرُونَ ٱللَّهَ لَعَلَّكُمۡ تُرۡحَمُونَ","End":"٤٦"},{"SurahNumber":27,"VerseNumber":47,"Text":"قَالُواْ ٱطَّيَّرۡنَا بِكَ وَبِمَن مَّعَكَۚ قَالَ طَـٰٓئِرُكُمۡ عِندَ ٱللَّهِۖ بَلۡ أَنتُمۡ قَوۡمٞ تُفۡتَنُونَ","End":"٤٧"},{"SurahNumber":27,"VerseNumber":48,"Text":"وَكَانَ فِي ٱلۡمَدِينَةِ تِسۡعَةُ رَهۡطٖ يُفۡسِدُونَ فِي ٱلۡأَرۡضِ وَلَا يُصۡلِحُونَ","End":"٤٨"},{"SurahNumber":27,"VerseNumber":49,"Text":"قَالُواْ تَقَاسَمُواْ بِٱللَّهِ لَنُبَيِّتَنَّهُۥ وَأَهۡلَهُۥ ثُمَّ لَنَقُولَنَّ لِوَلِيِّهِۦ مَا شَهِدۡنَا مَهۡلِكَ أَهۡلِهِۦ وَإِنَّا لَصَٰدِقُونَ","End":"٤٩"},{"SurahNumber":27,"VerseNumber":50,"Text":"وَمَكَرُواْ مَكۡرٗا وَمَكَرۡنَا مَكۡرٗا وَهُمۡ لَا يَشۡعُرُونَ","End":"٥٠"},{"SurahNumber":27,"VerseNumber":51,"Text":"فَٱنظُرۡ كَيۡفَ كَانَ عَٰقِبَةُ مَكۡرِهِمۡ أَنَّا دَمَّرۡنَٰهُمۡ وَقَوۡمَهُمۡ أَجۡمَعِينَ","End":"٥١"},{"SurahNumber":27,"VerseNumber":52,"Text":"فَتِلۡكَ بُيُوتُهُمۡ خَاوِيَةَۢ بِمَا ظَلَمُوٓاْۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَعۡلَمُونَ","End":"٥٢"},{"SurahNumber":27,"VerseNumber":53,"Text":"وَأَنجَيۡنَا ٱلَّذِينَ ءَامَنُواْ وَكَانُواْ يَتَّقُونَ","End":"٥٣"},{"SurahNumber":27,"VerseNumber":54,"Text":"وَلُوطًا إِذۡ قَالَ لِقَوۡمِهِۦٓ أَتَأۡتُونَ ٱلۡفَٰحِشَةَ وَأَنتُمۡ تُبۡصِرُونَ","End":"٥٤"},{"SurahNumber":27,"VerseNumber":55,"Text":"أَئِنَّكُمۡ لَتَأۡتُونَ ٱلرِّجَالَ شَهۡوَةٗ مِّن دُونِ ٱلنِّسَآءِۚ بَلۡ أَنتُمۡ قَوۡمٞ تَجۡهَلُونَ","End":"٥٥"},{"SurahNumber":27,"VerseNumber":56,"Text":"۞فَمَا كَانَ جَوَابَ قَوۡمِهِۦٓ إِلَّآ أَن قَالُوٓاْ أَخۡرِجُوٓاْ ءَالَ لُوطٖ مِّن قَرۡيَتِكُمۡۖ إِنَّهُمۡ أُنَاسٞ يَتَطَهَّرُونَ","End":"٥٦"},{"SurahNumber":27,"VerseNumber":57,"Text":"فَأَنجَيۡنَٰهُ وَأَهۡلَهُۥٓ إِلَّا ٱمۡرَأَتَهُۥ قَدَّرۡنَٰهَا مِنَ ٱلۡغَٰبِرِينَ","End":"٥٧"},{"SurahNumber":27,"VerseNumber":58,"Text":"وَأَمۡطَرۡنَا عَلَيۡهِم مَّطَرٗاۖ فَسَآءَ مَطَرُ ٱلۡمُنذَرِينَ","End":"٥٨"},{"SurahNumber":27,"VerseNumber":59,"Text":"قُلِ ٱلۡحَمۡدُ لِلَّهِ وَسَلَٰمٌ عَلَىٰ عِبَادِهِ ٱلَّذِينَ ٱصۡطَفَىٰٓۗ ءَآللَّهُ خَيۡرٌ أَمَّا يُشۡرِكُونَ","End":"٥٩"},{"SurahNumber":27,"VerseNumber":60,"Text":"أَمَّنۡ خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَأَنزَلَ لَكُم مِّنَ ٱلسَّمَآءِ مَآءٗ فَأَنۢبَتۡنَا بِهِۦ حَدَآئِقَ ذَاتَ بَهۡجَةٖ مَّا كَانَ لَكُمۡ أَن تُنۢبِتُواْ شَجَرَهَآۗ أَءِلَٰهٞ مَّعَ ٱللَّهِۚ بَلۡ هُمۡ قَوۡمٞ يَعۡدِلُونَ","End":"٦٠"},{"SurahNumber":27,"VerseNumber":61,"Text":"أَمَّن جَعَلَ ٱلۡأَرۡضَ قَرَارٗا وَجَعَلَ خِلَٰلَهَآ أَنۡهَٰرٗا وَجَعَلَ لَهَا رَوَٰسِيَ وَجَعَلَ بَيۡنَ ٱلۡبَحۡرَيۡنِ حَاجِزًاۗ أَءِلَٰهٞ مَّعَ ٱللَّهِۚ بَلۡ أَكۡثَرُهُمۡ لَا يَعۡلَمُونَ","End":"٦١"},{"SurahNumber":27,"VerseNumber":62,"Text":"أَمَّن يُجِيبُ ٱلۡمُضۡطَرَّ إِذَا دَعَاهُ وَيَكۡشِفُ ٱلسُّوٓءَ وَيَجۡعَلُكُمۡ خُلَفَآءَ ٱلۡأَرۡضِۗ أَءِلَٰهٞ مَّعَ ٱللَّهِۚ قَلِيلٗا مَّا تَذَكَّرُونَ","End":"٦٢"},{"SurahNumber":27,"VerseNumber":63,"Text":"أَمَّن يَهۡدِيكُمۡ فِي ظُلُمَٰتِ ٱلۡبَرِّ وَٱلۡبَحۡرِ وَمَن يُرۡسِلُ ٱلرِّيَٰحَ بُشۡرَۢا بَيۡنَ يَدَيۡ رَحۡمَتِهِۦٓۗ أَءِلَٰهٞ مَّعَ ٱللَّهِۚ تَعَٰلَى ٱللَّهُ عَمَّا يُشۡرِكُونَ","End":"٦٣"},{"SurahNumber":27,"VerseNumber":64,"Text":"أَمَّن يَبۡدَؤُاْ ٱلۡخَلۡقَ ثُمَّ يُعِيدُهُۥ وَمَن يَرۡزُقُكُم مِّنَ ٱلسَّمَآءِ وَٱلۡأَرۡضِۗ أَءِلَٰهٞ مَّعَ ٱللَّهِۚ قُلۡ هَاتُواْ بُرۡهَٰنَكُمۡ إِن كُنتُمۡ صَٰدِقِينَ","End":"٦٤"},{"SurahNumber":27,"VerseNumber":65,"Text":"قُل لَّا يَعۡلَمُ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ ٱلۡغَيۡبَ إِلَّا ٱللَّهُۚ وَمَا يَشۡعُرُونَ أَيَّانَ يُبۡعَثُونَ","End":"٦٥"},{"SurahNumber":27,"VerseNumber":66,"Text":"بَلِ ٱدَّـٰرَكَ عِلۡمُهُمۡ فِي ٱلۡأٓخِرَةِۚ بَلۡ هُمۡ فِي شَكّٖ مِّنۡهَاۖ بَلۡ هُم مِّنۡهَا عَمُونَ","End":"٦٦"},{"SurahNumber":27,"VerseNumber":67,"Text":"وَقَالَ ٱلَّذِينَ كَفَرُوٓاْ أَءِذَا كُنَّا تُرَٰبٗا وَءَابَآؤُنَآ أَئِنَّا لَمُخۡرَجُونَ","End":"٦٧"},{"SurahNumber":27,"VerseNumber":68,"Text":"لَقَدۡ وُعِدۡنَا هَٰذَا نَحۡنُ وَءَابَآؤُنَا مِن قَبۡلُ إِنۡ هَٰذَآ إِلَّآ أَسَٰطِيرُ ٱلۡأَوَّلِينَ","End":"٦٨"},{"SurahNumber":27,"VerseNumber":69,"Text":"قُلۡ سِيرُواْ فِي ٱلۡأَرۡضِ فَٱنظُرُواْ كَيۡفَ كَانَ عَٰقِبَةُ ٱلۡمُجۡرِمِينَ","End":"٦٩"},{"SurahNumber":27,"VerseNumber":70,"Text":"وَلَا تَحۡزَنۡ عَلَيۡهِمۡ وَلَا تَكُن فِي ضَيۡقٖ مِّمَّا يَمۡكُرُونَ","End":"٧٠"},{"SurahNumber":27,"VerseNumber":71,"Text":"وَيَقُولُونَ مَتَىٰ هَٰذَا ٱلۡوَعۡدُ إِن كُنتُمۡ صَٰدِقِينَ","End":"٧١"},{"SurahNumber":27,"VerseNumber":72,"Text":"قُلۡ عَسَىٰٓ أَن يَكُونَ رَدِفَ لَكُم بَعۡضُ ٱلَّذِي تَسۡتَعۡجِلُونَ","End":"٧٢"},{"SurahNumber":27,"VerseNumber":73,"Text":"وَإِنَّ رَبَّكَ لَذُو فَضۡلٍ عَلَى ٱلنَّاسِ وَلَٰكِنَّ أَكۡثَرَهُمۡ لَا يَشۡكُرُونَ","End":"٧٣"},{"SurahNumber":27,"VerseNumber":74,"Text":"وَإِنَّ رَبَّكَ لَيَعۡلَمُ مَا تُكِنُّ صُدُورُهُمۡ وَمَا يُعۡلِنُونَ","End":"٧٤"},{"SurahNumber":27,"VerseNumber":75,"Text":"وَمَا مِنۡ غَآئِبَةٖ فِي ٱلسَّمَآءِ وَٱلۡأَرۡضِ إِلَّا فِي كِتَٰبٖ مُّبِينٍ","End":"٧٥"},{"SurahNumber":27,"VerseNumber":76,"Text":"إِنَّ هَٰذَا ٱلۡقُرۡءَانَ يَقُصُّ عَلَىٰ بَنِيٓ إِسۡرَـٰٓءِيلَ أَكۡثَرَ ٱلَّذِي هُمۡ فِيهِ يَخۡتَلِفُونَ","End":"٧٦"},{"SurahNumber":27,"VerseNumber":77,"Text":"وَإِنَّهُۥ لَهُدٗى وَرَحۡمَةٞ لِّلۡمُؤۡمِنِينَ","End":"٧٧"},{"SurahNumber":27,"VerseNumber":78,"Text":"إِنَّ رَبَّكَ يَقۡضِي بَيۡنَهُم بِحُكۡمِهِۦۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡعَلِيمُ","End":"٧٨"},{"SurahNumber":27,"VerseNumber":79,"Text":"فَتَوَكَّلۡ عَلَى ٱللَّهِۖ إِنَّكَ عَلَى ٱلۡحَقِّ ٱلۡمُبِينِ","End":"٧٩"},{"SurahNumber":27,"VerseNumber":80,"Text":"إِنَّكَ لَا تُسۡمِعُ ٱلۡمَوۡتَىٰ وَلَا تُسۡمِعُ ٱلصُّمَّ ٱلدُّعَآءَ إِذَا وَلَّوۡاْ مُدۡبِرِينَ","End":"٨٠"},{"SurahNumber":27,"VerseNumber":81,"Text":"وَمَآ أَنتَ بِهَٰدِي ٱلۡعُمۡيِ عَن ضَلَٰلَتِهِمۡۖ إِن تُسۡمِعُ إِلَّا مَن يُؤۡمِنُ بِـَٔايَٰتِنَا فَهُم مُّسۡلِمُونَ","End":"٨١"},{"SurahNumber":27,"VerseNumber":82,"Text":"۞وَإِذَا وَقَعَ ٱلۡقَوۡلُ عَلَيۡهِمۡ أَخۡرَجۡنَا لَهُمۡ دَآبَّةٗ مِّنَ ٱلۡأَرۡضِ تُكَلِّمُهُمۡ أَنَّ ٱلنَّاسَ كَانُواْ بِـَٔايَٰتِنَا لَا يُوقِنُونَ","End":"٨٢"},{"SurahNumber":27,"VerseNumber":83,"Text":"وَيَوۡمَ نَحۡشُرُ مِن كُلِّ أُمَّةٖ فَوۡجٗا مِّمَّن يُكَذِّبُ بِـَٔايَٰتِنَا فَهُمۡ يُوزَعُونَ","End":"٨٣"},{"SurahNumber":27,"VerseNumber":84,"Text":"حَتَّىٰٓ إِذَا جَآءُو قَالَ أَكَذَّبۡتُم بِـَٔايَٰتِي وَلَمۡ تُحِيطُواْ بِهَا عِلۡمًا أَمَّاذَا كُنتُمۡ تَعۡمَلُونَ","End":"٨٤"},{"SurahNumber":27,"VerseNumber":85,"Text":"وَوَقَعَ ٱلۡقَوۡلُ عَلَيۡهِم بِمَا ظَلَمُواْ فَهُمۡ لَا يَنطِقُونَ","End":"٨٥"},{"SurahNumber":27,"VerseNumber":86,"Text":"أَلَمۡ يَرَوۡاْ أَنَّا جَعَلۡنَا ٱلَّيۡلَ لِيَسۡكُنُواْ فِيهِ وَٱلنَّهَارَ مُبۡصِرًاۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يُؤۡمِنُونَ","End":"٨٦"},{"SurahNumber":27,"VerseNumber":87,"Text":"وَيَوۡمَ يُنفَخُ فِي ٱلصُّورِ فَفَزِعَ مَن فِي ٱلسَّمَٰوَٰتِ وَمَن فِي ٱلۡأَرۡضِ إِلَّا مَن شَآءَ ٱللَّهُۚ وَكُلٌّ أَتَوۡهُ دَٰخِرِينَ","End":"٨٧"},{"SurahNumber":27,"VerseNumber":88,"Text":"وَتَرَى ٱلۡجِبَالَ تَحۡسَبُهَا جَامِدَةٗ وَهِيَ تَمُرُّ مَرَّ ٱلسَّحَابِۚ صُنۡعَ ٱللَّهِ ٱلَّذِيٓ أَتۡقَنَ كُلَّ شَيۡءٍۚ إِنَّهُۥ خَبِيرُۢ بِمَا تَفۡعَلُونَ","End":"٨٨"},{"SurahNumber":27,"VerseNumber":89,"Text":"مَن جَآءَ بِٱلۡحَسَنَةِ فَلَهُۥ خَيۡرٞ مِّنۡهَا وَهُم مِّن فَزَعٖ يَوۡمَئِذٍ ءَامِنُونَ","End":"٨٩"},{"SurahNumber":27,"VerseNumber":90,"Text":"وَمَن جَآءَ بِٱلسَّيِّئَةِ فَكُبَّتۡ وُجُوهُهُمۡ فِي ٱلنَّارِ هَلۡ تُجۡزَوۡنَ إِلَّا مَا كُنتُمۡ تَعۡمَلُونَ","End":"٩٠"},{"SurahNumber":27,"VerseNumber":91,"Text":"إِنَّمَآ أُمِرۡتُ أَنۡ أَعۡبُدَ رَبَّ هَٰذِهِ ٱلۡبَلۡدَةِ ٱلَّذِي حَرَّمَهَا وَلَهُۥ كُلُّ شَيۡءٖۖ وَأُمِرۡتُ أَنۡ أَكُونَ مِنَ ٱلۡمُسۡلِمِينَ","End":"٩١"},{"SurahNumber":27,"VerseNumber":92,"Text":"وَأَنۡ أَتۡلُوَاْ ٱلۡقُرۡءَانَۖ فَمَنِ ٱهۡتَدَىٰ فَإِنَّمَا يَهۡتَدِي لِنَفۡسِهِۦۖ وَمَن ضَلَّ فَقُلۡ إِنَّمَآ أَنَا۠ مِنَ ٱلۡمُنذِرِينَ","End":"٩٢"},{"SurahNumber":27,"VerseNumber":93,"Text":"وَقُلِ ٱلۡحَمۡدُ لِلَّهِ سَيُرِيكُمۡ ءَايَٰتِهِۦ فَتَعۡرِفُونَهَاۚ وَمَا رَبُّكَ بِغَٰفِلٍ عَمَّا تَعۡمَلُونَ","End":"٩٣"}],"Translations":[{"LanguageCode":"ara","Language":"Arabic","Name":"ara-quran-la","Author":"Quran Transliteration","Source":"http://tanzil.net","Direction":"ltr","Translations":[{"SurahNumber":27,"VerseNumber":1,"Text":"Taseen tilka ayatu alqurani wakitabin mubeenin"},{"SurahNumber":27,"VerseNumber":2,"Text":"Hudan wabushra lilmumineena"},{"SurahNumber":27,"VerseNumber":3,"Text":"Allatheena yuqeemoona alssalata wayutoona alzzakata wahum bialakhirati hum yooqinoona"},{"SurahNumber":27,"VerseNumber":4,"Text":"Inna allatheena la yuminoona bialakhirati zayyanna lahum aAAmalahum fahum yaAAmahoona"},{"SurahNumber":27,"VerseNumber":5,"Text":"Olaika allatheena lahum sooo alAAathabi wahum fee alakhirati humu alakhsaroona"},{"SurahNumber":27,"VerseNumber":6,"Text":"Wainnaka latulaqqa alqurana min ladun hakeemin AAaleemin"},{"SurahNumber":27,"VerseNumber":7,"Text":"Ith qala moosa liahlihi innee anastu naran saateekum minha bikhabarin aw ateekum bishihabin qabasin laAAallakum tastaloona"},{"SurahNumber":27,"VerseNumber":8,"Text":"Falamma jaaha noodiya an boorika man fee alnnari waman hawlaha wasubhana Allahi rabbi alAAalameena"},{"SurahNumber":27,"VerseNumber":9,"Text":"Ya moosa innahu ana Allahu alAAazeezu alhakeemu"},{"SurahNumber":27,"VerseNumber":10,"Text":"Waalqi AAasaka falamma raaha tahtazzu kaannaha jannun walla mudbiran walam yuAAaqqib ya moosa la takhaf innee la yakhafu ladayya almursaloona"},{"SurahNumber":27,"VerseNumber":11,"Text":"Illa man thalama thumma baddala husnan baAAda sooin fainnee ghafoorun raheemun"},{"SurahNumber":27,"VerseNumber":12,"Text":"Waadkhil yadaka fee jaybika takhruj baydaa min ghayri sooin fee tisAAi ayatin ila firAAawna waqawmihi innahum kanoo qawman fasiqeena"},{"SurahNumber":27,"VerseNumber":13,"Text":"Falamma jaathum ayatuna mubsiratan qaloo hatha sihrun mubeenun"},{"SurahNumber":27,"VerseNumber":14,"Text":"Wajahadoo biha waistayqanatha anfusuhum thulman waAAuluwwan faonthur kayfa kana AAaqibatu almufsideena"},{"SurahNumber":27,"VerseNumber":15,"Text":"Walaqad atayna dawooda wasulaymana AAilman waqala alhamdu lillahi allathee faddalana AAala katheerin min AAibadihi almumineena"},{"SurahNumber":27,"VerseNumber":16,"Text":"Wawaritha sulaymanu dawooda waqala ya ayyuha alnnasu AAullimna mantiqa alttayri waooteena min kulli shayin inna hatha lahuwa alfadlu almubeenu"},{"SurahNumber":27,"VerseNumber":17,"Text":"Wahushira lisulaymana junooduhu mina aljinni waalinsi waalttayri fahum yoozaAAoona"},{"SurahNumber":27,"VerseNumber":18,"Text":"Hatta itha ataw AAala wadi alnnamli qalat namlatun ya ayyuha alnnamlu odkhuloo masakinakum la yahtimannakum sulaymanu wajunooduhu wahum la yashAAuroona"},{"SurahNumber":27,"VerseNumber":19,"Text":"Fatabassama dahikan min qawliha waqala rabbi awziAAnee an ashkura niAAmataka allatee anAAamta AAalayya waAAala walidayya waan aAAmala salihan tardahu waadkhilnee birahmatika fee AAibadika alssaliheena"},{"SurahNumber":27,"VerseNumber":20,"Text":"Watafaqqada alttayra faqala ma liya la ara alhudhuda am kana mina alghaibeena"},{"SurahNumber":27,"VerseNumber":21,"Text":"LaoAAaththibannahu AAathaban shadeedan aw laathbahannahu aw layatiyannee bisultanin mubeenin"},{"SurahNumber":27,"VerseNumber":22,"Text":"Famakatha ghayra baAAeedin faqala ahattu bima lam tuhit bihi wajituka min sabain binabain yaqeenin"},{"SurahNumber":27,"VerseNumber":23,"Text":"Innee wajadtu imraatan tamlikuhum waootiyat min kulli shayin walaha AAarshun AAatheemun"},{"SurahNumber":27,"VerseNumber":24,"Text":"Wajadtuha waqawmaha yasjudoona lilshshamsi min dooni Allahi wazayyana lahumu alshshaytanu aAAmalahum fasaddahum AAani alssabeeli fahum la yahtadoona"},{"SurahNumber":27,"VerseNumber":25,"Text":"Alla yasjudoo lillahi allathee yukhriju alkhabaa fee alssamawati waalardi wayaAAlamu ma tukhfoona wama tuAAlinoona"},{"SurahNumber":27,"VerseNumber":26,"Text":"Allahu la ilaha illa huwa rabbu alAAarshi alAAatheemi"},{"SurahNumber":27,"VerseNumber":27,"Text":"Qala sananthuru asadaqta am kunta mina alkathibeena"},{"SurahNumber":27,"VerseNumber":28,"Text":"Ithhab bikitabee hatha faalqih ilayhim thumma tawalla AAanhum faonthur matha yarjiAAoona"},{"SurahNumber":27,"VerseNumber":29,"Text":"Qalat ya ayyuha almalao innee olqiya ilayya kitabun kareemun"},{"SurahNumber":27,"VerseNumber":30,"Text":"Innahu min sulaymana wainnahu bismi Allahi alrrahmani alrraheemi"},{"SurahNumber":27,"VerseNumber":31,"Text":"Alla taAAloo AAalayya watoonee muslimeena"},{"SurahNumber":27,"VerseNumber":32,"Text":"Qalat ya ayyuha almalao aftoonee fee amree ma kuntu qatiAAatan amran hatta tashhadoona"},{"SurahNumber":27,"VerseNumber":33,"Text":"Qaloo nahnu oloo quwwatin waoloo basin shadeedin waalamru ilayki faonthuree matha tamureena"},{"SurahNumber":27,"VerseNumber":34,"Text":"Qalat inna almulooka itha dakhaloo qaryatan afsadooha wajaAAaloo aAAizzata ahliha athillatan wakathalika yafAAaloona"},{"SurahNumber":27,"VerseNumber":35,"Text":"Wainnee mursilatun ilayhim bihadiyyatin fanathiratun bima yarjiAAu almursaloona"},{"SurahNumber":27,"VerseNumber":36,"Text":"Falamma jaa sulaymana qala atumiddoonani bimalin fama ataniya Allahu khayrun mimma atakum bal antum bihadiyyatikum tafrahoona"},{"SurahNumber":27,"VerseNumber":37,"Text":"IrjiAA ilayhim falanatiyannahum bijunoodin la qibala lahum biha walanukhrijannahum minha athillatan wahum saghiroona"},{"SurahNumber":27,"VerseNumber":38,"Text":"Qala ya ayyuha almalao ayyukum yateenee biAAarshiha qabla an yatoonee muslimeena"},{"SurahNumber":27,"VerseNumber":39,"Text":"Qala AAifreetun mina aljinni ana ateeka bihi qabla an taqooma min maqamika wainne AAalayhi laqawiyyun ameenun"},{"SurahNumber":27,"VerseNumber":40,"Text":"Qala allathee AAindahu AAilmun mina alkitabi ana ateeka bihi qabla an yartadda ilayka tarfuka falamma raahu mustaqirran AAindahu qala hatha min fadli rabbee liyabluwanee aashkuru am akfuru waman shakara fainnama yashkuru linafsihi waman kafara fainna rabbee ghaniyyun kareemun"},{"SurahNumber":27,"VerseNumber":41,"Text":"Qala nakkiroo laha AAarshaha nanthur atahtadee am takoonu mina allatheena la yahtadoona"},{"SurahNumber":27,"VerseNumber":42,"Text":"Falamma jaat qeela ahakatha AAarshuki qalat kaannahu huwa waooteena alAAilma min qabliha wakunna muslimeena"},{"SurahNumber":27,"VerseNumber":43,"Text":"Wasaddaha ma kanat taAAbudu min dooni Allahi innaha kanat min qawmin kafireena"},{"SurahNumber":27,"VerseNumber":44,"Text":"Qeela laha odkhulee alssarha falamma raathu hasibathu lujjatan wakashafat AAan saqayha qala innahu sarhun mumarradun min qawareera qalat rabbi innee thalamtu nafsee waaslamtu maAAa sulaymana lillahi rabbi alAAalameena"},{"SurahNumber":27,"VerseNumber":45,"Text":"Walaqad arsalna ila thamooda akhahum salihan ani oAAbudoo Allaha faitha hum fareeqani yakhtasimoona"},{"SurahNumber":27,"VerseNumber":46,"Text":"Qala ya qawmi lima tastaAAjiloona bialssayyiati qabla alhasanati lawla tastaghfiroona Allaha laAAallakum turhamoona"},{"SurahNumber":27,"VerseNumber":47,"Text":"Qaloo ittayyarna bika wabiman maAAaka qala tairukum AAinda Allahi bal antum qawmun tuftanoona"},{"SurahNumber":27,"VerseNumber":48,"Text":"Wakana fee almadeenati tisAAatu rahtin yufsidoona fee alardi wala yuslihoona"},{"SurahNumber":27,"VerseNumber":49,"Text":"Qaloo taqasamoo biAllahi lanubayyitannahu waahlahu thumma lanaqoolanna liwaliyyihi ma shahidna mahlika ahlihi wainna lasadiqoona"},{"SurahNumber":27,"VerseNumber":50,"Text":"Wamakaroo makran wamakarna makran wahum la yashAAuroona"},{"SurahNumber":27,"VerseNumber":51,"Text":"Faonthur kayfa kana AAaqibatu makrihim anna dammarnahum waqawmahum ajmaAAeena"},{"SurahNumber":27,"VerseNumber":52,"Text":"Fatilka buyootuhum khawiyatan bima thalamoo inna fee thalika laayatan liqawmin yaAAlamoona"},{"SurahNumber":27,"VerseNumber":53,"Text":"Waanjayna allatheena amanoo wakanoo yattaqoona"},{"SurahNumber":27,"VerseNumber":54,"Text":"Walootan ith qala liqawmihi atatoona alfahishata waantum tubsiroona"},{"SurahNumber":27,"VerseNumber":55,"Text":"Ainnakum latatoona alrrijala shahwatan min dooni alnnisai bal antum qawmun tajhaloona"},{"SurahNumber":27,"VerseNumber":56,"Text":"Fama kana jawaba qawmihi illa an qaloo akhrijoo ala lootin min qaryatikum innahum onasun yatatahharoona"},{"SurahNumber":27,"VerseNumber":57,"Text":"Faanjaynahu waahlahu illa imraatahu qaddarnaha mina alghabireena"},{"SurahNumber":27,"VerseNumber":58,"Text":"Waamtarna AAalayhim mataran fasaa mataru almunthareena"},{"SurahNumber":27,"VerseNumber":59,"Text":"Quli alhamdu lillahi wasalamun AAala AAibadihi allatheena istafa allahu khayrun amma yushrikoona"},{"SurahNumber":27,"VerseNumber":60,"Text":"Amman khalaqa alssamawati waalarda waanzala lakum mina alssamai maan faanbatna bihi hadaiqa thata bahjatin ma kana lakum an tunbitoo shajaraha ailahun maAAa Allahi bal hum qawmun yaAAdiloona"},{"SurahNumber":27,"VerseNumber":61,"Text":"Amman jaAAala alarda qararan wajaAAala khilalaha anharan wajaAAala laha rawasiya wajaAAala bayna albahrayni hajizan ailahun maAAa Allahi bal aktharuhum la yaAAlamoona"},{"SurahNumber":27,"VerseNumber":62,"Text":"Amman yujeebu almudtarra itha daAAahu wayakshifu alssooa wayajAAalukum khulafaa alardi ailahun maAAa Allahi qaleelan ma tathakkaroona"},{"SurahNumber":27,"VerseNumber":63,"Text":"Amman yahdeekum fee thulumati albarri waalbahri waman yursilu alrriyaha bushran bayna yaday rahmatihi ailahun maAAa Allahi taAAala Allahu AAamma yushrikoona"},{"SurahNumber":27,"VerseNumber":64,"Text":"Amman yabdao alkhalqa thumma yuAAeeduhu waman yarzuqukum mina alssamai waalardi ailahun maAAa Allahi qul hatoo burhanakum in kuntum sadiqeena"},{"SurahNumber":27,"VerseNumber":65,"Text":"Qul la yaAAlamu man fee alssamawati waalardi alghayba illa Allahu wama yashAAuroona ayyana yubAAathoona"},{"SurahNumber":27,"VerseNumber":66,"Text":"Bali iddaraka AAilmuhum fee alakhirati bal hum fee shakkin minha bal hum minha AAamoona"},{"SurahNumber":27,"VerseNumber":67,"Text":"Waqala allatheena kafaroo aitha kunna turaban waabaona ainna lamukhrajoona"},{"SurahNumber":27,"VerseNumber":68,"Text":"Laqad wuAAidna hatha nahnu waabaona min qablu in hatha illa asateeru alawwaleena"},{"SurahNumber":27,"VerseNumber":69,"Text":"Qul seeroo fee alardi faonthuroo kayfa kana AAaqibatu almujrimeena"},{"SurahNumber":27,"VerseNumber":70,"Text":"Wala tahzan AAalayhim wala takun fee dayqin mimma yamkuroona"},{"SurahNumber":27,"VerseNumber":71,"Text":"Wayaqooloona mata hatha alwaAAdu in kuntum sadiqeena"},{"SurahNumber":27,"VerseNumber":72,"Text":"Qul AAasa an yakoona radifa lakum baAAdu allathee tastaAAjiloona"},{"SurahNumber":27,"VerseNumber":73,"Text":"Wainna rabbaka lathoo fadlin AAala alnnasi walakinna aktharahum la yashkuroona"},{"SurahNumber":27,"VerseNumber":74,"Text":"Wainna rabbaka layaAAlamu ma tukinnu sudooruhum wama yuAAlinoona"},{"SurahNumber":27,"VerseNumber":75,"Text":"Wama min ghaibatin fee alssamai waalardi illa fee kitabin mubeenin"},{"SurahNumber":27,"VerseNumber":76,"Text":"Inna hatha alqurana yaqussu AAala banee israeela akthara allathee hum feehi yakhtalifoona"},{"SurahNumber":27,"VerseNumber":77,"Text":"Wainnahu lahudan warahmatun lilmumineena"},{"SurahNumber":27,"VerseNumber":78,"Text":"Inna rabbaka yaqdee baynahum bihukmihi wahuwa alAAazeezu alAAaleemu"},{"SurahNumber":27,"VerseNumber":79,"Text":"Fatawakkal AAala Allahi innaka AAala alhaqqi almubeeni"},{"SurahNumber":27,"VerseNumber":80,"Text":"Innaka la tusmiAAu almawta wala tusmiAAu alssumma aldduAAaa itha wallaw mudbireena"},{"SurahNumber":27,"VerseNumber":81,"Text":"Wama anta bihadee alAAumyi AAan dalalatihim in tusmiAAu illa man yuminu biayatina fahum muslimoona"},{"SurahNumber":27,"VerseNumber":82,"Text":"Waitha waqaAAa alqawlu AAalayhim akhrajna lahum dabbatan mina alardi tukallimuhum anna alnnasa kanoo biayatina la yooqinoona"},{"SurahNumber":27,"VerseNumber":83,"Text":"Wayawma nahshuru min kulli ommatin fawjan mimman yukaththibu biayatina fahum yoozaAAoona"},{"SurahNumber":27,"VerseNumber":84,"Text":"Hatta itha jaoo qala akaththabtum biayatee walam tuheetoo biha AAilman ammatha kuntum taAAmaloona"},{"SurahNumber":27,"VerseNumber":85,"Text":"WawaqaAAa alqawlu AAalayhim bima thalamoo fahum la yantiqoona"},{"SurahNumber":27,"VerseNumber":86,"Text":"Alam yaraw anna jaAAalna allayla liyaskunoo feehi waalnnahara mubsiran inna fee thalika laayatin liqawmin yuminoona"},{"SurahNumber":27,"VerseNumber":87,"Text":"Wayawma yunfakhu fee alssoori fafaziAAa man fee alssamawati waman fee alardi illa man shaa Allahu wakullun atawhu dakhireena"},{"SurahNumber":27,"VerseNumber":88,"Text":"Watara aljibala tahsabuha jamidatan wahiya tamurru marra alssahabi sunAAa Allahi allathee atqana kulla shayin innahu khabeerun bima tafAAaloona"},{"SurahNumber":27,"VerseNumber":89,"Text":"Man jaa bialhasanati falahu khayrun minha wahum min fazaAAin yawmaithin aminoona"},{"SurahNumber":27,"VerseNumber":90,"Text":"Waman jaa bialssayyiati fakubbat wujoohuhum fee alnnari hal tujzawna illa ma kuntum taAAmaloona"},{"SurahNumber":27,"VerseNumber":91,"Text":"Innama omirtu an aAAbuda rabba hathihi albaldati allathee harramaha walahu kullu shayin waomirtu an akoona mina almuslimeena"},{"SurahNumber":27,"VerseNumber":92,"Text":"Waan atluwa alqurana famani ihtada fainnama yahtadee linafsihi waman dalla faqul innama ana mina almunthireena"},{"SurahNumber":27,"VerseNumber":93,"Text":"Waquli alhamdu lillahi sayureekum ayatihi fataAArifoonaha wama rabbuka bighafilin AAamma taAAmaloona"}]},{"LanguageCode":"eng","Language":"English","Name":"eng-mustafakhattabg","Author":"Mustafa Khattab God Edition","Source":"","Direction":"ltr","Translations":[{"SurahNumber":27,"VerseNumber":1,"Text":"Ṭâ-Sĩn. These are the verses of the Quran; the clear Book"},{"SurahNumber":27,"VerseNumber":2,"Text":"˹It is˺ a guide and good news for the believers"},{"SurahNumber":27,"VerseNumber":3,"Text":"˹those˺ who establish prayer, pay alms-tax, and have sure faith in the Hereafter"},{"SurahNumber":27,"VerseNumber":4,"Text":"As for those who do not believe in the Hereafter, We have certainly made their ˹evil˺ deeds appealing to them, so they wander blindly"},{"SurahNumber":27,"VerseNumber":5,"Text":"It is they who will suffer a dreadful torment, and in the Hereafter they will ˹truly˺ be the greatest losers"},{"SurahNumber":27,"VerseNumber":6,"Text":"And indeed, you ˹O Prophet˺ are receiving the Quran from the One ˹Who is˺ All-Wise, All-Knowing"},{"SurahNumber":27,"VerseNumber":7,"Text":"˹Remember˺ when Moses said to his family, “I have spotted a fire. I will either bring you some directions from there, or a burning torch so you may warm yourselves.”"},{"SurahNumber":27,"VerseNumber":8,"Text":"But when he came to it, he was called ˹by God˺, “Blessed is the one at the fire, and whoever is around it! Glory be to God, the Lord of all worlds"},{"SurahNumber":27,"VerseNumber":9,"Text":"O Moses! It is truly I. I am God—the Almighty, All-Wise"},{"SurahNumber":27,"VerseNumber":10,"Text":"Now, throw down your staff!” But when he saw it slithering like a snake, he ran away without looking back. ˹God reassured him,˺ “O Moses! Do not be afraid! Messengers should have no fear in My presence"},{"SurahNumber":27,"VerseNumber":11,"Text":"˹Fear is˺ only for those who do wrong. But if they later mend ˹their˺ evil ˹ways˺ with good, then I am certainly All-Forgiving, Most Merciful"},{"SurahNumber":27,"VerseNumber":12,"Text":"Now put your hand through ˹the opening of˺ your collar, it will come out ˹shining˺ white, unblemished. ˹These are two˺ of nine signs for Pharaoh and his people. They have truly been a rebellious people.”"},{"SurahNumber":27,"VerseNumber":13,"Text":"But when Our enlightening signs came to them, they said, “This is pure magic.”"},{"SurahNumber":27,"VerseNumber":14,"Text":"And, although their hearts were convinced the signs were true, they still denied them wrongfully and arrogantly. See then what was the end of the corruptors"},{"SurahNumber":27,"VerseNumber":15,"Text":"Indeed, We granted knowledge to David and Solomon. And they said ˹in acknowledgment˺, “All praise is for God Who has privileged us over many of His faithful servants.”"},{"SurahNumber":27,"VerseNumber":16,"Text":"And David was succeeded by Solomon, who said, “O people! We have been taught the language of birds, and been given everything ˹we need˺. This is indeed a great privilege.”"},{"SurahNumber":27,"VerseNumber":17,"Text":"Solomon’s forces of jinn, humans, and birds were rallied for him, perfectly organized"},{"SurahNumber":27,"VerseNumber":18,"Text":"And when they came across a valley of ants, an ant warned, “O ants! Go quickly into your homes so Solomon and his armies do not crush you, unknowingly.”"},{"SurahNumber":27,"VerseNumber":19,"Text":"So Solomon smiled in amusement at her words, and prayed, “My Lord! Inspire me to ˹always˺ be thankful for Your favours which You have blessed me and my parents with, and to do good deeds that please you. Admit me, by Your mercy, into ˹the company of˺ Your righteous servants.”"},{"SurahNumber":27,"VerseNumber":20,"Text":"˹One day˺ he inspected the birds, and wondered, “Why is it that I cannot see the hoopoe? Or could he be absent"},{"SurahNumber":27,"VerseNumber":21,"Text":"I will surely subject him to a severe punishment, or ˹even˺ slaughter him, unless he brings me a compelling excuse.”"},{"SurahNumber":27,"VerseNumber":22,"Text":"It was not long before the bird came and said, “I have found out something you do not know. I have just come to you from Sheba with sure news"},{"SurahNumber":27,"VerseNumber":23,"Text":"Indeed, I found a woman ruling over them, who has been given everything ˹she needs˺, and who has a magnificent throne"},{"SurahNumber":27,"VerseNumber":24,"Text":"I found her and her people prostrating to the sun instead of God. For Satan has made their deeds appealing to them—hindering them from the ˹Right˺ Way and leaving them unguided—"},{"SurahNumber":27,"VerseNumber":25,"Text":"so they do not prostrate to God, Who brings forth what is hidden in the heavens and the earth, and knows what you ˹all˺ conceal and what you reveal"},{"SurahNumber":27,"VerseNumber":26,"Text":"˹He is˺ God! There is no god ˹worthy of worship˺ except Him, the Lord of the Mighty Throne.”"},{"SurahNumber":27,"VerseNumber":27,"Text":"Solomon said, “We will see whether you are telling the truth or lying"},{"SurahNumber":27,"VerseNumber":28,"Text":"Go with this letter of mine and deliver it to them, then stand aside and see how they will respond.”"},{"SurahNumber":27,"VerseNumber":29,"Text":"The Queen ˹later˺ announced, “O chiefs! Indeed, a noble letter has been delivered to me"},{"SurahNumber":27,"VerseNumber":30,"Text":"It is from Solomon, and it reads: ‘In the Name of God—the Most Compassionate, Most Merciful"},{"SurahNumber":27,"VerseNumber":31,"Text":"Do not be arrogant with me, but come to me, fully submitting ˹to God˺.’”"},{"SurahNumber":27,"VerseNumber":32,"Text":"She said, “O chiefs! Advise me in this matter of mine, for I would never make any decision without you.”"},{"SurahNumber":27,"VerseNumber":33,"Text":"They responded, “We are a people of strength and great ˹military˺ might, but the decision is yours, so decide what you will command.”"},{"SurahNumber":27,"VerseNumber":34,"Text":"She reasoned, “Indeed, when kings invade a land, they ruin it and debase its nobles. They really do so"},{"SurahNumber":27,"VerseNumber":35,"Text":"But I will certainly send him a gift, and see what ˹response˺ my envoys will return with.”"},{"SurahNumber":27,"VerseNumber":36,"Text":"When the chief-envoy came to him, Solomon said, “Do you offer me wealth? What God has granted me is far greater than what He has granted you. No! It is you who rejoice in ˹receiving˺ gifts"},{"SurahNumber":27,"VerseNumber":37,"Text":"Go back to them, for we will certainly mobilize against them forces which they can never resist, and we will drive them out from there in disgrace, fully humbled.”"},{"SurahNumber":27,"VerseNumber":38,"Text":"Solomon asked, “O chiefs! Which of you can bring me her throne before they come to me in ˹full˺ submission?”"},{"SurahNumber":27,"VerseNumber":39,"Text":"One mighty jinn responded, “I can bring it to you before you rise from this council of yours. And I am quite strong and trustworthy for this ˹task˺.”"},{"SurahNumber":27,"VerseNumber":40,"Text":"But the one who had knowledge of the Scripture said, “I can bring it to you in the blink of an eye.” So when Solomon saw it placed before him, he exclaimed, “This is by the grace of my Lord to test me whether I am grateful or ungrateful. And whoever is grateful, it is only for their own good. But whoever is ungrateful, surely my Lord is Self-Sufficient, Most Generous.”"},{"SurahNumber":27,"VerseNumber":41,"Text":"˹Then˺ Solomon said, “Disguise her throne for her so we may see whether she will recognize ˹it˺ or she will not be able to.”"},{"SurahNumber":27,"VerseNumber":42,"Text":"So when she arrived, it was said ˹to her˺, “Is your throne like this?” She replied, “It looks to be the same. We have ˹already˺ received knowledge ˹of Solomon’s prophethood˺ before this ˹miracle˺, and have submitted ˹to God˺.”"},{"SurahNumber":27,"VerseNumber":43,"Text":"But she had been hindered by what she used to worship instead of God, for she was indeed from a disbelieving people"},{"SurahNumber":27,"VerseNumber":44,"Text":"Then she was told, “Enter the palace.” But when she saw the hall, she thought it was a body of water, so she bared her legs. Solomon said. “It is just a palace paved with crystal.” ˹At last˺ she declared, “My Lord! I have certainly wronged my soul. Now I ˹fully˺ submit myself along with Solomon to God, the Lord of all worlds.”"},{"SurahNumber":27,"VerseNumber":45,"Text":"And We certainly sent to the people of Thamûd their brother Ṣâliḥ, proclaiming, “Worship God,” but they suddenly split into two opposing groups"},{"SurahNumber":27,"VerseNumber":46,"Text":"He urged ˹the disbelieving group˺, “O my people! Why do you ˹seek to˺ hasten the torment rather than grace? If only you sought God’s forgiveness so you may be shown mercy!”"},{"SurahNumber":27,"VerseNumber":47,"Text":"They replied, “You and your followers are a bad omen for us.” He responded, “Your omens are destined by God. In fact, you are ˹only˺ a people being tested.”"},{"SurahNumber":27,"VerseNumber":48,"Text":"And there were in the city nine ˹elite˺ men who spread corruption in the land, never doing what is right"},{"SurahNumber":27,"VerseNumber":49,"Text":"They vowed, “Let us swear by God that we will take him and his family down by night. Then we will certainly say to his ˹closest˺ heirs, ‘We did not witness the murder of his family. We are definitely telling the truth.’”"},{"SurahNumber":27,"VerseNumber":50,"Text":"And ˹so˺ they made a plan, but We too made a plan, while they were unaware"},{"SurahNumber":27,"VerseNumber":51,"Text":"See then what the consequences of their plan were: We ˹utterly˺ destroyed them and their people all together"},{"SurahNumber":27,"VerseNumber":52,"Text":"So their homes are there, ˹but completely˺ ruined because of their wrongdoing. Surely in this is a lesson for people of knowledge"},{"SurahNumber":27,"VerseNumber":53,"Text":"And We delivered those who were faithful and were mindful ˹of God˺"},{"SurahNumber":27,"VerseNumber":54,"Text":"And ˹remember˺ Lot, when he rebuked ˹the men of˺ his people, “Do you commit that shameful deed while you can see ˹one another˺"},{"SurahNumber":27,"VerseNumber":55,"Text":"Do you really lust after men instead of women? In fact, you are ˹only˺ a people acting ignorantly.”"},{"SurahNumber":27,"VerseNumber":56,"Text":"But his people’s only response was to say, “Expel Lot’s followers from your land! They are a people who wish to remain chaste!”"},{"SurahNumber":27,"VerseNumber":57,"Text":"So We delivered him and his family, except his wife. We had destined her to be one of the doomed"},{"SurahNumber":27,"VerseNumber":58,"Text":"And We poured upon them a rain ˹of brimstone˺. How evil was the rain of those who had been warned"},{"SurahNumber":27,"VerseNumber":59,"Text":"Say, ˹O Prophet,˺ “Praise be to God, and peace be upon the servants He has chosen.” ˹Ask the disbelievers,˺ “Which is better: God or whatever ˹gods˺ they associate ˹with Him˺?”"},{"SurahNumber":27,"VerseNumber":60,"Text":"Or ˹ask them,˺ “Who created the heavens and the earth, and sends down rain for you from the sky, by which We cause delightful gardens to grow? You could never cause their trees to grow. Was it another god besides God?” Absolutely not! But they are a people who set up equals ˹to God˺"},{"SurahNumber":27,"VerseNumber":61,"Text":"Or ˹ask them,˺ “Who made the earth a place of settlement, caused rivers to flow through it, placed firm mountains upon it, and set a barrier between ˹fresh and salt˺ bodies of water? Was it another god besides God?” Absolutely not! But most of them do not know"},{"SurahNumber":27,"VerseNumber":62,"Text":"Or ˹ask them,˺ “Who responds to the distressed when they cry to Him, relieving ˹their˺ affliction, and ˹Who˺ makes you successors in the earth? Is it another god besides God? Yet you are hardly mindful!”"},{"SurahNumber":27,"VerseNumber":63,"Text":"Or ˹ask them,˺ “Who guides you in the darkness of the land and sea, and sends the winds ushering in His mercy? Is it another god besides God? Exalted is God above what they associate ˹with Him˺"},{"SurahNumber":27,"VerseNumber":64,"Text":"Or ˹ask them,˺ “Who originates the creation then resurrects it, and gives you provisions from the heavens and the earth? Is it another god besides God?” Say, ˹O Prophet,˺ “Show ˹me˺ your proof, if what you say is true.”"},{"SurahNumber":27,"VerseNumber":65,"Text":"Say, ˹O Prophet,˺ “None in the heavens and the earth has knowledge of the unseen except God. Nor do they know when they will be resurrected"},{"SurahNumber":27,"VerseNumber":66,"Text":"No! Their knowledge of the Hereafter amounts to ignorance. In fact, they are in doubt about it. In truth, they are ˹totally˺ blind to it"},{"SurahNumber":27,"VerseNumber":67,"Text":"The disbelievers ask, “When we and our fathers are reduced to dust, will we really be brought forth ˹alive˺"},{"SurahNumber":27,"VerseNumber":68,"Text":"We have already been promised this, as well as our forefathers earlier. This is nothing but ancient fables!”"},{"SurahNumber":27,"VerseNumber":69,"Text":"Say, ˹O Prophet,˺ “Travel throughout the land and see the fate of the wicked.”"},{"SurahNumber":27,"VerseNumber":70,"Text":"Do not grieve for them, nor be distressed by their schemes"},{"SurahNumber":27,"VerseNumber":71,"Text":"They ask ˹the believers˺, “When will this threat come to pass, if what you say is true?”"},{"SurahNumber":27,"VerseNumber":72,"Text":"Say, ˹O Prophet,˺ “Perhaps some of what you seek to hasten is close at hand.”"},{"SurahNumber":27,"VerseNumber":73,"Text":"Surely your Lord is ever Bountiful to humanity, but most of them are ungrateful"},{"SurahNumber":27,"VerseNumber":74,"Text":"And surely your Lord knows what their hearts conceal and what they reveal"},{"SurahNumber":27,"VerseNumber":75,"Text":"For there is nothing hidden in the heavens or the earth without being ˹written˺ in a perfect Record"},{"SurahNumber":27,"VerseNumber":76,"Text":"Indeed, this Quran clarifies for the Children of Israel most of what they differ over"},{"SurahNumber":27,"VerseNumber":77,"Text":"And it is truly a guide and mercy for the believers"},{"SurahNumber":27,"VerseNumber":78,"Text":"Your Lord will certainly judge between them by His justice, for He is the Almighty, All-Knowing"},{"SurahNumber":27,"VerseNumber":79,"Text":"So put your trust in God, for you are surely upon the ˹Path of˺ clear truth"},{"SurahNumber":27,"VerseNumber":80,"Text":"You certainly cannot make the dead hear ˹the truth˺. Nor can you make the deaf hear the call when they turn their backs and walk away"},{"SurahNumber":27,"VerseNumber":81,"Text":"Nor can you lead the blind out of their misguidance. You can make none hear ˹the truth˺ except those who believe in Our revelations, ˹fully˺ submitting ˹to God˺"},{"SurahNumber":27,"VerseNumber":82,"Text":"And when the decree ˹of the Hour˺ comes to pass against them, We will bring forth for them a beast from the earth, telling them that the people had no sure faith in Our revelations"},{"SurahNumber":27,"VerseNumber":83,"Text":"˹Watch for˺ the Day We will gather from every faith-community a group of those who denied Our revelations, and they will be driven in ranks"},{"SurahNumber":27,"VerseNumber":84,"Text":"When they ˹finally˺ come before their Lord, He will ask ˹them˺, “Did you deny My revelations without ˹even˺ comprehending them? Or what ˹exactly˺ did you do?”"},{"SurahNumber":27,"VerseNumber":85,"Text":"And the decree ˹of torment˺ will be justified against them for their wrongdoing, leaving them speechless"},{"SurahNumber":27,"VerseNumber":86,"Text":"Do they not see that We made the night for them to rest in and the day bright? Surely in this are signs for those who believe"},{"SurahNumber":27,"VerseNumber":87,"Text":"And ˹beware of˺ the Day the Trumpet will be blown, and all those in the heavens and all those on the earth will be horrified ˹to the point of death˺, except those God wills ˹to spare˺. And all will come before Him, fully humbled"},{"SurahNumber":27,"VerseNumber":88,"Text":"Now you see the mountains, thinking they are firmly fixed, but they are travelling ˹just˺ like clouds. ˹That is˺ the design of God, Who has perfected everything. Surely He is All-Aware of what you do"},{"SurahNumber":27,"VerseNumber":89,"Text":"Whoever comes with a good deed will be rewarded with what is better, and they will be secure from the horror on that Day"},{"SurahNumber":27,"VerseNumber":90,"Text":"And whoever comes with an evil deed will be hurled face-first into the Fire. Are you rewarded except for what you used to do"},{"SurahNumber":27,"VerseNumber":91,"Text":"Say, ˹O Prophet,˺ “I have only been commanded to worship the Lord of this city ˹of Mecca˺, Who has made it sacred, and to Him belongs everything. And I am commanded to be one of those who ˹fully˺ submit ˹to Him˺"},{"SurahNumber":27,"VerseNumber":92,"Text":"and to recite the Quran.” Then whoever chooses to be guided, it is only for their own good. But whoever chooses to stray, say, ˹O Prophet,˺ “I am only a warner.”"},{"SurahNumber":27,"VerseNumber":93,"Text":"And say, “All praise is for God! He will show you His signs, and you will recognize them. And your Lord is never unaware of what you do.”"}]}]}