{"SurahNumber":31,"HasBismillah":true,"Verses":[{"SurahNumber":31,"VerseNumber":1,"Text":"الٓمٓ","End":"١"},{"SurahNumber":31,"VerseNumber":2,"Text":"تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ ٱلۡحَكِيمِ","End":"٢"},{"SurahNumber":31,"VerseNumber":3,"Text":"هُدٗى وَرَحۡمَةٗ لِّلۡمُحۡسِنِينَ","End":"٣"},{"SurahNumber":31,"VerseNumber":4,"Text":"ٱلَّذِينَ يُقِيمُونَ ٱلصَّلَوٰةَ وَيُؤۡتُونَ ٱلزَّكَوٰةَ وَهُم بِٱلۡأٓخِرَةِ هُمۡ يُوقِنُونَ","End":"٤"},{"SurahNumber":31,"VerseNumber":5,"Text":"أُوْلَـٰٓئِكَ عَلَىٰ هُدٗى مِّن رَّبِّهِمۡۖ وَأُوْلَـٰٓئِكَ هُمُ ٱلۡمُفۡلِحُونَ","End":"٥"},{"SurahNumber":31,"VerseNumber":6,"Text":"وَمِنَ ٱلنَّاسِ مَن يَشۡتَرِي لَهۡوَ ٱلۡحَدِيثِ لِيُضِلَّ عَن سَبِيلِ ٱللَّهِ بِغَيۡرِ عِلۡمٖ وَيَتَّخِذَهَا هُزُوًاۚ أُوْلَـٰٓئِكَ لَهُمۡ عَذَابٞ مُّهِينٞ","End":"٦"},{"SurahNumber":31,"VerseNumber":7,"Text":"وَإِذَا تُتۡلَىٰ عَلَيۡهِ ءَايَٰتُنَا وَلَّىٰ مُسۡتَكۡبِرٗا كَأَن لَّمۡ يَسۡمَعۡهَا كَأَنَّ فِيٓ أُذُنَيۡهِ وَقۡرٗاۖ فَبَشِّرۡهُ بِعَذَابٍ أَلِيمٍ","End":"٧"},{"SurahNumber":31,"VerseNumber":8,"Text":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّـٰلِحَٰتِ لَهُمۡ جَنَّـٰتُ ٱلنَّعِيمِ","End":"٨"},{"SurahNumber":31,"VerseNumber":9,"Text":"خَٰلِدِينَ فِيهَاۖ وَعۡدَ ٱللَّهِ حَقّٗاۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","End":"٩"},{"SurahNumber":31,"VerseNumber":10,"Text":"خَلَقَ ٱلسَّمَٰوَٰتِ بِغَيۡرِ عَمَدٖ تَرَوۡنَهَاۖ وَأَلۡقَىٰ فِي ٱلۡأَرۡضِ رَوَٰسِيَ أَن تَمِيدَ بِكُمۡ وَبَثَّ فِيهَا مِن كُلِّ دَآبَّةٖۚ وَأَنزَلۡنَا مِنَ ٱلسَّمَآءِ مَآءٗ فَأَنۢبَتۡنَا فِيهَا مِن كُلِّ زَوۡجٖ كَرِيمٍ","End":"١٠"},{"SurahNumber":31,"VerseNumber":11,"Text":"هَٰذَا خَلۡقُ ٱللَّهِ فَأَرُونِي مَاذَا خَلَقَ ٱلَّذِينَ مِن دُونِهِۦۚ بَلِ ٱلظَّـٰلِمُونَ فِي ضَلَٰلٖ مُّبِينٖ","End":"١١"},{"SurahNumber":31,"VerseNumber":12,"Text":"وَلَقَدۡ ءَاتَيۡنَا لُقۡمَٰنَ ٱلۡحِكۡمَةَ أَنِ ٱشۡكُرۡ لِلَّهِۚ وَمَن يَشۡكُرۡ فَإِنَّمَا يَشۡكُرُ لِنَفۡسِهِۦۖ وَمَن كَفَرَ فَإِنَّ ٱللَّهَ غَنِيٌّ حَمِيدٞ","End":"١٢"},{"SurahNumber":31,"VerseNumber":13,"Text":"وَإِذۡ قَالَ لُقۡمَٰنُ لِٱبۡنِهِۦ وَهُوَ يَعِظُهُۥ يَٰبُنَيَّ لَا تُشۡرِكۡ بِٱللَّهِۖ إِنَّ ٱلشِّرۡكَ لَظُلۡمٌ عَظِيمٞ","End":"١٣"},{"SurahNumber":31,"VerseNumber":14,"Text":"وَوَصَّيۡنَا ٱلۡإِنسَٰنَ بِوَٰلِدَيۡهِ حَمَلَتۡهُ أُمُّهُۥ وَهۡنًا عَلَىٰ وَهۡنٖ وَفِصَٰلُهُۥ فِي عَامَيۡنِ أَنِ ٱشۡكُرۡ لِي وَلِوَٰلِدَيۡكَ إِلَيَّ ٱلۡمَصِيرُ","End":"١٤"},{"SurahNumber":31,"VerseNumber":15,"Text":"وَإِن جَٰهَدَاكَ عَلَىٰٓ أَن تُشۡرِكَ بِي مَا لَيۡسَ لَكَ بِهِۦ عِلۡمٞ فَلَا تُطِعۡهُمَاۖ وَصَاحِبۡهُمَا فِي ٱلدُّنۡيَا مَعۡرُوفٗاۖ وَٱتَّبِعۡ سَبِيلَ مَنۡ أَنَابَ إِلَيَّۚ ثُمَّ إِلَيَّ مَرۡجِعُكُمۡ فَأُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ","End":"١٥"},{"SurahNumber":31,"VerseNumber":16,"Text":"يَٰبُنَيَّ إِنَّهَآ إِن تَكُ مِثۡقَالَ حَبَّةٖ مِّنۡ خَرۡدَلٖ فَتَكُن فِي صَخۡرَةٍ أَوۡ فِي ٱلسَّمَٰوَٰتِ أَوۡ فِي ٱلۡأَرۡضِ يَأۡتِ بِهَا ٱللَّهُۚ إِنَّ ٱللَّهَ لَطِيفٌ خَبِيرٞ","End":"١٦"},{"SurahNumber":31,"VerseNumber":17,"Text":"يَٰبُنَيَّ أَقِمِ ٱلصَّلَوٰةَ وَأۡمُرۡ بِٱلۡمَعۡرُوفِ وَٱنۡهَ عَنِ ٱلۡمُنكَرِ وَٱصۡبِرۡ عَلَىٰ مَآ أَصَابَكَۖ إِنَّ ذَٰلِكَ مِنۡ عَزۡمِ ٱلۡأُمُورِ","End":"١٧"},{"SurahNumber":31,"VerseNumber":18,"Text":"وَلَا تُصَعِّرۡ خَدَّكَ لِلنَّاسِ وَلَا تَمۡشِ فِي ٱلۡأَرۡضِ مَرَحًاۖ إِنَّ ٱللَّهَ لَا يُحِبُّ كُلَّ مُخۡتَالٖ فَخُورٖ","End":"١٨"},{"SurahNumber":31,"VerseNumber":19,"Text":"وَٱقۡصِدۡ فِي مَشۡيِكَ وَٱغۡضُضۡ مِن صَوۡتِكَۚ إِنَّ أَنكَرَ ٱلۡأَصۡوَٰتِ لَصَوۡتُ ٱلۡحَمِيرِ","End":"١٩"},{"SurahNumber":31,"VerseNumber":20,"Text":"أَلَمۡ تَرَوۡاْ أَنَّ ٱللَّهَ سَخَّرَ لَكُم مَّا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِ وَأَسۡبَغَ عَلَيۡكُمۡ نِعَمَهُۥ ظَٰهِرَةٗ وَبَاطِنَةٗۗ وَمِنَ ٱلنَّاسِ مَن يُجَٰدِلُ فِي ٱللَّهِ بِغَيۡرِ عِلۡمٖ وَلَا هُدٗى وَلَا كِتَٰبٖ مُّنِيرٖ","End":"٢٠"},{"SurahNumber":31,"VerseNumber":21,"Text":"وَإِذَا قِيلَ لَهُمُ ٱتَّبِعُواْ مَآ أَنزَلَ ٱللَّهُ قَالُواْ بَلۡ نَتَّبِعُ مَا وَجَدۡنَا عَلَيۡهِ ءَابَآءَنَآۚ أَوَلَوۡ كَانَ ٱلشَّيۡطَٰنُ يَدۡعُوهُمۡ إِلَىٰ عَذَابِ ٱلسَّعِيرِ","End":"٢١"},{"SurahNumber":31,"VerseNumber":22,"Text":"۞وَمَن يُسۡلِمۡ وَجۡهَهُۥٓ إِلَى ٱللَّهِ وَهُوَ مُحۡسِنٞ فَقَدِ ٱسۡتَمۡسَكَ بِٱلۡعُرۡوَةِ ٱلۡوُثۡقَىٰۗ وَإِلَى ٱللَّهِ عَٰقِبَةُ ٱلۡأُمُورِ","End":"٢٢"},{"SurahNumber":31,"VerseNumber":23,"Text":"وَمَن كَفَرَ فَلَا يَحۡزُنكَ كُفۡرُهُۥٓۚ إِلَيۡنَا مَرۡجِعُهُمۡ فَنُنَبِّئُهُم بِمَا عَمِلُوٓاْۚ إِنَّ ٱللَّهَ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ","End":"٢٣"},{"SurahNumber":31,"VerseNumber":24,"Text":"نُمَتِّعُهُمۡ قَلِيلٗا ثُمَّ نَضۡطَرُّهُمۡ إِلَىٰ عَذَابٍ غَلِيظٖ","End":"٢٤"},{"SurahNumber":31,"VerseNumber":25,"Text":"وَلَئِن سَأَلۡتَهُم مَّنۡ خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ لَيَقُولُنَّ ٱللَّهُۚ قُلِ ٱلۡحَمۡدُ لِلَّهِۚ بَلۡ أَكۡثَرُهُمۡ لَا يَعۡلَمُونَ","End":"٢٥"},{"SurahNumber":31,"VerseNumber":26,"Text":"لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ إِنَّ ٱللَّهَ هُوَ ٱلۡغَنِيُّ ٱلۡحَمِيدُ","End":"٢٦"},{"SurahNumber":31,"VerseNumber":27,"Text":"وَلَوۡ أَنَّمَا فِي ٱلۡأَرۡضِ مِن شَجَرَةٍ أَقۡلَٰمٞ وَٱلۡبَحۡرُ يَمُدُّهُۥ مِنۢ بَعۡدِهِۦ سَبۡعَةُ أَبۡحُرٖ مَّا نَفِدَتۡ كَلِمَٰتُ ٱللَّهِۚ إِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٞ","End":"٢٧"},{"SurahNumber":31,"VerseNumber":28,"Text":"مَّا خَلۡقُكُمۡ وَلَا بَعۡثُكُمۡ إِلَّا كَنَفۡسٖ وَٰحِدَةٍۚ إِنَّ ٱللَّهَ سَمِيعُۢ بَصِيرٌ","End":"٢٨"},{"SurahNumber":31,"VerseNumber":29,"Text":"أَلَمۡ تَرَ أَنَّ ٱللَّهَ يُولِجُ ٱلَّيۡلَ فِي ٱلنَّهَارِ وَيُولِجُ ٱلنَّهَارَ فِي ٱلَّيۡلِ وَسَخَّرَ ٱلشَّمۡسَ وَٱلۡقَمَرَۖ كُلّٞ يَجۡرِيٓ إِلَىٰٓ أَجَلٖ مُّسَمّٗى وَأَنَّ ٱللَّهَ بِمَا تَعۡمَلُونَ خَبِيرٞ","End":"٢٩"},{"SurahNumber":31,"VerseNumber":30,"Text":"ذَٰلِكَ بِأَنَّ ٱللَّهَ هُوَ ٱلۡحَقُّ وَأَنَّ مَا يَدۡعُونَ مِن دُونِهِ ٱلۡبَٰطِلُ وَأَنَّ ٱللَّهَ هُوَ ٱلۡعَلِيُّ ٱلۡكَبِيرُ","End":"٣٠"},{"SurahNumber":31,"VerseNumber":31,"Text":"أَلَمۡ تَرَ أَنَّ ٱلۡفُلۡكَ تَجۡرِي فِي ٱلۡبَحۡرِ بِنِعۡمَتِ ٱللَّهِ لِيُرِيَكُم مِّنۡ ءَايَٰتِهِۦٓۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّكُلِّ صَبَّارٖ شَكُورٖ","End":"٣١"},{"SurahNumber":31,"VerseNumber":32,"Text":"وَإِذَا غَشِيَهُم مَّوۡجٞ كَٱلظُّلَلِ دَعَوُاْ ٱللَّهَ مُخۡلِصِينَ لَهُ ٱلدِّينَ فَلَمَّا نَجَّىٰهُمۡ إِلَى ٱلۡبَرِّ فَمِنۡهُم مُّقۡتَصِدٞۚ وَمَا يَجۡحَدُ بِـَٔايَٰتِنَآ إِلَّا كُلُّ خَتَّارٖ كَفُورٖ","End":"٣٢"},{"SurahNumber":31,"VerseNumber":33,"Text":"يَـٰٓأَيُّهَا ٱلنَّاسُ ٱتَّقُواْ رَبَّكُمۡ وَٱخۡشَوۡاْ يَوۡمٗا لَّا يَجۡزِي وَالِدٌ عَن وَلَدِهِۦ وَلَا مَوۡلُودٌ هُوَ جَازٍ عَن وَالِدِهِۦ شَيۡـًٔاۚ إِنَّ وَعۡدَ ٱللَّهِ حَقّٞۖ فَلَا تَغُرَّنَّكُمُ ٱلۡحَيَوٰةُ ٱلدُّنۡيَا وَلَا يَغُرَّنَّكُم بِٱللَّهِ ٱلۡغَرُورُ","End":"٣٣"},{"SurahNumber":31,"VerseNumber":34,"Text":"إِنَّ ٱللَّهَ عِندَهُۥ عِلۡمُ ٱلسَّاعَةِ وَيُنَزِّلُ ٱلۡغَيۡثَ وَيَعۡلَمُ مَا فِي ٱلۡأَرۡحَامِۖ وَمَا تَدۡرِي نَفۡسٞ مَّاذَا تَكۡسِبُ غَدٗاۖ وَمَا تَدۡرِي نَفۡسُۢ بِأَيِّ أَرۡضٖ تَمُوتُۚ إِنَّ ٱللَّهَ عَلِيمٌ خَبِيرُۢ","End":"٣٤"}],"Translations":[{"LanguageCode":"ara","Language":"Arabic","Name":"ara-quran-la","Author":"Quran Transliteration","Source":"http://tanzil.net","Direction":"ltr","Translations":[{"SurahNumber":31,"VerseNumber":1,"Text":"Aliflammeem"},{"SurahNumber":31,"VerseNumber":2,"Text":"Tilka ayatu alkitabi alhakeemi"},{"SurahNumber":31,"VerseNumber":3,"Text":"Hudan warahmatan lilmuhsineena"},{"SurahNumber":31,"VerseNumber":4,"Text":"Allatheena yuqeemoona alssalata wayutoona alzzakata wahum bialakhirati hum yooqinoona"},{"SurahNumber":31,"VerseNumber":5,"Text":"Olaika AAala hudan min rabbihim waolaika humu almuflihoona"},{"SurahNumber":31,"VerseNumber":6,"Text":"Wamina alnnasi man yashtaree lahwa alhadeethi liyudilla AAan sabeeli Allahi bighayri AAilmin wayattakhithaha huzuwan olaika lahum AAathabun muheenun"},{"SurahNumber":31,"VerseNumber":7,"Text":"Waitha tutla AAalayhi ayatuna walla mustakbiran kaan lam yasmaAAha kaanna fee othunayhi waqran fabashshirhu biAAathabin aleemin"},{"SurahNumber":31,"VerseNumber":8,"Text":"Inna allatheena amanoo waAAamiloo alssalihati lahum jannatu alnnaAAeemi"},{"SurahNumber":31,"VerseNumber":9,"Text":"Khalideena feeha waAAda Allahi haqqan wahuwa alAAazeezu alhakeemu"},{"SurahNumber":31,"VerseNumber":10,"Text":"Khalaqa alssamawati bighayri AAamadin tarawnaha waalqa fee alardi rawasiya an tameeda bikum wabaththa feeha min kulli dabbatin waanzalna mina alssamai maan faanbatna feeha min kulli zawjin kareemin"},{"SurahNumber":31,"VerseNumber":11,"Text":"Hatha khalqu Allahi faaroonee matha khalaqa allatheena min doonihi bali alththalimoona fee dalalin mubeenin"},{"SurahNumber":31,"VerseNumber":12,"Text":"Walaqad atayna luqmana alhikmata ani oshkur lillahi waman yashkur fainnama yashkuru linafsihi waman kafara fainna Allaha ghaniyyun hameedun"},{"SurahNumber":31,"VerseNumber":13,"Text":"Waith qala luqmanu liibnihi wahuwa yaAAithuhu ya bunayya la tushrik biAllahi inna alshshirka lathulmun AAatheemun"},{"SurahNumber":31,"VerseNumber":14,"Text":"Wawassayna alinsana biwalidayhi hamalathu ommuhu wahnan AAala wahnin wafisaluhu fee AAamayni ani oshkur lee waliwalidayka ilayya almaseeru"},{"SurahNumber":31,"VerseNumber":15,"Text":"Wain jahadaka AAala an tushrika bee ma laysa laka bihi AAilmun fala tutiAAhuma wasahibhuma fee alddunya maAAroofan waittabiAA sabeela man anaba ilayya thumma ilayya marjiAAukum faonabbiokum bima kuntum taAAmaloona"},{"SurahNumber":31,"VerseNumber":16,"Text":"Ya bunayya innaha in taku mithqala habbatin min khardalin fatakun fee sakhratin aw fee alssamawati aw fee alardi yati biha Allahu inna Allaha lateefun khabeerun"},{"SurahNumber":31,"VerseNumber":17,"Text":"Ya bunayya aqimi alssalata wamur bialmaAAroofi wainha AAani almunkari waisbir AAala ma asabaka inna thalika min AAazmi alomoori"},{"SurahNumber":31,"VerseNumber":18,"Text":"Wala tusaAAAAir khaddaka lilnnasi wala tamshi fee alardi marahan inna Allaha la yuhibbu kulla mukhtalin fakhoorin"},{"SurahNumber":31,"VerseNumber":19,"Text":"Waiqsid fee mashyika waoghdud min sawtika inna ankara alaswati lasawtu alhameeri"},{"SurahNumber":31,"VerseNumber":20,"Text":"Alam taraw anna Allaha sakhkhara lakum ma fee alssamawati wama fee alardi waasbagha AAalaykum niAAamahu thahiratan wabatinatan wamina alnnasi man yujadilu fee Allahi bighayri AAilmin wala hudan wala kitabin muneerin"},{"SurahNumber":31,"VerseNumber":21,"Text":"Waitha qeela lahumu ittabiAAoo ma anzala Allahu qaloo bal nattabiAAu ma wajadna AAalayhi abaana awalaw kana alshshaytanu yadAAoohum ila AAathabi alssaAAeeri"},{"SurahNumber":31,"VerseNumber":22,"Text":"Waman yuslim wajhahu ila Allahi wahuwa muhsinun faqadi istamsaka bialAAurwati alwuthqa waila Allahi AAaqibatu alomoori"},{"SurahNumber":31,"VerseNumber":23,"Text":"Waman kafara fala yahzunka kufruhu ilayna marjiAAuhum fanunabbiohum bima AAamiloo inna Allaha AAaleemun bithati alssudoori"},{"SurahNumber":31,"VerseNumber":24,"Text":"NumattiAAuhum qaleelan thumma nadtarruhum ila AAathabin ghaleethin"},{"SurahNumber":31,"VerseNumber":25,"Text":"Walain saaltahum man khalaqa alssamawati waalarda layaqoolunna Allahu quli alhamdu lillahi bal aktharuhum la yaAAlamoona"},{"SurahNumber":31,"VerseNumber":26,"Text":"Lillahi ma fee alssamawati waalardi inna Allaha huwa alghaniyyu alhameedu"},{"SurahNumber":31,"VerseNumber":27,"Text":"Walaw annama fee alardi min shajaratin aqlamun waalbahru yamudduhu min baAAdihi sabAAatu abhurin ma nafidat kalimatu Allahi inna Allaha AAazeezun hakeemun"},{"SurahNumber":31,"VerseNumber":28,"Text":"Ma khalqukum wala baAAthukum illa kanafsin wahidatin inna Allaha sameeAAun baseerun"},{"SurahNumber":31,"VerseNumber":29,"Text":"Alam tara anna Allaha yooliju allayla fee alnnahari wayooliju alnnahara fee allayli wasakhkhara alshshamsa waalqamara kullun yajree ila ajalin musamman waanna Allaha bima taAAmaloona khabeerun"},{"SurahNumber":31,"VerseNumber":30,"Text":"Thalika bianna Allaha huwa alhaqqu waanna ma yadAAoona min doonihi albatilu waanna Allaha huwa alAAaliyyu alkabeeru"},{"SurahNumber":31,"VerseNumber":31,"Text":"Alam tara anna alfulka tajree fee albahri biniAAmati Allahi liyuriyakum min ayatihi inna fee thalika laayatin likulli sabbarin shakoorin"},{"SurahNumber":31,"VerseNumber":32,"Text":"Waitha ghashiyahum mawjun kaalththulali daAAawoo Allaha mukhliseena lahu alddeena falamma najjahum ila albarri faminhum muqtasidun wama yajhadu biayatina illa kullu khattarin kafoorin"},{"SurahNumber":31,"VerseNumber":33,"Text":"Ya ayyuha alnnasu ittaqoo rabbakum waikhshaw yawman la yajzee walidun AAan waladihi wala mawloodun huwa jazin AAan walidihi shayan inna waAAda Allahi haqqun fala taghurrannakumu alhayatu alddunya wala yaghurrannakum biAllahi algharooru"},{"SurahNumber":31,"VerseNumber":34,"Text":"Inna Allaha AAindahu AAilmu alssaAAati wayunazzilu alghaytha wayaAAlamu ma fee alarhami wama tadree nafsun matha taksibu ghadan wama tadree nafsun biayyi ardin tamootu inna Allaha AAaleemun khabeerun"}]},{"LanguageCode":"eng","Language":"English","Name":"eng-mustafakhattabg","Author":"Mustafa Khattab God Edition","Source":"","Direction":"ltr","Translations":[{"SurahNumber":31,"VerseNumber":1,"Text":"Alif-Lãm-Mĩm"},{"SurahNumber":31,"VerseNumber":2,"Text":"These are the verses of the Book, rich in wisdom"},{"SurahNumber":31,"VerseNumber":3,"Text":"˹It is˺ a guide and mercy for the good-doers—"},{"SurahNumber":31,"VerseNumber":4,"Text":"those who establish prayer, pay alms-tax, and have sure faith in the Hereafter"},{"SurahNumber":31,"VerseNumber":5,"Text":"It is they who are ˹truly˺ guided by their Lord, and it is they who will be successful"},{"SurahNumber":31,"VerseNumber":6,"Text":"But there are some who employ theatrics, only to lead others away from God’s Way—without any knowledge—and to make a mockery of it. They will suffer a humiliating punishment"},{"SurahNumber":31,"VerseNumber":7,"Text":"Whenever Our revelations are recited to them, they turn away in arrogance as if they did not hear them, as if there is deafness in their ears. So give them good news ˹O Prophet˺ of a painful punishment"},{"SurahNumber":31,"VerseNumber":8,"Text":"Surely those who believe and do good will have the Gardens of Bliss"},{"SurahNumber":31,"VerseNumber":9,"Text":"staying there forever. God’s promise is true. And He is the Almighty, All-Wise"},{"SurahNumber":31,"VerseNumber":10,"Text":"He created the heavens without pillars—as you can see—and placed firm mountains upon the earth so it does not shake with you, and scattered throughout it all types of creatures. And We send down rain from the sky, causing every type of fine plant to grow on earth"},{"SurahNumber":31,"VerseNumber":11,"Text":"This is God’s creation. Now show Me what those ˹gods˺ other than Him have created. In fact, the wrongdoers are clearly astray"},{"SurahNumber":31,"VerseNumber":12,"Text":"Indeed, We blessed Luqmân with wisdom, ˹saying˺, “Be grateful to God, for whoever is grateful, it is only for their own good. And whoever is ungrateful, then surely God is Self-Sufficient, Praiseworthy.”"},{"SurahNumber":31,"VerseNumber":13,"Text":"And ˹remember˺ when Luqmân said to his son, while advising him, “O my dear son! Never associate ˹anything˺ with God ˹in worship˺, for associating ˹others with Him˺ is truly the worst of all wrongs.”"},{"SurahNumber":31,"VerseNumber":14,"Text":"And We have commanded people to ˹honour˺ their parents. Their mothers bore them through hardship upon hardship, and their weaning takes two years. So be grateful to Me and your parents. To Me is the final return"},{"SurahNumber":31,"VerseNumber":15,"Text":"But if they pressure you to associate with Me what you have no knowledge of, do not obey them. Still keep their company in this world courteously, and follow the way of those who turn to Me ˹in devotion˺. Then to Me you will ˹all˺ return, and then I will inform you of what you used to do"},{"SurahNumber":31,"VerseNumber":16,"Text":"˹Luqmân added,˺ “O my dear son! ˹Even˺ if a deed were the weight of a mustard seed—be it ˹hidden˺ in a rock or in the heavens or the earth—God will bring it forth. Surely God is Most Subtle, All-Aware"},{"SurahNumber":31,"VerseNumber":17,"Text":"“O my dear son! Establish prayer, encourage what is good and forbid what is evil, and endure patiently whatever befalls you. Surely this is a resolve to aspire to"},{"SurahNumber":31,"VerseNumber":18,"Text":"“And do not turn your nose up to people, nor walk pridefully upon the earth. Surely God does not like whoever is arrogant, boastful"},{"SurahNumber":31,"VerseNumber":19,"Text":"Be moderate in your pace. And lower your voice, for the ugliest of all voices is certainly the braying of donkeys.”"},{"SurahNumber":31,"VerseNumber":20,"Text":"Have you not seen that God has subjected for you whatever is in the heavens and whatever is on the earth, and has lavished His favours upon you, both seen and unseen? ˹Still˺ there are some who dispute about God without knowledge, or guidance, or an enlightening scripture"},{"SurahNumber":31,"VerseNumber":21,"Text":"When it is said to them, “Follow what God has revealed,” they reply, “No! We ˹only˺ follow what we found our forefathers practicing.” ˹Would they still do so˺ even if Satan is inviting them to the torment of the Blaze"},{"SurahNumber":31,"VerseNumber":22,"Text":"Whoever fully submits themselves to God and is a good-doer, they have certainly grasped the firmest hand-hold. And with God rests the outcome of ˹all˺ affairs"},{"SurahNumber":31,"VerseNumber":23,"Text":"But whoever disbelieves, do not let their disbelief grieve you ˹O Prophet˺. To Us is their return, and We will inform them of all they did. Surely God knows best what is ˹hidden˺ in the heart"},{"SurahNumber":31,"VerseNumber":24,"Text":"We allow them enjoyment for a little while, then ˹in time˺ We will force them into a harsh torment"},{"SurahNumber":31,"VerseNumber":25,"Text":"And if you ask them who created the heavens and the earth, they will definitely say, “God!” Say, “Praise be to God!” In fact, most of them do not know"},{"SurahNumber":31,"VerseNumber":26,"Text":"To God belongs whatever is in the heavens and the earth. God is truly the Self-Sufficient, Praiseworthy"},{"SurahNumber":31,"VerseNumber":27,"Text":"If all the trees on earth were pens and the ocean ˹were ink˺, refilled by seven other oceans, the Words of God would not be exhausted. Surely God is Almighty, All-Wise"},{"SurahNumber":31,"VerseNumber":28,"Text":"The creation and resurrection of you ˹all˺ is as simple ˹for Him˺ as that of a single soul. Surely God is All-Hearing, All-Seeing"},{"SurahNumber":31,"VerseNumber":29,"Text":"Do you not see that God causes the night to merge into the day and the day into the night, and has subjected the sun and the moon, each orbiting for an appointed term, and that God is All-Aware of what you do"},{"SurahNumber":31,"VerseNumber":30,"Text":"That is because God ˹alone˺ is the Truth and what they invoke besides Him is falsehood, and ˹because˺ God ˹alone˺ is the Most High, All-Great"},{"SurahNumber":31,"VerseNumber":31,"Text":"Do you not see that the ships sail ˹smoothly˺ through the sea by the grace of God so that He may show you some of His signs? Surely in this are signs for whoever is steadfast, grateful"},{"SurahNumber":31,"VerseNumber":32,"Text":"And as soon as they are overwhelmed by waves like mountains, they cry out to God ˹alone˺ in sincere devotion. But when He delivers them ˹safely˺ to shore, only some become relatively grateful. And none rejects Our signs except whoever is deceitful, ungrateful"},{"SurahNumber":31,"VerseNumber":33,"Text":"O humanity! Be mindful of your Lord, and beware of a Day when no parent will be of any benefit to their child, nor will a child be of any benefit to their parent. Surely God’s promise is true. So do not let the life of this world deceive you, nor let the Chief Deceiver deceive you about God"},{"SurahNumber":31,"VerseNumber":34,"Text":"Indeed, God ˹alone˺ has the knowledge of the Hour. He sends down the rain, and knows what is in the wombs. No soul knows what it will earn for tomorrow, and no soul knows in what land it will die. Surely God is All-Knowing, All-Aware"}]}]}