{"SurahNumber":40,"HasBismillah":true,"Verses":[{"SurahNumber":40,"VerseNumber":1,"Text":"حمٓ","End":"١"},{"SurahNumber":40,"VerseNumber":2,"Text":"تَنزِيلُ ٱلۡكِتَٰبِ مِنَ ٱللَّهِ ٱلۡعَزِيزِ ٱلۡعَلِيمِ","End":"٢"},{"SurahNumber":40,"VerseNumber":3,"Text":"غَافِرِ ٱلذَّنۢبِ وَقَابِلِ ٱلتَّوۡبِ شَدِيدِ ٱلۡعِقَابِ ذِي ٱلطَّوۡلِۖ لَآ إِلَٰهَ إِلَّا هُوَۖ إِلَيۡهِ ٱلۡمَصِيرُ","End":"٣"},{"SurahNumber":40,"VerseNumber":4,"Text":"مَا يُجَٰدِلُ فِيٓ ءَايَٰتِ ٱللَّهِ إِلَّا ٱلَّذِينَ كَفَرُواْ فَلَا يَغۡرُرۡكَ تَقَلُّبُهُمۡ فِي ٱلۡبِلَٰدِ","End":"٤"},{"SurahNumber":40,"VerseNumber":5,"Text":"كَذَّبَتۡ قَبۡلَهُمۡ قَوۡمُ نُوحٖ وَٱلۡأَحۡزَابُ مِنۢ بَعۡدِهِمۡۖ وَهَمَّتۡ كُلُّ أُمَّةِۭ بِرَسُولِهِمۡ لِيَأۡخُذُوهُۖ وَجَٰدَلُواْ بِٱلۡبَٰطِلِ لِيُدۡحِضُواْ بِهِ ٱلۡحَقَّ فَأَخَذۡتُهُمۡۖ فَكَيۡفَ كَانَ عِقَابِ","End":"٥"},{"SurahNumber":40,"VerseNumber":6,"Text":"وَكَذَٰلِكَ حَقَّتۡ كَلِمَتُ رَبِّكَ عَلَى ٱلَّذِينَ كَفَرُوٓاْ أَنَّهُمۡ أَصۡحَٰبُ ٱلنَّارِ","End":"٦"},{"SurahNumber":40,"VerseNumber":7,"Text":"ٱلَّذِينَ يَحۡمِلُونَ ٱلۡعَرۡشَ وَمَنۡ حَوۡلَهُۥ يُسَبِّحُونَ بِحَمۡدِ رَبِّهِمۡ وَيُؤۡمِنُونَ بِهِۦ وَيَسۡتَغۡفِرُونَ لِلَّذِينَ ءَامَنُواْۖ رَبَّنَا وَسِعۡتَ كُلَّ شَيۡءٖ رَّحۡمَةٗ وَعِلۡمٗا فَٱغۡفِرۡ لِلَّذِينَ تَابُواْ وَٱتَّبَعُواْ سَبِيلَكَ وَقِهِمۡ عَذَابَ ٱلۡجَحِيمِ","End":"٧"},{"SurahNumber":40,"VerseNumber":8,"Text":"رَبَّنَا وَأَدۡخِلۡهُمۡ جَنَّـٰتِ عَدۡنٍ ٱلَّتِي وَعَدتَّهُمۡ وَمَن صَلَحَ مِنۡ ءَابَآئِهِمۡ وَأَزۡوَٰجِهِمۡ وَذُرِّيَّـٰتِهِمۡۚ إِنَّكَ أَنتَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","End":"٨"},{"SurahNumber":40,"VerseNumber":9,"Text":"وَقِهِمُ ٱلسَّيِّـَٔاتِۚ وَمَن تَقِ ٱلسَّيِّـَٔاتِ يَوۡمَئِذٖ فَقَدۡ رَحِمۡتَهُۥۚ وَذَٰلِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ","End":"٩"},{"SurahNumber":40,"VerseNumber":10,"Text":"إِنَّ ٱلَّذِينَ كَفَرُواْ يُنَادَوۡنَ لَمَقۡتُ ٱللَّهِ أَكۡبَرُ مِن مَّقۡتِكُمۡ أَنفُسَكُمۡ إِذۡ تُدۡعَوۡنَ إِلَى ٱلۡإِيمَٰنِ فَتَكۡفُرُونَ","End":"١٠"},{"SurahNumber":40,"VerseNumber":11,"Text":"قَالُواْ رَبَّنَآ أَمَتَّنَا ٱثۡنَتَيۡنِ وَأَحۡيَيۡتَنَا ٱثۡنَتَيۡنِ فَٱعۡتَرَفۡنَا بِذُنُوبِنَا فَهَلۡ إِلَىٰ خُرُوجٖ مِّن سَبِيلٖ","End":"١١"},{"SurahNumber":40,"VerseNumber":12,"Text":"ذَٰلِكُم بِأَنَّهُۥٓ إِذَا دُعِيَ ٱللَّهُ وَحۡدَهُۥ كَفَرۡتُمۡ وَإِن يُشۡرَكۡ بِهِۦ تُؤۡمِنُواْۚ فَٱلۡحُكۡمُ لِلَّهِ ٱلۡعَلِيِّ ٱلۡكَبِيرِ","End":"١٢"},{"SurahNumber":40,"VerseNumber":13,"Text":"هُوَ ٱلَّذِي يُرِيكُمۡ ءَايَٰتِهِۦ وَيُنَزِّلُ لَكُم مِّنَ ٱلسَّمَآءِ رِزۡقٗاۚ وَمَا يَتَذَكَّرُ إِلَّا مَن يُنِيبُ","End":"١٣"},{"SurahNumber":40,"VerseNumber":14,"Text":"فَٱدۡعُواْ ٱللَّهَ مُخۡلِصِينَ لَهُ ٱلدِّينَ وَلَوۡ كَرِهَ ٱلۡكَٰفِرُونَ","End":"١٤"},{"SurahNumber":40,"VerseNumber":15,"Text":"رَفِيعُ ٱلدَّرَجَٰتِ ذُو ٱلۡعَرۡشِ يُلۡقِي ٱلرُّوحَ مِنۡ أَمۡرِهِۦ عَلَىٰ مَن يَشَآءُ مِنۡ عِبَادِهِۦ لِيُنذِرَ يَوۡمَ ٱلتَّلَاقِ","End":"١٥"},{"SurahNumber":40,"VerseNumber":16,"Text":"يَوۡمَ هُم بَٰرِزُونَۖ لَا يَخۡفَىٰ عَلَى ٱللَّهِ مِنۡهُمۡ شَيۡءٞۚ لِّمَنِ ٱلۡمُلۡكُ ٱلۡيَوۡمَۖ لِلَّهِ ٱلۡوَٰحِدِ ٱلۡقَهَّارِ","End":"١٦"},{"SurahNumber":40,"VerseNumber":17,"Text":"ٱلۡيَوۡمَ تُجۡزَىٰ كُلُّ نَفۡسِۭ بِمَا كَسَبَتۡۚ لَا ظُلۡمَ ٱلۡيَوۡمَۚ إِنَّ ٱللَّهَ سَرِيعُ ٱلۡحِسَابِ","End":"١٧"},{"SurahNumber":40,"VerseNumber":18,"Text":"وَأَنذِرۡهُمۡ يَوۡمَ ٱلۡأٓزِفَةِ إِذِ ٱلۡقُلُوبُ لَدَى ٱلۡحَنَاجِرِ كَٰظِمِينَۚ مَا لِلظَّـٰلِمِينَ مِنۡ حَمِيمٖ وَلَا شَفِيعٖ يُطَاعُ","End":"١٨"},{"SurahNumber":40,"VerseNumber":19,"Text":"يَعۡلَمُ خَآئِنَةَ ٱلۡأَعۡيُنِ وَمَا تُخۡفِي ٱلصُّدُورُ","End":"١٩"},{"SurahNumber":40,"VerseNumber":20,"Text":"وَٱللَّهُ يَقۡضِي بِٱلۡحَقِّۖ وَٱلَّذِينَ يَدۡعُونَ مِن دُونِهِۦ لَا يَقۡضُونَ بِشَيۡءٍۗ إِنَّ ٱللَّهَ هُوَ ٱلسَّمِيعُ ٱلۡبَصِيرُ","End":"٢٠"},{"SurahNumber":40,"VerseNumber":21,"Text":"۞أَوَلَمۡ يَسِيرُواْ فِي ٱلۡأَرۡضِ فَيَنظُرُواْ كَيۡفَ كَانَ عَٰقِبَةُ ٱلَّذِينَ كَانُواْ مِن قَبۡلِهِمۡۚ كَانُواْ هُمۡ أَشَدَّ مِنۡهُمۡ قُوَّةٗ وَءَاثَارٗا فِي ٱلۡأَرۡضِ فَأَخَذَهُمُ ٱللَّهُ بِذُنُوبِهِمۡ وَمَا كَانَ لَهُم مِّنَ ٱللَّهِ مِن وَاقٖ","End":"٢١"},{"SurahNumber":40,"VerseNumber":22,"Text":"ذَٰلِكَ بِأَنَّهُمۡ كَانَت تَّأۡتِيهِمۡ رُسُلُهُم بِٱلۡبَيِّنَٰتِ فَكَفَرُواْ فَأَخَذَهُمُ ٱللَّهُۚ إِنَّهُۥ قَوِيّٞ شَدِيدُ ٱلۡعِقَابِ","End":"٢٢"},{"SurahNumber":40,"VerseNumber":23,"Text":"وَلَقَدۡ أَرۡسَلۡنَا مُوسَىٰ بِـَٔايَٰتِنَا وَسُلۡطَٰنٖ مُّبِينٍ","End":"٢٣"},{"SurahNumber":40,"VerseNumber":24,"Text":"إِلَىٰ فِرۡعَوۡنَ وَهَٰمَٰنَ وَقَٰرُونَ فَقَالُواْ سَٰحِرٞ كَذَّابٞ","End":"٢٤"},{"SurahNumber":40,"VerseNumber":25,"Text":"فَلَمَّا جَآءَهُم بِٱلۡحَقِّ مِنۡ عِندِنَا قَالُواْ ٱقۡتُلُوٓاْ أَبۡنَآءَ ٱلَّذِينَ ءَامَنُواْ مَعَهُۥ وَٱسۡتَحۡيُواْ نِسَآءَهُمۡۚ وَمَا كَيۡدُ ٱلۡكَٰفِرِينَ إِلَّا فِي ضَلَٰلٖ","End":"٢٥"},{"SurahNumber":40,"VerseNumber":26,"Text":"وَقَالَ فِرۡعَوۡنُ ذَرُونِيٓ أَقۡتُلۡ مُوسَىٰ وَلۡيَدۡعُ رَبَّهُۥٓۖ إِنِّيٓ أَخَافُ أَن يُبَدِّلَ دِينَكُمۡ أَوۡ أَن يُظۡهِرَ فِي ٱلۡأَرۡضِ ٱلۡفَسَادَ","End":"٢٦"},{"SurahNumber":40,"VerseNumber":27,"Text":"وَقَالَ مُوسَىٰٓ إِنِّي عُذۡتُ بِرَبِّي وَرَبِّكُم مِّن كُلِّ مُتَكَبِّرٖ لَّا يُؤۡمِنُ بِيَوۡمِ ٱلۡحِسَابِ","End":"٢٧"},{"SurahNumber":40,"VerseNumber":28,"Text":"وَقَالَ رَجُلٞ مُّؤۡمِنٞ مِّنۡ ءَالِ فِرۡعَوۡنَ يَكۡتُمُ إِيمَٰنَهُۥٓ أَتَقۡتُلُونَ رَجُلًا أَن يَقُولَ رَبِّيَ ٱللَّهُ وَقَدۡ جَآءَكُم بِٱلۡبَيِّنَٰتِ مِن رَّبِّكُمۡۖ وَإِن يَكُ كَٰذِبٗا فَعَلَيۡهِ كَذِبُهُۥۖ وَإِن يَكُ صَادِقٗا يُصِبۡكُم بَعۡضُ ٱلَّذِي يَعِدُكُمۡۖ إِنَّ ٱللَّهَ لَا يَهۡدِي مَنۡ هُوَ مُسۡرِفٞ كَذَّابٞ","End":"٢٨"},{"SurahNumber":40,"VerseNumber":29,"Text":"يَٰقَوۡمِ لَكُمُ ٱلۡمُلۡكُ ٱلۡيَوۡمَ ظَٰهِرِينَ فِي ٱلۡأَرۡضِ فَمَن يَنصُرُنَا مِنۢ بَأۡسِ ٱللَّهِ إِن جَآءَنَاۚ قَالَ فِرۡعَوۡنُ مَآ أُرِيكُمۡ إِلَّا مَآ أَرَىٰ وَمَآ أَهۡدِيكُمۡ إِلَّا سَبِيلَ ٱلرَّشَادِ","End":"٢٩"},{"SurahNumber":40,"VerseNumber":30,"Text":"وَقَالَ ٱلَّذِيٓ ءَامَنَ يَٰقَوۡمِ إِنِّيٓ أَخَافُ عَلَيۡكُم مِّثۡلَ يَوۡمِ ٱلۡأَحۡزَابِ","End":"٣٠"},{"SurahNumber":40,"VerseNumber":31,"Text":"مِثۡلَ دَأۡبِ قَوۡمِ نُوحٖ وَعَادٖ وَثَمُودَ وَٱلَّذِينَ مِنۢ بَعۡدِهِمۡۚ وَمَا ٱللَّهُ يُرِيدُ ظُلۡمٗا لِّلۡعِبَادِ","End":"٣١"},{"SurahNumber":40,"VerseNumber":32,"Text":"وَيَٰقَوۡمِ إِنِّيٓ أَخَافُ عَلَيۡكُمۡ يَوۡمَ ٱلتَّنَادِ","End":"٣٢"},{"SurahNumber":40,"VerseNumber":33,"Text":"يَوۡمَ تُوَلُّونَ مُدۡبِرِينَ مَا لَكُم مِّنَ ٱللَّهِ مِنۡ عَاصِمٖۗ وَمَن يُضۡلِلِ ٱللَّهُ فَمَا لَهُۥ مِنۡ هَادٖ","End":"٣٣"},{"SurahNumber":40,"VerseNumber":34,"Text":"وَلَقَدۡ جَآءَكُمۡ يُوسُفُ مِن قَبۡلُ بِٱلۡبَيِّنَٰتِ فَمَا زِلۡتُمۡ فِي شَكّٖ مِّمَّا جَآءَكُم بِهِۦۖ حَتَّىٰٓ إِذَا هَلَكَ قُلۡتُمۡ لَن يَبۡعَثَ ٱللَّهُ مِنۢ بَعۡدِهِۦ رَسُولٗاۚ كَذَٰلِكَ يُضِلُّ ٱللَّهُ مَنۡ هُوَ مُسۡرِفٞ مُّرۡتَابٌ","End":"٣٤"},{"SurahNumber":40,"VerseNumber":35,"Text":"ٱلَّذِينَ يُجَٰدِلُونَ فِيٓ ءَايَٰتِ ٱللَّهِ بِغَيۡرِ سُلۡطَٰنٍ أَتَىٰهُمۡۖ كَبُرَ مَقۡتًا عِندَ ٱللَّهِ وَعِندَ ٱلَّذِينَ ءَامَنُواْۚ كَذَٰلِكَ يَطۡبَعُ ٱللَّهُ عَلَىٰ كُلِّ قَلۡبِ مُتَكَبِّرٖ جَبَّارٖ","End":"٣٥"},{"SurahNumber":40,"VerseNumber":36,"Text":"وَقَالَ فِرۡعَوۡنُ يَٰهَٰمَٰنُ ٱبۡنِ لِي صَرۡحٗا لَّعَلِّيٓ أَبۡلُغُ ٱلۡأَسۡبَٰبَ","End":"٣٦"},{"SurahNumber":40,"VerseNumber":37,"Text":"أَسۡبَٰبَ ٱلسَّمَٰوَٰتِ فَأَطَّلِعَ إِلَىٰٓ إِلَٰهِ مُوسَىٰ وَإِنِّي لَأَظُنُّهُۥ كَٰذِبٗاۚ وَكَذَٰلِكَ زُيِّنَ لِفِرۡعَوۡنَ سُوٓءُ عَمَلِهِۦ وَصُدَّ عَنِ ٱلسَّبِيلِۚ وَمَا كَيۡدُ فِرۡعَوۡنَ إِلَّا فِي تَبَابٖ","End":"٣٧"},{"SurahNumber":40,"VerseNumber":38,"Text":"وَقَالَ ٱلَّذِيٓ ءَامَنَ يَٰقَوۡمِ ٱتَّبِعُونِ أَهۡدِكُمۡ سَبِيلَ ٱلرَّشَادِ","End":"٣٨"},{"SurahNumber":40,"VerseNumber":39,"Text":"يَٰقَوۡمِ إِنَّمَا هَٰذِهِ ٱلۡحَيَوٰةُ ٱلدُّنۡيَا مَتَٰعٞ وَإِنَّ ٱلۡأٓخِرَةَ هِيَ دَارُ ٱلۡقَرَارِ","End":"٣٩"},{"SurahNumber":40,"VerseNumber":40,"Text":"مَنۡ عَمِلَ سَيِّئَةٗ فَلَا يُجۡزَىٰٓ إِلَّا مِثۡلَهَاۖ وَمَنۡ عَمِلَ صَٰلِحٗا مِّن ذَكَرٍ أَوۡ أُنثَىٰ وَهُوَ مُؤۡمِنٞ فَأُوْلَـٰٓئِكَ يَدۡخُلُونَ ٱلۡجَنَّةَ يُرۡزَقُونَ فِيهَا بِغَيۡرِ حِسَابٖ","End":"٤٠"},{"SurahNumber":40,"VerseNumber":41,"Text":"۞وَيَٰقَوۡمِ مَا لِيٓ أَدۡعُوكُمۡ إِلَى ٱلنَّجَوٰةِ وَتَدۡعُونَنِيٓ إِلَى ٱلنَّارِ","End":"٤١"},{"SurahNumber":40,"VerseNumber":42,"Text":"تَدۡعُونَنِي لِأَكۡفُرَ بِٱللَّهِ وَأُشۡرِكَ بِهِۦ مَا لَيۡسَ لِي بِهِۦ عِلۡمٞ وَأَنَا۠ أَدۡعُوكُمۡ إِلَى ٱلۡعَزِيزِ ٱلۡغَفَّـٰرِ","End":"٤٢"},{"SurahNumber":40,"VerseNumber":43,"Text":"لَا جَرَمَ أَنَّمَا تَدۡعُونَنِيٓ إِلَيۡهِ لَيۡسَ لَهُۥ دَعۡوَةٞ فِي ٱلدُّنۡيَا وَلَا فِي ٱلۡأٓخِرَةِ وَأَنَّ مَرَدَّنَآ إِلَى ٱللَّهِ وَأَنَّ ٱلۡمُسۡرِفِينَ هُمۡ أَصۡحَٰبُ ٱلنَّارِ","End":"٤٣"},{"SurahNumber":40,"VerseNumber":44,"Text":"فَسَتَذۡكُرُونَ مَآ أَقُولُ لَكُمۡۚ وَأُفَوِّضُ أَمۡرِيٓ إِلَى ٱللَّهِۚ إِنَّ ٱللَّهَ بَصِيرُۢ بِٱلۡعِبَادِ","End":"٤٤"},{"SurahNumber":40,"VerseNumber":45,"Text":"فَوَقَىٰهُ ٱللَّهُ سَيِّـَٔاتِ مَا مَكَرُواْۖ وَحَاقَ بِـَٔالِ فِرۡعَوۡنَ سُوٓءُ ٱلۡعَذَابِ","End":"٤٥"},{"SurahNumber":40,"VerseNumber":46,"Text":"ٱلنَّارُ يُعۡرَضُونَ عَلَيۡهَا غُدُوّٗا وَعَشِيّٗاۚ وَيَوۡمَ تَقُومُ ٱلسَّاعَةُ أَدۡخِلُوٓاْ ءَالَ فِرۡعَوۡنَ أَشَدَّ ٱلۡعَذَابِ","End":"٤٦"},{"SurahNumber":40,"VerseNumber":47,"Text":"وَإِذۡ يَتَحَآجُّونَ فِي ٱلنَّارِ فَيَقُولُ ٱلضُّعَفَـٰٓؤُاْ لِلَّذِينَ ٱسۡتَكۡبَرُوٓاْ إِنَّا كُنَّا لَكُمۡ تَبَعٗا فَهَلۡ أَنتُم مُّغۡنُونَ عَنَّا نَصِيبٗا مِّنَ ٱلنَّارِ","End":"٤٧"},{"SurahNumber":40,"VerseNumber":48,"Text":"قَالَ ٱلَّذِينَ ٱسۡتَكۡبَرُوٓاْ إِنَّا كُلّٞ فِيهَآ إِنَّ ٱللَّهَ قَدۡ حَكَمَ بَيۡنَ ٱلۡعِبَادِ","End":"٤٨"},{"SurahNumber":40,"VerseNumber":49,"Text":"وَقَالَ ٱلَّذِينَ فِي ٱلنَّارِ لِخَزَنَةِ جَهَنَّمَ ٱدۡعُواْ رَبَّكُمۡ يُخَفِّفۡ عَنَّا يَوۡمٗا مِّنَ ٱلۡعَذَابِ","End":"٤٩"},{"SurahNumber":40,"VerseNumber":50,"Text":"قَالُوٓاْ أَوَلَمۡ تَكُ تَأۡتِيكُمۡ رُسُلُكُم بِٱلۡبَيِّنَٰتِۖ قَالُواْ بَلَىٰۚ قَالُواْ فَٱدۡعُواْۗ وَمَا دُعَـٰٓؤُاْ ٱلۡكَٰفِرِينَ إِلَّا فِي ضَلَٰلٍ","End":"٥٠"},{"SurahNumber":40,"VerseNumber":51,"Text":"إِنَّا لَنَنصُرُ رُسُلَنَا وَٱلَّذِينَ ءَامَنُواْ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَيَوۡمَ يَقُومُ ٱلۡأَشۡهَٰدُ","End":"٥١"},{"SurahNumber":40,"VerseNumber":52,"Text":"يَوۡمَ لَا يَنفَعُ ٱلظَّـٰلِمِينَ مَعۡذِرَتُهُمۡۖ وَلَهُمُ ٱللَّعۡنَةُ وَلَهُمۡ سُوٓءُ ٱلدَّارِ","End":"٥٢"},{"SurahNumber":40,"VerseNumber":53,"Text":"وَلَقَدۡ ءَاتَيۡنَا مُوسَى ٱلۡهُدَىٰ وَأَوۡرَثۡنَا بَنِيٓ إِسۡرَـٰٓءِيلَ ٱلۡكِتَٰبَ","End":"٥٣"},{"SurahNumber":40,"VerseNumber":54,"Text":"هُدٗى وَذِكۡرَىٰ لِأُوْلِي ٱلۡأَلۡبَٰبِ","End":"٥٤"},{"SurahNumber":40,"VerseNumber":55,"Text":"فَٱصۡبِرۡ إِنَّ وَعۡدَ ٱللَّهِ حَقّٞ وَٱسۡتَغۡفِرۡ لِذَنۢبِكَ وَسَبِّحۡ بِحَمۡدِ رَبِّكَ بِٱلۡعَشِيِّ وَٱلۡإِبۡكَٰرِ","End":"٥٥"},{"SurahNumber":40,"VerseNumber":56,"Text":"إِنَّ ٱلَّذِينَ يُجَٰدِلُونَ فِيٓ ءَايَٰتِ ٱللَّهِ بِغَيۡرِ سُلۡطَٰنٍ أَتَىٰهُمۡ إِن فِي صُدُورِهِمۡ إِلَّا كِبۡرٞ مَّا هُم بِبَٰلِغِيهِۚ فَٱسۡتَعِذۡ بِٱللَّهِۖ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلۡبَصِيرُ","End":"٥٦"},{"SurahNumber":40,"VerseNumber":57,"Text":"لَخَلۡقُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ أَكۡبَرُ مِنۡ خَلۡقِ ٱلنَّاسِ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَعۡلَمُونَ","End":"٥٧"},{"SurahNumber":40,"VerseNumber":58,"Text":"وَمَا يَسۡتَوِي ٱلۡأَعۡمَىٰ وَٱلۡبَصِيرُ وَٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّـٰلِحَٰتِ وَلَا ٱلۡمُسِيٓءُۚ قَلِيلٗا مَّا تَتَذَكَّرُونَ","End":"٥٨"},{"SurahNumber":40,"VerseNumber":59,"Text":"إِنَّ ٱلسَّاعَةَ لَأٓتِيَةٞ لَّا رَيۡبَ فِيهَا وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يُؤۡمِنُونَ","End":"٥٩"},{"SurahNumber":40,"VerseNumber":60,"Text":"وَقَالَ رَبُّكُمُ ٱدۡعُونِيٓ أَسۡتَجِبۡ لَكُمۡۚ إِنَّ ٱلَّذِينَ يَسۡتَكۡبِرُونَ عَنۡ عِبَادَتِي سَيَدۡخُلُونَ جَهَنَّمَ دَاخِرِينَ","End":"٦٠"},{"SurahNumber":40,"VerseNumber":61,"Text":"ٱللَّهُ ٱلَّذِي جَعَلَ لَكُمُ ٱلَّيۡلَ لِتَسۡكُنُواْ فِيهِ وَٱلنَّهَارَ مُبۡصِرًاۚ إِنَّ ٱللَّهَ لَذُو فَضۡلٍ عَلَى ٱلنَّاسِ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَشۡكُرُونَ","End":"٦١"},{"SurahNumber":40,"VerseNumber":62,"Text":"ذَٰلِكُمُ ٱللَّهُ رَبُّكُمۡ خَٰلِقُ كُلِّ شَيۡءٖ لَّآ إِلَٰهَ إِلَّا هُوَۖ فَأَنَّىٰ تُؤۡفَكُونَ","End":"٦٢"},{"SurahNumber":40,"VerseNumber":63,"Text":"كَذَٰلِكَ يُؤۡفَكُ ٱلَّذِينَ كَانُواْ بِـَٔايَٰتِ ٱللَّهِ يَجۡحَدُونَ","End":"٦٣"},{"SurahNumber":40,"VerseNumber":64,"Text":"ٱللَّهُ ٱلَّذِي جَعَلَ لَكُمُ ٱلۡأَرۡضَ قَرَارٗا وَٱلسَّمَآءَ بِنَآءٗ وَصَوَّرَكُمۡ فَأَحۡسَنَ صُوَرَكُمۡ وَرَزَقَكُم مِّنَ ٱلطَّيِّبَٰتِۚ ذَٰلِكُمُ ٱللَّهُ رَبُّكُمۡۖ فَتَبَارَكَ ٱللَّهُ رَبُّ ٱلۡعَٰلَمِينَ","End":"٦٤"},{"SurahNumber":40,"VerseNumber":65,"Text":"هُوَ ٱلۡحَيُّ لَآ إِلَٰهَ إِلَّا هُوَ فَٱدۡعُوهُ مُخۡلِصِينَ لَهُ ٱلدِّينَۗ ٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ","End":"٦٥"},{"SurahNumber":40,"VerseNumber":66,"Text":"۞قُلۡ إِنِّي نُهِيتُ أَنۡ أَعۡبُدَ ٱلَّذِينَ تَدۡعُونَ مِن دُونِ ٱللَّهِ لَمَّا جَآءَنِيَ ٱلۡبَيِّنَٰتُ مِن رَّبِّي وَأُمِرۡتُ أَنۡ أُسۡلِمَ لِرَبِّ ٱلۡعَٰلَمِينَ","End":"٦٦"},{"SurahNumber":40,"VerseNumber":67,"Text":"هُوَ ٱلَّذِي خَلَقَكُم مِّن تُرَابٖ ثُمَّ مِن نُّطۡفَةٖ ثُمَّ مِنۡ عَلَقَةٖ ثُمَّ يُخۡرِجُكُمۡ طِفۡلٗا ثُمَّ لِتَبۡلُغُوٓاْ أَشُدَّكُمۡ ثُمَّ لِتَكُونُواْ شُيُوخٗاۚ وَمِنكُم مَّن يُتَوَفَّىٰ مِن قَبۡلُۖ وَلِتَبۡلُغُوٓاْ أَجَلٗا مُّسَمّٗى وَلَعَلَّكُمۡ تَعۡقِلُونَ","End":"٦٧"},{"SurahNumber":40,"VerseNumber":68,"Text":"هُوَ ٱلَّذِي يُحۡيِۦ وَيُمِيتُۖ فَإِذَا قَضَىٰٓ أَمۡرٗا فَإِنَّمَا يَقُولُ لَهُۥ كُن فَيَكُونُ","End":"٦٨"},{"SurahNumber":40,"VerseNumber":69,"Text":"أَلَمۡ تَرَ إِلَى ٱلَّذِينَ يُجَٰدِلُونَ فِيٓ ءَايَٰتِ ٱللَّهِ أَنَّىٰ يُصۡرَفُونَ","End":"٦٩"},{"SurahNumber":40,"VerseNumber":70,"Text":"ٱلَّذِينَ كَذَّبُواْ بِٱلۡكِتَٰبِ وَبِمَآ أَرۡسَلۡنَا بِهِۦ رُسُلَنَاۖ فَسَوۡفَ يَعۡلَمُونَ","End":"٧٠"},{"SurahNumber":40,"VerseNumber":71,"Text":"إِذِ ٱلۡأَغۡلَٰلُ فِيٓ أَعۡنَٰقِهِمۡ وَٱلسَّلَٰسِلُ يُسۡحَبُونَ","End":"٧١"},{"SurahNumber":40,"VerseNumber":72,"Text":"فِي ٱلۡحَمِيمِ ثُمَّ فِي ٱلنَّارِ يُسۡجَرُونَ","End":"٧٢"},{"SurahNumber":40,"VerseNumber":73,"Text":"ثُمَّ قِيلَ لَهُمۡ أَيۡنَ مَا كُنتُمۡ تُشۡرِكُونَ","End":"٧٣"},{"SurahNumber":40,"VerseNumber":74,"Text":"مِن دُونِ ٱللَّهِۖ قَالُواْ ضَلُّواْ عَنَّا بَل لَّمۡ نَكُن نَّدۡعُواْ مِن قَبۡلُ شَيۡـٔٗاۚ كَذَٰلِكَ يُضِلُّ ٱللَّهُ ٱلۡكَٰفِرِينَ","End":"٧٤"},{"SurahNumber":40,"VerseNumber":75,"Text":"ذَٰلِكُم بِمَا كُنتُمۡ تَفۡرَحُونَ فِي ٱلۡأَرۡضِ بِغَيۡرِ ٱلۡحَقِّ وَبِمَا كُنتُمۡ تَمۡرَحُونَ","End":"٧٥"},{"SurahNumber":40,"VerseNumber":76,"Text":"ٱدۡخُلُوٓاْ أَبۡوَٰبَ جَهَنَّمَ خَٰلِدِينَ فِيهَاۖ فَبِئۡسَ مَثۡوَى ٱلۡمُتَكَبِّرِينَ","End":"٧٦"},{"SurahNumber":40,"VerseNumber":77,"Text":"فَٱصۡبِرۡ إِنَّ وَعۡدَ ٱللَّهِ حَقّٞۚ فَإِمَّا نُرِيَنَّكَ بَعۡضَ ٱلَّذِي نَعِدُهُمۡ أَوۡ نَتَوَفَّيَنَّكَ فَإِلَيۡنَا يُرۡجَعُونَ","End":"٧٧"},{"SurahNumber":40,"VerseNumber":78,"Text":"وَلَقَدۡ أَرۡسَلۡنَا رُسُلٗا مِّن قَبۡلِكَ مِنۡهُم مَّن قَصَصۡنَا عَلَيۡكَ وَمِنۡهُم مَّن لَّمۡ نَقۡصُصۡ عَلَيۡكَۗ وَمَا كَانَ لِرَسُولٍ أَن يَأۡتِيَ بِـَٔايَةٍ إِلَّا بِإِذۡنِ ٱللَّهِۚ فَإِذَا جَآءَ أَمۡرُ ٱللَّهِ قُضِيَ بِٱلۡحَقِّ وَخَسِرَ هُنَالِكَ ٱلۡمُبۡطِلُونَ","End":"٧٨"},{"SurahNumber":40,"VerseNumber":79,"Text":"ٱللَّهُ ٱلَّذِي جَعَلَ لَكُمُ ٱلۡأَنۡعَٰمَ لِتَرۡكَبُواْ مِنۡهَا وَمِنۡهَا تَأۡكُلُونَ","End":"٧٩"},{"SurahNumber":40,"VerseNumber":80,"Text":"وَلَكُمۡ فِيهَا مَنَٰفِعُ وَلِتَبۡلُغُواْ عَلَيۡهَا حَاجَةٗ فِي صُدُورِكُمۡ وَعَلَيۡهَا وَعَلَى ٱلۡفُلۡكِ تُحۡمَلُونَ","End":"٨٠"},{"SurahNumber":40,"VerseNumber":81,"Text":"وَيُرِيكُمۡ ءَايَٰتِهِۦ فَأَيَّ ءَايَٰتِ ٱللَّهِ تُنكِرُونَ","End":"٨١"},{"SurahNumber":40,"VerseNumber":82,"Text":"أَفَلَمۡ يَسِيرُواْ فِي ٱلۡأَرۡضِ فَيَنظُرُواْ كَيۡفَ كَانَ عَٰقِبَةُ ٱلَّذِينَ مِن قَبۡلِهِمۡۚ كَانُوٓاْ أَكۡثَرَ مِنۡهُمۡ وَأَشَدَّ قُوَّةٗ وَءَاثَارٗا فِي ٱلۡأَرۡضِ فَمَآ أَغۡنَىٰ عَنۡهُم مَّا كَانُواْ يَكۡسِبُونَ","End":"٨٢"},{"SurahNumber":40,"VerseNumber":83,"Text":"فَلَمَّا جَآءَتۡهُمۡ رُسُلُهُم بِٱلۡبَيِّنَٰتِ فَرِحُواْ بِمَا عِندَهُم مِّنَ ٱلۡعِلۡمِ وَحَاقَ بِهِم مَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ","End":"٨٣"},{"SurahNumber":40,"VerseNumber":84,"Text":"فَلَمَّا رَأَوۡاْ بَأۡسَنَا قَالُوٓاْ ءَامَنَّا بِٱللَّهِ وَحۡدَهُۥ وَكَفَرۡنَا بِمَا كُنَّا بِهِۦ مُشۡرِكِينَ","End":"٨٤"},{"SurahNumber":40,"VerseNumber":85,"Text":"فَلَمۡ يَكُ يَنفَعُهُمۡ إِيمَٰنُهُمۡ لَمَّا رَأَوۡاْ بَأۡسَنَاۖ سُنَّتَ ٱللَّهِ ٱلَّتِي قَدۡ خَلَتۡ فِي عِبَادِهِۦۖ وَخَسِرَ هُنَالِكَ ٱلۡكَٰفِرُونَ","End":"٨٥"}],"Translations":[{"LanguageCode":"ara","Language":"Arabic","Name":"ara-quran-la","Author":"Quran Transliteration","Source":"http://tanzil.net","Direction":"ltr","Translations":[{"SurahNumber":40,"VerseNumber":1,"Text":"Hameem"},{"SurahNumber":40,"VerseNumber":2,"Text":"Tanzeelu alkitabi mina Allahi alAAazeezi alAAaleemi"},{"SurahNumber":40,"VerseNumber":3,"Text":"Ghafiri alththanbi waqabili alttawbi shadeedi alAAiqabi thee alttawli la ilaha illa huwa ilayhi almaseeru"},{"SurahNumber":40,"VerseNumber":4,"Text":"Ma yujadilu fee ayati Allahi illa allatheena kafaroo fala yaghrurka taqallubuhum fee albiladi"},{"SurahNumber":40,"VerseNumber":5,"Text":"Kaththabat qablahum qawmu noohin waalahzabu min baAAdihim wahammat kullu ommatin birasoolihim liyakhuthoohu wajadaloo bialbatili liyudhidoo bihi alhaqqa faakhathtuhum fakayfa kana AAiqabi"},{"SurahNumber":40,"VerseNumber":6,"Text":"Wakathalika haqqat kalimatu rabbika AAala allatheena kafaroo annahum ashabu alnnari"},{"SurahNumber":40,"VerseNumber":7,"Text":"Allatheena yahmiloona alAAarsha waman hawlahu yusabbihoona bihamdi rabbihim wayuminoona bihi wayastaghfiroona lillatheena amanoo rabbana wasiAAta kulla shayin rahmatan waAAilman faighfir lillatheena taboo waittabaAAoo sabeelaka waqihim AAathaba aljaheemi"},{"SurahNumber":40,"VerseNumber":8,"Text":"Rabbana waadkhilhum jannati AAadnin allatee waAAadtahum waman salaha min abaihim waazwajihim wathurriyyatihim innaka anta alAAazeezu alhakeemu"},{"SurahNumber":40,"VerseNumber":9,"Text":"Waqihimu alssayyiati waman taqi alssayyiati yawmaithin faqad rahimtahu wathalika huwa alfawzu alAAatheemu"},{"SurahNumber":40,"VerseNumber":10,"Text":"Inna allatheena kafaroo yunadawna lamaqtu Allahi akbaru min maqtikum anfusakum ith tudAAawna ila aleemani fatakfuroona"},{"SurahNumber":40,"VerseNumber":11,"Text":"Qaloo rabbana amattana ithnatayni waahyaytana ithnatayni faiAAtarafna bithunoobina fahal ila khuroojin min sabeelin"},{"SurahNumber":40,"VerseNumber":12,"Text":"Thalikum biannahu itha duAAiya Allahu wahdahu kafartum wain yushrak bihi tuminoo faalhukmu lillahi alAAaliyyi alkabeeri"},{"SurahNumber":40,"VerseNumber":13,"Text":"Huwa allathee yureekum ayatihi wayunazzilu lakum mina alssamai rizqan wama yatathakkaru illa man yuneebu"},{"SurahNumber":40,"VerseNumber":14,"Text":"FaodAAoo Allaha mukhliseena lahu alddeena walaw kariha alkafiroona"},{"SurahNumber":40,"VerseNumber":15,"Text":"RafeeAAu alddarajati thoo alAAarshi yulqee alrrooha min amrihi AAala man yashao min AAibadihi liyunthira yawma alttalaqi"},{"SurahNumber":40,"VerseNumber":16,"Text":"Yawma hum barizoona la yakhfa AAala Allahi minhum shayon limani almulku alyawma lillahi alwahidi alqahhari"},{"SurahNumber":40,"VerseNumber":17,"Text":"Alyawma tujza kullu nafsin bima kasabat la thulma alyawma inna Allaha sareeAAu alhisabi"},{"SurahNumber":40,"VerseNumber":18,"Text":"Waanthirhum yawma alazifati ithi alquloobu lada alhanajiri kathimeena ma lilththalimeena min hameemin wala shafeeAAin yutaAAu"},{"SurahNumber":40,"VerseNumber":19,"Text":"YaAAlamu khainata alaAAyuni wama tukhfee alssudooru"},{"SurahNumber":40,"VerseNumber":20,"Text":"WaAllahu yaqdee bialhaqqi waallatheena yadAAoona min doonihi la yaqdoona bishayin inna Allaha huwa alssameeAAu albaseeru"},{"SurahNumber":40,"VerseNumber":21,"Text":"Awa lam yaseeroo fee alardi fayanthuroo kayfa kana AAaqibatu allatheena kanoo min qablihim kanoo hum ashadda minhum quwwatan waatharan fee alardi faakhathahumu Allahu bithunoobihim wama kana lahum mina Allahi min waqin"},{"SurahNumber":40,"VerseNumber":22,"Text":"Thalika biannahum kanat tateehim rusuluhum bialbayyinati fakafaroo faakhathahumu Allahu innahu qawiyyun shadeedu alAAiqabi"},{"SurahNumber":40,"VerseNumber":23,"Text":"Walaqad arsalna moosa biayatina wasultanin mubeenin"},{"SurahNumber":40,"VerseNumber":24,"Text":"Ila firAAawna wahamana waqaroona faqaloo sahirun kaththabun"},{"SurahNumber":40,"VerseNumber":25,"Text":"Falamma jaahum bialhaqqi min AAindina qaloo oqtuloo abnaa allatheena amanoo maAAahu waistahyoo nisaahum wama kaydu alkafireena illa fee dalalin"},{"SurahNumber":40,"VerseNumber":26,"Text":"Waqala firAAawnu tharoonee aqtul moosa walyadAAu rabbahu innee akhafu an yubaddila deenakum aw an yuthhira fee alardi alfasada"},{"SurahNumber":40,"VerseNumber":27,"Text":"Waqala moosa innee AAuthtu birabbee warabbikum min kulli mutakabbirin la yuminu biyawmi alhisabi"},{"SurahNumber":40,"VerseNumber":28,"Text":"Waqala rajulun muminun min ali firAAawna yaktumu eemanahu ataqtuloona rajulan an yaqoola rabbiyya Allahu waqad jaakum bialbayyinati min rabbikum wain yaku kathiban faAAalayhi kathibuhu wain yaku sadiqan yusibkum baAAdu allathee yaAAidukum inna Allaha la yahdee man huwa musrifun kaththabun"},{"SurahNumber":40,"VerseNumber":29,"Text":"Ya qawmi lakumu almulku alyawma thahireena fee alardi faman yansuruna min basi Allahi in jaana qala firAAawnu ma oreekum illa ma ara wama ahdeekum illa sabeela alrrashadi"},{"SurahNumber":40,"VerseNumber":30,"Text":"Waqala allathee amana ya qawmi innee akhafu AAalaykum mithla yawmi alahzabi"},{"SurahNumber":40,"VerseNumber":31,"Text":"Mithla dabi qawmi noohin waAAadin wathamooda waallatheena min baAAdihim wama Allahu yureedu thulman lilAAibadi"},{"SurahNumber":40,"VerseNumber":32,"Text":"Waya qawmi innee akhafu AAalaykum yawma alttanadi"},{"SurahNumber":40,"VerseNumber":33,"Text":"Yawma tuwalloona mudbireena ma lakum mina Allahi min AAasimin waman yudlili Allahu fama lahu min hadin"},{"SurahNumber":40,"VerseNumber":34,"Text":"Walaqad jaakum yoosufu min qablu bialbayyinati fama ziltum fee shakkin mimma jaakum bihi hatta itha halaka qultum lan yabAAatha Allahu min baAAdihi rasoolan kathalika yudillu Allahu man huwa musrifun murtabun"},{"SurahNumber":40,"VerseNumber":35,"Text":"Allatheena yujadiloona fee ayati Allahi bighayri sultanin atahum kabura maqtan AAinda Allahi waAAinda allatheena amanoo kathalika yatbaAAu Allahu AAala kulli qalbi mutakabbirin jabbarin"},{"SurahNumber":40,"VerseNumber":36,"Text":"Waqala firAAawnu ya hamanu ibni lee sarhan laAAallee ablughu alasbaba"},{"SurahNumber":40,"VerseNumber":37,"Text":"Asbaba alssamawati faattaliAAa ila ilahi moosa wainnee laathunnuhu kathiban wakathalika zuyyina lifirAAawna sooo AAamalihi wasudda AAani alssabeeli wama kaydu firAAawna illa fee tababin"},{"SurahNumber":40,"VerseNumber":38,"Text":"Waqala allathee amana ya qawmi ittabiAAooni ahdikum sabeela alrrashadi"},{"SurahNumber":40,"VerseNumber":39,"Text":"Ya qawmi innama hathihi alhayatu alddunya mataAAun wainna alakhirata hiya daru alqarari"},{"SurahNumber":40,"VerseNumber":40,"Text":"Man AAamila sayyiatan fala yujza illa mithlaha waman AAamila salihan min thakarin aw ontha wahuwa muminun faolaika yadkhuloona aljannata yurzaqoona feeha bighayri hisabin"},{"SurahNumber":40,"VerseNumber":41,"Text":"Waya qawmi ma lee adAAookum ila alnnajati watadAAoonanee ila alnnari"},{"SurahNumber":40,"VerseNumber":42,"Text":"TadAAoonanee liakfura biAllahi waoshrika bihi ma laysa lee bihi AAilmun waana adAAookum ila alAAazeezi alghaffari"},{"SurahNumber":40,"VerseNumber":43,"Text":"La jarama annama tadAAoonanee ilayhi laysa lahu daAAwatun fee alddunya wala fee alakhirati waanna maraddana ila Allahi waanna almusrifeena hum ashabu alnnari"},{"SurahNumber":40,"VerseNumber":44,"Text":"Fasatathkuroona ma aqoolu lakum waofawwidu amree ila Allahi inna Allaha baseerun bialAAibadi"},{"SurahNumber":40,"VerseNumber":45,"Text":"Fawaqahu Allahu sayyiati ma makaroo wahaqa biali firAAawna sooo alAAathabi"},{"SurahNumber":40,"VerseNumber":46,"Text":"Alnnaru yuAAradoona AAalayha ghuduwwan waAAashiyyan wayawma taqoomu alssaAAatu adkhiloo ala firAAawna ashadda alAAathabi"},{"SurahNumber":40,"VerseNumber":47,"Text":"Waith yatahajjoona fee alnnari fayaqoolu aldduAAafao lillatheena istakbaroo inna kunna lakum tabaAAan fahal antum mughnoona AAanna naseeban mina alnnari"},{"SurahNumber":40,"VerseNumber":48,"Text":"Qala allatheena istakbaroo inna kullun feeha inna Allaha qad hakama bayna alAAibadi"},{"SurahNumber":40,"VerseNumber":49,"Text":"Waqala allatheena fee alnnari likhazanati jahannama odAAoo rabbakum yukhaffif AAanna yawman mina alAAathabi"},{"SurahNumber":40,"VerseNumber":50,"Text":"Qaloo awalam taku tateekum rusulukum bialbayyinati qaloo bala qaloo faodAAoo wama duAAao alkafireena illa fee dalalin"},{"SurahNumber":40,"VerseNumber":51,"Text":"Inna lanansuru rusulana waallatheena amanoo fee alhayati alddunya wayawma yaqoomu alashhadu"},{"SurahNumber":40,"VerseNumber":52,"Text":"Yawma la yanfaAAu alththalimeena maAAthiratuhum walahumu allaAAnatu walahum sooo alddari"},{"SurahNumber":40,"VerseNumber":53,"Text":"Walaqad atayna moosa alhuda waawrathna banee israeela alkitaba"},{"SurahNumber":40,"VerseNumber":54,"Text":"Hudan wathikra liolee alalbabi"},{"SurahNumber":40,"VerseNumber":55,"Text":"Faisbir inna waAAda Allahi haqqun waistaghfir lithanbika wasabbih bihamdi rabbika bialAAashiyyi waalibkari"},{"SurahNumber":40,"VerseNumber":56,"Text":"Inna allatheena yujadiloona fee ayati Allahi bighayri sultanin atahum in fee sudoorihim illa kibrun ma hum bibaligheehi faistaAAith biAllahi innahu huwa alssameeAAu albaseeru"},{"SurahNumber":40,"VerseNumber":57,"Text":"Lakhalqu alssamawati waalardi akbaru min khalqi alnnasi walakinna akthara alnnasi la yaAAlamoona"},{"SurahNumber":40,"VerseNumber":58,"Text":"Wama yastawee alaAAma waalbaseeru waallatheena amanoo waAAamiloo alssalihati wala almuseeo qaleelan ma tatathakkaroona"},{"SurahNumber":40,"VerseNumber":59,"Text":"Inna alssaAAata laatiyatun la rayba feeha walakinna akthara alnnasi la yuminoona"},{"SurahNumber":40,"VerseNumber":60,"Text":"Waqala rabbukumu odAAoonee astajib lakum inna allatheena yastakbiroona AAan AAibadatee sayadkhuloona jahannama dakhireena"},{"SurahNumber":40,"VerseNumber":61,"Text":"Allahu allathee jaAAala lakumu allayla litaskunoo feehi waalnnahara mubsiran inna Allaha lathoo fadlin AAala alnnasi walakinna akthara alnnasi la yashkuroona"},{"SurahNumber":40,"VerseNumber":62,"Text":"Thalikumu Allahu rabbukum khaliqu kulli shayin la ilaha illa huwa faanna tufakoona"},{"SurahNumber":40,"VerseNumber":63,"Text":"Kathalika yufaku allatheena kanoo biayati Allahi yajhadoona"},{"SurahNumber":40,"VerseNumber":64,"Text":"Allahu allathee jaAAala lakumu alarda qararan waalssamaa binaan wasawwarakum faahsana suwarakum warazaqakum mina alttayyibati thalikumu Allahu rabbukum fatabaraka Allahu rabbu alAAalameena"},{"SurahNumber":40,"VerseNumber":65,"Text":"Huwa alhayyu la ilaha illa huwa faodAAoohu mukhliseena lahu alddeena alhamdu lillahi rabbi alAAalameena"},{"SurahNumber":40,"VerseNumber":66,"Text":"Qul innee nuheetu an aAAbuda allatheena tadAAoona min dooni Allahi lamma jaaniya albayyinatu min rabbee waomirtu an oslima lirabbi alAAalameena"},{"SurahNumber":40,"VerseNumber":67,"Text":"Huwa allathee khalaqakum min turabin thumma min nutfatin thumma min AAalaqatin thumma yukhrijukum tiflan thumma litablughoo ashuddakum thumma litakoonoo shuyookhan waminkum man yutawaffa min qablu walitablughoo ajalan musamman walaAAallakum taAAqiloona"},{"SurahNumber":40,"VerseNumber":68,"Text":"Huwa allathee yuhyee wayumeetu faitha qada amran fainnama yaqoolu lahu kun fayakoonu"},{"SurahNumber":40,"VerseNumber":69,"Text":"Alam tara ila allatheena yujadiloona fee ayati Allahi anna yusrafoona"},{"SurahNumber":40,"VerseNumber":70,"Text":"Allatheena kaththaboo bialkitabi wabima arsalna bihi rusulana fasawfa yaAAlamoona"},{"SurahNumber":40,"VerseNumber":71,"Text":"Ithi alaghlalu fee aAAnaqihim waalssalasilu yushaboona"},{"SurahNumber":40,"VerseNumber":72,"Text":"Fee alhameemi thumma fee alnnari yusjaroona"},{"SurahNumber":40,"VerseNumber":73,"Text":"Thumma qeela lahum ayna ma kuntum tushrikoona"},{"SurahNumber":40,"VerseNumber":74,"Text":"Min dooni Allahi qaloo dalloo AAanna bal lam nakun nadAAoo min qablu shayan kathalika yudillu Allahu alkafireena"},{"SurahNumber":40,"VerseNumber":75,"Text":"Thalikum bima kuntum tafrahoona fee alardi bighayri alhaqqi wabima kuntum tamrahoona"},{"SurahNumber":40,"VerseNumber":76,"Text":"Odkhuloo abwaba jahannama khalideena feeha fabisa mathwa almutakabbireena"},{"SurahNumber":40,"VerseNumber":77,"Text":"Faisbir inna waAAda Allahi haqqun faimma nuriyannaka baAAda allathee naAAiduhum aw natawaffayannaka failayna yurjaAAoona"},{"SurahNumber":40,"VerseNumber":78,"Text":"Walaqad arsalna rusulan min qablika minhum man qasasna AAalayka waminhum man lam naqsus AAalayka wama kana lirasoolin an yatiya biayatin illa biithni Allahi faitha jaa amru Allahi qudiya bialhaqqi wakhasira hunalika almubtiloona"},{"SurahNumber":40,"VerseNumber":79,"Text":"Allahu allathee jaAAala lakumu alanAAama litarkaboo minha waminha takuloona"},{"SurahNumber":40,"VerseNumber":80,"Text":"Walakum feeha manafiAAu walitablughoo AAalayha hajatan fee sudoorikum waAAalayha waAAala alfulki tuhmaloona"},{"SurahNumber":40,"VerseNumber":81,"Text":"Wayureekum ayatihi faayya ayati Allahi tunkiroona"},{"SurahNumber":40,"VerseNumber":82,"Text":"Afalam yaseeroo fee alardi fayanthuroo kayfa kana AAaqibatu allatheena min qablihim kanoo akthara minhum waashadda quwwatan waatharan fee alardi fama aghna AAanhum ma kanoo yaksiboona"},{"SurahNumber":40,"VerseNumber":83,"Text":"Falamma jaathum rusuluhum bialbayyinati farihoo bima AAindahum mina alAAilmi wahaqa bihim ma kanoo bihi yastahzioona"},{"SurahNumber":40,"VerseNumber":84,"Text":"Falamma raaw basana qaloo amanna biAllahi wahdahu wakafarna bima kunna bihi mushrikeena"},{"SurahNumber":40,"VerseNumber":85,"Text":"Falam yaku yanfaAAuhum eemanuhum lamma raaw basana sunnata Allahi allatee qad khalat fee AAibadihi wakhasira hunalika alkafiroona"}]},{"LanguageCode":"eng","Language":"English","Name":"eng-mustafakhattabg","Author":"Mustafa Khattab God Edition","Source":"","Direction":"ltr","Translations":[{"SurahNumber":40,"VerseNumber":1,"Text":"Ḥâ-Mĩm"},{"SurahNumber":40,"VerseNumber":2,"Text":"The revelation of this Book is from God—the Almighty, All-Knowing"},{"SurahNumber":40,"VerseNumber":3,"Text":"the Forgiver of sin and Accepter of repentance, the Severe in punishment, and Infinite in bounty. There is no god ˹worthy of worship˺ except Him. To Him ˹alone˺ is the final return"},{"SurahNumber":40,"VerseNumber":4,"Text":"None disputes the signs of God except the disbelievers, so do not be deceived by their prosperity throughout the land"},{"SurahNumber":40,"VerseNumber":5,"Text":"Before them, the people of Noah denied ˹the truth˺, as did ˹other˺ enemy forces afterwards. Every community plotted against its prophet to seize him, and argued in falsehood, ˹hoping˺ to discredit the truth with it. So I seized them. And how ˹horrible˺ was My punishment"},{"SurahNumber":40,"VerseNumber":6,"Text":"And so your Lord’s decree has been proven true against the disbelievers—that they will be the inmates of the Fire"},{"SurahNumber":40,"VerseNumber":7,"Text":"Those ˹angels˺ who carry the Throne and those around it glorify the praises of their Lord, have faith in Him, and seek forgiveness for the believers, ˹praying:˺ “Our Lord! You encompass everything in ˹Your˺ mercy and knowledge. So forgive those who repent and follow Your Way, and protect them from the torment of the Hellfire"},{"SurahNumber":40,"VerseNumber":8,"Text":"Our Lord! Admit them into the Gardens of Eternity which You have promised them, along with the righteous among their parents, spouses, and descendants. You ˹alone˺ are truly the Almighty, All-Wise"},{"SurahNumber":40,"VerseNumber":9,"Text":"And protect them from ˹the consequences of their˺ evil deeds. For whoever You protect from the evil of their deeds on that Day will have been shown Your mercy. That is ˹truly˺ the ultimate triumph.”"},{"SurahNumber":40,"VerseNumber":10,"Text":"Indeed, it will be announced to the disbelievers, “God’s contempt for you—as you disbelieved when invited to belief—was far worse than your contempt for one another ˹Today˺.”"},{"SurahNumber":40,"VerseNumber":11,"Text":"They will plead, “Our Lord! You made us lifeless twice, and gave us life twice. Now we confess our sins. So is there any way out?”"},{"SurahNumber":40,"VerseNumber":12,"Text":"˹They will be told,˺ “˹No!˺ This is because when God alone was invoked, you ˹staunchly˺ disbelieved. But when others were associated with Him ˹in worship˺, you ˹readily˺ believed. So ˹Today˺ judgment belongs to God ˹alone˺—the Most High, All-Great.”"},{"SurahNumber":40,"VerseNumber":13,"Text":"He is the One Who shows you His signs and sends down ˹rain as˺ a provision for you from the sky. ˹But˺ none will be mindful except those who turn ˹to Him˺"},{"SurahNumber":40,"VerseNumber":14,"Text":"So call upon God with sincere devotion, even to the dismay of the disbelievers"},{"SurahNumber":40,"VerseNumber":15,"Text":"˹He is˺ Highly Exalted in rank, Lord of the Throne. He sends down the revelation by His command to whoever He wills of His servants to warn ˹all˺ of the Day of Meeting—"},{"SurahNumber":40,"VerseNumber":16,"Text":"the Day all will appear ˹before God˺. Nothing about them will be hidden from Him. ˹He will ask,˺ “Who does all authority belong to this Day? To God—the One, the Supreme"},{"SurahNumber":40,"VerseNumber":17,"Text":"Today every soul will be rewarded for what it has done. No injustice Today! Surely God is swift in reckoning.”"},{"SurahNumber":40,"VerseNumber":18,"Text":"Warn them ˹O Prophet˺ of the approaching Day when the hearts will jump into the throats, suppressing distress. The wrongdoers will have neither a close friend nor intercessor to be heard"},{"SurahNumber":40,"VerseNumber":19,"Text":"God ˹even˺ knows the sly glances of the eyes and whatever the hearts conceal"},{"SurahNumber":40,"VerseNumber":20,"Text":"And God judges with the truth, while those ˹idols˺ they invoke besides Him cannot judge at all. Indeed, God ˹alone˺ is the All-Hearing, All-Seeing"},{"SurahNumber":40,"VerseNumber":21,"Text":"Have they not travelled throughout the land to see what was the end of those ˹destroyed˺ before them? They were far superior in might and ˹richer in˺ monuments throughout the land. But God seized them for their sins, and they had no protector from God"},{"SurahNumber":40,"VerseNumber":22,"Text":"That was because their messengers used to come to them with clear proofs, but they persisted in disbelief. So God seized them. Surely He is All-Powerful, severe in punishment"},{"SurahNumber":40,"VerseNumber":23,"Text":"Indeed, We sent Moses with Our signs and compelling proof"},{"SurahNumber":40,"VerseNumber":24,"Text":"to Pharaoh, Hamân, and Korah. But they responded: “Magician! Total liar!”"},{"SurahNumber":40,"VerseNumber":25,"Text":"Then, when he came to them with the truth from Us, they said, “Kill the sons of those who believe with him and keep their women.” But the plotting of the disbelievers was only in vain"},{"SurahNumber":40,"VerseNumber":26,"Text":"And Pharaoh said, “Let me kill Moses, and let him call upon his Lord! I truly fear that he may change your traditions or cause mischief in the land.”"},{"SurahNumber":40,"VerseNumber":27,"Text":"Moses replied, “I seek refuge in my Lord and your Lord from every arrogant person who does not believe in the Day of Reckoning.”"},{"SurahNumber":40,"VerseNumber":28,"Text":"A believing man from Pharaoh’s people, who was hiding his faith, argued, “Will you kill a man ˹only˺ for saying: ‘My Lord is God,’ while he has in fact come to you with clear proofs from your Lord? If he is a liar, it will be to his own loss. But if he is truthful, then you will be afflicted with some of what he is threatening you with. Surely God does not guide whoever is a transgressor, a total liar"},{"SurahNumber":40,"VerseNumber":29,"Text":"O my people! Authority belongs to you today, reigning supreme in the land. But who would help us against the torment of God, if it were to befall us?” Pharaoh assured ˹his people˺, “I am telling you only what I believe, and I am leading you only to the way of guidance.”"},{"SurahNumber":40,"VerseNumber":30,"Text":"And the man who believed cautioned, “O my people! I truly fear for you the doom of ˹earlier˺ enemy forces—"},{"SurahNumber":40,"VerseNumber":31,"Text":"like the fate of the people of Noah, ’Ȃd, Thamûd, and those after them. For God would never will to wrong ˹His˺ servants"},{"SurahNumber":40,"VerseNumber":32,"Text":"O my people! I truly fear for you the Day all will be crying out ˹to each other˺—"},{"SurahNumber":40,"VerseNumber":33,"Text":"the Day you will ˹try in vain to˺ turn your backs and run away, with no one to protect you from God. And whoever God leaves to stray will be left with no guide"},{"SurahNumber":40,"VerseNumber":34,"Text":"Joseph already came to you earlier with clear proofs, yet you never ceased to doubt what he came to you with. When he died you said, ‘God will never send a messenger after him.’ This is how God leaves every transgressor and doubter to stray—"},{"SurahNumber":40,"VerseNumber":35,"Text":"those who dispute God’s signs with no proof given to them. How despicable is that for God and the believers! This is how God seals the heart of every arrogant tyrant.”"},{"SurahNumber":40,"VerseNumber":36,"Text":"Pharaoh ordered, “O Hamân! Build me a high tower so I may reach the pathways"},{"SurahNumber":40,"VerseNumber":37,"Text":"leading up to the heavens and look for the God of Moses, although I am sure he is a liar.” And so Pharaoh’s evil deeds were made so appealing to him that he was hindered from the ˹Right˺ Way. But the plotting of Pharaoh was only in vain"},{"SurahNumber":40,"VerseNumber":38,"Text":"And the man who believed urged, “O my people! Follow me, ˹and˺ I will lead you to the Way of Guidance"},{"SurahNumber":40,"VerseNumber":39,"Text":"O my people! This worldly life is only ˹a fleeting˺ enjoyment, whereas the Hereafter is truly the home of settlement"},{"SurahNumber":40,"VerseNumber":40,"Text":"Whoever does an evil deed will only be paid back with its equivalent. And whoever does good, whether male or female, and is a believer, they will enter Paradise, where they will be provided for without limit"},{"SurahNumber":40,"VerseNumber":41,"Text":"O my people! How is it that I invite you to salvation, while you invite me to the Fire"},{"SurahNumber":40,"VerseNumber":42,"Text":"You invite me to disbelieve in God and associate with Him what I have no knowledge of, while I invite you to the Almighty, Most Forgiving"},{"SurahNumber":40,"VerseNumber":43,"Text":"There is no doubt that whatever ˹idols˺ you invite me to ˹worship˺ are not worthy to be invoked either in this world or the Hereafter. ˹Undoubtedly,˺ our return is to God, and the transgressors will be the inmates of the Fire"},{"SurahNumber":40,"VerseNumber":44,"Text":"You will remember what I say to you, and I entrust my affairs to God. Surely God is All-Seeing of all ˹His˺ servants.”"},{"SurahNumber":40,"VerseNumber":45,"Text":"So God protected him from the evil of their schemes. And Pharaoh’s people were overwhelmed by an evil punishment"},{"SurahNumber":40,"VerseNumber":46,"Text":"they are exposed to the Fire ˹in their graves˺ morning and evening. And on the Day the Hour will be established ˹it will be said˺, “Admit Pharaoh’s people into the harshest punishment ˹of Hell˺.”"},{"SurahNumber":40,"VerseNumber":47,"Text":"˹Consider the Day˺ when they will dispute in the Fire, and the lowly ˹followers˺ will appeal to the arrogant ˹leaders˺, “We were your ˹dedicated˺ followers, will you then shield us from a portion of the Fire?”"},{"SurahNumber":40,"VerseNumber":48,"Text":"The arrogant will say, “We are all in it! ˹For˺ God has already passed judgment over ˹His˺ servants.”"},{"SurahNumber":40,"VerseNumber":49,"Text":"And those in the Fire will cry out to the keepers of Hell, “Pray to your Lord to lighten the torment for us ˹even˺ for one day!”"},{"SurahNumber":40,"VerseNumber":50,"Text":"The keepers will reply, “Did your messengers not ˹constantly˺ come to you with clear proofs?” They will say, “Yes ˹they did˺.” The keepers will say, “Then pray! Though the prayer of the disbelievers is only in vain.”"},{"SurahNumber":40,"VerseNumber":51,"Text":"We certainly help Our messengers and the believers, ˹both˺ in this worldly life and on the Day the witnesses will stand forth ˹for testimony˺—"},{"SurahNumber":40,"VerseNumber":52,"Text":"the Day the wrongdoers’ excuses will be of no benefit to them. They will be condemned, and will have the worst outcome"},{"SurahNumber":40,"VerseNumber":53,"Text":"And indeed, We gave Moses ˹true˺ guidance, and made the Children of Israel inherit the Scripture—"},{"SurahNumber":40,"VerseNumber":54,"Text":"a guide and a reminder to people of reason"},{"SurahNumber":40,"VerseNumber":55,"Text":"So be patient ˹O Prophet˺, ˹for˺ God’s promise is certainly true. Seek forgiveness for your shortcomings. And glorify the praises of your Lord morning and evening"},{"SurahNumber":40,"VerseNumber":56,"Text":"Surely those who dispute God’s signs—with no proof given to them—have nothing in their hearts but greed for dominance, which they will never attain. So seek refuge in God. Indeed, He alone is the All-Hearing, All-Seeing"},{"SurahNumber":40,"VerseNumber":57,"Text":"The creation of the heavens and the earth is certainly greater than the re-creation of humankind, but most people do not know"},{"SurahNumber":40,"VerseNumber":58,"Text":"Those blind ˹to the truth˺ and those who can see are not equal, nor are those who believe and do good ˹equal˺ to those who do evil. Yet you are hardly mindful"},{"SurahNumber":40,"VerseNumber":59,"Text":"The Hour is certainly coming, there is no doubt about it. But most people do not believe"},{"SurahNumber":40,"VerseNumber":60,"Text":"Your Lord has proclaimed, “Call upon Me, I will respond to you. Surely those who are too proud to worship Me will enter Hell, fully humbled.”"},{"SurahNumber":40,"VerseNumber":61,"Text":"It is God Who has made the night for you to rest in and the day bright. Surely God is ever Bountiful to humanity, but most people are ungrateful"},{"SurahNumber":40,"VerseNumber":62,"Text":"That is God, your Lord, the Creator of all things. There is no god ˹worthy of worship˺ except Him. How can you then be deluded ˹from the truth˺"},{"SurahNumber":40,"VerseNumber":63,"Text":"This is how those who used to reject God’s signs were ˹also˺ deluded"},{"SurahNumber":40,"VerseNumber":64,"Text":"It is God Who made the earth a place of settlement for you and the sky a canopy. He shaped you ˹in the womb˺, perfecting your form. And He has provided you with what is good and lawful. That is God—your Lord. So Blessed is God, Lord of all worlds"},{"SurahNumber":40,"VerseNumber":65,"Text":"He is the Ever-Living. There is no god ˹worthy of worship˺ except Him. So call upon Him with sincere devotion, ˹saying,˺ “All praise is for God—Lord of all worlds.”"},{"SurahNumber":40,"VerseNumber":66,"Text":"Say, ˹O Prophet,˺ “I have been forbidden to worship those ˹idols˺ you worship besides God, since clear proofs have come to me from my Lord. And I have been commanded to ˹fully˺ submit to the Lord of all worlds.”"},{"SurahNumber":40,"VerseNumber":67,"Text":"He is the One Who created you from dust, then from a sperm-drop, then ˹developed you into˺ a clinging clot ˹of blood˺, then He brings you forth as infants, so that you may reach your prime, and become old—though some of you ˹may˺ die sooner—reaching an appointed time, so perhaps you may understand ˹God’s power˺"},{"SurahNumber":40,"VerseNumber":68,"Text":"He is the One Who gives life and causes death. When He decrees a matter, He simply tells it, “Be!” And it is"},{"SurahNumber":40,"VerseNumber":69,"Text":"Have you not seen how those who dispute God’s signs are turned away"},{"SurahNumber":40,"VerseNumber":70,"Text":"˹They are˺ the ones who reject this Book and all ˹scriptures˺ We sent Our messengers with. So they will know ˹the consequences˺"},{"SurahNumber":40,"VerseNumber":71,"Text":"when shackles will be around their necks and chains ˹on their legs˺. They will be dragged"},{"SurahNumber":40,"VerseNumber":72,"Text":"through boiling water, then burned in the Fire ˹as fuel˺"},{"SurahNumber":40,"VerseNumber":73,"Text":"Then they will be asked, “Where are those ˹idols˺ you used to associate"},{"SurahNumber":40,"VerseNumber":74,"Text":"with God?” They will cry, “They have ˹all˺ failed us. In fact, we did not invoke anything ˹real˺ before.” This is how God leaves the disbelievers to stray"},{"SurahNumber":40,"VerseNumber":75,"Text":"˹They will be told,˺ “This ˹punishment˺ is for being prideful on earth unjustly and for acting arrogantly"},{"SurahNumber":40,"VerseNumber":76,"Text":"Enter the gates of Hell, to stay there forever. What an evil home for the arrogant!”"},{"SurahNumber":40,"VerseNumber":77,"Text":"So be patient ˹O Prophet˺. Surely God’s promise is true. Whether We show you some of what We threaten them with, or cause you to die ˹before that˺, to Us they will ˹all˺ be returned"},{"SurahNumber":40,"VerseNumber":78,"Text":"We already sent messengers before you. We have told you the stories of some of them, while others We have not. It was not for any messenger to bring a sign without God’s permission. But when God’s decree comes, judgment will be passed with fairness, and the people of falsehood will then be in ˹total˺ loss"},{"SurahNumber":40,"VerseNumber":79,"Text":"It is God Who made cattle for you so that you may ride some and eat others"},{"SurahNumber":40,"VerseNumber":80,"Text":"Also, you find in them ˹other˺ benefits. And by means of them you may reach destinations you desire. And you are carried upon ˹some of˺ them and upon ships"},{"SurahNumber":40,"VerseNumber":81,"Text":"And He shows you His signs. Now which of God’s signs will you deny"},{"SurahNumber":40,"VerseNumber":82,"Text":"Have they not travelled throughout the land to see what was the end of those who were ˹destroyed˺ before them? They were far superior in might and ˹richer in˺ monuments throughout the land, but their ˹worldly˺ gains were of no benefit to them"},{"SurahNumber":40,"VerseNumber":83,"Text":"When their messengers came to them with clear proofs, they were prideful in whatever ˹worldly˺ knowledge they had, and were ˹ultimately˺ overwhelmed by what they used to ridicule"},{"SurahNumber":40,"VerseNumber":84,"Text":"When they saw Our punishment, they cried, “˹Now˺ we believe in God alone and reject what we had been associating with Him!”"},{"SurahNumber":40,"VerseNumber":85,"Text":"But their faith was of no benefit to them when they saw Our torment. This has ˹always˺ been God’s way ˹of dealing˺ with His ˹wicked˺ servants. Then and there the disbelievers were in ˹total˺ loss"}]}]}