{"SurahNumber":60,"HasBismillah":true,"Verses":[{"SurahNumber":60,"VerseNumber":1,"Text":"يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ عَدُوِّي وَعَدُوَّكُمۡ أَوۡلِيَآءَ تُلۡقُونَ إِلَيۡهِم بِٱلۡمَوَدَّةِ وَقَدۡ كَفَرُواْ بِمَا جَآءَكُم مِّنَ ٱلۡحَقِّ يُخۡرِجُونَ ٱلرَّسُولَ وَإِيَّاكُمۡ أَن تُؤۡمِنُواْ بِٱللَّهِ رَبِّكُمۡ إِن كُنتُمۡ خَرَجۡتُمۡ جِهَٰدٗا فِي سَبِيلِي وَٱبۡتِغَآءَ مَرۡضَاتِيۚ تُسِرُّونَ إِلَيۡهِم بِٱلۡمَوَدَّةِ وَأَنَا۠ أَعۡلَمُ بِمَآ أَخۡفَيۡتُمۡ وَمَآ أَعۡلَنتُمۡۚ وَمَن يَفۡعَلۡهُ مِنكُمۡ فَقَدۡ ضَلَّ سَوَآءَ ٱلسَّبِيلِ","End":"١"},{"SurahNumber":60,"VerseNumber":2,"Text":"إِن يَثۡقَفُوكُمۡ يَكُونُواْ لَكُمۡ أَعۡدَآءٗ وَيَبۡسُطُوٓاْ إِلَيۡكُمۡ أَيۡدِيَهُمۡ وَأَلۡسِنَتَهُم بِٱلسُّوٓءِ وَوَدُّواْ لَوۡ تَكۡفُرُونَ","End":"٢"},{"SurahNumber":60,"VerseNumber":3,"Text":"لَن تَنفَعَكُمۡ أَرۡحَامُكُمۡ وَلَآ أَوۡلَٰدُكُمۡۚ يَوۡمَ ٱلۡقِيَٰمَةِ يَفۡصِلُ بَيۡنَكُمۡۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ","End":"٣"},{"SurahNumber":60,"VerseNumber":4,"Text":"قَدۡ كَانَتۡ لَكُمۡ أُسۡوَةٌ حَسَنَةٞ فِيٓ إِبۡرَٰهِيمَ وَٱلَّذِينَ مَعَهُۥٓ إِذۡ قَالُواْ لِقَوۡمِهِمۡ إِنَّا بُرَءَـٰٓؤُاْ مِنكُمۡ وَمِمَّا تَعۡبُدُونَ مِن دُونِ ٱللَّهِ كَفَرۡنَا بِكُمۡ وَبَدَا بَيۡنَنَا وَبَيۡنَكُمُ ٱلۡعَدَٰوَةُ وَٱلۡبَغۡضَآءُ أَبَدًا حَتَّىٰ تُؤۡمِنُواْ بِٱللَّهِ وَحۡدَهُۥٓ إِلَّا قَوۡلَ إِبۡرَٰهِيمَ لِأَبِيهِ لَأَسۡتَغۡفِرَنَّ لَكَ وَمَآ أَمۡلِكُ لَكَ مِنَ ٱللَّهِ مِن شَيۡءٖۖ رَّبَّنَا عَلَيۡكَ تَوَكَّلۡنَا وَإِلَيۡكَ أَنَبۡنَا وَإِلَيۡكَ ٱلۡمَصِيرُ","End":"٤"},{"SurahNumber":60,"VerseNumber":5,"Text":"رَبَّنَا لَا تَجۡعَلۡنَا فِتۡنَةٗ لِّلَّذِينَ كَفَرُواْ وَٱغۡفِرۡ لَنَا رَبَّنَآۖ إِنَّكَ أَنتَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","End":"٥"},{"SurahNumber":60,"VerseNumber":6,"Text":"لَقَدۡ كَانَ لَكُمۡ فِيهِمۡ أُسۡوَةٌ حَسَنَةٞ لِّمَن كَانَ يَرۡجُواْ ٱللَّهَ وَٱلۡيَوۡمَ ٱلۡأٓخِرَۚ وَمَن يَتَوَلَّ فَإِنَّ ٱللَّهَ هُوَ ٱلۡغَنِيُّ ٱلۡحَمِيدُ","End":"٦"},{"SurahNumber":60,"VerseNumber":7,"Text":"۞عَسَى ٱللَّهُ أَن يَجۡعَلَ بَيۡنَكُمۡ وَبَيۡنَ ٱلَّذِينَ عَادَيۡتُم مِّنۡهُم مَّوَدَّةٗۚ وَٱللَّهُ قَدِيرٞۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ","End":"٧"},{"SurahNumber":60,"VerseNumber":8,"Text":"لَّا يَنۡهَىٰكُمُ ٱللَّهُ عَنِ ٱلَّذِينَ لَمۡ يُقَٰتِلُوكُمۡ فِي ٱلدِّينِ وَلَمۡ يُخۡرِجُوكُم مِّن دِيَٰرِكُمۡ أَن تَبَرُّوهُمۡ وَتُقۡسِطُوٓاْ إِلَيۡهِمۡۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُقۡسِطِينَ","End":"٨"},{"SurahNumber":60,"VerseNumber":9,"Text":"إِنَّمَا يَنۡهَىٰكُمُ ٱللَّهُ عَنِ ٱلَّذِينَ قَٰتَلُوكُمۡ فِي ٱلدِّينِ وَأَخۡرَجُوكُم مِّن دِيَٰرِكُمۡ وَظَٰهَرُواْ عَلَىٰٓ إِخۡرَاجِكُمۡ أَن تَوَلَّوۡهُمۡۚ وَمَن يَتَوَلَّهُمۡ فَأُوْلَـٰٓئِكَ هُمُ ٱلظَّـٰلِمُونَ","End":"٩"},{"SurahNumber":60,"VerseNumber":10,"Text":"يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا جَآءَكُمُ ٱلۡمُؤۡمِنَٰتُ مُهَٰجِرَٰتٖ فَٱمۡتَحِنُوهُنَّۖ ٱللَّهُ أَعۡلَمُ بِإِيمَٰنِهِنَّۖ فَإِنۡ عَلِمۡتُمُوهُنَّ مُؤۡمِنَٰتٖ فَلَا تَرۡجِعُوهُنَّ إِلَى ٱلۡكُفَّارِۖ لَا هُنَّ حِلّٞ لَّهُمۡ وَلَا هُمۡ يَحِلُّونَ لَهُنَّۖ وَءَاتُوهُم مَّآ أَنفَقُواْۚ وَلَا جُنَاحَ عَلَيۡكُمۡ أَن تَنكِحُوهُنَّ إِذَآ ءَاتَيۡتُمُوهُنَّ أُجُورَهُنَّۚ وَلَا تُمۡسِكُواْ بِعِصَمِ ٱلۡكَوَافِرِ وَسۡـَٔلُواْ مَآ أَنفَقۡتُمۡ وَلۡيَسۡـَٔلُواْ مَآ أَنفَقُواْۚ ذَٰلِكُمۡ حُكۡمُ ٱللَّهِ يَحۡكُمُ بَيۡنَكُمۡۖ وَٱللَّهُ عَلِيمٌ حَكِيمٞ","End":"١٠"},{"SurahNumber":60,"VerseNumber":11,"Text":"وَإِن فَاتَكُمۡ شَيۡءٞ مِّنۡ أَزۡوَٰجِكُمۡ إِلَى ٱلۡكُفَّارِ فَعَاقَبۡتُمۡ فَـَٔاتُواْ ٱلَّذِينَ ذَهَبَتۡ أَزۡوَٰجُهُم مِّثۡلَ مَآ أَنفَقُواْۚ وَٱتَّقُواْ ٱللَّهَ ٱلَّذِيٓ أَنتُم بِهِۦ مُؤۡمِنُونَ","End":"١١"},{"SurahNumber":60,"VerseNumber":12,"Text":"يَـٰٓأَيُّهَا ٱلنَّبِيُّ إِذَا جَآءَكَ ٱلۡمُؤۡمِنَٰتُ يُبَايِعۡنَكَ عَلَىٰٓ أَن لَّا يُشۡرِكۡنَ بِٱللَّهِ شَيۡـٔٗا وَلَا يَسۡرِقۡنَ وَلَا يَزۡنِينَ وَلَا يَقۡتُلۡنَ أَوۡلَٰدَهُنَّ وَلَا يَأۡتِينَ بِبُهۡتَٰنٖ يَفۡتَرِينَهُۥ بَيۡنَ أَيۡدِيهِنَّ وَأَرۡجُلِهِنَّ وَلَا يَعۡصِينَكَ فِي مَعۡرُوفٖ فَبَايِعۡهُنَّ وَٱسۡتَغۡفِرۡ لَهُنَّ ٱللَّهَۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","End":"١٢"},{"SurahNumber":60,"VerseNumber":13,"Text":"يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَوَلَّوۡاْ قَوۡمًا غَضِبَ ٱللَّهُ عَلَيۡهِمۡ قَدۡ يَئِسُواْ مِنَ ٱلۡأٓخِرَةِ كَمَا يَئِسَ ٱلۡكُفَّارُ مِنۡ أَصۡحَٰبِ ٱلۡقُبُورِ","End":"١٣"}],"Translations":[{"LanguageCode":"ara","Language":"Arabic","Name":"ara-quran-la","Author":"Quran Transliteration","Source":"http://tanzil.net","Direction":"ltr","Translations":[{"SurahNumber":60,"VerseNumber":1,"Text":"Ya ayyuha allatheena amanoo la tattakhithoo AAaduwwee waAAaduwwakum awliyaa tulqoona ilayhim bialmawaddati waqad kafaroo bima jaakum mina alhaqqi yukhrijoona alrrasoola waiyyakum an tuminoo biAllahi rabbikum in kuntum kharajtum jihadan fee sabeelee waibtighaa mardatee tusirroona ilayhim bialmawaddati waana aAAlamu bima akhfaytum wama aAAlantum waman yafAAalhu minkum faqad dalla sawaa alssabeeli"},{"SurahNumber":60,"VerseNumber":2,"Text":"In yathqafookum yakoonoo lakam aAAdaan wayabsutoo ilaykum aydiyahum waalsinatahum bialssooi wawaddoo law takfuroona"},{"SurahNumber":60,"VerseNumber":3,"Text":"Lan tanfaAAakum arhamukum wala awladukum yawma alqiyamati yafsilu baynakum waAllahu bima taAAmaloona baseerun"},{"SurahNumber":60,"VerseNumber":4,"Text":"Qad kanat lakum oswatun hasanatun fee ibraheema waallatheena maAAahu ith qaloo liqawmihim inna buraao minkum wamimma taAAbudoona min dooni Allahi kafarna bikum wabada baynana wabaynakumu alAAadawatu waalbaghdao abadan hatta tuminoo biAllahi wahdahu illa qawla ibraheema liabeehi laastaghfiranna laka wama amliku laka mina Allahi min shayin rabbana AAalayka tawakkalna wailayka anabna wailayka almaseeru"},{"SurahNumber":60,"VerseNumber":5,"Text":"Rabbana la tajAAalna fitnatan lillatheena kafaroo waighfir lana rabbana innaka anta alAAazeezu alhakeemu"},{"SurahNumber":60,"VerseNumber":6,"Text":"Laqad kana lakum feehim oswatun hasanatun liman kana yarjoo Allaha waalyawma alakhira waman yatawalla fainna Allaha huwa alghanniyyu alhameedu"},{"SurahNumber":60,"VerseNumber":7,"Text":"AAasa Allahu an yajAAala baynakum wabayna allatheena AAadaytum minhum mawaddatan waAllahu qadeerun waAllahu ghafoorun raheemun"},{"SurahNumber":60,"VerseNumber":8,"Text":"La yanhakumu Allahu AAani allatheena lam yuqatilookum fee alddeeni walam yukhrijookum min diyarikum an tabarroohum watuqsitoo ilayhim inna Allaha yuhibbu almuqsiteena"},{"SurahNumber":60,"VerseNumber":9,"Text":"Innama yanhakumu Allahu AAani allatheena qatalookum fee alddeeni waakhrajookum min diyarikum wathaharoo AAala ikhrajikum an tawallawhum waman yatawallahum faolaika humu alththalimoona"},{"SurahNumber":60,"VerseNumber":10,"Text":"Ya ayyuha allatheena amanoo itha jaakumu almuminatu muhajiratin faimtahinoohunna Allahu aAAlamu bieemanihinna fain AAalimtumoohunna muminatin fala tarjiAAoohunna ila alkuffari la hunna hillun lahum wala hum yahilloona lahunna waatoohum ma anfaqoo wala junaha AAalaykum an tankihoohunna itha ataytumoohunna ojoorahunna wala tumsikoo biAAisami alkawafiri waisaloo ma anfaqtum walyasaloo ma anfaqoo thalikum hukmu Allahi yahkumu baynakum waAllahu AAaleemun hakeemun"},{"SurahNumber":60,"VerseNumber":11,"Text":"Wain fatakum shayon min azwajikum ila alkuffari faAAaqabtum faatoo allatheena thahabat azwajuhum mithla ma anfaqoo waittaqoo Allaha allathee antum bihi muminoona"},{"SurahNumber":60,"VerseNumber":12,"Text":"Ya ayyuha alnnabiyyu itha jaaka almuminatu yubayiAAnaka AAala an la yushrikna biAllahi shayan wala yasriqna wala yazneena wala yaqtulna awladahunna wala yateena bibuhtanin yaftareenahu bayna aydeehinna waarjulihinna wala yaAAseenaka fee maAAroofin fabayiAAhunna waistaghfir lahunna Allaha inna Allaha ghafoorun raheemun"},{"SurahNumber":60,"VerseNumber":13,"Text":"Ya ayyuha allatheena amanoo la tatawallaw qawman ghadiba Allahu AAalayhim qad yaisoo mina alakhirati kama yaisa alkuffaru min ashabi alquboori"}]},{"LanguageCode":"eng","Language":"English","Name":"eng-mustafakhattabg","Author":"Mustafa Khattab God Edition","Source":"","Direction":"ltr","Translations":[{"SurahNumber":60,"VerseNumber":1,"Text":"O believers! Do not take My enemies and yours as trusted allies, showing them affection even though they deny what has come to you of the truth. They drove the Messenger and yourselves out ˹of Mecca˺, simply for your belief in God, your Lord. If you ˹truly˺ emigrated to struggle in My cause and seek My pleasure, ˹then do not take them as allies,˺ disclosing secrets ˹of the believers˺ to the pagans out of affection for them, when I know best whatever you conceal and whatever you reveal. And whoever of you does this has truly strayed from the Right Way"},{"SurahNumber":60,"VerseNumber":2,"Text":"If they gain the upper hand over you, they would be your ˹open˺ enemies, unleashing their hands and tongues to harm you, and wishing that you would abandon faith"},{"SurahNumber":60,"VerseNumber":3,"Text":"Neither your relatives nor children will benefit you on Judgment Day—He will decide between you ˹all˺. For God is All-Seeing of what you do"},{"SurahNumber":60,"VerseNumber":4,"Text":"You already have an excellent example in Abraham and those with him, when they said to their people, “We totally dissociate ourselves from you and ˹shun˺ whatever ˹idols˺ you worship besides God. We reject you. The enmity and hatred that has arisen between us and you will last until you believe in God alone.” The only exception is when Abraham said to his father, “I will seek forgiveness for you,˹” adding, “but˺ I cannot protect you from God at all.” ˹The believers prayed,˺ “Our Lord! In You we trust. And to You we ˹always˺ turn. And to You is the final return"},{"SurahNumber":60,"VerseNumber":5,"Text":"Our Lord! Do not subject us to the persecution of the disbelievers. Forgive us, our Lord! You ˹alone˺ are truly the Almighty, All-Wise.”"},{"SurahNumber":60,"VerseNumber":6,"Text":"You certainly have an excellent example in them for whoever has hope in God and the Last Day. But whoever turns away, then surely God ˹alone˺ is the Self-Sufficient, Praiseworthy"},{"SurahNumber":60,"VerseNumber":7,"Text":"˹In time,˺ God may bring about goodwill between you and those of them you ˹now˺ hold as enemies. For God is Most Capable. And God is All-Forgiving, Most Merciful"},{"SurahNumber":60,"VerseNumber":8,"Text":"God does not forbid you from dealing kindly and fairly with those who have neither fought nor driven you out of your homes. Surely God loves those who are fair"},{"SurahNumber":60,"VerseNumber":9,"Text":"God only forbids you from befriending those who have fought you for ˹your˺ faith, driven you out of your homes, or supported ˹others˺ in doing so. And whoever takes them as friends, then it is they who are the ˹true˺ wrongdoers"},{"SurahNumber":60,"VerseNumber":10,"Text":"O believers! When the believing women come to you as emigrants, test their intentions—their faith is best known to God—and if you find them to be believers, then do not send them back to the disbelievers. These ˹women˺ are not lawful ˹wives˺ for the disbelievers, nor are the disbelievers lawful ˹husbands˺ for them. ˹But˺ repay the disbelievers whatever ˹dowries˺ they had paid. And there is no blame on you if you marry these ˹women˺ as long as you pay them their dowries. And do not hold on to marriage with polytheistic women. ˹But˺ demand ˹repayment of˺ whatever ˹dowries˺ you had paid, and let the disbelievers do the same. That is the judgment of God—He judges between you. And God is All-Knowing, All-Wise"},{"SurahNumber":60,"VerseNumber":11,"Text":"And if any of your wives desert you to the disbelievers, and later you take spoils from them, then pay those whose wives have gone, the equivalent of whatever ˹dowry˺ they had paid. And be mindful of God, in Whom you believe"},{"SurahNumber":60,"VerseNumber":12,"Text":"O Prophet! When the believing women come to you, pledging to you that they will neither associate anything with God ˹in worship˺, nor steal, nor fornicate, nor kill their children, nor falsely attribute ˹illegitimate˺ children to their husbands, nor disobey you in what is right, then accept their pledge, and ask God to forgive them. Surely God is All-Forgiving, Most Merciful"},{"SurahNumber":60,"VerseNumber":13,"Text":"O believers! Do not ally yourselves with a people God is displeased with. They already have no hope for the Hereafter, just like the disbelievers lying in ˹their˺ graves"}]}]}