{"SurahNumber":8,"HasBismillah":true,"Verses":[{"SurahNumber":8,"VerseNumber":1,"Text":"يَسۡـَٔلُونَكَ عَنِ ٱلۡأَنفَالِۖ قُلِ ٱلۡأَنفَالُ لِلَّهِ وَٱلرَّسُولِۖ فَٱتَّقُواْ ٱللَّهَ وَأَصۡلِحُواْ ذَاتَ بَيۡنِكُمۡۖ وَأَطِيعُواْ ٱللَّهَ وَرَسُولَهُۥٓ إِن كُنتُم مُّؤۡمِنِينَ","End":"١"},{"SurahNumber":8,"VerseNumber":2,"Text":"إِنَّمَا ٱلۡمُؤۡمِنُونَ ٱلَّذِينَ إِذَا ذُكِرَ ٱللَّهُ وَجِلَتۡ قُلُوبُهُمۡ وَإِذَا تُلِيَتۡ عَلَيۡهِمۡ ءَايَٰتُهُۥ زَادَتۡهُمۡ إِيمَٰنٗا وَعَلَىٰ رَبِّهِمۡ يَتَوَكَّلُونَ","End":"٢"},{"SurahNumber":8,"VerseNumber":3,"Text":"ٱلَّذِينَ يُقِيمُونَ ٱلصَّلَوٰةَ وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ","End":"٣"},{"SurahNumber":8,"VerseNumber":4,"Text":"أُوْلَـٰٓئِكَ هُمُ ٱلۡمُؤۡمِنُونَ حَقّٗاۚ لَّهُمۡ دَرَجَٰتٌ عِندَ رَبِّهِمۡ وَمَغۡفِرَةٞ وَرِزۡقٞ كَرِيمٞ","End":"٤"},{"SurahNumber":8,"VerseNumber":5,"Text":"كَمَآ أَخۡرَجَكَ رَبُّكَ مِنۢ بَيۡتِكَ بِٱلۡحَقِّ وَإِنَّ فَرِيقٗا مِّنَ ٱلۡمُؤۡمِنِينَ لَكَٰرِهُونَ","End":"٥"},{"SurahNumber":8,"VerseNumber":6,"Text":"يُجَٰدِلُونَكَ فِي ٱلۡحَقِّ بَعۡدَ مَا تَبَيَّنَ كَأَنَّمَا يُسَاقُونَ إِلَى ٱلۡمَوۡتِ وَهُمۡ يَنظُرُونَ","End":"٦"},{"SurahNumber":8,"VerseNumber":7,"Text":"وَإِذۡ يَعِدُكُمُ ٱللَّهُ إِحۡدَى ٱلطَّآئِفَتَيۡنِ أَنَّهَا لَكُمۡ وَتَوَدُّونَ أَنَّ غَيۡرَ ذَاتِ ٱلشَّوۡكَةِ تَكُونُ لَكُمۡ وَيُرِيدُ ٱللَّهُ أَن يُحِقَّ ٱلۡحَقَّ بِكَلِمَٰتِهِۦ وَيَقۡطَعَ دَابِرَ ٱلۡكَٰفِرِينَ","End":"٧"},{"SurahNumber":8,"VerseNumber":8,"Text":"لِيُحِقَّ ٱلۡحَقَّ وَيُبۡطِلَ ٱلۡبَٰطِلَ وَلَوۡ كَرِهَ ٱلۡمُجۡرِمُونَ","End":"٨"},{"SurahNumber":8,"VerseNumber":9,"Text":"إِذۡ تَسۡتَغِيثُونَ رَبَّكُمۡ فَٱسۡتَجَابَ لَكُمۡ أَنِّي مُمِدُّكُم بِأَلۡفٖ مِّنَ ٱلۡمَلَـٰٓئِكَةِ مُرۡدِفِينَ","End":"٩"},{"SurahNumber":8,"VerseNumber":10,"Text":"وَمَا جَعَلَهُ ٱللَّهُ إِلَّا بُشۡرَىٰ وَلِتَطۡمَئِنَّ بِهِۦ قُلُوبُكُمۡۚ وَمَا ٱلنَّصۡرُ إِلَّا مِنۡ عِندِ ٱللَّهِۚ إِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٌ","End":"١٠"},{"SurahNumber":8,"VerseNumber":11,"Text":"إِذۡ يُغَشِّيكُمُ ٱلنُّعَاسَ أَمَنَةٗ مِّنۡهُ وَيُنَزِّلُ عَلَيۡكُم مِّنَ ٱلسَّمَآءِ مَآءٗ لِّيُطَهِّرَكُم بِهِۦ وَيُذۡهِبَ عَنكُمۡ رِجۡزَ ٱلشَّيۡطَٰنِ وَلِيَرۡبِطَ عَلَىٰ قُلُوبِكُمۡ وَيُثَبِّتَ بِهِ ٱلۡأَقۡدَامَ","End":"١١"},{"SurahNumber":8,"VerseNumber":12,"Text":"إِذۡ يُوحِي رَبُّكَ إِلَى ٱلۡمَلَـٰٓئِكَةِ أَنِّي مَعَكُمۡ فَثَبِّتُواْ ٱلَّذِينَ ءَامَنُواْۚ سَأُلۡقِي فِي قُلُوبِ ٱلَّذِينَ كَفَرُواْ ٱلرُّعۡبَ فَٱضۡرِبُواْ فَوۡقَ ٱلۡأَعۡنَاقِ وَٱضۡرِبُواْ مِنۡهُمۡ كُلَّ بَنَانٖ","End":"١٢"},{"SurahNumber":8,"VerseNumber":13,"Text":"ذَٰلِكَ بِأَنَّهُمۡ شَآقُّواْ ٱللَّهَ وَرَسُولَهُۥۚ وَمَن يُشَاقِقِ ٱللَّهَ وَرَسُولَهُۥ فَإِنَّ ٱللَّهَ شَدِيدُ ٱلۡعِقَابِ","End":"١٣"},{"SurahNumber":8,"VerseNumber":14,"Text":"ذَٰلِكُمۡ فَذُوقُوهُ وَأَنَّ لِلۡكَٰفِرِينَ عَذَابَ ٱلنَّارِ","End":"١٤"},{"SurahNumber":8,"VerseNumber":15,"Text":"يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا لَقِيتُمُ ٱلَّذِينَ كَفَرُواْ زَحۡفٗا فَلَا تُوَلُّوهُمُ ٱلۡأَدۡبَارَ","End":"١٥"},{"SurahNumber":8,"VerseNumber":16,"Text":"وَمَن يُوَلِّهِمۡ يَوۡمَئِذٖ دُبُرَهُۥٓ إِلَّا مُتَحَرِّفٗا لِّقِتَالٍ أَوۡ مُتَحَيِّزًا إِلَىٰ فِئَةٖ فَقَدۡ بَآءَ بِغَضَبٖ مِّنَ ٱللَّهِ وَمَأۡوَىٰهُ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمَصِيرُ","End":"١٦"},{"SurahNumber":8,"VerseNumber":17,"Text":"فَلَمۡ تَقۡتُلُوهُمۡ وَلَٰكِنَّ ٱللَّهَ قَتَلَهُمۡۚ وَمَا رَمَيۡتَ إِذۡ رَمَيۡتَ وَلَٰكِنَّ ٱللَّهَ رَمَىٰ وَلِيُبۡلِيَ ٱلۡمُؤۡمِنِينَ مِنۡهُ بَلَآءً حَسَنًاۚ إِنَّ ٱللَّهَ سَمِيعٌ عَلِيمٞ","End":"١٧"},{"SurahNumber":8,"VerseNumber":18,"Text":"ذَٰلِكُمۡ وَأَنَّ ٱللَّهَ مُوهِنُ كَيۡدِ ٱلۡكَٰفِرِينَ","End":"١٨"},{"SurahNumber":8,"VerseNumber":19,"Text":"إِن تَسۡتَفۡتِحُواْ فَقَدۡ جَآءَكُمُ ٱلۡفَتۡحُۖ وَإِن تَنتَهُواْ فَهُوَ خَيۡرٞ لَّكُمۡۖ وَإِن تَعُودُواْ نَعُدۡ وَلَن تُغۡنِيَ عَنكُمۡ فِئَتُكُمۡ شَيۡـٔٗا وَلَوۡ كَثُرَتۡ وَأَنَّ ٱللَّهَ مَعَ ٱلۡمُؤۡمِنِينَ","End":"١٩"},{"SurahNumber":8,"VerseNumber":20,"Text":"يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ أَطِيعُواْ ٱللَّهَ وَرَسُولَهُۥ وَلَا تَوَلَّوۡاْ عَنۡهُ وَأَنتُمۡ تَسۡمَعُونَ","End":"٢٠"},{"SurahNumber":8,"VerseNumber":21,"Text":"وَلَا تَكُونُواْ كَٱلَّذِينَ قَالُواْ سَمِعۡنَا وَهُمۡ لَا يَسۡمَعُونَ","End":"٢١"},{"SurahNumber":8,"VerseNumber":22,"Text":"۞إِنَّ شَرَّ ٱلدَّوَآبِّ عِندَ ٱللَّهِ ٱلصُّمُّ ٱلۡبُكۡمُ ٱلَّذِينَ لَا يَعۡقِلُونَ","End":"٢٢"},{"SurahNumber":8,"VerseNumber":23,"Text":"وَلَوۡ عَلِمَ ٱللَّهُ فِيهِمۡ خَيۡرٗا لَّأَسۡمَعَهُمۡۖ وَلَوۡ أَسۡمَعَهُمۡ لَتَوَلَّواْ وَّهُم مُّعۡرِضُونَ","End":"٢٣"},{"SurahNumber":8,"VerseNumber":24,"Text":"يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱسۡتَجِيبُواْ لِلَّهِ وَلِلرَّسُولِ إِذَا دَعَاكُمۡ لِمَا يُحۡيِيكُمۡۖ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ يَحُولُ بَيۡنَ ٱلۡمَرۡءِ وَقَلۡبِهِۦ وَأَنَّهُۥٓ إِلَيۡهِ تُحۡشَرُونَ","End":"٢٤"},{"SurahNumber":8,"VerseNumber":25,"Text":"وَٱتَّقُواْ فِتۡنَةٗ لَّا تُصِيبَنَّ ٱلَّذِينَ ظَلَمُواْ مِنكُمۡ خَآصَّةٗۖ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ شَدِيدُ ٱلۡعِقَابِ","End":"٢٥"},{"SurahNumber":8,"VerseNumber":26,"Text":"وَٱذۡكُرُوٓاْ إِذۡ أَنتُمۡ قَلِيلٞ مُّسۡتَضۡعَفُونَ فِي ٱلۡأَرۡضِ تَخَافُونَ أَن يَتَخَطَّفَكُمُ ٱلنَّاسُ فَـَٔاوَىٰكُمۡ وَأَيَّدَكُم بِنَصۡرِهِۦ وَرَزَقَكُم مِّنَ ٱلطَّيِّبَٰتِ لَعَلَّكُمۡ تَشۡكُرُونَ","End":"٢٦"},{"SurahNumber":8,"VerseNumber":27,"Text":"يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَخُونُواْ ٱللَّهَ وَٱلرَّسُولَ وَتَخُونُوٓاْ أَمَٰنَٰتِكُمۡ وَأَنتُمۡ تَعۡلَمُونَ","End":"٢٧"},{"SurahNumber":8,"VerseNumber":28,"Text":"وَٱعۡلَمُوٓاْ أَنَّمَآ أَمۡوَٰلُكُمۡ وَأَوۡلَٰدُكُمۡ فِتۡنَةٞ وَأَنَّ ٱللَّهَ عِندَهُۥٓ أَجۡرٌ عَظِيمٞ","End":"٢٨"},{"SurahNumber":8,"VerseNumber":29,"Text":"يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِن تَتَّقُواْ ٱللَّهَ يَجۡعَل لَّكُمۡ فُرۡقَانٗا وَيُكَفِّرۡ عَنكُمۡ سَيِّـَٔاتِكُمۡ وَيَغۡفِرۡ لَكُمۡۗ وَٱللَّهُ ذُو ٱلۡفَضۡلِ ٱلۡعَظِيمِ","End":"٢٩"},{"SurahNumber":8,"VerseNumber":30,"Text":"وَإِذۡ يَمۡكُرُ بِكَ ٱلَّذِينَ كَفَرُواْ لِيُثۡبِتُوكَ أَوۡ يَقۡتُلُوكَ أَوۡ يُخۡرِجُوكَۚ وَيَمۡكُرُونَ وَيَمۡكُرُ ٱللَّهُۖ وَٱللَّهُ خَيۡرُ ٱلۡمَٰكِرِينَ","End":"٣٠"},{"SurahNumber":8,"VerseNumber":31,"Text":"وَإِذَا تُتۡلَىٰ عَلَيۡهِمۡ ءَايَٰتُنَا قَالُواْ قَدۡ سَمِعۡنَا لَوۡ نَشَآءُ لَقُلۡنَا مِثۡلَ هَٰذَآ إِنۡ هَٰذَآ إِلَّآ أَسَٰطِيرُ ٱلۡأَوَّلِينَ","End":"٣١"},{"SurahNumber":8,"VerseNumber":32,"Text":"وَإِذۡ قَالُواْ ٱللَّهُمَّ إِن كَانَ هَٰذَا هُوَ ٱلۡحَقَّ مِنۡ عِندِكَ فَأَمۡطِرۡ عَلَيۡنَا حِجَارَةٗ مِّنَ ٱلسَّمَآءِ أَوِ ٱئۡتِنَا بِعَذَابٍ أَلِيمٖ","End":"٣٢"},{"SurahNumber":8,"VerseNumber":33,"Text":"وَمَا كَانَ ٱللَّهُ لِيُعَذِّبَهُمۡ وَأَنتَ فِيهِمۡۚ وَمَا كَانَ ٱللَّهُ مُعَذِّبَهُمۡ وَهُمۡ يَسۡتَغۡفِرُونَ","End":"٣٣"},{"SurahNumber":8,"VerseNumber":34,"Text":"وَمَا لَهُمۡ أَلَّا يُعَذِّبَهُمُ ٱللَّهُ وَهُمۡ يَصُدُّونَ عَنِ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ وَمَا كَانُوٓاْ أَوۡلِيَآءَهُۥٓۚ إِنۡ أَوۡلِيَآؤُهُۥٓ إِلَّا ٱلۡمُتَّقُونَ وَلَٰكِنَّ أَكۡثَرَهُمۡ لَا يَعۡلَمُونَ","End":"٣٤"},{"SurahNumber":8,"VerseNumber":35,"Text":"وَمَا كَانَ صَلَاتُهُمۡ عِندَ ٱلۡبَيۡتِ إِلَّا مُكَآءٗ وَتَصۡدِيَةٗۚ فَذُوقُواْ ٱلۡعَذَابَ بِمَا كُنتُمۡ تَكۡفُرُونَ","End":"٣٥"},{"SurahNumber":8,"VerseNumber":36,"Text":"إِنَّ ٱلَّذِينَ كَفَرُواْ يُنفِقُونَ أَمۡوَٰلَهُمۡ لِيَصُدُّواْ عَن سَبِيلِ ٱللَّهِۚ فَسَيُنفِقُونَهَا ثُمَّ تَكُونُ عَلَيۡهِمۡ حَسۡرَةٗ ثُمَّ يُغۡلَبُونَۗ وَٱلَّذِينَ كَفَرُوٓاْ إِلَىٰ جَهَنَّمَ يُحۡشَرُونَ","End":"٣٦"},{"SurahNumber":8,"VerseNumber":37,"Text":"لِيَمِيزَ ٱللَّهُ ٱلۡخَبِيثَ مِنَ ٱلطَّيِّبِ وَيَجۡعَلَ ٱلۡخَبِيثَ بَعۡضَهُۥ عَلَىٰ بَعۡضٖ فَيَرۡكُمَهُۥ جَمِيعٗا فَيَجۡعَلَهُۥ فِي جَهَنَّمَۚ أُوْلَـٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ","End":"٣٧"},{"SurahNumber":8,"VerseNumber":38,"Text":"قُل لِّلَّذِينَ كَفَرُوٓاْ إِن يَنتَهُواْ يُغۡفَرۡ لَهُم مَّا قَدۡ سَلَفَ وَإِن يَعُودُواْ فَقَدۡ مَضَتۡ سُنَّتُ ٱلۡأَوَّلِينَ","End":"٣٨"},{"SurahNumber":8,"VerseNumber":39,"Text":"وَقَٰتِلُوهُمۡ حَتَّىٰ لَا تَكُونَ فِتۡنَةٞ وَيَكُونَ ٱلدِّينُ كُلُّهُۥ لِلَّهِۚ فَإِنِ ٱنتَهَوۡاْ فَإِنَّ ٱللَّهَ بِمَا يَعۡمَلُونَ بَصِيرٞ","End":"٣٩"},{"SurahNumber":8,"VerseNumber":40,"Text":"وَإِن تَوَلَّوۡاْ فَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ مَوۡلَىٰكُمۡۚ نِعۡمَ ٱلۡمَوۡلَىٰ وَنِعۡمَ ٱلنَّصِيرُ","End":"٤٠"},{"SurahNumber":8,"VerseNumber":41,"Text":"۞وَٱعۡلَمُوٓاْ أَنَّمَا غَنِمۡتُم مِّن شَيۡءٖ فَأَنَّ لِلَّهِ خُمُسَهُۥ وَلِلرَّسُولِ وَلِذِي ٱلۡقُرۡبَىٰ وَٱلۡيَتَٰمَىٰ وَٱلۡمَسَٰكِينِ وَٱبۡنِ ٱلسَّبِيلِ إِن كُنتُمۡ ءَامَنتُم بِٱللَّهِ وَمَآ أَنزَلۡنَا عَلَىٰ عَبۡدِنَا يَوۡمَ ٱلۡفُرۡقَانِ يَوۡمَ ٱلۡتَقَى ٱلۡجَمۡعَانِۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ","End":"٤١"},{"SurahNumber":8,"VerseNumber":42,"Text":"إِذۡ أَنتُم بِٱلۡعُدۡوَةِ ٱلدُّنۡيَا وَهُم بِٱلۡعُدۡوَةِ ٱلۡقُصۡوَىٰ وَٱلرَّكۡبُ أَسۡفَلَ مِنكُمۡۚ وَلَوۡ تَوَاعَدتُّمۡ لَٱخۡتَلَفۡتُمۡ فِي ٱلۡمِيعَٰدِ وَلَٰكِن لِّيَقۡضِيَ ٱللَّهُ أَمۡرٗا كَانَ مَفۡعُولٗا لِّيَهۡلِكَ مَنۡ هَلَكَ عَنۢ بَيِّنَةٖ وَيَحۡيَىٰ مَنۡ حَيَّ عَنۢ بَيِّنَةٖۗ وَإِنَّ ٱللَّهَ لَسَمِيعٌ عَلِيمٌ","End":"٤٢"},{"SurahNumber":8,"VerseNumber":43,"Text":"إِذۡ يُرِيكَهُمُ ٱللَّهُ فِي مَنَامِكَ قَلِيلٗاۖ وَلَوۡ أَرَىٰكَهُمۡ كَثِيرٗا لَّفَشِلۡتُمۡ وَلَتَنَٰزَعۡتُمۡ فِي ٱلۡأَمۡرِ وَلَٰكِنَّ ٱللَّهَ سَلَّمَۚ إِنَّهُۥ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ","End":"٤٣"},{"SurahNumber":8,"VerseNumber":44,"Text":"وَإِذۡ يُرِيكُمُوهُمۡ إِذِ ٱلۡتَقَيۡتُمۡ فِيٓ أَعۡيُنِكُمۡ قَلِيلٗا وَيُقَلِّلُكُمۡ فِيٓ أَعۡيُنِهِمۡ لِيَقۡضِيَ ٱللَّهُ أَمۡرٗا كَانَ مَفۡعُولٗاۗ وَإِلَى ٱللَّهِ تُرۡجَعُ ٱلۡأُمُورُ","End":"٤٤"},{"SurahNumber":8,"VerseNumber":45,"Text":"يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا لَقِيتُمۡ فِئَةٗ فَٱثۡبُتُواْ وَٱذۡكُرُواْ ٱللَّهَ كَثِيرٗا لَّعَلَّكُمۡ تُفۡلِحُونَ","End":"٤٥"},{"SurahNumber":8,"VerseNumber":46,"Text":"وَأَطِيعُواْ ٱللَّهَ وَرَسُولَهُۥ وَلَا تَنَٰزَعُواْ فَتَفۡشَلُواْ وَتَذۡهَبَ رِيحُكُمۡۖ وَٱصۡبِرُوٓاْۚ إِنَّ ٱللَّهَ مَعَ ٱلصَّـٰبِرِينَ","End":"٤٦"},{"SurahNumber":8,"VerseNumber":47,"Text":"وَلَا تَكُونُواْ كَٱلَّذِينَ خَرَجُواْ مِن دِيَٰرِهِم بَطَرٗا وَرِئَآءَ ٱلنَّاسِ وَيَصُدُّونَ عَن سَبِيلِ ٱللَّهِۚ وَٱللَّهُ بِمَا يَعۡمَلُونَ مُحِيطٞ","End":"٤٧"},{"SurahNumber":8,"VerseNumber":48,"Text":"وَإِذۡ زَيَّنَ لَهُمُ ٱلشَّيۡطَٰنُ أَعۡمَٰلَهُمۡ وَقَالَ لَا غَالِبَ لَكُمُ ٱلۡيَوۡمَ مِنَ ٱلنَّاسِ وَإِنِّي جَارٞ لَّكُمۡۖ فَلَمَّا تَرَآءَتِ ٱلۡفِئَتَانِ نَكَصَ عَلَىٰ عَقِبَيۡهِ وَقَالَ إِنِّي بَرِيٓءٞ مِّنكُمۡ إِنِّيٓ أَرَىٰ مَا لَا تَرَوۡنَ إِنِّيٓ أَخَافُ ٱللَّهَۚ وَٱللَّهُ شَدِيدُ ٱلۡعِقَابِ","End":"٤٨"},{"SurahNumber":8,"VerseNumber":49,"Text":"إِذۡ يَقُولُ ٱلۡمُنَٰفِقُونَ وَٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٌ غَرَّ هَـٰٓؤُلَآءِ دِينُهُمۡۗ وَمَن يَتَوَكَّلۡ عَلَى ٱللَّهِ فَإِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٞ","End":"٤٩"},{"SurahNumber":8,"VerseNumber":50,"Text":"وَلَوۡ تَرَىٰٓ إِذۡ يَتَوَفَّى ٱلَّذِينَ كَفَرُواْ ٱلۡمَلَـٰٓئِكَةُ يَضۡرِبُونَ وُجُوهَهُمۡ وَأَدۡبَٰرَهُمۡ وَذُوقُواْ عَذَابَ ٱلۡحَرِيقِ","End":"٥٠"},{"SurahNumber":8,"VerseNumber":51,"Text":"ذَٰلِكَ بِمَا قَدَّمَتۡ أَيۡدِيكُمۡ وَأَنَّ ٱللَّهَ لَيۡسَ بِظَلَّـٰمٖ لِّلۡعَبِيدِ","End":"٥١"},{"SurahNumber":8,"VerseNumber":52,"Text":"كَدَأۡبِ ءَالِ فِرۡعَوۡنَ وَٱلَّذِينَ مِن قَبۡلِهِمۡۚ كَفَرُواْ بِـَٔايَٰتِ ٱللَّهِ فَأَخَذَهُمُ ٱللَّهُ بِذُنُوبِهِمۡۚ إِنَّ ٱللَّهَ قَوِيّٞ شَدِيدُ ٱلۡعِقَابِ","End":"٥٢"},{"SurahNumber":8,"VerseNumber":53,"Text":"ذَٰلِكَ بِأَنَّ ٱللَّهَ لَمۡ يَكُ مُغَيِّرٗا نِّعۡمَةً أَنۡعَمَهَا عَلَىٰ قَوۡمٍ حَتَّىٰ يُغَيِّرُواْ مَا بِأَنفُسِهِمۡ وَأَنَّ ٱللَّهَ سَمِيعٌ عَلِيمٞ","End":"٥٣"},{"SurahNumber":8,"VerseNumber":54,"Text":"كَدَأۡبِ ءَالِ فِرۡعَوۡنَ وَٱلَّذِينَ مِن قَبۡلِهِمۡۚ كَذَّبُواْ بِـَٔايَٰتِ رَبِّهِمۡ فَأَهۡلَكۡنَٰهُم بِذُنُوبِهِمۡ وَأَغۡرَقۡنَآ ءَالَ فِرۡعَوۡنَۚ وَكُلّٞ كَانُواْ ظَٰلِمِينَ","End":"٥٤"},{"SurahNumber":8,"VerseNumber":55,"Text":"إِنَّ شَرَّ ٱلدَّوَآبِّ عِندَ ٱللَّهِ ٱلَّذِينَ كَفَرُواْ فَهُمۡ لَا يُؤۡمِنُونَ","End":"٥٥"},{"SurahNumber":8,"VerseNumber":56,"Text":"ٱلَّذِينَ عَٰهَدتَّ مِنۡهُمۡ ثُمَّ يَنقُضُونَ عَهۡدَهُمۡ فِي كُلِّ مَرَّةٖ وَهُمۡ لَا يَتَّقُونَ","End":"٥٦"},{"SurahNumber":8,"VerseNumber":57,"Text":"فَإِمَّا تَثۡقَفَنَّهُمۡ فِي ٱلۡحَرۡبِ فَشَرِّدۡ بِهِم مَّنۡ خَلۡفَهُمۡ لَعَلَّهُمۡ يَذَّكَّرُونَ","End":"٥٧"},{"SurahNumber":8,"VerseNumber":58,"Text":"وَإِمَّا تَخَافَنَّ مِن قَوۡمٍ خِيَانَةٗ فَٱنۢبِذۡ إِلَيۡهِمۡ عَلَىٰ سَوَآءٍۚ إِنَّ ٱللَّهَ لَا يُحِبُّ ٱلۡخَآئِنِينَ","End":"٥٨"},{"SurahNumber":8,"VerseNumber":59,"Text":"وَلَا يَحۡسَبَنَّ ٱلَّذِينَ كَفَرُواْ سَبَقُوٓاْۚ إِنَّهُمۡ لَا يُعۡجِزُونَ","End":"٥٩"},{"SurahNumber":8,"VerseNumber":60,"Text":"وَأَعِدُّواْ لَهُم مَّا ٱسۡتَطَعۡتُم مِّن قُوَّةٖ وَمِن رِّبَاطِ ٱلۡخَيۡلِ تُرۡهِبُونَ بِهِۦ عَدُوَّ ٱللَّهِ وَعَدُوَّكُمۡ وَءَاخَرِينَ مِن دُونِهِمۡ لَا تَعۡلَمُونَهُمُ ٱللَّهُ يَعۡلَمُهُمۡۚ وَمَا تُنفِقُواْ مِن شَيۡءٖ فِي سَبِيلِ ٱللَّهِ يُوَفَّ إِلَيۡكُمۡ وَأَنتُمۡ لَا تُظۡلَمُونَ","End":"٦٠"},{"SurahNumber":8,"VerseNumber":61,"Text":"۞وَإِن جَنَحُواْ لِلسَّلۡمِ فَٱجۡنَحۡ لَهَا وَتَوَكَّلۡ عَلَى ٱللَّهِۚ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ","End":"٦١"},{"SurahNumber":8,"VerseNumber":62,"Text":"وَإِن يُرِيدُوٓاْ أَن يَخۡدَعُوكَ فَإِنَّ حَسۡبَكَ ٱللَّهُۚ هُوَ ٱلَّذِيٓ أَيَّدَكَ بِنَصۡرِهِۦ وَبِٱلۡمُؤۡمِنِينَ","End":"٦٢"},{"SurahNumber":8,"VerseNumber":63,"Text":"وَأَلَّفَ بَيۡنَ قُلُوبِهِمۡۚ لَوۡ أَنفَقۡتَ مَا فِي ٱلۡأَرۡضِ جَمِيعٗا مَّآ أَلَّفۡتَ بَيۡنَ قُلُوبِهِمۡ وَلَٰكِنَّ ٱللَّهَ أَلَّفَ بَيۡنَهُمۡۚ إِنَّهُۥ عَزِيزٌ حَكِيمٞ","End":"٦٣"},{"SurahNumber":8,"VerseNumber":64,"Text":"يَـٰٓأَيُّهَا ٱلنَّبِيُّ حَسۡبُكَ ٱللَّهُ وَمَنِ ٱتَّبَعَكَ مِنَ ٱلۡمُؤۡمِنِينَ","End":"٦٤"},{"SurahNumber":8,"VerseNumber":65,"Text":"يَـٰٓأَيُّهَا ٱلنَّبِيُّ حَرِّضِ ٱلۡمُؤۡمِنِينَ عَلَى ٱلۡقِتَالِۚ إِن يَكُن مِّنكُمۡ عِشۡرُونَ صَٰبِرُونَ يَغۡلِبُواْ مِاْئَتَيۡنِۚ وَإِن يَكُن مِّنكُم مِّاْئَةٞ يَغۡلِبُوٓاْ أَلۡفٗا مِّنَ ٱلَّذِينَ كَفَرُواْ بِأَنَّهُمۡ قَوۡمٞ لَّا يَفۡقَهُونَ","End":"٦٥"},{"SurahNumber":8,"VerseNumber":66,"Text":"ٱلۡـَٰٔنَ خَفَّفَ ٱللَّهُ عَنكُمۡ وَعَلِمَ أَنَّ فِيكُمۡ ضَعۡفٗاۚ فَإِن يَكُن مِّنكُم مِّاْئَةٞ صَابِرَةٞ يَغۡلِبُواْ مِاْئَتَيۡنِۚ وَإِن يَكُن مِّنكُمۡ أَلۡفٞ يَغۡلِبُوٓاْ أَلۡفَيۡنِ بِإِذۡنِ ٱللَّهِۗ وَٱللَّهُ مَعَ ٱلصَّـٰبِرِينَ","End":"٦٦"},{"SurahNumber":8,"VerseNumber":67,"Text":"مَا كَانَ لِنَبِيٍّ أَن يَكُونَ لَهُۥٓ أَسۡرَىٰ حَتَّىٰ يُثۡخِنَ فِي ٱلۡأَرۡضِۚ تُرِيدُونَ عَرَضَ ٱلدُّنۡيَا وَٱللَّهُ يُرِيدُ ٱلۡأٓخِرَةَۗ وَٱللَّهُ عَزِيزٌ حَكِيمٞ","End":"٦٧"},{"SurahNumber":8,"VerseNumber":68,"Text":"لَّوۡلَا كِتَٰبٞ مِّنَ ٱللَّهِ سَبَقَ لَمَسَّكُمۡ فِيمَآ أَخَذۡتُمۡ عَذَابٌ عَظِيمٞ","End":"٦٨"},{"SurahNumber":8,"VerseNumber":69,"Text":"فَكُلُواْ مِمَّا غَنِمۡتُمۡ حَلَٰلٗا طَيِّبٗاۚ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","End":"٦٩"},{"SurahNumber":8,"VerseNumber":70,"Text":"يَـٰٓأَيُّهَا ٱلنَّبِيُّ قُل لِّمَن فِيٓ أَيۡدِيكُم مِّنَ ٱلۡأَسۡرَىٰٓ إِن يَعۡلَمِ ٱللَّهُ فِي قُلُوبِكُمۡ خَيۡرٗا يُؤۡتِكُمۡ خَيۡرٗا مِّمَّآ أُخِذَ مِنكُمۡ وَيَغۡفِرۡ لَكُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ","End":"٧٠"},{"SurahNumber":8,"VerseNumber":71,"Text":"وَإِن يُرِيدُواْ خِيَانَتَكَ فَقَدۡ خَانُواْ ٱللَّهَ مِن قَبۡلُ فَأَمۡكَنَ مِنۡهُمۡۗ وَٱللَّهُ عَلِيمٌ حَكِيمٌ","End":"٧١"},{"SurahNumber":8,"VerseNumber":72,"Text":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَهَاجَرُواْ وَجَٰهَدُواْ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡ فِي سَبِيلِ ٱللَّهِ وَٱلَّذِينَ ءَاوَواْ وَّنَصَرُوٓاْ أُوْلَـٰٓئِكَ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٖۚ وَٱلَّذِينَ ءَامَنُواْ وَلَمۡ يُهَاجِرُواْ مَا لَكُم مِّن وَلَٰيَتِهِم مِّن شَيۡءٍ حَتَّىٰ يُهَاجِرُواْۚ وَإِنِ ٱسۡتَنصَرُوكُمۡ فِي ٱلدِّينِ فَعَلَيۡكُمُ ٱلنَّصۡرُ إِلَّا عَلَىٰ قَوۡمِۭ بَيۡنَكُمۡ وَبَيۡنَهُم مِّيثَٰقٞۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ","End":"٧٢"},{"SurahNumber":8,"VerseNumber":73,"Text":"وَٱلَّذِينَ كَفَرُواْ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٍۚ إِلَّا تَفۡعَلُوهُ تَكُن فِتۡنَةٞ فِي ٱلۡأَرۡضِ وَفَسَادٞ كَبِيرٞ","End":"٧٣"},{"SurahNumber":8,"VerseNumber":74,"Text":"وَٱلَّذِينَ ءَامَنُواْ وَهَاجَرُواْ وَجَٰهَدُواْ فِي سَبِيلِ ٱللَّهِ وَٱلَّذِينَ ءَاوَواْ وَّنَصَرُوٓاْ أُوْلَـٰٓئِكَ هُمُ ٱلۡمُؤۡمِنُونَ حَقّٗاۚ لَّهُم مَّغۡفِرَةٞ وَرِزۡقٞ كَرِيمٞ","End":"٧٤"},{"SurahNumber":8,"VerseNumber":75,"Text":"وَٱلَّذِينَ ءَامَنُواْ مِنۢ بَعۡدُ وَهَاجَرُواْ وَجَٰهَدُواْ مَعَكُمۡ فَأُوْلَـٰٓئِكَ مِنكُمۡۚ وَأُوْلُواْ ٱلۡأَرۡحَامِ بَعۡضُهُمۡ أَوۡلَىٰ بِبَعۡضٖ فِي كِتَٰبِ ٱللَّهِۚ إِنَّ ٱللَّهَ بِكُلِّ شَيۡءٍ عَلِيمُۢ","End":"٧٥"}],"Translations":[{"LanguageCode":"ara","Language":"Arabic","Name":"ara-quran-la","Author":"Quran Transliteration","Source":"http://tanzil.net","Direction":"ltr","Translations":[{"SurahNumber":8,"VerseNumber":1,"Text":"Yasaloonaka AAani alanfali quli alanfalu lillahi waalrrasooli faittaqoo Allaha waaslihoo thata baynikum waateeAAoo Allaha warasoolahu in kuntum mumineena"},{"SurahNumber":8,"VerseNumber":2,"Text":"Innama almuminoona allatheena itha thukira Allahu wajilat quloobuhum waitha tuliyat AAalayhim ayatuhu zadathum eemanan waAAala rabbihim yatawakkaloona"},{"SurahNumber":8,"VerseNumber":3,"Text":"Allatheena yuqeemoona alssalata wamimma razaqnahum yunfiqoona"},{"SurahNumber":8,"VerseNumber":4,"Text":"Olaika humu almuminoona haqqan lahum darajatun AAinda rabbihim wamaghfiratun warizqun kareemun"},{"SurahNumber":8,"VerseNumber":5,"Text":"Kama akhrajaka rabbuka min baytika bialhaqqi wainna fareeqan mina almumineena lakarihoona"},{"SurahNumber":8,"VerseNumber":6,"Text":"Yujadiloonaka fee alhaqqi baAAdama tabayyana kaannama yusaqoona ila almawti wahum yanthuroona"},{"SurahNumber":8,"VerseNumber":7,"Text":"Waith yaAAidukumu Allahu ihda alttaifatayni annaha lakum watawaddoona anna ghayra thati alshshawkati takoonu lakum wayureedu Allahu an yuhiqqa alhaqqa bikalimatihi wayaqtaAAa dabira alkafireena"},{"SurahNumber":8,"VerseNumber":8,"Text":"Liyuhiqqa alhaqqa wayubtila albatila walaw kariha almujrimoona"},{"SurahNumber":8,"VerseNumber":9,"Text":"Ith tastagheethoona rabbakum faistajaba lakum annee mumiddukum bialfin mina almalaikati murdifeena"},{"SurahNumber":8,"VerseNumber":10,"Text":"Wama jaAAalahu Allahu illa bushra walitatmainna bihi quloobukum wama alnnasru illa min AAindi Allahi inna Allaha AAazeezun hakeemun"},{"SurahNumber":8,"VerseNumber":11,"Text":"Ith yughashsheekumu alnnuAAasa amanatan minhu wayunazzilu AAalaykum mina alssamai maan liyutahhirakum bihi wayuthhiba AAankum rijza alshshaytani waliyarbita AAala quloobikum wayuthabbita bihi alaqdama"},{"SurahNumber":8,"VerseNumber":12,"Text":"Ith yoohee rabbuka ila almalaikati annee maAAakum fathabbitoo allatheena amanoo saolqee fee quloobi allatheena kafaroo alrruAAba faidriboo fawqa alaAAnaqi waidriboo minhum kulla bananin"},{"SurahNumber":8,"VerseNumber":13,"Text":"Thalika biannahum shaqqoo Allaha warasoolahu waman yushaqiqi Allaha warasoolahu fainna Allaha shadeedu alAAiqabi"},{"SurahNumber":8,"VerseNumber":14,"Text":"Thalikum fathooqoohu waanna lilkafireena AAathaba alnnari"},{"SurahNumber":8,"VerseNumber":15,"Text":"Ya ayyuha allatheena amanoo itha laqeetumu allatheena kafaroo zahfan fala tuwalloohumu aladbara"},{"SurahNumber":8,"VerseNumber":16,"Text":"Waman yuwallihim yawmaithin duburahu illa mutaharrifan liqitalin aw mutahayyizan ila fiatin faqad baa bighadabin mina Allahi wamawahu jahannamu wabisa almaseeru"},{"SurahNumber":8,"VerseNumber":17,"Text":"Falam taqtuloohum walakinna Allaha qatalahum wama ramayta ith ramayta walakinna Allaha rama waliyubliya almumineena minhu balaan hasanan inna Allaha sameeAAun AAaleemun"},{"SurahNumber":8,"VerseNumber":18,"Text":"Thalikum waanna Allaha moohinu kaydi alkafireena"},{"SurahNumber":8,"VerseNumber":19,"Text":"In tastaftihoo faqad jaakumu alfathu wain tantahoo fahuwa khayrun lakum wain taAAoodoo naAAud walan tughniya AAankum fiatukum shayan walaw kathurat waanna Allaha maAAa almumineena"},{"SurahNumber":8,"VerseNumber":20,"Text":"Ya ayyuha allatheena amanoo ateeAAoo Allaha warasoolahu wala tawallaw AAanhu waantum tasmaAAoona"},{"SurahNumber":8,"VerseNumber":21,"Text":"Wala takoonoo kaallatheena qaloo samiAAna wahum la yasmaAAoona"},{"SurahNumber":8,"VerseNumber":22,"Text":"Inna sharra alddawabbi AAinda Allahi alssummu albukmu allatheena la yaAAqiloona"},{"SurahNumber":8,"VerseNumber":23,"Text":"Walaw AAalima Allahu feehim khayran laasmaAAahum walaw asmaAAahum latawallaw wahum muAAridoona"},{"SurahNumber":8,"VerseNumber":24,"Text":"Ya ayyuha allatheena amanoo istajeeboo lillahi walilrrasooli itha daAAakum lima yuhyeekum waiAAlamoo anna Allaha yahoolu bayna almari waqalbihi waannahu ilayhi tuhsharoona"},{"SurahNumber":8,"VerseNumber":25,"Text":"Waittaqoo fitnatan la tuseebanna allatheena thalamoo minkum khassatan waiAAlamoo anna Allaha shadeedu alAAiqabi"},{"SurahNumber":8,"VerseNumber":26,"Text":"Waothkuroo ith antum qaleelun mustadAAafoona fee alardi takhafoona an yatakhattafakumu alnnasu faawakum waayyadakum binasrihi warazaqakum mina alttayyibati laAAallakum tashkuroona"},{"SurahNumber":8,"VerseNumber":27,"Text":"Ya ayyuha allatheena amanoo la takhoonoo Allaha waalrrasoola watakhoonoo amanatikum waantum taAAlamoona"},{"SurahNumber":8,"VerseNumber":28,"Text":"WaiAAlamoo annama amwalukum waawladukum fitnatun waanna Allaha AAindahu ajrun AAatheemun"},{"SurahNumber":8,"VerseNumber":29,"Text":"Ya ayyuha allatheena amanoo in tattaqoo Allaha yajAAal lakum furqanan wayukaffir AAankum sayyiatikum wayaghfir lakum waAllahu thoo alfadli alAAatheemi"},{"SurahNumber":8,"VerseNumber":30,"Text":"Waith yamkuru bika allatheena kafaroo liyuthbitooka aw yaqtulooka aw yukhrijooka wayamkuroona wayamkuru Allahu waAllahu khayru almakireena"},{"SurahNumber":8,"VerseNumber":31,"Text":"Waitha tutla AAalayhim ayatuna qaloo qad samiAAna law nashao laqulna mithla hatha in hatha illa asateeru alawwaleena"},{"SurahNumber":8,"VerseNumber":32,"Text":"Waith qaloo allahumma in kana hatha huwa alhaqqa min AAindika faamtir AAalayna hijaratan mina alssamai awi itina biAAathabin aleemin"},{"SurahNumber":8,"VerseNumber":33,"Text":"Wama kana Allahu liyuAAaththibahum waanta feehim wama kana Allahu muAAaththibahum wahum yastaghfiroona"},{"SurahNumber":8,"VerseNumber":34,"Text":"Wama lahum alla yuAAaththibahumu Allahu wahum yasuddoona AAani almasjidi alharami wama kanoo awliyaahu in awliyaohu illa almuttaqoona walakinna aktharahum la yaAAlamoona"},{"SurahNumber":8,"VerseNumber":35,"Text":"Wama kana salatuhum AAinda albayti illa mukaan watasdiyatan fathooqoo alAAathaba bima kuntum takfuroona"},{"SurahNumber":8,"VerseNumber":36,"Text":"Inna allatheena kafaroo yunfiqoona amwalahum liyasuddoo AAan sabeeli Allahi fasayunfiqoonaha thumma takoonu AAalayhim hasratan thumma yughlaboona waallatheena kafaroo ila jahannama yuhsharoona"},{"SurahNumber":8,"VerseNumber":37,"Text":"Liyameeza Allahu alkhabeetha mina alttayyibi wayajAAala alkhabeetha baAAdahu AAala baAAdin fayarkumahu jameeAAan fayajAAalahu fee jahannama olaika humu alkhasiroona"},{"SurahNumber":8,"VerseNumber":38,"Text":"Qul lillatheena kafaroo in yantahoo yughfar lahum ma qad salafa wain yaAAoodoo faqad madat sunnatu alawwaleena"},{"SurahNumber":8,"VerseNumber":39,"Text":"Waqatiloohum hatta la takoona fitnatun wayakoona alddeenu kulluhu lillahi faini intahaw fainna Allaha bima yaAAmaloona baseerun"},{"SurahNumber":8,"VerseNumber":40,"Text":"Wain tawallaw faiAAlamoo anna Allaha mawlakum niAAma almawla waniAAma alnnaseeru"},{"SurahNumber":8,"VerseNumber":41,"Text":"WaiAAlamoo annama ghanimtum min shayin faanna lillahi khumusahu walilrrasooli walithee alqurba waalyatama waalmasakeeni waibni alssabeeli in kuntum amantum biAllahi wama anzalna AAala AAabdina yawma alfurqani yawma iltaqa aljamAAani waAllahu AAala kulli shayin qadeerun"},{"SurahNumber":8,"VerseNumber":42,"Text":"Ith antum bialAAudwati alddunya wahum bialAAudwati alquswa waalrrakbu asfala minkum walaw tawaAAadtum laikhtalaftum fee almeeAAadi walakin liyaqdiya Allahu amran kana mafAAoolan liyahlika man halaka AAan bayyinatin wayahya man hayya AAan bayyinatin wainna Allaha lasameeAAun AAaleemun"},{"SurahNumber":8,"VerseNumber":43,"Text":"Ith yureekahumu Allahu fee manamika qaleelan walaw arakahum katheeran lafashiltum walatanazaAAtum fee alamri walakinna Allaha sallama innahu AAaleemun bithati alssudoori"},{"SurahNumber":8,"VerseNumber":44,"Text":"Waith yureekumoohum ithi iltaqaytum fee aAAyunikum qaleelan wayuqallilukum fee aAAyunihim liyaqdiya Allahu amran kana mafAAoolan waila Allahi turjaAAu alomooru"},{"SurahNumber":8,"VerseNumber":45,"Text":"Ya ayyuha allatheena amanoo itha laqeetum fiatan faothbutoo waothkuroo Allaha katheeran laAAallakum tuflihoona"},{"SurahNumber":8,"VerseNumber":46,"Text":"WaateeAAoo Allaha warasoolahu wala tanazaAAoo fatafshaloo watathhaba reehukum waisbiroo inna Allaha maAAa alssabireena"},{"SurahNumber":8,"VerseNumber":47,"Text":"Wala takoonoo kaallatheena kharajoo min diyarihim bataran wariaa alnnasi wayasuddoona AAan sabeeli Allahi waAllahu bima yaAAmaloona muheetun"},{"SurahNumber":8,"VerseNumber":48,"Text":"Waith zayyana lahumu alshshaytanu aAAmalahum waqala la ghaliba lakumu alyawma mina alnnasi wainnee jarun lakum falamma taraati alfiatani nakasa AAala AAaqibayhi waqala innee bareeon minkum innee ara ma la tarawna innee akhafu Allaha waAllahu shadeedu alAAiqabi"},{"SurahNumber":8,"VerseNumber":49,"Text":"Ith yaqoolu almunafiqoona waallatheena fee quloobihim maradun gharra haolai deenuhum waman yatawakkal AAala Allahi fainna Allaha AAazeezun hakeemun"},{"SurahNumber":8,"VerseNumber":50,"Text":"Walaw tara ith yatawaffa allatheena kafaroo almalaikatu yadriboona wujoohahum waadbarahum wathooqoo AAathaba alhareeqi"},{"SurahNumber":8,"VerseNumber":51,"Text":"Thalika bima qaddamat aydeekum waanna Allaha laysa bithallamin lilAAabeedi"},{"SurahNumber":8,"VerseNumber":52,"Text":"Kadabi ali firAAawna waallatheena min qablihim kafaroo biayati Allahi faakhathahumu Allahu bithunoobihim inna Allaha qawiyyun shadeedu alAAiqabi"},{"SurahNumber":8,"VerseNumber":53,"Text":"Thalika bianna Allaha lam yaku mughayyiran niAAmatan anAAamaha AAala qawmin hatta yughayyiroo ma bianfusihim waanna Allaha sameeAAun AAaleemun"},{"SurahNumber":8,"VerseNumber":54,"Text":"Kadabi ali firAAawna waallatheena min qablihim kaththaboo biayati rabbihim faahlaknahum bithunoobihim waaghraqna ala firAAawna wakullun kanoo thalimeena"},{"SurahNumber":8,"VerseNumber":55,"Text":"Inna sharra alddawabbi AAinda Allahi allatheena kafaroo fahum la yuminoona"},{"SurahNumber":8,"VerseNumber":56,"Text":"Allatheena AAahadta minhum thumma yanqudoona AAahdahum fee kulli marratin wahum la yattaqoona"},{"SurahNumber":8,"VerseNumber":57,"Text":"Faimma tathqafannahum fee alharbi fasharrid bihim man khalfahum laAAallahum yaththakkaroona"},{"SurahNumber":8,"VerseNumber":58,"Text":"Waimma takhafanna min qawmin khiyanatan fainbith ilayhim AAala sawain inna Allaha la yuhibbu alkhaineena"},{"SurahNumber":8,"VerseNumber":59,"Text":"Wala yahsabanna allatheena kafaroo sabaqoo innahum la yuAAjizoona"},{"SurahNumber":8,"VerseNumber":60,"Text":"WaaAAiddoo lahum ma istataAAtum min quwwatin wamin ribati alkhayli turhiboona bihi AAaduwwa Allahi waAAaduwwakum waakhareena min doonihim la taAAlamoonahumu Allahu yaAAlamuhum wama tunfiqoo min shayin fee sabeeli Allahi yuwaffa ilaykum waantum la tuthlamoona"},{"SurahNumber":8,"VerseNumber":61,"Text":"Wain janahoo lilssalmi faijnah laha watawakkal AAala Allahi innahu huwa alssameeAAu alAAaleemu"},{"SurahNumber":8,"VerseNumber":62,"Text":"Wain yureedoo an yakhdaAAooka fainna hasbaka Allahu huwa allathee ayyadaka binasrihi wabialmumineena"},{"SurahNumber":8,"VerseNumber":63,"Text":"Waallafa bayna quloobihim law anfaqta ma fee alardi jameeAAan ma allafta bayna quloobihim walakinna Allaha allafa baynahum innahu AAazeezun hakeemun"},{"SurahNumber":8,"VerseNumber":64,"Text":"Ya ayyuha alnnabiyyu hasbuka Allahu wamani ittabaAAaka mina almumineena"},{"SurahNumber":8,"VerseNumber":65,"Text":"Ya ayyuha alnnabiyyu harridi almumineena AAala alqitali in yakun minkum AAishroona sabiroona yaghliboo miatayni wain yakun minkum miatun yaghliboo alfan mina allatheena kafaroo biannahum qawmun la yafqahoona"},{"SurahNumber":8,"VerseNumber":66,"Text":"Alana khaffafa Allahu AAankum waAAalima anna feekum daAAfan fain yakun minkum miatun sabiratun yaghliboo miatayni wain yakun minkum alfun yaghliboo alfayni biithni Allahi waAllahu maAAa alssabireena"},{"SurahNumber":8,"VerseNumber":67,"Text":"Ma kana linabiyyin an yakoona lahu asra hatta yuthkhina fee alardi tureedoona AAarada alddunya waAllahu yureedu alakhirata waAllahu AAazeezun hakeemun"},{"SurahNumber":8,"VerseNumber":68,"Text":"Lawla kitabun mina Allahi sabaqa lamassakum feema akhathtum AAathabun AAatheemun"},{"SurahNumber":8,"VerseNumber":69,"Text":"Fakuloo mimma ghanimtum halalan tayyiban waittaqoo Allaha inna Allaha ghafoorun raheemun"},{"SurahNumber":8,"VerseNumber":70,"Text":"Ya ayyuha alnnabiyyu qul liman fee aydeekum mina alasra in yaAAlami Allahu fee quloobikum khayran yutikum khayran mimma okhitha minkum wayaghfir lakum waAllahu ghafoorun raheemun"},{"SurahNumber":8,"VerseNumber":71,"Text":"Wain yureedoo khiyanataka faqad khanoo Allaha min qablu faamkana minhum waAllahu AAaleemun hakeemun"},{"SurahNumber":8,"VerseNumber":72,"Text":"Inna allatheena amanoo wahajaroo wajahadoo biamwalihim waanfusihim fee sabeeli Allahi waallatheena awaw wanasaroo olaika baAAduhum awliyao baAAdin waallatheena amanoo walam yuhajiroo ma lakum min walayatihim min shayin hatta yuhajiroo waini istansarookum fee alddeeni faAAalaykumu alnnasru illa AAala qawmin baynakum wabaynahum meethaqun waAllahu bima taAAmaloona baseerun"},{"SurahNumber":8,"VerseNumber":73,"Text":"Waallatheena kafaroo baAAduhum awliyao baAAdin illa tafAAaloohu takun fitnatun fee alardi wafasadun kabeerun"},{"SurahNumber":8,"VerseNumber":74,"Text":"Waallatheena amanoo wahajaroo wajahadoo fee sabeeli Allahi waallatheena awaw wanasaroo olaika humu almuminoona haqqan lahum maghfiratun warizqun kareemun"},{"SurahNumber":8,"VerseNumber":75,"Text":"Waallatheena amanoo min baAAdu wahajaroo wajahadoo maAAakum faolaika minkum waoloo alarhami baAAduhum awla bibaAAdin fee kitabi Allahi inna Allaha bikulli shayin AAaleemun"}]},{"LanguageCode":"eng","Language":"English","Name":"eng-mustafakhattabg","Author":"Mustafa Khattab God Edition","Source":"","Direction":"ltr","Translations":[{"SurahNumber":8,"VerseNumber":1,"Text":"They ask you ˹O Prophet˺ regarding the spoils of war. Say, “Their distribution is decided by God and His Messenger. So be mindful of God, settle your affairs, and obey God and His Messenger if you are ˹true˺ believers.”"},{"SurahNumber":8,"VerseNumber":2,"Text":"The ˹true˺ believers are only those whose hearts tremble at the remembrance of God, whose faith increases when His revelations are recited to them, and who put their trust in their Lord"},{"SurahNumber":8,"VerseNumber":3,"Text":"˹They are˺ those who establish prayer and donate from what We have provided for them"},{"SurahNumber":8,"VerseNumber":4,"Text":"It is they who are the true believers. They will have elevated ranks, forgiveness, and an honourable provision from their Lord"},{"SurahNumber":8,"VerseNumber":5,"Text":"Similarly, when your Lord brought you ˹O Prophet˺ out of your home for a just cause, a group of believers was totally against it"},{"SurahNumber":8,"VerseNumber":6,"Text":"They disputed with you about the truth after it had been made clear, as if they were being driven to death with their eyes wide open"},{"SurahNumber":8,"VerseNumber":7,"Text":"˹Remember, O believers,˺ when God promised ˹to give˺ you the upper hand over either target, you wished to capture the unarmed party. But it was God’s Will to establish the truth by His Words and uproot the disbelievers"},{"SurahNumber":8,"VerseNumber":8,"Text":"to firmly establish the truth and wipe out falsehood—even to the dismay of the wicked"},{"SurahNumber":8,"VerseNumber":9,"Text":"˹Remember˺ when you cried out to your Lord for help, He answered, “I will reinforce you with a thousand angels—followed by many others.”"},{"SurahNumber":8,"VerseNumber":10,"Text":"And God made this a sign of victory and reassurance to your hearts. Victory comes only from God. Surely God is Almighty, All-Wise"},{"SurahNumber":8,"VerseNumber":11,"Text":"˹Remember˺ when He caused drowsiness to overcome you, giving you serenity. And He sent down rain from the sky to purify you, free you from Satan’s whispers, strengthen your hearts, and make ˹your˺ steps firm"},{"SurahNumber":8,"VerseNumber":12,"Text":"˹Remember, O Prophet,˺ when your Lord revealed to the angels, “I am with you. So make the believers stand firm. I will cast horror into the hearts of the disbelievers. So strike their necks and strike their fingertips.”"},{"SurahNumber":8,"VerseNumber":13,"Text":"This is because they defied God and His Messenger. And whoever defies God and His Messenger, then ˹know that˺ God is surely severe in punishment"},{"SurahNumber":8,"VerseNumber":14,"Text":"That ˹worldly punishment˺ is yours, so taste it! Then the disbelievers will suffer the torment of the Fire"},{"SurahNumber":8,"VerseNumber":15,"Text":"O believers! When you face the disbelievers in battle, never turn your backs to them"},{"SurahNumber":8,"VerseNumber":16,"Text":"And whoever does so on such an occasion—unless it is a manoeuvre or to join their own troops—will earn the displeasure of God, and their home will be Hell. What an evil destination"},{"SurahNumber":8,"VerseNumber":17,"Text":"It was not you ˹believers˺ who killed them, but it was God Who did so. Nor was it you ˹O Prophet˺ who threw ˹a handful of sand at the disbelievers˺, but it was God Who did so, rendering the believers a great favour. Surely God is All-Hearing, All-Knowing"},{"SurahNumber":8,"VerseNumber":18,"Text":"As such, God frustrates the evil plans of the disbelievers"},{"SurahNumber":8,"VerseNumber":19,"Text":"If you ˹Meccans˺ sought judgment, now it has come to you. And if you cease, it will be for your own good. But if you persist, We will persist. And your forces—no matter how numerous they might be—will not benefit you whatsoever. For God is certainly with the believers"},{"SurahNumber":8,"VerseNumber":20,"Text":"O believers! Obey God and His Messenger and do not turn away from him while you hear ˹his call˺"},{"SurahNumber":8,"VerseNumber":21,"Text":"Do not be like those who say, “We hear,” but in fact they are not listening"},{"SurahNumber":8,"VerseNumber":22,"Text":"Indeed, the worst of all beings in the sight of God are the ˹wilfully˺ deaf and dumb, who do not understand"},{"SurahNumber":8,"VerseNumber":23,"Text":"Had God known any goodness in them, He would have certainly made them hear. ˹But˺ even if He had made them hear, they would have surely turned away heedlessly"},{"SurahNumber":8,"VerseNumber":24,"Text":"O believers! Respond to God and His Messenger when he calls you to that which gives you life. And know that God stands between a person and their heart, and that to Him you will all be gathered"},{"SurahNumber":8,"VerseNumber":25,"Text":"Beware of a trial that will not only affect the wrongdoers among you. And know that God is severe in punishment"},{"SurahNumber":8,"VerseNumber":26,"Text":"Remember when you had been vastly outnumbered and oppressed in the land, constantly in fear of attacks by your enemy, then He sheltered you, strengthened you with His help, and provided you with good things so perhaps you would be thankful"},{"SurahNumber":8,"VerseNumber":27,"Text":"O believers! Do not betray God and the Messenger, nor betray your trusts knowingly"},{"SurahNumber":8,"VerseNumber":28,"Text":"And know that your wealth and your children are only a test and that with God is a great reward"},{"SurahNumber":8,"VerseNumber":29,"Text":"O believers! If you are mindful of God, He will grant you a standard ˹to distinguish between right and wrong˺, absolve you of your sins, and forgive you. And God is the Lord of infinite bounty"},{"SurahNumber":8,"VerseNumber":30,"Text":"And ˹remember, O Prophet,˺ when the disbelievers conspired to capture, kill, or exile you. They planned, but God also planned. And God is the best of planners"},{"SurahNumber":8,"VerseNumber":31,"Text":"Whenever Our revelations are recited to them, they challenge ˹you˺, “We have already heard ˹the recitation˺. If we wanted, we could have easily produced something similar. This ˹Quran˺ is nothing but ancient fables!”"},{"SurahNumber":8,"VerseNumber":32,"Text":"And ˹remember˺ when they prayed, “O God! If this is indeed the truth from You, then rain down stones upon us from the sky or overcome us with a painful punishment.”"},{"SurahNumber":8,"VerseNumber":33,"Text":"But God would never punish them while you ˹O Prophet˺ were in their midst. Nor would He ever punish them if they prayed for forgiveness"},{"SurahNumber":8,"VerseNumber":34,"Text":"And why should God not punish them while they hinder pilgrims from the Sacred Mosque, claiming to be its rightful guardians? None has the right to guardianship except those mindful ˹of God˺, but most pagans do not know"},{"SurahNumber":8,"VerseNumber":35,"Text":"Their prayer at the Sacred House was nothing but whistling and clapping. So taste the punishment for your disbelief"},{"SurahNumber":8,"VerseNumber":36,"Text":"Surely the disbelievers spend their wealth to hinder others from the Path of God. They will continue to spend to the point of regret. Then they will be defeated and the disbelievers will be driven into Hell"},{"SurahNumber":8,"VerseNumber":37,"Text":"so God may separate the evil from the good. He will pile up the evil ones all together and then cast them into Hell. They are the ˹true˺ losers"},{"SurahNumber":8,"VerseNumber":38,"Text":"Tell the disbelievers that if they desist, their past will be forgiven. But if they persist, then they have an example in those destroyed before them"},{"SurahNumber":8,"VerseNumber":39,"Text":"Fight against them until there is no more persecution—and ˹your˺ devotion will be entirely to God. But if they desist, then surely God is All-Seeing of what they do"},{"SurahNumber":8,"VerseNumber":40,"Text":"And if they do not comply, then know that God is your Protector. What an excellent Protector, and what an excellent Helper"},{"SurahNumber":8,"VerseNumber":41,"Text":"Know that whatever spoils you take, one-fifth is for God and the Messenger, his close relatives, orphans, the poor, and ˹needy˺ travellers, if you ˹truly˺ believe in God and what We revealed to Our servant on that decisive day when the two armies met ˹at Badr˺. And God is Most Capable of everything"},{"SurahNumber":8,"VerseNumber":42,"Text":"˹Remember˺ when you were on the near side of the valley, your enemy on the far side, and the caravan was below you. Even if the two armies had made an appointment ˹to meet˺, both would have certainly missed it. Still it transpired so God may establish what He had destined—that those who were to perish and those who were to survive might do so after the truth had been made clear to both. Surely God is All-Hearing, All-Knowing"},{"SurahNumber":8,"VerseNumber":43,"Text":"˹Remember, O Prophet,˺ when God showed them in your dream as few in number. Had He shown them to you as many, you ˹believers˺ would have certainly faltered and disputed in the matter. But God spared you ˹from that˺. Surely He knows best what is ˹hidden˺ in the heart"},{"SurahNumber":8,"VerseNumber":44,"Text":"Then when your armies met, God made them appear as few in your eyes, and made you appear as few in theirs, so God may establish what He had destined. And to God ˹all˺ matters will be returned ˹for judgment˺"},{"SurahNumber":8,"VerseNumber":45,"Text":"O believers! When you face an enemy, stand firm and remember God often so you may triumph"},{"SurahNumber":8,"VerseNumber":46,"Text":"Obey God and His Messenger and do not dispute with one another, or you would be discouraged and weakened. Persevere! Surely God is with those who persevere"},{"SurahNumber":8,"VerseNumber":47,"Text":"Do not be like those ˹pagans˺ who left their homes arrogantly, only to be seen by people and to hinder others from God’s Path. And God is Fully Aware of what they do"},{"SurahNumber":8,"VerseNumber":48,"Text":"And ˹remember˺ when Satan made their ˹evil˺ deeds appealing to them, and said, “No one can overcome you today. I am surely by your side.” But when the two forces faced off, he cowered and said, “I have absolutely nothing to do with you. I certainly see what you do not see. I truly fear God, for God is severe in punishment.”"},{"SurahNumber":8,"VerseNumber":49,"Text":"˹Remember˺ when the hypocrites and those with sickness in their hearts said, “These ˹believers˺ are deluded by their faith.” But whoever puts their trust in God, surely God is Almighty, All-Wise"},{"SurahNumber":8,"VerseNumber":50,"Text":"If only you could see when the angels take the souls of the disbelievers, beating their faces and backs, ˹saying,˺ “Taste the torment of burning"},{"SurahNumber":8,"VerseNumber":51,"Text":"This is ˹the reward˺ for what your hands have done. And God is never unjust to ˹His˺ creation.”"},{"SurahNumber":8,"VerseNumber":52,"Text":"Their fate is that of the people of Pharaoh and those before them—they all disbelieved in God’s signs, so God seized them for their sins. Indeed, God is All-Powerful, severe in punishment"},{"SurahNumber":8,"VerseNumber":53,"Text":"This is because God would never discontinue His favour to a people until they discontinue their faith. Surely God is All-Hearing, All-Knowing"},{"SurahNumber":8,"VerseNumber":54,"Text":"That was the case with Pharaoh’s people and those before them—they all rejected the signs of their Lord, so We destroyed them for their sins and drowned Pharaoh’s people. They were all wrongdoers"},{"SurahNumber":8,"VerseNumber":55,"Text":"Indeed, the worst of all beings in the sight of God are those who persist in disbelief, never to have faith—"},{"SurahNumber":8,"VerseNumber":56,"Text":"˹namely˺ those with whom you ˹O Prophet˺ have entered into treaties, but they violate them every time, not fearing the consequences"},{"SurahNumber":8,"VerseNumber":57,"Text":"If you ever encounter them in battle, make a fearsome example of them, so perhaps those who would follow them may be deterred"},{"SurahNumber":8,"VerseNumber":58,"Text":"And if you ˹O Prophet˺ see signs of betrayal by a people, respond by openly terminating your treaty with them. Surely God does not like those who betray"},{"SurahNumber":8,"VerseNumber":59,"Text":"Do not let those disbelievers think they are not within reach. They will have no escape"},{"SurahNumber":8,"VerseNumber":60,"Text":"Prepare against them what you ˹believers˺ can of ˹military˺ power and cavalry to deter God’s enemies and your enemies as well as other enemies unknown to you but known to God. Whatever you spend in the cause of God will be paid to you in full and you will not be wronged"},{"SurahNumber":8,"VerseNumber":61,"Text":"If the enemy is inclined towards peace, make peace with them. And put your trust in God. Indeed, He ˹alone˺ is the All-Hearing, All-Knowing"},{"SurahNumber":8,"VerseNumber":62,"Text":"But if their intention is only to deceive you, then God is certainly sufficient for you. He is the One Who has supported you with His help and with the believers"},{"SurahNumber":8,"VerseNumber":63,"Text":"He brought their hearts together. Had you spent all the riches in the earth, you could not have united their hearts. But God has united them. Indeed, He is Almighty, All-Wise"},{"SurahNumber":8,"VerseNumber":64,"Text":"O Prophet! God is sufficient for you and for the believers who follow you"},{"SurahNumber":8,"VerseNumber":65,"Text":"O Prophet! Motivate the believers to fight. If there are twenty steadfast among you, they will overcome two hundred. And if there are one hundred of you, they will overcome one thousand of the disbelievers, for they are a people who do not comprehend"},{"SurahNumber":8,"VerseNumber":66,"Text":"Now God has lightened your burden, for He knows that there is weakness in you. So if there are a hundred steadfast among you, they will overcome two hundred. And if there be one thousand, they will overcome two thousand, by God’s Will. And God is with the steadfast"},{"SurahNumber":8,"VerseNumber":67,"Text":"It is not fit for a prophet that he should take captives until he has thoroughly subdued the land. You ˹believers˺ settled with the fleeting gains of this world, while God’s aim ˹for you˺ is the Hereafter. God is Almighty, All-Wise"},{"SurahNumber":8,"VerseNumber":68,"Text":"Had it not been for a prior decree from God, you would have certainly been disciplined with a tremendous punishment for whatever ˹ransom˺ you have taken"},{"SurahNumber":8,"VerseNumber":69,"Text":"Now enjoy what you have taken, for it is lawful and good. And be mindful of God. Surely God is All-Forgiving, Most Merciful"},{"SurahNumber":8,"VerseNumber":70,"Text":"O Prophet! Tell the captives in your custody, “If God finds goodness in your hearts, He will give you better than what has been taken from you, and forgive you. For God is All-Forgiving, Most Merciful.”"},{"SurahNumber":8,"VerseNumber":71,"Text":"But if their intention is only to betray you ˹O Prophet˺, they sought to betray God before. But He gave you power over them. And God is All-Knowing, All-Wise"},{"SurahNumber":8,"VerseNumber":72,"Text":"Those who believed, emigrated, and strived with their wealth and lives in the cause of God, as well as those who gave them shelter and help—they are truly guardians of one another. As for those who believed but did not emigrate, you have no obligations to them until they emigrate. But if they seek your help ˹against persecution˺ in faith, it is your obligation to help them, except against people bound with you in a treaty. God is All-Seeing of what you do"},{"SurahNumber":8,"VerseNumber":73,"Text":"As for the disbelievers, they are guardians of one another. And unless you ˹believers˺ act likewise, there will be great oppression and corruption in the land"},{"SurahNumber":8,"VerseNumber":74,"Text":"Those who believed, migrated, and struggled in the cause of God, and those who gave ˹them˺ shelter and help, they are the true believers. They will have forgiveness and an honourable provision"},{"SurahNumber":8,"VerseNumber":75,"Text":"And those who later believed, migrated, and struggled alongside you, they are also with you. But only blood relatives are now entitled to inherit from one another, as ordained by God. Surely God has ˹full˺ knowledge of everything"}]}]}