{"SurahNumber":98,"HasBismillah":true,"Verses":[{"SurahNumber":98,"VerseNumber":1,"Text":"لَمۡ يَكُنِ ٱلَّذِينَ كَفَرُواْ مِنۡ أَهۡلِ ٱلۡكِتَٰبِ وَٱلۡمُشۡرِكِينَ مُنفَكِّينَ حَتَّىٰ تَأۡتِيَهُمُ ٱلۡبَيِّنَةُ","End":"١"},{"SurahNumber":98,"VerseNumber":2,"Text":"رَسُولٞ مِّنَ ٱللَّهِ يَتۡلُواْ صُحُفٗا مُّطَهَّرَةٗ","End":"٢"},{"SurahNumber":98,"VerseNumber":3,"Text":"فِيهَا كُتُبٞ قَيِّمَةٞ","End":"٣"},{"SurahNumber":98,"VerseNumber":4,"Text":"وَمَا تَفَرَّقَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ إِلَّا مِنۢ بَعۡدِ مَا جَآءَتۡهُمُ ٱلۡبَيِّنَةُ","End":"٤"},{"SurahNumber":98,"VerseNumber":5,"Text":"وَمَآ أُمِرُوٓاْ إِلَّا لِيَعۡبُدُواْ ٱللَّهَ مُخۡلِصِينَ لَهُ ٱلدِّينَ حُنَفَآءَ وَيُقِيمُواْ ٱلصَّلَوٰةَ وَيُؤۡتُواْ ٱلزَّكَوٰةَۚ وَذَٰلِكَ دِينُ ٱلۡقَيِّمَةِ","End":"٥"},{"SurahNumber":98,"VerseNumber":6,"Text":"إِنَّ ٱلَّذِينَ كَفَرُواْ مِنۡ أَهۡلِ ٱلۡكِتَٰبِ وَٱلۡمُشۡرِكِينَ فِي نَارِ جَهَنَّمَ خَٰلِدِينَ فِيهَآۚ أُوْلَـٰٓئِكَ هُمۡ شَرُّ ٱلۡبَرِيَّةِ","End":"٦"},{"SurahNumber":98,"VerseNumber":7,"Text":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّـٰلِحَٰتِ أُوْلَـٰٓئِكَ هُمۡ خَيۡرُ ٱلۡبَرِيَّةِ","End":"٧"},{"SurahNumber":98,"VerseNumber":8,"Text":"جَزَآؤُهُمۡ عِندَ رَبِّهِمۡ جَنَّـٰتُ عَدۡنٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَآ أَبَدٗاۖ رَّضِيَ ٱللَّهُ عَنۡهُمۡ وَرَضُواْ عَنۡهُۚ ذَٰلِكَ لِمَنۡ خَشِيَ رَبَّهُۥ","End":"٨"}],"Translations":[{"LanguageCode":"ara","Language":"Arabic","Name":"ara-quran-la","Author":"Quran Transliteration","Source":"http://tanzil.net","Direction":"ltr","Translations":[{"SurahNumber":98,"VerseNumber":1,"Text":"Lam yakuni allatheena kafaroo min ahli alkitabi waalmushrikeena munfakkeena hatta tatiyahumu albayyinatu"},{"SurahNumber":98,"VerseNumber":2,"Text":"Rasoolun mina Allahi yatloo suhufan mutahharatan"},{"SurahNumber":98,"VerseNumber":3,"Text":"Feeha kutubun qayyimatun"},{"SurahNumber":98,"VerseNumber":4,"Text":"Wama tafarraqa allatheena ootoo alkitaba illa min baAAdi ma jaathumu albayyinatu"},{"SurahNumber":98,"VerseNumber":5,"Text":"Wama omiroo illa liyaAAbudoo Allaha mukhliseena lahu alddeena hunafaa wayuqeemoo alssalata wayutoo alzzakata wathalika deenu alqayyimati"},{"SurahNumber":98,"VerseNumber":6,"Text":"Inna allatheena kafaroo min ahli alkitabi waalmushrikeena fee nari jahannama khalideena feeha olaika hum sharru albariyyati"},{"SurahNumber":98,"VerseNumber":7,"Text":"Inna allatheena amanoo waAAamiloo alssalihati olaika hum khayru albariyyati"},{"SurahNumber":98,"VerseNumber":8,"Text":"Jazaohum AAinda rabbihim jannatu AAadnin tajree min tahtiha alanharu khalideena feeha abadan radiya Allahu AAanhum waradoo AAanhu thalika liman khashiya rabbahu"}]},{"LanguageCode":"eng","Language":"English","Name":"eng-mustafakhattabg","Author":"Mustafa Khattab God Edition","Source":"","Direction":"ltr","Translations":[{"SurahNumber":98,"VerseNumber":1,"Text":"The disbelievers from the People of the Book and the polytheists were not going to desist ˹from disbelief˺ until the clear proof came to them"},{"SurahNumber":98,"VerseNumber":2,"Text":"a messenger from God, reciting scrolls of ˹utmost˺ purity"},{"SurahNumber":98,"VerseNumber":3,"Text":"containing upright commandments"},{"SurahNumber":98,"VerseNumber":4,"Text":"It was not until this clear proof came to the People of the Book that they became divided ˹about his prophethood˺—"},{"SurahNumber":98,"VerseNumber":5,"Text":"even though they were only commanded to worship God ˹alone˺ with sincere devotion to Him in all uprightness, establish prayer, and pay alms-tax. That is the upright Way"},{"SurahNumber":98,"VerseNumber":6,"Text":"Indeed, those who disbelieve from the People of the Book and the polytheists will be in the Fire of Hell, to stay there forever. They are the worst of ˹all˺ beings"},{"SurahNumber":98,"VerseNumber":7,"Text":"Indeed, those who believe and do good—they are the best of ˹all˺ beings"},{"SurahNumber":98,"VerseNumber":8,"Text":"Their reward with their Lord will be Gardens of Eternity, under which rivers flow, to stay there for ever and ever. God is pleased with them and they are pleased with Him. This is ˹only˺ for those in awe of their Lord"}]}]}