{"SurahNumber":17,"HasBismillah":true,"Verses":[{"SurahNumber":17,"VerseNumber":1,"Text":"سُبۡحَٰنَ ٱلَّذِيٓ أَسۡرَىٰ بِعَبۡدِهِۦ لَيۡلٗا مِّنَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ إِلَى ٱلۡمَسۡجِدِ ٱلۡأَقۡصَا ٱلَّذِي بَٰرَكۡنَا حَوۡلَهُۥ لِنُرِيَهُۥ مِنۡ ءَايَٰتِنَآۚ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلۡبَصِيرُ","End":"١"},{"SurahNumber":17,"VerseNumber":2,"Text":"وَءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ وَجَعَلۡنَٰهُ هُدٗى لِّبَنِيٓ إِسۡرَـٰٓءِيلَ أَلَّا تَتَّخِذُواْ مِن دُونِي وَكِيلٗا","End":"٢"},{"SurahNumber":17,"VerseNumber":3,"Text":"ذُرِّيَّةَ مَنۡ حَمَلۡنَا مَعَ نُوحٍۚ إِنَّهُۥ كَانَ عَبۡدٗا شَكُورٗا","End":"٣"},{"SurahNumber":17,"VerseNumber":4,"Text":"وَقَضَيۡنَآ إِلَىٰ بَنِيٓ إِسۡرَـٰٓءِيلَ فِي ٱلۡكِتَٰبِ لَتُفۡسِدُنَّ فِي ٱلۡأَرۡضِ مَرَّتَيۡنِ وَلَتَعۡلُنَّ عُلُوّٗا كَبِيرٗا","End":"٤"},{"SurahNumber":17,"VerseNumber":5,"Text":"فَإِذَا جَآءَ وَعۡدُ أُولَىٰهُمَا بَعَثۡنَا عَلَيۡكُمۡ عِبَادٗا لَّنَآ أُوْلِي بَأۡسٖ شَدِيدٖ فَجَاسُواْ خِلَٰلَ ٱلدِّيَارِۚ وَكَانَ وَعۡدٗا مَّفۡعُولٗا","End":"٥"},{"SurahNumber":17,"VerseNumber":6,"Text":"ثُمَّ رَدَدۡنَا لَكُمُ ٱلۡكَرَّةَ عَلَيۡهِمۡ وَأَمۡدَدۡنَٰكُم بِأَمۡوَٰلٖ وَبَنِينَ وَجَعَلۡنَٰكُمۡ أَكۡثَرَ نَفِيرًا","End":"٦"},{"SurahNumber":17,"VerseNumber":7,"Text":"إِنۡ أَحۡسَنتُمۡ أَحۡسَنتُمۡ لِأَنفُسِكُمۡۖ وَإِنۡ أَسَأۡتُمۡ فَلَهَاۚ فَإِذَا جَآءَ وَعۡدُ ٱلۡأٓخِرَةِ لِيَسُـُٔواْ وُجُوهَكُمۡ وَلِيَدۡخُلُواْ ٱلۡمَسۡجِدَ كَمَا دَخَلُوهُ أَوَّلَ مَرَّةٖ وَلِيُتَبِّرُواْ مَا عَلَوۡاْ تَتۡبِيرًا","End":"٧"},{"SurahNumber":17,"VerseNumber":8,"Text":"عَسَىٰ رَبُّكُمۡ أَن يَرۡحَمَكُمۡۚ وَإِنۡ عُدتُّمۡ عُدۡنَاۚ وَجَعَلۡنَا جَهَنَّمَ لِلۡكَٰفِرِينَ حَصِيرًا","End":"٨"},{"SurahNumber":17,"VerseNumber":9,"Text":"إِنَّ هَٰذَا ٱلۡقُرۡءَانَ يَهۡدِي لِلَّتِي هِيَ أَقۡوَمُ وَيُبَشِّرُ ٱلۡمُؤۡمِنِينَ ٱلَّذِينَ يَعۡمَلُونَ ٱلصَّـٰلِحَٰتِ أَنَّ لَهُمۡ أَجۡرٗا كَبِيرٗا","End":"٩"},{"SurahNumber":17,"VerseNumber":10,"Text":"وَأَنَّ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ أَعۡتَدۡنَا لَهُمۡ عَذَابًا أَلِيمٗا","End":"١٠"},{"SurahNumber":17,"VerseNumber":11,"Text":"وَيَدۡعُ ٱلۡإِنسَٰنُ بِٱلشَّرِّ دُعَآءَهُۥ بِٱلۡخَيۡرِۖ وَكَانَ ٱلۡإِنسَٰنُ عَجُولٗا","End":"١١"},{"SurahNumber":17,"VerseNumber":12,"Text":"وَجَعَلۡنَا ٱلَّيۡلَ وَٱلنَّهَارَ ءَايَتَيۡنِۖ فَمَحَوۡنَآ ءَايَةَ ٱلَّيۡلِ وَجَعَلۡنَآ ءَايَةَ ٱلنَّهَارِ مُبۡصِرَةٗ لِّتَبۡتَغُواْ فَضۡلٗا مِّن رَّبِّكُمۡ وَلِتَعۡلَمُواْ عَدَدَ ٱلسِّنِينَ وَٱلۡحِسَابَۚ وَكُلَّ شَيۡءٖ فَصَّلۡنَٰهُ تَفۡصِيلٗا","End":"١٢"},{"SurahNumber":17,"VerseNumber":13,"Text":"وَكُلَّ إِنسَٰنٍ أَلۡزَمۡنَٰهُ طَـٰٓئِرَهُۥ فِي عُنُقِهِۦۖ وَنُخۡرِجُ لَهُۥ يَوۡمَ ٱلۡقِيَٰمَةِ كِتَٰبٗا يَلۡقَىٰهُ مَنشُورًا","End":"١٣"},{"SurahNumber":17,"VerseNumber":14,"Text":"ٱقۡرَأۡ كِتَٰبَكَ كَفَىٰ بِنَفۡسِكَ ٱلۡيَوۡمَ عَلَيۡكَ حَسِيبٗا","End":"١٤"},{"SurahNumber":17,"VerseNumber":15,"Text":"مَّنِ ٱهۡتَدَىٰ فَإِنَّمَا يَهۡتَدِي لِنَفۡسِهِۦۖ وَمَن ضَلَّ فَإِنَّمَا يَضِلُّ عَلَيۡهَاۚ وَلَا تَزِرُ وَازِرَةٞ وِزۡرَ أُخۡرَىٰۗ وَمَا كُنَّا مُعَذِّبِينَ حَتَّىٰ نَبۡعَثَ رَسُولٗا","End":"١٥"},{"SurahNumber":17,"VerseNumber":16,"Text":"وَإِذَآ أَرَدۡنَآ أَن نُّهۡلِكَ قَرۡيَةً أَمَرۡنَا مُتۡرَفِيهَا فَفَسَقُواْ فِيهَا فَحَقَّ عَلَيۡهَا ٱلۡقَوۡلُ فَدَمَّرۡنَٰهَا تَدۡمِيرٗا","End":"١٦"},{"SurahNumber":17,"VerseNumber":17,"Text":"وَكَمۡ أَهۡلَكۡنَا مِنَ ٱلۡقُرُونِ مِنۢ بَعۡدِ نُوحٖۗ وَكَفَىٰ بِرَبِّكَ بِذُنُوبِ عِبَادِهِۦ خَبِيرَۢا بَصِيرٗا","End":"١٧"},{"SurahNumber":17,"VerseNumber":18,"Text":"مَّن كَانَ يُرِيدُ ٱلۡعَاجِلَةَ عَجَّلۡنَا لَهُۥ فِيهَا مَا نَشَآءُ لِمَن نُّرِيدُ ثُمَّ جَعَلۡنَا لَهُۥ جَهَنَّمَ يَصۡلَىٰهَا مَذۡمُومٗا مَّدۡحُورٗا","End":"١٨"},{"SurahNumber":17,"VerseNumber":19,"Text":"وَمَنۡ أَرَادَ ٱلۡأٓخِرَةَ وَسَعَىٰ لَهَا سَعۡيَهَا وَهُوَ مُؤۡمِنٞ فَأُوْلَـٰٓئِكَ كَانَ سَعۡيُهُم مَّشۡكُورٗا","End":"١٩"},{"SurahNumber":17,"VerseNumber":20,"Text":"كُلّٗا نُّمِدُّ هَـٰٓؤُلَآءِ وَهَـٰٓؤُلَآءِ مِنۡ عَطَآءِ رَبِّكَۚ وَمَا كَانَ عَطَآءُ رَبِّكَ مَحۡظُورًا","End":"٢٠"},{"SurahNumber":17,"VerseNumber":21,"Text":"ٱنظُرۡ كَيۡفَ فَضَّلۡنَا بَعۡضَهُمۡ عَلَىٰ بَعۡضٖۚ وَلَلۡأٓخِرَةُ أَكۡبَرُ دَرَجَٰتٖ وَأَكۡبَرُ تَفۡضِيلٗا","End":"٢١"},{"SurahNumber":17,"VerseNumber":22,"Text":"لَّا تَجۡعَلۡ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ فَتَقۡعُدَ مَذۡمُومٗا مَّخۡذُولٗا","End":"٢٢"},{"SurahNumber":17,"VerseNumber":23,"Text":"۞وَقَضَىٰ رَبُّكَ أَلَّا تَعۡبُدُوٓاْ إِلَّآ إِيَّاهُ وَبِٱلۡوَٰلِدَيۡنِ إِحۡسَٰنًاۚ إِمَّا يَبۡلُغَنَّ عِندَكَ ٱلۡكِبَرَ أَحَدُهُمَآ أَوۡ كِلَاهُمَا فَلَا تَقُل لَّهُمَآ أُفّٖ وَلَا تَنۡهَرۡهُمَا وَقُل لَّهُمَا قَوۡلٗا كَرِيمٗا","End":"٢٣"},{"SurahNumber":17,"VerseNumber":24,"Text":"وَٱخۡفِضۡ لَهُمَا جَنَاحَ ٱلذُّلِّ مِنَ ٱلرَّحۡمَةِ وَقُل رَّبِّ ٱرۡحَمۡهُمَا كَمَا رَبَّيَانِي صَغِيرٗا","End":"٢٤"},{"SurahNumber":17,"VerseNumber":25,"Text":"رَّبُّكُمۡ أَعۡلَمُ بِمَا فِي نُفُوسِكُمۡۚ إِن تَكُونُواْ صَٰلِحِينَ فَإِنَّهُۥ كَانَ لِلۡأَوَّـٰبِينَ غَفُورٗا","End":"٢٥"},{"SurahNumber":17,"VerseNumber":26,"Text":"وَءَاتِ ذَا ٱلۡقُرۡبَىٰ حَقَّهُۥ وَٱلۡمِسۡكِينَ وَٱبۡنَ ٱلسَّبِيلِ وَلَا تُبَذِّرۡ تَبۡذِيرًا","End":"٢٦"},{"SurahNumber":17,"VerseNumber":27,"Text":"إِنَّ ٱلۡمُبَذِّرِينَ كَانُوٓاْ إِخۡوَٰنَ ٱلشَّيَٰطِينِۖ وَكَانَ ٱلشَّيۡطَٰنُ لِرَبِّهِۦ كَفُورٗا","End":"٢٧"},{"SurahNumber":17,"VerseNumber":28,"Text":"وَإِمَّا تُعۡرِضَنَّ عَنۡهُمُ ٱبۡتِغَآءَ رَحۡمَةٖ مِّن رَّبِّكَ تَرۡجُوهَا فَقُل لَّهُمۡ قَوۡلٗا مَّيۡسُورٗا","End":"٢٨"},{"SurahNumber":17,"VerseNumber":29,"Text":"وَلَا تَجۡعَلۡ يَدَكَ مَغۡلُولَةً إِلَىٰ عُنُقِكَ وَلَا تَبۡسُطۡهَا كُلَّ ٱلۡبَسۡطِ فَتَقۡعُدَ مَلُومٗا مَّحۡسُورًا","End":"٢٩"},{"SurahNumber":17,"VerseNumber":30,"Text":"إِنَّ رَبَّكَ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ وَيَقۡدِرُۚ إِنَّهُۥ كَانَ بِعِبَادِهِۦ خَبِيرَۢا بَصِيرٗا","End":"٣٠"},{"SurahNumber":17,"VerseNumber":31,"Text":"وَلَا تَقۡتُلُوٓاْ أَوۡلَٰدَكُمۡ خَشۡيَةَ إِمۡلَٰقٖۖ نَّحۡنُ نَرۡزُقُهُمۡ وَإِيَّاكُمۡۚ إِنَّ قَتۡلَهُمۡ كَانَ خِطۡـٔٗا كَبِيرٗا","End":"٣١"},{"SurahNumber":17,"VerseNumber":32,"Text":"وَلَا تَقۡرَبُواْ ٱلزِّنَىٰٓۖ إِنَّهُۥ كَانَ فَٰحِشَةٗ وَسَآءَ سَبِيلٗا","End":"٣٢"},{"SurahNumber":17,"VerseNumber":33,"Text":"وَلَا تَقۡتُلُواْ ٱلنَّفۡسَ ٱلَّتِي حَرَّمَ ٱللَّهُ إِلَّا بِٱلۡحَقِّۗ وَمَن قُتِلَ مَظۡلُومٗا فَقَدۡ جَعَلۡنَا لِوَلِيِّهِۦ سُلۡطَٰنٗا فَلَا يُسۡرِف فِّي ٱلۡقَتۡلِۖ إِنَّهُۥ كَانَ مَنصُورٗا","End":"٣٣"},{"SurahNumber":17,"VerseNumber":34,"Text":"وَلَا تَقۡرَبُواْ مَالَ ٱلۡيَتِيمِ إِلَّا بِٱلَّتِي هِيَ أَحۡسَنُ حَتَّىٰ يَبۡلُغَ أَشُدَّهُۥۚ وَأَوۡفُواْ بِٱلۡعَهۡدِۖ إِنَّ ٱلۡعَهۡدَ كَانَ مَسۡـُٔولٗا","End":"٣٤"},{"SurahNumber":17,"VerseNumber":35,"Text":"وَأَوۡفُواْ ٱلۡكَيۡلَ إِذَا كِلۡتُمۡ وَزِنُواْ بِٱلۡقِسۡطَاسِ ٱلۡمُسۡتَقِيمِۚ ذَٰلِكَ خَيۡرٞ وَأَحۡسَنُ تَأۡوِيلٗا","End":"٣٥"},{"SurahNumber":17,"VerseNumber":36,"Text":"وَلَا تَقۡفُ مَا لَيۡسَ لَكَ بِهِۦ عِلۡمٌۚ إِنَّ ٱلسَّمۡعَ وَٱلۡبَصَرَ وَٱلۡفُؤَادَ كُلُّ أُوْلَـٰٓئِكَ كَانَ عَنۡهُ مَسۡـُٔولٗا","End":"٣٦"},{"SurahNumber":17,"VerseNumber":37,"Text":"وَلَا تَمۡشِ فِي ٱلۡأَرۡضِ مَرَحًاۖ إِنَّكَ لَن تَخۡرِقَ ٱلۡأَرۡضَ وَلَن تَبۡلُغَ ٱلۡجِبَالَ طُولٗا","End":"٣٧"},{"SurahNumber":17,"VerseNumber":38,"Text":"كُلُّ ذَٰلِكَ كَانَ سَيِّئُهُۥ عِندَ رَبِّكَ مَكۡرُوهٗا","End":"٣٨"},{"SurahNumber":17,"VerseNumber":39,"Text":"ذَٰلِكَ مِمَّآ أَوۡحَىٰٓ إِلَيۡكَ رَبُّكَ مِنَ ٱلۡحِكۡمَةِۗ وَلَا تَجۡعَلۡ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ فَتُلۡقَىٰ فِي جَهَنَّمَ مَلُومٗا مَّدۡحُورًا","End":"٣٩"},{"SurahNumber":17,"VerseNumber":40,"Text":"أَفَأَصۡفَىٰكُمۡ رَبُّكُم بِٱلۡبَنِينَ وَٱتَّخَذَ مِنَ ٱلۡمَلَـٰٓئِكَةِ إِنَٰثًاۚ إِنَّكُمۡ لَتَقُولُونَ قَوۡلًا عَظِيمٗا","End":"٤٠"},{"SurahNumber":17,"VerseNumber":41,"Text":"وَلَقَدۡ صَرَّفۡنَا فِي هَٰذَا ٱلۡقُرۡءَانِ لِيَذَّكَّرُواْ وَمَا يَزِيدُهُمۡ إِلَّا نُفُورٗا","End":"٤١"},{"SurahNumber":17,"VerseNumber":42,"Text":"قُل لَّوۡ كَانَ مَعَهُۥٓ ءَالِهَةٞ كَمَا يَقُولُونَ إِذٗا لَّٱبۡتَغَوۡاْ إِلَىٰ ذِي ٱلۡعَرۡشِ سَبِيلٗا","End":"٤٢"},{"SurahNumber":17,"VerseNumber":43,"Text":"سُبۡحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يَقُولُونَ عُلُوّٗا كَبِيرٗا","End":"٤٣"},{"SurahNumber":17,"VerseNumber":44,"Text":"تُسَبِّحُ لَهُ ٱلسَّمَٰوَٰتُ ٱلسَّبۡعُ وَٱلۡأَرۡضُ وَمَن فِيهِنَّۚ وَإِن مِّن شَيۡءٍ إِلَّا يُسَبِّحُ بِحَمۡدِهِۦ وَلَٰكِن لَّا تَفۡقَهُونَ تَسۡبِيحَهُمۡۚ إِنَّهُۥ كَانَ حَلِيمًا غَفُورٗا","End":"٤٤"},{"SurahNumber":17,"VerseNumber":45,"Text":"وَإِذَا قَرَأۡتَ ٱلۡقُرۡءَانَ جَعَلۡنَا بَيۡنَكَ وَبَيۡنَ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ حِجَابٗا مَّسۡتُورٗا","End":"٤٥"},{"SurahNumber":17,"VerseNumber":46,"Text":"وَجَعَلۡنَا عَلَىٰ قُلُوبِهِمۡ أَكِنَّةً أَن يَفۡقَهُوهُ وَفِيٓ ءَاذَانِهِمۡ وَقۡرٗاۚ وَإِذَا ذَكَرۡتَ رَبَّكَ فِي ٱلۡقُرۡءَانِ وَحۡدَهُۥ وَلَّوۡاْ عَلَىٰٓ أَدۡبَٰرِهِمۡ نُفُورٗا","End":"٤٦"},{"SurahNumber":17,"VerseNumber":47,"Text":"نَّحۡنُ أَعۡلَمُ بِمَا يَسۡتَمِعُونَ بِهِۦٓ إِذۡ يَسۡتَمِعُونَ إِلَيۡكَ وَإِذۡ هُمۡ نَجۡوَىٰٓ إِذۡ يَقُولُ ٱلظَّـٰلِمُونَ إِن تَتَّبِعُونَ إِلَّا رَجُلٗا مَّسۡحُورًا","End":"٤٧"},{"SurahNumber":17,"VerseNumber":48,"Text":"ٱنظُرۡ كَيۡفَ ضَرَبُواْ لَكَ ٱلۡأَمۡثَالَ فَضَلُّواْ فَلَا يَسۡتَطِيعُونَ سَبِيلٗا","End":"٤٨"},{"SurahNumber":17,"VerseNumber":49,"Text":"وَقَالُوٓاْ أَءِذَا كُنَّا عِظَٰمٗا وَرُفَٰتًا أَءِنَّا لَمَبۡعُوثُونَ خَلۡقٗا جَدِيدٗا","End":"٤٩"},{"SurahNumber":17,"VerseNumber":50,"Text":"۞قُلۡ كُونُواْ حِجَارَةً أَوۡ حَدِيدًا","End":"٥٠"},{"SurahNumber":17,"VerseNumber":51,"Text":"أَوۡ خَلۡقٗا مِّمَّا يَكۡبُرُ فِي صُدُورِكُمۡۚ فَسَيَقُولُونَ مَن يُعِيدُنَاۖ قُلِ ٱلَّذِي فَطَرَكُمۡ أَوَّلَ مَرَّةٖۚ فَسَيُنۡغِضُونَ إِلَيۡكَ رُءُوسَهُمۡ وَيَقُولُونَ مَتَىٰ هُوَۖ قُلۡ عَسَىٰٓ أَن يَكُونَ قَرِيبٗا","End":"٥١"},{"SurahNumber":17,"VerseNumber":52,"Text":"يَوۡمَ يَدۡعُوكُمۡ فَتَسۡتَجِيبُونَ بِحَمۡدِهِۦ وَتَظُنُّونَ إِن لَّبِثۡتُمۡ إِلَّا قَلِيلٗا","End":"٥٢"},{"SurahNumber":17,"VerseNumber":53,"Text":"وَقُل لِّعِبَادِي يَقُولُواْ ٱلَّتِي هِيَ أَحۡسَنُۚ إِنَّ ٱلشَّيۡطَٰنَ يَنزَغُ بَيۡنَهُمۡۚ إِنَّ ٱلشَّيۡطَٰنَ كَانَ لِلۡإِنسَٰنِ عَدُوّٗا مُّبِينٗا","End":"٥٣"},{"SurahNumber":17,"VerseNumber":54,"Text":"رَّبُّكُمۡ أَعۡلَمُ بِكُمۡۖ إِن يَشَأۡ يَرۡحَمۡكُمۡ أَوۡ إِن يَشَأۡ يُعَذِّبۡكُمۡۚ وَمَآ أَرۡسَلۡنَٰكَ عَلَيۡهِمۡ وَكِيلٗا","End":"٥٤"},{"SurahNumber":17,"VerseNumber":55,"Text":"وَرَبُّكَ أَعۡلَمُ بِمَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۗ وَلَقَدۡ فَضَّلۡنَا بَعۡضَ ٱلنَّبِيِّـۧنَ عَلَىٰ بَعۡضٖۖ وَءَاتَيۡنَا دَاوُۥدَ زَبُورٗا","End":"٥٥"},{"SurahNumber":17,"VerseNumber":56,"Text":"قُلِ ٱدۡعُواْ ٱلَّذِينَ زَعَمۡتُم مِّن دُونِهِۦ فَلَا يَمۡلِكُونَ كَشۡفَ ٱلضُّرِّ عَنكُمۡ وَلَا تَحۡوِيلًا","End":"٥٦"},{"SurahNumber":17,"VerseNumber":57,"Text":"أُوْلَـٰٓئِكَ ٱلَّذِينَ يَدۡعُونَ يَبۡتَغُونَ إِلَىٰ رَبِّهِمُ ٱلۡوَسِيلَةَ أَيُّهُمۡ أَقۡرَبُ وَيَرۡجُونَ رَحۡمَتَهُۥ وَيَخَافُونَ عَذَابَهُۥٓۚ إِنَّ عَذَابَ رَبِّكَ كَانَ مَحۡذُورٗا","End":"٥٧"},{"SurahNumber":17,"VerseNumber":58,"Text":"وَإِن مِّن قَرۡيَةٍ إِلَّا نَحۡنُ مُهۡلِكُوهَا قَبۡلَ يَوۡمِ ٱلۡقِيَٰمَةِ أَوۡ مُعَذِّبُوهَا عَذَابٗا شَدِيدٗاۚ كَانَ ذَٰلِكَ فِي ٱلۡكِتَٰبِ مَسۡطُورٗا","End":"٥٨"},{"SurahNumber":17,"VerseNumber":59,"Text":"وَمَا مَنَعَنَآ أَن نُّرۡسِلَ بِٱلۡأٓيَٰتِ إِلَّآ أَن كَذَّبَ بِهَا ٱلۡأَوَّلُونَۚ وَءَاتَيۡنَا ثَمُودَ ٱلنَّاقَةَ مُبۡصِرَةٗ فَظَلَمُواْ بِهَاۚ وَمَا نُرۡسِلُ بِٱلۡأٓيَٰتِ إِلَّا تَخۡوِيفٗا","End":"٥٩"},{"SurahNumber":17,"VerseNumber":60,"Text":"وَإِذۡ قُلۡنَا لَكَ إِنَّ رَبَّكَ أَحَاطَ بِٱلنَّاسِۚ وَمَا جَعَلۡنَا ٱلرُّءۡيَا ٱلَّتِيٓ أَرَيۡنَٰكَ إِلَّا فِتۡنَةٗ لِّلنَّاسِ وَٱلشَّجَرَةَ ٱلۡمَلۡعُونَةَ فِي ٱلۡقُرۡءَانِۚ وَنُخَوِّفُهُمۡ فَمَا يَزِيدُهُمۡ إِلَّا طُغۡيَٰنٗا كَبِيرٗا","End":"٦٠"},{"SurahNumber":17,"VerseNumber":61,"Text":"وَإِذۡ قُلۡنَا لِلۡمَلَـٰٓئِكَةِ ٱسۡجُدُواْ لِأٓدَمَ فَسَجَدُوٓاْ إِلَّآ إِبۡلِيسَ قَالَ ءَأَسۡجُدُ لِمَنۡ خَلَقۡتَ طِينٗا","End":"٦١"},{"SurahNumber":17,"VerseNumber":62,"Text":"قَالَ أَرَءَيۡتَكَ هَٰذَا ٱلَّذِي كَرَّمۡتَ عَلَيَّ لَئِنۡ أَخَّرۡتَنِ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِ لَأَحۡتَنِكَنَّ ذُرِّيَّتَهُۥٓ إِلَّا قَلِيلٗا","End":"٦٢"},{"SurahNumber":17,"VerseNumber":63,"Text":"قَالَ ٱذۡهَبۡ فَمَن تَبِعَكَ مِنۡهُمۡ فَإِنَّ جَهَنَّمَ جَزَآؤُكُمۡ جَزَآءٗ مَّوۡفُورٗا","End":"٦٣"},{"SurahNumber":17,"VerseNumber":64,"Text":"وَٱسۡتَفۡزِزۡ مَنِ ٱسۡتَطَعۡتَ مِنۡهُم بِصَوۡتِكَ وَأَجۡلِبۡ عَلَيۡهِم بِخَيۡلِكَ وَرَجِلِكَ وَشَارِكۡهُمۡ فِي ٱلۡأَمۡوَٰلِ وَٱلۡأَوۡلَٰدِ وَعِدۡهُمۡۚ وَمَا يَعِدُهُمُ ٱلشَّيۡطَٰنُ إِلَّا غُرُورًا","End":"٦٤"},{"SurahNumber":17,"VerseNumber":65,"Text":"إِنَّ عِبَادِي لَيۡسَ لَكَ عَلَيۡهِمۡ سُلۡطَٰنٞۚ وَكَفَىٰ بِرَبِّكَ وَكِيلٗا","End":"٦٥"},{"SurahNumber":17,"VerseNumber":66,"Text":"رَّبُّكُمُ ٱلَّذِي يُزۡجِي لَكُمُ ٱلۡفُلۡكَ فِي ٱلۡبَحۡرِ لِتَبۡتَغُواْ مِن فَضۡلِهِۦٓۚ إِنَّهُۥ كَانَ بِكُمۡ رَحِيمٗا","End":"٦٦"},{"SurahNumber":17,"VerseNumber":67,"Text":"وَإِذَا مَسَّكُمُ ٱلضُّرُّ فِي ٱلۡبَحۡرِ ضَلَّ مَن تَدۡعُونَ إِلَّآ إِيَّاهُۖ فَلَمَّا نَجَّىٰكُمۡ إِلَى ٱلۡبَرِّ أَعۡرَضۡتُمۡۚ وَكَانَ ٱلۡإِنسَٰنُ كَفُورًا","End":"٦٧"},{"SurahNumber":17,"VerseNumber":68,"Text":"أَفَأَمِنتُمۡ أَن يَخۡسِفَ بِكُمۡ جَانِبَ ٱلۡبَرِّ أَوۡ يُرۡسِلَ عَلَيۡكُمۡ حَاصِبٗا ثُمَّ لَا تَجِدُواْ لَكُمۡ وَكِيلًا","End":"٦٨"},{"SurahNumber":17,"VerseNumber":69,"Text":"أَمۡ أَمِنتُمۡ أَن يُعِيدَكُمۡ فِيهِ تَارَةً أُخۡرَىٰ فَيُرۡسِلَ عَلَيۡكُمۡ قَاصِفٗا مِّنَ ٱلرِّيحِ فَيُغۡرِقَكُم بِمَا كَفَرۡتُمۡ ثُمَّ لَا تَجِدُواْ لَكُمۡ عَلَيۡنَا بِهِۦ تَبِيعٗا","End":"٦٩"},{"SurahNumber":17,"VerseNumber":70,"Text":"۞وَلَقَدۡ كَرَّمۡنَا بَنِيٓ ءَادَمَ وَحَمَلۡنَٰهُمۡ فِي ٱلۡبَرِّ وَٱلۡبَحۡرِ وَرَزَقۡنَٰهُم مِّنَ ٱلطَّيِّبَٰتِ وَفَضَّلۡنَٰهُمۡ عَلَىٰ كَثِيرٖ مِّمَّنۡ خَلَقۡنَا تَفۡضِيلٗا","End":"٧٠"},{"SurahNumber":17,"VerseNumber":71,"Text":"يَوۡمَ نَدۡعُواْ كُلَّ أُنَاسِۭ بِإِمَٰمِهِمۡۖ فَمَنۡ أُوتِيَ كِتَٰبَهُۥ بِيَمِينِهِۦ فَأُوْلَـٰٓئِكَ يَقۡرَءُونَ كِتَٰبَهُمۡ وَلَا يُظۡلَمُونَ فَتِيلٗا","End":"٧١"},{"SurahNumber":17,"VerseNumber":72,"Text":"وَمَن كَانَ فِي هَٰذِهِۦٓ أَعۡمَىٰ فَهُوَ فِي ٱلۡأٓخِرَةِ أَعۡمَىٰ وَأَضَلُّ سَبِيلٗا","End":"٧٢"},{"SurahNumber":17,"VerseNumber":73,"Text":"وَإِن كَادُواْ لَيَفۡتِنُونَكَ عَنِ ٱلَّذِيٓ أَوۡحَيۡنَآ إِلَيۡكَ لِتَفۡتَرِيَ عَلَيۡنَا غَيۡرَهُۥۖ وَإِذٗا لَّٱتَّخَذُوكَ خَلِيلٗا","End":"٧٣"},{"SurahNumber":17,"VerseNumber":74,"Text":"وَلَوۡلَآ أَن ثَبَّتۡنَٰكَ لَقَدۡ كِدتَّ تَرۡكَنُ إِلَيۡهِمۡ شَيۡـٔٗا قَلِيلًا","End":"٧٤"},{"SurahNumber":17,"VerseNumber":75,"Text":"إِذٗا لَّأَذَقۡنَٰكَ ضِعۡفَ ٱلۡحَيَوٰةِ وَضِعۡفَ ٱلۡمَمَاتِ ثُمَّ لَا تَجِدُ لَكَ عَلَيۡنَا نَصِيرٗا","End":"٧٥"},{"SurahNumber":17,"VerseNumber":76,"Text":"وَإِن كَادُواْ لَيَسۡتَفِزُّونَكَ مِنَ ٱلۡأَرۡضِ لِيُخۡرِجُوكَ مِنۡهَاۖ وَإِذٗا لَّا يَلۡبَثُونَ خِلَٰفَكَ إِلَّا قَلِيلٗا","End":"٧٦"},{"SurahNumber":17,"VerseNumber":77,"Text":"سُنَّةَ مَن قَدۡ أَرۡسَلۡنَا قَبۡلَكَ مِن رُّسُلِنَاۖ وَلَا تَجِدُ لِسُنَّتِنَا تَحۡوِيلًا","End":"٧٧"},{"SurahNumber":17,"VerseNumber":78,"Text":"أَقِمِ ٱلصَّلَوٰةَ لِدُلُوكِ ٱلشَّمۡسِ إِلَىٰ غَسَقِ ٱلَّيۡلِ وَقُرۡءَانَ ٱلۡفَجۡرِۖ إِنَّ قُرۡءَانَ ٱلۡفَجۡرِ كَانَ مَشۡهُودٗا","End":"٧٨"},{"SurahNumber":17,"VerseNumber":79,"Text":"وَمِنَ ٱلَّيۡلِ فَتَهَجَّدۡ بِهِۦ نَافِلَةٗ لَّكَ عَسَىٰٓ أَن يَبۡعَثَكَ رَبُّكَ مَقَامٗا مَّحۡمُودٗا","End":"٧٩"},{"SurahNumber":17,"VerseNumber":80,"Text":"وَقُل رَّبِّ أَدۡخِلۡنِي مُدۡخَلَ صِدۡقٖ وَأَخۡرِجۡنِي مُخۡرَجَ صِدۡقٖ وَٱجۡعَل لِّي مِن لَّدُنكَ سُلۡطَٰنٗا نَّصِيرٗا","End":"٨٠"},{"SurahNumber":17,"VerseNumber":81,"Text":"وَقُلۡ جَآءَ ٱلۡحَقُّ وَزَهَقَ ٱلۡبَٰطِلُۚ إِنَّ ٱلۡبَٰطِلَ كَانَ زَهُوقٗا","End":"٨١"},{"SurahNumber":17,"VerseNumber":82,"Text":"وَنُنَزِّلُ مِنَ ٱلۡقُرۡءَانِ مَا هُوَ شِفَآءٞ وَرَحۡمَةٞ لِّلۡمُؤۡمِنِينَ وَلَا يَزِيدُ ٱلظَّـٰلِمِينَ إِلَّا خَسَارٗا","End":"٨٢"},{"SurahNumber":17,"VerseNumber":83,"Text":"وَإِذَآ أَنۡعَمۡنَا عَلَى ٱلۡإِنسَٰنِ أَعۡرَضَ وَنَـَٔا بِجَانِبِهِۦ وَإِذَا مَسَّهُ ٱلشَّرُّ كَانَ يَـُٔوسٗا","End":"٨٣"},{"SurahNumber":17,"VerseNumber":84,"Text":"قُلۡ كُلّٞ يَعۡمَلُ عَلَىٰ شَاكِلَتِهِۦ فَرَبُّكُمۡ أَعۡلَمُ بِمَنۡ هُوَ أَهۡدَىٰ سَبِيلٗا","End":"٨٤"},{"SurahNumber":17,"VerseNumber":85,"Text":"وَيَسۡـَٔلُونَكَ عَنِ ٱلرُّوحِۖ قُلِ ٱلرُّوحُ مِنۡ أَمۡرِ رَبِّي وَمَآ أُوتِيتُم مِّنَ ٱلۡعِلۡمِ إِلَّا قَلِيلٗا","End":"٨٥"},{"SurahNumber":17,"VerseNumber":86,"Text":"وَلَئِن شِئۡنَا لَنَذۡهَبَنَّ بِٱلَّذِيٓ أَوۡحَيۡنَآ إِلَيۡكَ ثُمَّ لَا تَجِدُ لَكَ بِهِۦ عَلَيۡنَا وَكِيلًا","End":"٨٦"},{"SurahNumber":17,"VerseNumber":87,"Text":"إِلَّا رَحۡمَةٗ مِّن رَّبِّكَۚ إِنَّ فَضۡلَهُۥ كَانَ عَلَيۡكَ كَبِيرٗا","End":"٨٧"},{"SurahNumber":17,"VerseNumber":88,"Text":"قُل لَّئِنِ ٱجۡتَمَعَتِ ٱلۡإِنسُ وَٱلۡجِنُّ عَلَىٰٓ أَن يَأۡتُواْ بِمِثۡلِ هَٰذَا ٱلۡقُرۡءَانِ لَا يَأۡتُونَ بِمِثۡلِهِۦ وَلَوۡ كَانَ بَعۡضُهُمۡ لِبَعۡضٖ ظَهِيرٗا","End":"٨٨"},{"SurahNumber":17,"VerseNumber":89,"Text":"وَلَقَدۡ صَرَّفۡنَا لِلنَّاسِ فِي هَٰذَا ٱلۡقُرۡءَانِ مِن كُلِّ مَثَلٖ فَأَبَىٰٓ أَكۡثَرُ ٱلنَّاسِ إِلَّا كُفُورٗا","End":"٨٩"},{"SurahNumber":17,"VerseNumber":90,"Text":"وَقَالُواْ لَن نُّؤۡمِنَ لَكَ حَتَّىٰ تَفۡجُرَ لَنَا مِنَ ٱلۡأَرۡضِ يَنۢبُوعًا","End":"٩٠"},{"SurahNumber":17,"VerseNumber":91,"Text":"أَوۡ تَكُونَ لَكَ جَنَّةٞ مِّن نَّخِيلٖ وَعِنَبٖ فَتُفَجِّرَ ٱلۡأَنۡهَٰرَ خِلَٰلَهَا تَفۡجِيرًا","End":"٩١"},{"SurahNumber":17,"VerseNumber":92,"Text":"أَوۡ تُسۡقِطَ ٱلسَّمَآءَ كَمَا زَعَمۡتَ عَلَيۡنَا كِسَفًا أَوۡ تَأۡتِيَ بِٱللَّهِ وَٱلۡمَلَـٰٓئِكَةِ قَبِيلًا","End":"٩٢"},{"SurahNumber":17,"VerseNumber":93,"Text":"أَوۡ يَكُونَ لَكَ بَيۡتٞ مِّن زُخۡرُفٍ أَوۡ تَرۡقَىٰ فِي ٱلسَّمَآءِ وَلَن نُّؤۡمِنَ لِرُقِيِّكَ حَتَّىٰ تُنَزِّلَ عَلَيۡنَا كِتَٰبٗا نَّقۡرَؤُهُۥۗ قُلۡ سُبۡحَانَ رَبِّي هَلۡ كُنتُ إِلَّا بَشَرٗا رَّسُولٗا","End":"٩٣"},{"SurahNumber":17,"VerseNumber":94,"Text":"وَمَا مَنَعَ ٱلنَّاسَ أَن يُؤۡمِنُوٓاْ إِذۡ جَآءَهُمُ ٱلۡهُدَىٰٓ إِلَّآ أَن قَالُوٓاْ أَبَعَثَ ٱللَّهُ بَشَرٗا رَّسُولٗا","End":"٩٤"},{"SurahNumber":17,"VerseNumber":95,"Text":"قُل لَّوۡ كَانَ فِي ٱلۡأَرۡضِ مَلَـٰٓئِكَةٞ يَمۡشُونَ مُطۡمَئِنِّينَ لَنَزَّلۡنَا عَلَيۡهِم مِّنَ ٱلسَّمَآءِ مَلَكٗا رَّسُولٗا","End":"٩٥"},{"SurahNumber":17,"VerseNumber":96,"Text":"قُلۡ كَفَىٰ بِٱللَّهِ شَهِيدَۢا بَيۡنِي وَبَيۡنَكُمۡۚ إِنَّهُۥ كَانَ بِعِبَادِهِۦ خَبِيرَۢا بَصِيرٗا","End":"٩٦"},{"SurahNumber":17,"VerseNumber":97,"Text":"وَمَن يَهۡدِ ٱللَّهُ فَهُوَ ٱلۡمُهۡتَدِۖ وَمَن يُضۡلِلۡ فَلَن تَجِدَ لَهُمۡ أَوۡلِيَآءَ مِن دُونِهِۦۖ وَنَحۡشُرُهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ عَلَىٰ وُجُوهِهِمۡ عُمۡيٗا وَبُكۡمٗا وَصُمّٗاۖ مَّأۡوَىٰهُمۡ جَهَنَّمُۖ كُلَّمَا خَبَتۡ زِدۡنَٰهُمۡ سَعِيرٗا","End":"٩٧"},{"SurahNumber":17,"VerseNumber":98,"Text":"ذَٰلِكَ جَزَآؤُهُم بِأَنَّهُمۡ كَفَرُواْ بِـَٔايَٰتِنَا وَقَالُوٓاْ أَءِذَا كُنَّا عِظَٰمٗا وَرُفَٰتًا أَءِنَّا لَمَبۡعُوثُونَ خَلۡقٗا جَدِيدًا","End":"٩٨"},{"SurahNumber":17,"VerseNumber":99,"Text":"۞أَوَلَمۡ يَرَوۡاْ أَنَّ ٱللَّهَ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ قَادِرٌ عَلَىٰٓ أَن يَخۡلُقَ مِثۡلَهُمۡ وَجَعَلَ لَهُمۡ أَجَلٗا لَّا رَيۡبَ فِيهِ فَأَبَى ٱلظَّـٰلِمُونَ إِلَّا كُفُورٗا","End":"٩٩"},{"SurahNumber":17,"VerseNumber":100,"Text":"قُل لَّوۡ أَنتُمۡ تَمۡلِكُونَ خَزَآئِنَ رَحۡمَةِ رَبِّيٓ إِذٗا لَّأَمۡسَكۡتُمۡ خَشۡيَةَ ٱلۡإِنفَاقِۚ وَكَانَ ٱلۡإِنسَٰنُ قَتُورٗا","End":"١٠٠"},{"SurahNumber":17,"VerseNumber":101,"Text":"وَلَقَدۡ ءَاتَيۡنَا مُوسَىٰ تِسۡعَ ءَايَٰتِۭ بَيِّنَٰتٖۖ فَسۡـَٔلۡ بَنِيٓ إِسۡرَـٰٓءِيلَ إِذۡ جَآءَهُمۡ فَقَالَ لَهُۥ فِرۡعَوۡنُ إِنِّي لَأَظُنُّكَ يَٰمُوسَىٰ مَسۡحُورٗا","End":"١٠١"},{"SurahNumber":17,"VerseNumber":102,"Text":"قَالَ لَقَدۡ عَلِمۡتَ مَآ أَنزَلَ هَـٰٓؤُلَآءِ إِلَّا رَبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ بَصَآئِرَ وَإِنِّي لَأَظُنُّكَ يَٰفِرۡعَوۡنُ مَثۡبُورٗا","End":"١٠٢"},{"SurahNumber":17,"VerseNumber":103,"Text":"فَأَرَادَ أَن يَسۡتَفِزَّهُم مِّنَ ٱلۡأَرۡضِ فَأَغۡرَقۡنَٰهُ وَمَن مَّعَهُۥ جَمِيعٗا","End":"١٠٣"},{"SurahNumber":17,"VerseNumber":104,"Text":"وَقُلۡنَا مِنۢ بَعۡدِهِۦ لِبَنِيٓ إِسۡرَـٰٓءِيلَ ٱسۡكُنُواْ ٱلۡأَرۡضَ فَإِذَا جَآءَ وَعۡدُ ٱلۡأٓخِرَةِ جِئۡنَا بِكُمۡ لَفِيفٗا","End":"١٠٤"},{"SurahNumber":17,"VerseNumber":105,"Text":"وَبِٱلۡحَقِّ أَنزَلۡنَٰهُ وَبِٱلۡحَقِّ نَزَلَۗ وَمَآ أَرۡسَلۡنَٰكَ إِلَّا مُبَشِّرٗا وَنَذِيرٗا","End":"١٠٥"},{"SurahNumber":17,"VerseNumber":106,"Text":"وَقُرۡءَانٗا فَرَقۡنَٰهُ لِتَقۡرَأَهُۥ عَلَى ٱلنَّاسِ عَلَىٰ مُكۡثٖ وَنَزَّلۡنَٰهُ تَنزِيلٗا","End":"١٠٦"},{"SurahNumber":17,"VerseNumber":107,"Text":"قُلۡ ءَامِنُواْ بِهِۦٓ أَوۡ لَا تُؤۡمِنُوٓاْۚ إِنَّ ٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ مِن قَبۡلِهِۦٓ إِذَا يُتۡلَىٰ عَلَيۡهِمۡ يَخِرُّونَۤ لِلۡأَذۡقَانِۤ سُجَّدٗاۤ","End":"١٠٧"},{"SurahNumber":17,"VerseNumber":108,"Text":"وَيَقُولُونَ سُبۡحَٰنَ رَبِّنَآ إِن كَانَ وَعۡدُ رَبِّنَا لَمَفۡعُولٗا","End":"١٠٨"},{"SurahNumber":17,"VerseNumber":109,"Text":"وَيَخِرُّونَ لِلۡأَذۡقَانِ يَبۡكُونَ وَيَزِيدُهُمۡ خُشُوعٗا۩","End":"١٠٩"},{"SurahNumber":17,"VerseNumber":110,"Text":"قُلِ ٱدۡعُواْ ٱللَّهَ أَوِ ٱدۡعُواْ ٱلرَّحۡمَٰنَۖ أَيّٗا مَّا تَدۡعُواْ فَلَهُ ٱلۡأَسۡمَآءُ ٱلۡحُسۡنَىٰۚ وَلَا تَجۡهَرۡ بِصَلَاتِكَ وَلَا تُخَافِتۡ بِهَا وَٱبۡتَغِ بَيۡنَ ذَٰلِكَ سَبِيلٗا","End":"١١٠"},{"SurahNumber":17,"VerseNumber":111,"Text":"وَقُلِ ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي لَمۡ يَتَّخِذۡ وَلَدٗا وَلَمۡ يَكُن لَّهُۥ شَرِيكٞ فِي ٱلۡمُلۡكِ وَلَمۡ يَكُن لَّهُۥ وَلِيّٞ مِّنَ ٱلذُّلِّۖ وَكَبِّرۡهُ تَكۡبِيرَۢا","End":"١١١"}],"Translations":[{"Id":10,"LanguageCode":"ara","Name":"ara-quran-la","Author":"Quran Transliteration","Language":"Arabic","Description":"Arabic - Latinised","Direction":"ltr","Source":"http://tanzil.net","Translations":[{"SurahNumber":17,"VerseNumber":1,"Text":"Subhana allathee asra biAAabdihi laylan mina almasjidi alharami ila almasjidi alaqsa allathee barakna hawlahu linuriyahu min ayatina innahu huwa alssameeAAu albaseeru"},{"SurahNumber":17,"VerseNumber":2,"Text":"Waatayna moosa alkitaba wajaAAalnahu hudan libanee israeela alla tattakhithoo min doonee wakeelan"},{"SurahNumber":17,"VerseNumber":3,"Text":"Thurriyyata man hamalna maAAa noohin innahu kana AAabdan shakooran"},{"SurahNumber":17,"VerseNumber":4,"Text":"Waqadayna ila banee israeela fee alkitabi latufsidunna fee alardi marratayni walataAAlunna AAuluwwan kabeeran"},{"SurahNumber":17,"VerseNumber":5,"Text":"Faitha jaa waAAdu oolahuma baAAathna AAalaykum AAibadan lana olee basin shadeedin fajasoo khilala alddiyari wakana waAAdan mafAAoolan"},{"SurahNumber":17,"VerseNumber":6,"Text":"Thumma radadna lakumu alkarrata AAalayhim waamdadnakum biamwalin wabaneena wajaAAalnakum akthara nafeeran"},{"SurahNumber":17,"VerseNumber":7,"Text":"In ahsantum ahsantum lianfusikum wain asatum falaha faitha jaa waAAdu alakhirati liyasoooo wujoohakum waliyadkhuloo almasjida kama dakhaloohu awwala marratin waliyutabbiroo ma AAalaw tatbeeran"},{"SurahNumber":17,"VerseNumber":8,"Text":"AAasa rabbukum an yarhamakum wain AAudtum AAudna wajaAAalna jahannama lilkafireena haseeran"},{"SurahNumber":17,"VerseNumber":9,"Text":"Inna hatha alqurana yahdee lillatee hiya aqwamu wayubashshiru almumineena allatheena yaAAmaloona alssalihati anna lahum ajran kabeeran"},{"SurahNumber":17,"VerseNumber":10,"Text":"Waanna allatheena la yuminoona bialakhirati aAAtadna lahum AAathaban aleeman"},{"SurahNumber":17,"VerseNumber":11,"Text":"WayadAAu alinsanu bialshsharri duAAaahu bialkhayri wakana alinsanu AAajoolan"},{"SurahNumber":17,"VerseNumber":12,"Text":"WajaAAalna allayla waalnnahara ayatayni famahawna ayata allayli wajaAAalna ayata alnnahari mubsiratan litabtaghoo fadlan min rabbikum walitaAAlamoo AAadada alssineena waalhisaba wakulla shayin fassalnahu tafseelan"},{"SurahNumber":17,"VerseNumber":13,"Text":"Wakulla insanin alzamnahu tairahu fee AAunuqihi wanukhriju lahu yawma alqiyamati kitaban yalqahu manshooran"},{"SurahNumber":17,"VerseNumber":14,"Text":"Iqra kitabaka kafa binafsika alyawma AAalayka haseeban"},{"SurahNumber":17,"VerseNumber":15,"Text":"Mani ihtada fainnama yahtadee linafsihi waman dalla fainnama yadillu AAalayha wala taziru waziratun wizra okhra wama kunna muAAaththibeena hatta nabAAatha rasoolan"},{"SurahNumber":17,"VerseNumber":16,"Text":"Waitha aradna an nuhlika qaryatan amarna mutrafeeha fafasaqoo feeha fahaqqa AAalayha alqawlu fadammarnaha tadmeeran"},{"SurahNumber":17,"VerseNumber":17,"Text":"Wakam ahlakna mina alqurooni min baAAdi noohin wakafa birabbika bithunoobi AAibadihi khabeeran baseeran"},{"SurahNumber":17,"VerseNumber":18,"Text":"Man kana yureedu alAAajilata AAajjalna lahu feeha ma nashao liman nureedu thumma jaAAalna lahu jahannama yaslaha mathmooman madhooran"},{"SurahNumber":17,"VerseNumber":19,"Text":"Waman arada alakhirata wasaAAa laha saAAyaha wahuwa muminun faolaika kana saAAyuhum mashkooran"},{"SurahNumber":17,"VerseNumber":20,"Text":"Kullan numiddu haolai wahaolai min AAatai rabbika wama kana AAatao rabbika mahthooran"},{"SurahNumber":17,"VerseNumber":21,"Text":"Onthur kayfa faddalna baAAdahum AAala baAAdin walalakhiratu akbaru darajatin waakbaru tafdeelan"},{"SurahNumber":17,"VerseNumber":22,"Text":"La tajAAal maAAa Allahi ilahan akhara fataqAAuda mathmooman makhthoolan"},{"SurahNumber":17,"VerseNumber":23,"Text":"Waqada rabbuka alla taAAbudoo illa iyyahu wabialwalidayni ihsanan imma yablughanna AAindaka alkibara ahaduhuma aw kilahuma fala taqul lahuma offin wala tanharhuma waqul lahuma qawlan kareeman"},{"SurahNumber":17,"VerseNumber":24,"Text":"Waikhfid lahuma janaha alththulli mina alrrahmati waqul rabbi irhamhuma kama rabbayanee sagheeran"},{"SurahNumber":17,"VerseNumber":25,"Text":"Rabbukum aAAlamu bima fee nufoosikum in takoonoo saliheena fainnahu kana lilawwabeena ghafooran"},{"SurahNumber":17,"VerseNumber":26,"Text":"Waati tha alqurba haqqahu waalmiskeena waibna alssabeeli wala tubaththir tabtheeran"},{"SurahNumber":17,"VerseNumber":27,"Text":"Inna almubaththireena kanoo ikhwana alshshayateeni wakana alshshaytanu lirabbihi kafooran"},{"SurahNumber":17,"VerseNumber":28,"Text":"Waimma tuAAridanna AAanhumu ibtighaa rahmatin min rabbika tarjooha faqul lahum qawlan maysooran"},{"SurahNumber":17,"VerseNumber":29,"Text":"Wala tajAAal yadaka maghloolatan ila AAunuqika wala tabsutha kulla albasti fataqAAuda malooman mahsooran"},{"SurahNumber":17,"VerseNumber":30,"Text":"Inna rabbaka yabsutu alrrizqa liman yashao wayaqdiru innahu kana biAAibadihi khabeeran baseeran"},{"SurahNumber":17,"VerseNumber":31,"Text":"Wala taqtuloo awladakum khashyata imlaqin nahnu narzuquhum waiyyakum inna qatlahum kana khitan kabeeran"},{"SurahNumber":17,"VerseNumber":32,"Text":"Wala taqraboo alzzina innahu kana fahishatan wasaa sabeelan"},{"SurahNumber":17,"VerseNumber":33,"Text":"Wala taqtuloo alnnafsa allatee harrama Allahu illa bialhaqqi waman qutila mathlooman faqad jaAAalna liwaliyyihi sultanan fala yusrif fee alqatli innahu kana mansooran"},{"SurahNumber":17,"VerseNumber":34,"Text":"Wala taqraboo mala alyateemi illa biallatee hiya ahsanu hatta yablugha ashuddahu waawfoo bialAAahdi inna alAAahda kana masoolan"},{"SurahNumber":17,"VerseNumber":35,"Text":"Waawfoo alkayla itha kiltum wazinoo bialqistasi almustaqeemi thalika khayrun waahsanu taweelan"},{"SurahNumber":17,"VerseNumber":36,"Text":"Wala taqfu ma laysa laka bihi AAilmun inna alssamAAa waalbasara waalfuada kullu olaika kana AAanhu masoolan"},{"SurahNumber":17,"VerseNumber":37,"Text":"Wala tamshi fee alardi marahan innaka lan takhriqa alarda walan tablugha aljibala toolan"},{"SurahNumber":17,"VerseNumber":38,"Text":"Kullu thalika kana sayyiohu AAinda rabbika makroohan"},{"SurahNumber":17,"VerseNumber":39,"Text":"Thalika mimma awha ilayka rabbuka mina alhikmati wala tajAAal maAAa Allahi ilahan akhara fatulqa fee jahannama malooman madhooran"},{"SurahNumber":17,"VerseNumber":40,"Text":"Afaasfakum rabbukum bialbaneena waittakhatha mina almalaikati inathan innakum lataqooloona qawlan AAatheeman"},{"SurahNumber":17,"VerseNumber":41,"Text":"Walaqad sarrafna fee hatha alqurani liyaththakkaroo wama yazeeduhum illa nufooran"},{"SurahNumber":17,"VerseNumber":42,"Text":"Qul law kana maAAahu alihatun kama yaqooloona ithan laibtaghaw ila thee alAAarshi sabeelan"},{"SurahNumber":17,"VerseNumber":43,"Text":"Subhanahu wataAAala AAamma yaqooloona AAuluwwan kabeeran"},{"SurahNumber":17,"VerseNumber":44,"Text":"Tusabbihu lahu alssamawatu alssabAAu waalardu waman feehinna wain min shayin illa yusabbihu bihamdihi walakin la tafqahoona tasbeehahum innahu kana haleeman ghafooran"},{"SurahNumber":17,"VerseNumber":45,"Text":"Waitha qarata alqurana jaAAalna baynaka wabayna allatheena la yuminoona bialakhirati hijaban mastooran"},{"SurahNumber":17,"VerseNumber":46,"Text":"WajaAAalna AAala quloobihim akinnatan an yafqahoohu wafee athanihim waqran waitha thakarta rabbaka fee alqurani wahdahu wallaw AAala adbarihim nufooran"},{"SurahNumber":17,"VerseNumber":47,"Text":"Nahnu aAAlamu bima yastamiAAoona bihi ith yastamiAAoona ilayka waith hum najwa ith yaqoolu alththalimoona in tattabiAAoona illa rajulan mashooran"},{"SurahNumber":17,"VerseNumber":48,"Text":"Onthur kayfa daraboo laka alamthala fadalloo fala yastateeAAoona sabeelan"},{"SurahNumber":17,"VerseNumber":49,"Text":"Waqaloo aitha kunna AAithaman warufatan ainna lamabAAoothoona khalqan jadeedan"},{"SurahNumber":17,"VerseNumber":50,"Text":"Qul koonoo hijaratan aw hadeedan"},{"SurahNumber":17,"VerseNumber":51,"Text":"Aw khalqan mimma yakburu fee sudoorikum fasayaqooloona man yuAAeeduna quli allathee fatarakum awwala marratin fasayunghidoona ilayka ruoosahum wayaqooloona mata huwa qul AAasa an yakoona qareeban"},{"SurahNumber":17,"VerseNumber":52,"Text":"Yawma yadAAookum fatastajeeboona bihamdihi watathunnoona in labithtum illa qaleelan"},{"SurahNumber":17,"VerseNumber":53,"Text":"Waqul liAAibadee yaqooloo allatee hiya ahsanu inna alshshaytana yanzaghu baynahum inna alshshaytana kana lilinsani AAaduwwan mubeenan"},{"SurahNumber":17,"VerseNumber":54,"Text":"Rabbukum aAAlamu bikum in yasha yarhamkum aw in yasha yuAAaththibkum wama arsalnaka AAalayhim wakeelan"},{"SurahNumber":17,"VerseNumber":55,"Text":"Warabbuka aAAlamu biman fee alssamawati waalardi walaqad faddalna baAAda alnnabiyyeena AAala baAAdin waatayna dawooda zabooran"},{"SurahNumber":17,"VerseNumber":56,"Text":"Quli odAAu allatheena zaAAamtum min doonihi fala yamlikoona kashfa alddurri AAankum wala tahweelan"},{"SurahNumber":17,"VerseNumber":57,"Text":"Olaika allatheena yadAAoona yabtaghoona ila rabbihimu alwaseelata ayyuhum aqrabu wayarjoona rahmatahu wayakhafoona AAathabahu inna AAathaba rabbika kana mahthooran"},{"SurahNumber":17,"VerseNumber":58,"Text":"Wain min qaryatin illa nahnu muhlikooha qabla yawmi alqiyamati aw muAAaththibooha AAathaban shadeedan kana thalika fee alkitabi mastooran"},{"SurahNumber":17,"VerseNumber":59,"Text":"Wama manaAAana an nursila bialayati illa an kaththaba biha alawwaloona waatayna thamooda alnnaqata mubsiratan fathalamoo biha wama nursilu bialayati illa takhweefan"},{"SurahNumber":17,"VerseNumber":60,"Text":"Waith qulna laka inna rabbaka ahata bialnnasi wama jaAAalna alrruya allatee araynaka illa fitnatan lilnnasi waalshshajarata almalAAoonata fee alqurani wanukhawwifuhum fama yazeeduhum illa tughyanan kabeeran"},{"SurahNumber":17,"VerseNumber":61,"Text":"Waith qulna lilmalaikati osjudoo liadama fasajadoo illa ibleesa qala aasjudu liman khalaqta teenan"},{"SurahNumber":17,"VerseNumber":62,"Text":"Qala araaytaka hatha allathee karramta AAalayya lain akhkhartani ila yawmi alqiyamati laahtanikanna thurriyyatahu illa qaleelan"},{"SurahNumber":17,"VerseNumber":63,"Text":"Qala ithhab faman tabiAAaka minhum fainna jahannama jazaokum jazaan mawfooran"},{"SurahNumber":17,"VerseNumber":64,"Text":"Waistafziz mani istataAAta minhum bisawtika waajlib AAalayhim bikhaylika warajlika washarikhum fee alamwali waalawladi waAAidhum wama yaAAiduhumu alshshaytanu illa ghurooran"},{"SurahNumber":17,"VerseNumber":65,"Text":"Inna AAibadee laysa laka AAalayhim sultanun wakafa birabbika wakeelan"},{"SurahNumber":17,"VerseNumber":66,"Text":"Rabbukumu allathee yuzjee lakumu alfulka fee albahri litabtaghoo min fadlihi innahu kana bikum raheeman"},{"SurahNumber":17,"VerseNumber":67,"Text":"Waitha massakumu alddurru fee albahri dalla man tadAAoona illa iyyahu falamma najjakum ila albarri aAAradtum wakana alinsanu kafooran"},{"SurahNumber":17,"VerseNumber":68,"Text":"Afaamintum an yakhsifa bikum janiba albarri aw yursila AAalaykum hasiban thumma la tajidoo lakum wakeelan"},{"SurahNumber":17,"VerseNumber":69,"Text":"Am amintum an yuAAeedakum feehi taratan okhra fayursila AAalaykum qasifan mina alrreehi fayughriqakum bima kafartum thumma la tajidoo lakum AAalayna bihi tabeeAAan"},{"SurahNumber":17,"VerseNumber":70,"Text":"Walaqad karramna banee adama wahamalnahum fee albarri waalbahri warazaqnahum mina alttayyibati wafaddalnahum AAala katheerin mimman khalaqna tafdeelan"},{"SurahNumber":17,"VerseNumber":71,"Text":"Yawma nadAAoo kulla onasin biimamihim faman ootiya kitabahu biyameenihi faolaika yaqraoona kitabahum wala yuthlamoona fateelan"},{"SurahNumber":17,"VerseNumber":72,"Text":"Waman kana fee hathihi aAAma fahuwa fee alakhirati aAAma waadallu sabeelan"},{"SurahNumber":17,"VerseNumber":73,"Text":"Wain kadoo layaftinoonaka AAani allathee awhayna ilayka litaftariya AAalayna ghayrahu waithan laittakhathooka khaleelan"},{"SurahNumber":17,"VerseNumber":74,"Text":"Walawla an thabbatnaka laqad kidta tarkanu ilayhim shayan qaleelan"},{"SurahNumber":17,"VerseNumber":75,"Text":"Ithan laathaqnaka diAAfa alhayati wadiAAfa almamati thumma la tajidu laka AAalayna naseeran"},{"SurahNumber":17,"VerseNumber":76,"Text":"Wain kadoo layastafizzoonaka mina alardi liyukhrijooka minha waithan la yalbathoona khilafaka illa qaleelan"},{"SurahNumber":17,"VerseNumber":77,"Text":"Sunnata man qad arsalna qablaka min rusulina wala tajidu lisunnatina tahweelan"},{"SurahNumber":17,"VerseNumber":78,"Text":"Aqimi alssalata lidulooki alshshamsi ila ghasaqi allayli waqurana alfajri inna qurana alfajri kana mashhoodan"},{"SurahNumber":17,"VerseNumber":79,"Text":"Wamina allayli fatahajjad bihi nafilatan laka AAasa an yabAAathaka rabbuka maqaman mahmoodan"},{"SurahNumber":17,"VerseNumber":80,"Text":"Waqul rabbi adkhilnee mudkhala sidqin waakhrijnee mukhraja sidqin waijAAal lee min ladunka sultanan naseeran"},{"SurahNumber":17,"VerseNumber":81,"Text":"Waqul jaa alhaqqu wazahaqa albatilu inna albatila kana zahooqan"},{"SurahNumber":17,"VerseNumber":82,"Text":"Wanunazzilu mina alqurani ma huwa shifaon warahmatun lilmumineena wala yazeedu alththalimeena illa khasaran"},{"SurahNumber":17,"VerseNumber":83,"Text":"Waitha anAAamna AAala alinsani aAArada wanaa bijanibihi waitha massahu alshsharru kana yaoosan"},{"SurahNumber":17,"VerseNumber":84,"Text":"Qul kullun yaAAmalu AAala shakilatihi farabbukum aAAlamu biman huwa ahda sabeelan"},{"SurahNumber":17,"VerseNumber":85,"Text":"Wayasaloonaka AAani alrroohi quli alrroohu min amri rabbee wama ooteetum mina alAAilmi illa qaleelan"},{"SurahNumber":17,"VerseNumber":86,"Text":"Walain shina lanathhabanna biallathee awhayna ilayka thumma la tajidu laka bihi AAalayna wakeelan"},{"SurahNumber":17,"VerseNumber":87,"Text":"Illa rahmatan min rabbika inna fadlahu kana AAalayka kabeeran"},{"SurahNumber":17,"VerseNumber":88,"Text":"Qul laini ijtamaAAati alinsu waaljinnu AAala an yatoo bimithli hatha alqurani la yatoona bimithlihi walaw kana baAAduhum libaAAdin thaheeran"},{"SurahNumber":17,"VerseNumber":89,"Text":"Walaqad sarrafna lilnnasi fee hatha alqurani min kulli mathalin faaba aktharu alnnasi illa kufooran"},{"SurahNumber":17,"VerseNumber":90,"Text":"Waqaloo lan numina laka hatta tafjura lana mina alardi yanbooAAan"},{"SurahNumber":17,"VerseNumber":91,"Text":"Aw takoona laka jannatun min nakheelin waAAinabin fatufajjira alanhara khilalaha tafjeeran"},{"SurahNumber":17,"VerseNumber":92,"Text":"Aw tusqita alssamaa kama zaAAamta AAalayna kisafan aw tatiya biAllahi waalmalaikati qabeelan"},{"SurahNumber":17,"VerseNumber":93,"Text":"Aw yakoona laka baytun min zukhrufin aw tarqa fee alssamai walan numina liruqiyyika hatta tunazzila AAalayna kitaban naqraohu qul subhana rabbee hal kuntu illa basharan rasoolan"},{"SurahNumber":17,"VerseNumber":94,"Text":"Wama manaAAa alnnasa an yuminoo ith jaahumu alhuda illa an qaloo abaAAatha Allahu basharan rasoolan"},{"SurahNumber":17,"VerseNumber":95,"Text":"Qul law kana fee alardi malaikatun yamshoona mutmainneena lanazzalna AAalayhim mina alssamai malakan rasoolan"},{"SurahNumber":17,"VerseNumber":96,"Text":"Qul kafa biAllahi shaheedan baynee wabaynakum innahu kana biAAibadihi khabeeran baseeran"},{"SurahNumber":17,"VerseNumber":97,"Text":"Waman yahdi Allahu fahuwa almuhtadi waman yudlil falan tajida lahum awliyaa min doonihi wanahshuruhum yawma alqiyamati AAala wujoohihim AAumyan wabukman wasumman mawahum jahannamu kullama khabat zidnahum saAAeeran"},{"SurahNumber":17,"VerseNumber":98,"Text":"Thalika jazaohum biannahum kafaroo biayatina waqaloo aitha kunna AAithaman warufatan ainna lamabAAoothoona khalqan jadeedan"},{"SurahNumber":17,"VerseNumber":99,"Text":"Awalam yaraw anna Allaha allathee khalaqa alssamawati waalarda qadirun AAala an yakhluqa mithlahum wajaAAala lahum ajalan la rayba feehi faaba alththalimoona illa kufooran"},{"SurahNumber":17,"VerseNumber":100,"Text":"Qul law antum tamlikoona khazaina rahmati rabbee ithan laamsaktum khashyata alinfaqi wakana alinsanu qatooran"},{"SurahNumber":17,"VerseNumber":101,"Text":"Walaqad atayna moosa tisAAa ayatin bayyinatin faisal banee israeela ith jaahum faqala lahu firAAawnu innee laathunnuka ya moosa mashooran"},{"SurahNumber":17,"VerseNumber":102,"Text":"Qala laqad AAalimta ma anzala haolai illa rabbu alssamawati waalardi basaira wainnee laathunnuka ya firAAawnu mathbooran"},{"SurahNumber":17,"VerseNumber":103,"Text":"Faarada an yastafizzahum mina alardi faaghraqnahu waman maAAahu jameeAAan"},{"SurahNumber":17,"VerseNumber":104,"Text":"Waqulna min baAAdihi libanee israeela oskunoo alarda faitha jaa waAAdu alakhirati jina bikum lafeefan"},{"SurahNumber":17,"VerseNumber":105,"Text":"Wabialhaqqi anzalnahu wabialhaqqi nazala wama arsalnaka illa mubashshiran wanatheeran"},{"SurahNumber":17,"VerseNumber":106,"Text":"Waquranan faraqnahu litaqraahu AAala alnnasi AAala mukthin wanazzalnahu tanzeelan"},{"SurahNumber":17,"VerseNumber":107,"Text":"Qul aminoo bihi aw la tuminoo inna allatheena ootoo alAAilma min qablihi itha yutla AAalayhim yakhirroona lilathqani sujjadan"},{"SurahNumber":17,"VerseNumber":108,"Text":"Wayaqooloona subhana rabbina in kana waAAdu rabbina lamafAAoolan"},{"SurahNumber":17,"VerseNumber":109,"Text":"Wayakhirroona lilathqani yabkoona wayazeeduhum khushooAAan"},{"SurahNumber":17,"VerseNumber":110,"Text":"Quli odAAoo Allaha awi odAAoo alrrahmana ayyan ma tadAAoo falahu alasmao alhusna wala tajhar bisalatika wala tukhafit biha waibtaghi bayna thalika sabeelan"},{"SurahNumber":17,"VerseNumber":111,"Text":"Waquli alhamdu lillahi allathee lam yattakhith waladan walam yakun lahu shareekun fee almulki walam yakun lahu waliyyun mina alththulli wakabbirhu takbeeran"}]},{"Id":34,"LanguageCode":"ara","Name":"ara-quranuthmanihaf1","Author":"Quran Uthmani Hafs No Diacritics","Language":"Arabic","Description":"Arabic","Direction":"rtl","Source":"https://qurancomplex.gov.sa/","Translations":[{"SurahNumber":17,"VerseNumber":1,"Text":"سبحن الذي اسرى بعبده ليل ا من المسجد الحرام الى المسجد الاقصا الذي بركنا حوله لنريه من ءايتنا انه هو السميع البصير"},{"SurahNumber":17,"VerseNumber":2,"Text":"وءاتينا موسى الكتب وجعلنه هد ى لبني اسرءيل الا تتخذوا من دوني وكيل ا"},{"SurahNumber":17,"VerseNumber":3,"Text":"ذرية من حملنا مع نوح انه كان عبد ا شكور ا"},{"SurahNumber":17,"VerseNumber":4,"Text":"وقضينا الى بني اسرءيل في الكتب لتفسدن في الارض مرتين ولتعلن علو ا كبير ا"},{"SurahNumber":17,"VerseNumber":5,"Text":"فاذا جاء وعد اولىهما بعثنا عليكم عباد ا لنا اولي باس شديد فجاسوا خلل الديار وكان وعد ا مفعول ا"},{"SurahNumber":17,"VerseNumber":6,"Text":"ثم رددنا لكم الكرة عليهم وامددنكم بامول وبنين وجعلنكم اكثر نفيرا"},{"SurahNumber":17,"VerseNumber":7,"Text":"ان احسنتم احسنتم لانفسكم وان اساتم فلها فاذا جاء وعد الاخرة ليسوا وجوهكم وليدخلوا المسجد كما دخلوه اول مرة وليتبروا ما علوا تتبيرا"},{"SurahNumber":17,"VerseNumber":8,"Text":"عسى ربكم ان يرحمكم وان عدتم عدنا وجعلنا جهنم للكفرين حصيرا"},{"SurahNumber":17,"VerseNumber":9,"Text":"ان هذا القرءان يهدي للتي هي اقوم ويبشر المومنين الذين يعملون الصلحت ان لهم اجر ا كبير ا"},{"SurahNumber":17,"VerseNumber":10,"Text":"وان الذين لا يومنون بالاخرة اعتدنا لهم عذابا اليم ا"},{"SurahNumber":17,"VerseNumber":11,"Text":"ويدع الانسن بالشر دعاءه بالخير وكان الانسن عجول ا"},{"SurahNumber":17,"VerseNumber":12,"Text":"وجعلنا اليل والنهار ءايتين فمحونا ءاية اليل وجعلنا ءاية النهار مبصرة لتبتغوا فضل ا من ربكم ولتعلموا عدد السنين والحساب وكل شيء فصلنه تفصيل ا"},{"SurahNumber":17,"VerseNumber":13,"Text":"وكل انسن الزمنه طيره في عنقه ونخرج له يوم القيمة كتب ا يلقىه منشورا"},{"SurahNumber":17,"VerseNumber":14,"Text":"اقرا كتبك كفى بنفسك اليوم عليك حسيب ا"},{"SurahNumber":17,"VerseNumber":15,"Text":"من اهتدى فانما يهتدي لنفسه ومن ضل فانما يضل عليها ولا تزر وازرة وزر اخرى وما كنا معذبين حتى نبعث رسول ا"},{"SurahNumber":17,"VerseNumber":16,"Text":"واذا اردنا ان نهلك قرية امرنا مترفيها ففسقوا فيها فحق عليها القول فدمرنها تدمير ا"},{"SurahNumber":17,"VerseNumber":17,"Text":"وكم اهلكنا من القرون من بعد نوح وكفى بربك بذنوب عباده خبيرا بصير ا"},{"SurahNumber":17,"VerseNumber":18,"Text":"من كان يريد العاجلة عجلنا له فيها ما نشاء لمن نريد ثم جعلنا له جهنم يصلىها مذموم ا مدحور ا"},{"SurahNumber":17,"VerseNumber":19,"Text":"ومن اراد الاخرة وسعى لها سعيها وهو مومن فاوليك كان سعيهم مشكور ا"},{"SurahNumber":17,"VerseNumber":20,"Text":"كل ا نمد هولاء وهولاء من عطاء ربك وما كان عطاء ربك محظورا"},{"SurahNumber":17,"VerseNumber":21,"Text":"انظر كيف فضلنا بعضهم على بعض وللاخرة اكبر درجت واكبر تفضيل ا"},{"SurahNumber":17,"VerseNumber":22,"Text":"لا تجعل مع الله الها ءاخر فتقعد مذموم ا مخذول ا"},{"SurahNumber":17,"VerseNumber":23,"Text":"۞وقضى ربك الا تعبدوا الا اياه وبالولدين احسنا اما يبلغن عندك الكبر احدهما او كلاهما فلا تقل لهما اف ولا تنهرهما وقل لهما قول ا كريم ا"},{"SurahNumber":17,"VerseNumber":24,"Text":"واخفض لهما جناح الذل من الرحمة وقل رب ارحمهما كما ربياني صغير ا"},{"SurahNumber":17,"VerseNumber":25,"Text":"ربكم اعلم بما في نفوسكم ان تكونوا صلحين فانه كان للاوبين غفور ا"},{"SurahNumber":17,"VerseNumber":26,"Text":"وءات ذا القربى حقه والمسكين وابن السبيل ولا تبذر تبذيرا"},{"SurahNumber":17,"VerseNumber":27,"Text":"ان المبذرين كانوا اخون الشيطين وكان الشيطن لربه كفور ا"},{"SurahNumber":17,"VerseNumber":28,"Text":"واما تعرضن عنهم ابتغاء رحمة من ربك ترجوها فقل لهم قول ا ميسور ا"},{"SurahNumber":17,"VerseNumber":29,"Text":"ولا تجعل يدك مغلولة الى عنقك ولا تبسطها كل البسط فتقعد ملوم ا محسورا"},{"SurahNumber":17,"VerseNumber":30,"Text":"ان ربك يبسط الرزق لمن يشاء ويقدر انه كان بعباده خبيرا بصير ا"},{"SurahNumber":17,"VerseNumber":31,"Text":"ولا تقتلوا اولدكم خشية املق نحن نرزقهم واياكم ان قتلهم كان خط ا كبير ا"},{"SurahNumber":17,"VerseNumber":32,"Text":"ولا تقربوا الزنى انه كان فحشة وساء سبيل ا"},{"SurahNumber":17,"VerseNumber":33,"Text":"ولا تقتلوا النفس التي حرم الله الا بالحق ومن قتل مظلوم ا فقد جعلنا لوليه سلطن ا فلا يسرف في القتل انه كان منصور ا"},{"SurahNumber":17,"VerseNumber":34,"Text":"ولا تقربوا مال اليتيم الا بالتي هي احسن حتى يبلغ اشده واوفوا بالعهد ان العهد كان مسول ا"},{"SurahNumber":17,"VerseNumber":35,"Text":"واوفوا الكيل اذا كلتم وزنوا بالقسطاس المستقيم ذلك خير واحسن تاويل ا"},{"SurahNumber":17,"VerseNumber":36,"Text":"ولا تقف ما ليس لك به علم ان السمع والبصر والفواد كل اوليك كان عنه مسول ا"},{"SurahNumber":17,"VerseNumber":37,"Text":"ولا تمش في الارض مرحا انك لن تخرق الارض ولن تبلغ الجبال طول ا"},{"SurahNumber":17,"VerseNumber":38,"Text":"كل ذلك كان سييه عند ربك مكروه ا"},{"SurahNumber":17,"VerseNumber":39,"Text":"ذلك مما اوحى اليك ربك من الحكمة ولا تجعل مع الله الها ءاخر فتلقى في جهنم ملوم ا مدحورا"},{"SurahNumber":17,"VerseNumber":40,"Text":"افاصفىكم ربكم بالبنين واتخذ من المليكة انثا انكم لتقولون قولا عظيم ا"},{"SurahNumber":17,"VerseNumber":41,"Text":"ولقد صرفنا في هذا القرءان ليذكروا وما يزيدهم الا نفور ا"},{"SurahNumber":17,"VerseNumber":42,"Text":"قل لو كان معه ءالهة كما يقولون اذ ا لابتغوا الى ذي العرش سبيل ا"},{"SurahNumber":17,"VerseNumber":43,"Text":"سبحنه وتعلى عما يقولون علو ا كبير ا"},{"SurahNumber":17,"VerseNumber":44,"Text":"تسبح له السموت السبع والارض ومن فيهن وان من شيء الا يسبح بحمده ولكن لا تفقهون تسبيحهم انه كان حليما غفور ا"},{"SurahNumber":17,"VerseNumber":45,"Text":"واذا قرات القرءان جعلنا بينك وبين الذين لا يومنون بالاخرة حجاب ا مستور ا"},{"SurahNumber":17,"VerseNumber":46,"Text":"وجعلنا على قلوبهم اكنة ان يفقهوه وفي ءاذانهم وقر ا واذا ذكرت ربك في القرءان وحده ولوا على ادبرهم نفور ا"},{"SurahNumber":17,"VerseNumber":47,"Text":"نحن اعلم بما يستمعون به اذ يستمعون اليك واذ هم نجوى اذ يقول الظلمون ان تتبعون الا رجل ا مسحورا"},{"SurahNumber":17,"VerseNumber":48,"Text":"انظر كيف ضربوا لك الامثال فضلوا فلا يستطيعون سبيل ا"},{"SurahNumber":17,"VerseNumber":49,"Text":"وقالوا اءذا كنا عظم ا ورفتا اءنا لمبعوثون خلق ا جديد ا"},{"SurahNumber":17,"VerseNumber":50,"Text":"۞قل كونوا حجارة او حديدا"},{"SurahNumber":17,"VerseNumber":51,"Text":"او خلق ا مما يكبر في صدوركم فسيقولون من يعيدنا قل الذي فطركم اول مرة فسينغضون اليك رءوسهم ويقولون متى هو قل عسى ان يكون قريب ا"},{"SurahNumber":17,"VerseNumber":52,"Text":"يوم يدعوكم فتستجيبون بحمده وتظنون ان لبثتم الا قليل ا"},{"SurahNumber":17,"VerseNumber":53,"Text":"وقل لعبادي يقولوا التي هي احسن ان الشيطن ينزغ بينهم ان الشيطن كان للانسن عدو ا مبين ا"},{"SurahNumber":17,"VerseNumber":54,"Text":"ربكم اعلم بكم ان يشا يرحمكم او ان يشا يعذبكم وما ارسلنك عليهم وكيل ا"},{"SurahNumber":17,"VerseNumber":55,"Text":"وربك اعلم بمن في السموت والارض ولقد فضلنا بعض النبين على بعض وءاتينا داود زبور ا"},{"SurahNumber":17,"VerseNumber":56,"Text":"قل ادعوا الذين زعمتم من دونه فلا يملكون كشف الضر عنكم ولا تحويلا"},{"SurahNumber":17,"VerseNumber":57,"Text":"اوليك الذين يدعون يبتغون الى ربهم الوسيلة ايهم اقرب ويرجون رحمته ويخافون عذابه ان عذاب ربك كان محذور ا"},{"SurahNumber":17,"VerseNumber":58,"Text":"وان من قرية الا نحن مهلكوها قبل يوم القيمة او معذبوها عذاب ا شديد ا كان ذلك في الكتب مسطور ا"},{"SurahNumber":17,"VerseNumber":59,"Text":"وما منعنا ان نرسل بالايت الا ان كذب بها الاولون وءاتينا ثمود الناقة مبصرة فظلموا بها وما نرسل بالايت الا تخويف ا"},{"SurahNumber":17,"VerseNumber":60,"Text":"واذ قلنا لك ان ربك احاط بالناس وما جعلنا الرءيا التي ارينك الا فتنة للناس والشجرة الملعونة في القرءان ونخوفهم فما يزيدهم الا طغين ا كبير ا"},{"SurahNumber":17,"VerseNumber":61,"Text":"واذ قلنا للمليكة اسجدوا لادم فسجدوا الا ابليس قال ءاسجد لمن خلقت طين ا"},{"SurahNumber":17,"VerseNumber":62,"Text":"قال ارءيتك هذا الذي كرمت علي لين اخرتن الى يوم القيمة لاحتنكن ذريته الا قليل ا"},{"SurahNumber":17,"VerseNumber":63,"Text":"قال اذهب فمن تبعك منهم فان جهنم جزاوكم جزاء موفور ا"},{"SurahNumber":17,"VerseNumber":64,"Text":"واستفزز من استطعت منهم بصوتك واجلب عليهم بخيلك ورجلك وشاركهم في الامول والاولد وعدهم وما يعدهم الشيطن الا غرورا"},{"SurahNumber":17,"VerseNumber":65,"Text":"ان عبادي ليس لك عليهم سلطن وكفى بربك وكيل ا"},{"SurahNumber":17,"VerseNumber":66,"Text":"ربكم الذي يزجي لكم الفلك في البحر لتبتغوا من فضله انه كان بكم رحيم ا"},{"SurahNumber":17,"VerseNumber":67,"Text":"واذا مسكم الضر في البحر ضل من تدعون الا اياه فلما نجىكم الى البر اعرضتم وكان الانسن كفورا"},{"SurahNumber":17,"VerseNumber":68,"Text":"افامنتم ان يخسف بكم جانب البر او يرسل عليكم حاصب ا ثم لا تجدوا لكم وكيلا"},{"SurahNumber":17,"VerseNumber":69,"Text":"ام امنتم ان يعيدكم فيه تارة اخرى فيرسل عليكم قاصف ا من الريح فيغرقكم بما كفرتم ثم لا تجدوا لكم علينا به تبيع ا"},{"SurahNumber":17,"VerseNumber":70,"Text":"۞ولقد كرمنا بني ءادم وحملنهم في البر والبحر ورزقنهم من الطيبت وفضلنهم على كثير ممن خلقنا تفضيل ا"},{"SurahNumber":17,"VerseNumber":71,"Text":"يوم ندعوا كل اناس باممهم فمن اوتي كتبه بيمينه فاوليك يقرءون كتبهم ولا يظلمون فتيل ا"},{"SurahNumber":17,"VerseNumber":72,"Text":"ومن كان في هذه اعمى فهو في الاخرة اعمى واضل سبيل ا"},{"SurahNumber":17,"VerseNumber":73,"Text":"وان كادوا ليفتنونك عن الذي اوحينا اليك لتفتري علينا غيره واذ ا لاتخذوك خليل ا"},{"SurahNumber":17,"VerseNumber":74,"Text":"ولولا ان ثبتنك لقد كدت تركن اليهم شي ا قليلا"},{"SurahNumber":17,"VerseNumber":75,"Text":"اذ ا لاذقنك ضعف الحيوة وضعف الممات ثم لا تجد لك علينا نصير ا"},{"SurahNumber":17,"VerseNumber":76,"Text":"وان كادوا ليستفزونك من الارض ليخرجوك منها واذ ا لا يلبثون خلفك الا قليل ا"},{"SurahNumber":17,"VerseNumber":77,"Text":"سنة من قد ارسلنا قبلك من رسلنا ولا تجد لسنتنا تحويلا"},{"SurahNumber":17,"VerseNumber":78,"Text":"اقم الصلوة لدلوك الشمس الى غسق اليل وقرءان الفجر ان قرءان الفجر كان مشهود ا"},{"SurahNumber":17,"VerseNumber":79,"Text":"ومن اليل فتهجد به نافلة لك عسى ان يبعثك ربك مقام ا محمود ا"},{"SurahNumber":17,"VerseNumber":80,"Text":"وقل رب ادخلني مدخل صدق واخرجني مخرج صدق واجعل لي من لدنك سلطن ا نصير ا"},{"SurahNumber":17,"VerseNumber":81,"Text":"وقل جاء الحق وزهق البطل ان البطل كان زهوق ا"},{"SurahNumber":17,"VerseNumber":82,"Text":"وننزل من القرءان ما هو شفاء ورحمة للمومنين ولا يزيد الظلمين الا خسار ا"},{"SurahNumber":17,"VerseNumber":83,"Text":"واذا انعمنا على الانسن اعرض ونا بجانبه واذا مسه الشر كان يوس ا"},{"SurahNumber":17,"VerseNumber":84,"Text":"قل كل يعمل على شاكلته فربكم اعلم بمن هو اهدى سبيل ا"},{"SurahNumber":17,"VerseNumber":85,"Text":"ويسلونك عن الروح قل الروح من امر ربي وما اوتيتم من العلم الا قليل ا"},{"SurahNumber":17,"VerseNumber":86,"Text":"ولين شينا لنذهبن بالذي اوحينا اليك ثم لا تجد لك به علينا وكيلا"},{"SurahNumber":17,"VerseNumber":87,"Text":"الا رحمة من ربك ان فضله كان عليك كبير ا"},{"SurahNumber":17,"VerseNumber":88,"Text":"قل لين اجتمعت الانس والجن على ان ياتوا بمثل هذا القرءان لا ياتون بمثله ولو كان بعضهم لبعض ظهير ا"},{"SurahNumber":17,"VerseNumber":89,"Text":"ولقد صرفنا للناس في هذا القرءان من كل مثل فابى اكثر الناس الا كفور ا"},{"SurahNumber":17,"VerseNumber":90,"Text":"وقالوا لن نومن لك حتى تفجر لنا من الارض ينبوعا"},{"SurahNumber":17,"VerseNumber":91,"Text":"او تكون لك جنة من نخيل وعنب فتفجر الانهر خللها تفجيرا"},{"SurahNumber":17,"VerseNumber":92,"Text":"او تسقط السماء كما زعمت علينا كسفا او تاتي بالله والمليكة قبيلا"},{"SurahNumber":17,"VerseNumber":93,"Text":"او يكون لك بيت من زخرف او ترقى في السماء ولن نومن لرقيك حتى تنزل علينا كتب ا نقروه قل سبحان ربي هل كنت الا بشر ا رسول ا"},{"SurahNumber":17,"VerseNumber":94,"Text":"وما منع الناس ان يومنوا اذ جاءهم الهدى الا ان قالوا ابعث الله بشر ا رسول ا"},{"SurahNumber":17,"VerseNumber":95,"Text":"قل لو كان في الارض مليكة يمشون مطمينين لنزلنا عليهم من السماء ملك ا رسول ا"},{"SurahNumber":17,"VerseNumber":96,"Text":"قل كفى بالله شهيدا بيني وبينكم انه كان بعباده خبيرا بصير ا"},{"SurahNumber":17,"VerseNumber":97,"Text":"ومن يهد الله فهو المهتد ومن يضلل فلن تجد لهم اولياء من دونه ونحشرهم يوم القيمة على وجوههم عمي ا وبكم ا وصم ا ماوىهم جهنم كلما خبت زدنهم سعير ا"},{"SurahNumber":17,"VerseNumber":98,"Text":"ذلك جزاوهم بانهم كفروا بايتنا وقالوا اءذا كنا عظم ا ورفتا اءنا لمبعوثون خلق ا جديدا"},{"SurahNumber":17,"VerseNumber":99,"Text":"۞اولم يروا ان الله الذي خلق السموت والارض قادر على ان يخلق مثلهم وجعل لهم اجل ا لا ريب فيه فابى الظلمون الا كفور ا"},{"SurahNumber":17,"VerseNumber":100,"Text":"قل لو انتم تملكون خزاين رحمة ربي اذ ا لامسكتم خشية الانفاق وكان الانسن قتور ا"},{"SurahNumber":17,"VerseNumber":101,"Text":"ولقد ءاتينا موسى تسع ءايت بينت فسل بني اسرءيل اذ جاءهم فقال له فرعون اني لاظنك يموسى مسحور ا"},{"SurahNumber":17,"VerseNumber":102,"Text":"قال لقد علمت ما انزل هولاء الا رب السموت والارض بصاير واني لاظنك يفرعون مثبور ا"},{"SurahNumber":17,"VerseNumber":103,"Text":"فاراد ان يستفزهم من الارض فاغرقنه ومن معه جميع ا"},{"SurahNumber":17,"VerseNumber":104,"Text":"وقلنا من بعده لبني اسرءيل اسكنوا الارض فاذا جاء وعد الاخرة جينا بكم لفيف ا"},{"SurahNumber":17,"VerseNumber":105,"Text":"وبالحق انزلنه وبالحق نزل وما ارسلنك الا مبشر ا ونذير ا"},{"SurahNumber":17,"VerseNumber":106,"Text":"وقرءان ا فرقنه لتقراه على الناس على مكث ونزلنه تنزيل ا"},{"SurahNumber":17,"VerseNumber":107,"Text":"قل ءامنوا به او لا تومنوا ان الذين اوتوا العلم من قبله اذا يتلى عليهم يخرون للاذقان سجد ا"},{"SurahNumber":17,"VerseNumber":108,"Text":"ويقولون سبحن ربنا ان كان وعد ربنا لمفعول ا"},{"SurahNumber":17,"VerseNumber":109,"Text":"ويخرون للاذقان يبكون ويزيدهم خشوع ا۩"},{"SurahNumber":17,"VerseNumber":110,"Text":"قل ادعوا الله او ادعوا الرحمن اي ا ما تدعوا فله الاسماء الحسنى ولا تجهر بصلاتك ولا تخافت بها وابتغ بين ذلك سبيل ا"},{"SurahNumber":17,"VerseNumber":111,"Text":"وقل الحمد لله الذي لم يتخذ ولد ا ولم يكن له شريك في الملك ولم يكن له ولي من الذل وكبره تكبيرا"}]}]}