{"SurahNumber":27,"HasBismillah":true,"Verses":[{"SurahNumber":27,"VerseNumber":1,"Text":"طسٓۚ تِلۡكَ ءَايَٰتُ ٱلۡقُرۡءَانِ وَكِتَابٖ مُّبِينٍ","End":"١"},{"SurahNumber":27,"VerseNumber":2,"Text":"هُدٗى وَبُشۡرَىٰ لِلۡمُؤۡمِنِينَ","End":"٢"},{"SurahNumber":27,"VerseNumber":3,"Text":"ٱلَّذِينَ يُقِيمُونَ ٱلصَّلَوٰةَ وَيُؤۡتُونَ ٱلزَّكَوٰةَ وَهُم بِٱلۡأٓخِرَةِ هُمۡ يُوقِنُونَ","End":"٣"},{"SurahNumber":27,"VerseNumber":4,"Text":"إِنَّ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ زَيَّنَّا لَهُمۡ أَعۡمَٰلَهُمۡ فَهُمۡ يَعۡمَهُونَ","End":"٤"},{"SurahNumber":27,"VerseNumber":5,"Text":"أُوْلَـٰٓئِكَ ٱلَّذِينَ لَهُمۡ سُوٓءُ ٱلۡعَذَابِ وَهُمۡ فِي ٱلۡأٓخِرَةِ هُمُ ٱلۡأَخۡسَرُونَ","End":"٥"},{"SurahNumber":27,"VerseNumber":6,"Text":"وَإِنَّكَ لَتُلَقَّى ٱلۡقُرۡءَانَ مِن لَّدُنۡ حَكِيمٍ عَلِيمٍ","End":"٦"},{"SurahNumber":27,"VerseNumber":7,"Text":"إِذۡ قَالَ مُوسَىٰ لِأَهۡلِهِۦٓ إِنِّيٓ ءَانَسۡتُ نَارٗا سَـَٔاتِيكُم مِّنۡهَا بِخَبَرٍ أَوۡ ءَاتِيكُم بِشِهَابٖ قَبَسٖ لَّعَلَّكُمۡ تَصۡطَلُونَ","End":"٧"},{"SurahNumber":27,"VerseNumber":8,"Text":"فَلَمَّا جَآءَهَا نُودِيَ أَنۢ بُورِكَ مَن فِي ٱلنَّارِ وَمَنۡ حَوۡلَهَا وَسُبۡحَٰنَ ٱللَّهِ رَبِّ ٱلۡعَٰلَمِينَ","End":"٨"},{"SurahNumber":27,"VerseNumber":9,"Text":"يَٰمُوسَىٰٓ إِنَّهُۥٓ أَنَا ٱللَّهُ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","End":"٩"},{"SurahNumber":27,"VerseNumber":10,"Text":"وَأَلۡقِ عَصَاكَۚ فَلَمَّا رَءَاهَا تَهۡتَزُّ كَأَنَّهَا جَآنّٞ وَلَّىٰ مُدۡبِرٗا وَلَمۡ يُعَقِّبۡۚ يَٰمُوسَىٰ لَا تَخَفۡ إِنِّي لَا يَخَافُ لَدَيَّ ٱلۡمُرۡسَلُونَ","End":"١٠"},{"SurahNumber":27,"VerseNumber":11,"Text":"إِلَّا مَن ظَلَمَ ثُمَّ بَدَّلَ حُسۡنَۢا بَعۡدَ سُوٓءٖ فَإِنِّي غَفُورٞ رَّحِيمٞ","End":"١١"},{"SurahNumber":27,"VerseNumber":12,"Text":"وَأَدۡخِلۡ يَدَكَ فِي جَيۡبِكَ تَخۡرُجۡ بَيۡضَآءَ مِنۡ غَيۡرِ سُوٓءٖۖ فِي تِسۡعِ ءَايَٰتٍ إِلَىٰ فِرۡعَوۡنَ وَقَوۡمِهِۦٓۚ إِنَّهُمۡ كَانُواْ قَوۡمٗا فَٰسِقِينَ","End":"١٢"},{"SurahNumber":27,"VerseNumber":13,"Text":"فَلَمَّا جَآءَتۡهُمۡ ءَايَٰتُنَا مُبۡصِرَةٗ قَالُواْ هَٰذَا سِحۡرٞ مُّبِينٞ","End":"١٣"},{"SurahNumber":27,"VerseNumber":14,"Text":"وَجَحَدُواْ بِهَا وَٱسۡتَيۡقَنَتۡهَآ أَنفُسُهُمۡ ظُلۡمٗا وَعُلُوّٗاۚ فَٱنظُرۡ كَيۡفَ كَانَ عَٰقِبَةُ ٱلۡمُفۡسِدِينَ","End":"١٤"},{"SurahNumber":27,"VerseNumber":15,"Text":"وَلَقَدۡ ءَاتَيۡنَا دَاوُۥدَ وَسُلَيۡمَٰنَ عِلۡمٗاۖ وَقَالَا ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي فَضَّلَنَا عَلَىٰ كَثِيرٖ مِّنۡ عِبَادِهِ ٱلۡمُؤۡمِنِينَ","End":"١٥"},{"SurahNumber":27,"VerseNumber":16,"Text":"وَوَرِثَ سُلَيۡمَٰنُ دَاوُۥدَۖ وَقَالَ يَـٰٓأَيُّهَا ٱلنَّاسُ عُلِّمۡنَا مَنطِقَ ٱلطَّيۡرِ وَأُوتِينَا مِن كُلِّ شَيۡءٍۖ إِنَّ هَٰذَا لَهُوَ ٱلۡفَضۡلُ ٱلۡمُبِينُ","End":"١٦"},{"SurahNumber":27,"VerseNumber":17,"Text":"وَحُشِرَ لِسُلَيۡمَٰنَ جُنُودُهُۥ مِنَ ٱلۡجِنِّ وَٱلۡإِنسِ وَٱلطَّيۡرِ فَهُمۡ يُوزَعُونَ","End":"١٧"},{"SurahNumber":27,"VerseNumber":18,"Text":"حَتَّىٰٓ إِذَآ أَتَوۡاْ عَلَىٰ وَادِ ٱلنَّمۡلِ قَالَتۡ نَمۡلَةٞ يَـٰٓأَيُّهَا ٱلنَّمۡلُ ٱدۡخُلُواْ مَسَٰكِنَكُمۡ لَا يَحۡطِمَنَّكُمۡ سُلَيۡمَٰنُ وَجُنُودُهُۥ وَهُمۡ لَا يَشۡعُرُونَ","End":"١٨"},{"SurahNumber":27,"VerseNumber":19,"Text":"فَتَبَسَّمَ ضَاحِكٗا مِّن قَوۡلِهَا وَقَالَ رَبِّ أَوۡزِعۡنِيٓ أَنۡ أَشۡكُرَ نِعۡمَتَكَ ٱلَّتِيٓ أَنۡعَمۡتَ عَلَيَّ وَعَلَىٰ وَٰلِدَيَّ وَأَنۡ أَعۡمَلَ صَٰلِحٗا تَرۡضَىٰهُ وَأَدۡخِلۡنِي بِرَحۡمَتِكَ فِي عِبَادِكَ ٱلصَّـٰلِحِينَ","End":"١٩"},{"SurahNumber":27,"VerseNumber":20,"Text":"وَتَفَقَّدَ ٱلطَّيۡرَ فَقَالَ مَالِيَ لَآ أَرَى ٱلۡهُدۡهُدَ أَمۡ كَانَ مِنَ ٱلۡغَآئِبِينَ","End":"٢٠"},{"SurahNumber":27,"VerseNumber":21,"Text":"لَأُعَذِّبَنَّهُۥ عَذَابٗا شَدِيدًا أَوۡ لَأَاْذۡبَحَنَّهُۥٓ أَوۡ لَيَأۡتِيَنِّي بِسُلۡطَٰنٖ مُّبِينٖ","End":"٢١"},{"SurahNumber":27,"VerseNumber":22,"Text":"فَمَكَثَ غَيۡرَ بَعِيدٖ فَقَالَ أَحَطتُ بِمَا لَمۡ تُحِطۡ بِهِۦ وَجِئۡتُكَ مِن سَبَإِۭ بِنَبَإٖ يَقِينٍ","End":"٢٢"},{"SurahNumber":27,"VerseNumber":23,"Text":"إِنِّي وَجَدتُّ ٱمۡرَأَةٗ تَمۡلِكُهُمۡ وَأُوتِيَتۡ مِن كُلِّ شَيۡءٖ وَلَهَا عَرۡشٌ عَظِيمٞ","End":"٢٣"},{"SurahNumber":27,"VerseNumber":24,"Text":"وَجَدتُّهَا وَقَوۡمَهَا يَسۡجُدُونَ لِلشَّمۡسِ مِن دُونِ ٱللَّهِ وَزَيَّنَ لَهُمُ ٱلشَّيۡطَٰنُ أَعۡمَٰلَهُمۡ فَصَدَّهُمۡ عَنِ ٱلسَّبِيلِ فَهُمۡ لَا يَهۡتَدُونَ","End":"٢٤"},{"SurahNumber":27,"VerseNumber":25,"Text":"أَلَّاۤ يَسۡجُدُواْۤ لِلَّهِ ٱلَّذِي يُخۡرِجُ ٱلۡخَبۡءَ فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَيَعۡلَمُ مَا تُخۡفُونَ وَمَا تُعۡلِنُونَ","End":"٢٥"},{"SurahNumber":27,"VerseNumber":26,"Text":"ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ رَبُّ ٱلۡعَرۡشِ ٱلۡعَظِيمِ۩","End":"٢٦"},{"SurahNumber":27,"VerseNumber":27,"Text":"۞قَالَ سَنَنظُرُ أَصَدَقۡتَ أَمۡ كُنتَ مِنَ ٱلۡكَٰذِبِينَ","End":"٢٧"},{"SurahNumber":27,"VerseNumber":28,"Text":"ٱذۡهَب بِّكِتَٰبِي هَٰذَا فَأَلۡقِهۡ إِلَيۡهِمۡ ثُمَّ تَوَلَّ عَنۡهُمۡ فَٱنظُرۡ مَاذَا يَرۡجِعُونَ","End":"٢٨"},{"SurahNumber":27,"VerseNumber":29,"Text":"قَالَتۡ يَـٰٓأَيُّهَا ٱلۡمَلَؤُاْ إِنِّيٓ أُلۡقِيَ إِلَيَّ كِتَٰبٞ كَرِيمٌ","End":"٢٩"},{"SurahNumber":27,"VerseNumber":30,"Text":"إِنَّهُۥ مِن سُلَيۡمَٰنَ وَإِنَّهُۥ بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ","End":"٣٠"},{"SurahNumber":27,"VerseNumber":31,"Text":"أَلَّا تَعۡلُواْ عَلَيَّ وَأۡتُونِي مُسۡلِمِينَ","End":"٣١"},{"SurahNumber":27,"VerseNumber":32,"Text":"قَالَتۡ يَـٰٓأَيُّهَا ٱلۡمَلَؤُاْ أَفۡتُونِي فِيٓ أَمۡرِي مَا كُنتُ قَاطِعَةً أَمۡرًا حَتَّىٰ تَشۡهَدُونِ","End":"٣٢"},{"SurahNumber":27,"VerseNumber":33,"Text":"قَالُواْ نَحۡنُ أُوْلُواْ قُوَّةٖ وَأُوْلُواْ بَأۡسٖ شَدِيدٖ وَٱلۡأَمۡرُ إِلَيۡكِ فَٱنظُرِي مَاذَا تَأۡمُرِينَ","End":"٣٣"},{"SurahNumber":27,"VerseNumber":34,"Text":"قَالَتۡ إِنَّ ٱلۡمُلُوكَ إِذَا دَخَلُواْ قَرۡيَةً أَفۡسَدُوهَا وَجَعَلُوٓاْ أَعِزَّةَ أَهۡلِهَآ أَذِلَّةٗۚ وَكَذَٰلِكَ يَفۡعَلُونَ","End":"٣٤"},{"SurahNumber":27,"VerseNumber":35,"Text":"وَإِنِّي مُرۡسِلَةٌ إِلَيۡهِم بِهَدِيَّةٖ فَنَاظِرَةُۢ بِمَ يَرۡجِعُ ٱلۡمُرۡسَلُونَ","End":"٣٥"},{"SurahNumber":27,"VerseNumber":36,"Text":"فَلَمَّا جَآءَ سُلَيۡمَٰنَ قَالَ أَتُمِدُّونَنِ بِمَالٖ فَمَآ ءَاتَىٰنِۦَ ٱللَّهُ خَيۡرٞ مِّمَّآ ءَاتَىٰكُمۚ بَلۡ أَنتُم بِهَدِيَّتِكُمۡ تَفۡرَحُونَ","End":"٣٦"},{"SurahNumber":27,"VerseNumber":37,"Text":"ٱرۡجِعۡ إِلَيۡهِمۡ فَلَنَأۡتِيَنَّهُم بِجُنُودٖ لَّا قِبَلَ لَهُم بِهَا وَلَنُخۡرِجَنَّهُم مِّنۡهَآ أَذِلَّةٗ وَهُمۡ صَٰغِرُونَ","End":"٣٧"},{"SurahNumber":27,"VerseNumber":38,"Text":"قَالَ يَـٰٓأَيُّهَا ٱلۡمَلَؤُاْ أَيُّكُمۡ يَأۡتِينِي بِعَرۡشِهَا قَبۡلَ أَن يَأۡتُونِي مُسۡلِمِينَ","End":"٣٨"},{"SurahNumber":27,"VerseNumber":39,"Text":"قَالَ عِفۡرِيتٞ مِّنَ ٱلۡجِنِّ أَنَا۠ ءَاتِيكَ بِهِۦ قَبۡلَ أَن تَقُومَ مِن مَّقَامِكَۖ وَإِنِّي عَلَيۡهِ لَقَوِيٌّ أَمِينٞ","End":"٣٩"},{"SurahNumber":27,"VerseNumber":40,"Text":"قَالَ ٱلَّذِي عِندَهُۥ عِلۡمٞ مِّنَ ٱلۡكِتَٰبِ أَنَا۠ ءَاتِيكَ بِهِۦ قَبۡلَ أَن يَرۡتَدَّ إِلَيۡكَ طَرۡفُكَۚ فَلَمَّا رَءَاهُ مُسۡتَقِرًّا عِندَهُۥ قَالَ هَٰذَا مِن فَضۡلِ رَبِّي لِيَبۡلُوَنِيٓ ءَأَشۡكُرُ أَمۡ أَكۡفُرُۖ وَمَن شَكَرَ فَإِنَّمَا يَشۡكُرُ لِنَفۡسِهِۦۖ وَمَن كَفَرَ فَإِنَّ رَبِّي غَنِيّٞ كَرِيمٞ","End":"٤٠"},{"SurahNumber":27,"VerseNumber":41,"Text":"قَالَ نَكِّرُواْ لَهَا عَرۡشَهَا نَنظُرۡ أَتَهۡتَدِيٓ أَمۡ تَكُونُ مِنَ ٱلَّذِينَ لَا يَهۡتَدُونَ","End":"٤١"},{"SurahNumber":27,"VerseNumber":42,"Text":"فَلَمَّا جَآءَتۡ قِيلَ أَهَٰكَذَا عَرۡشُكِۖ قَالَتۡ كَأَنَّهُۥ هُوَۚ وَأُوتِينَا ٱلۡعِلۡمَ مِن قَبۡلِهَا وَكُنَّا مُسۡلِمِينَ","End":"٤٢"},{"SurahNumber":27,"VerseNumber":43,"Text":"وَصَدَّهَا مَا كَانَت تَّعۡبُدُ مِن دُونِ ٱللَّهِۖ إِنَّهَا كَانَتۡ مِن قَوۡمٖ كَٰفِرِينَ","End":"٤٣"},{"SurahNumber":27,"VerseNumber":44,"Text":"قِيلَ لَهَا ٱدۡخُلِي ٱلصَّرۡحَۖ فَلَمَّا رَأَتۡهُ حَسِبَتۡهُ لُجَّةٗ وَكَشَفَتۡ عَن سَاقَيۡهَاۚ قَالَ إِنَّهُۥ صَرۡحٞ مُّمَرَّدٞ مِّن قَوَارِيرَۗ قَالَتۡ رَبِّ إِنِّي ظَلَمۡتُ نَفۡسِي وَأَسۡلَمۡتُ مَعَ سُلَيۡمَٰنَ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ","End":"٤٤"},{"SurahNumber":27,"VerseNumber":45,"Text":"وَلَقَدۡ أَرۡسَلۡنَآ إِلَىٰ ثَمُودَ أَخَاهُمۡ صَٰلِحًا أَنِ ٱعۡبُدُواْ ٱللَّهَ فَإِذَا هُمۡ فَرِيقَانِ يَخۡتَصِمُونَ","End":"٤٥"},{"SurahNumber":27,"VerseNumber":46,"Text":"قَالَ يَٰقَوۡمِ لِمَ تَسۡتَعۡجِلُونَ بِٱلسَّيِّئَةِ قَبۡلَ ٱلۡحَسَنَةِۖ لَوۡلَا تَسۡتَغۡفِرُونَ ٱللَّهَ لَعَلَّكُمۡ تُرۡحَمُونَ","End":"٤٦"},{"SurahNumber":27,"VerseNumber":47,"Text":"قَالُواْ ٱطَّيَّرۡنَا بِكَ وَبِمَن مَّعَكَۚ قَالَ طَـٰٓئِرُكُمۡ عِندَ ٱللَّهِۖ بَلۡ أَنتُمۡ قَوۡمٞ تُفۡتَنُونَ","End":"٤٧"},{"SurahNumber":27,"VerseNumber":48,"Text":"وَكَانَ فِي ٱلۡمَدِينَةِ تِسۡعَةُ رَهۡطٖ يُفۡسِدُونَ فِي ٱلۡأَرۡضِ وَلَا يُصۡلِحُونَ","End":"٤٨"},{"SurahNumber":27,"VerseNumber":49,"Text":"قَالُواْ تَقَاسَمُواْ بِٱللَّهِ لَنُبَيِّتَنَّهُۥ وَأَهۡلَهُۥ ثُمَّ لَنَقُولَنَّ لِوَلِيِّهِۦ مَا شَهِدۡنَا مَهۡلِكَ أَهۡلِهِۦ وَإِنَّا لَصَٰدِقُونَ","End":"٤٩"},{"SurahNumber":27,"VerseNumber":50,"Text":"وَمَكَرُواْ مَكۡرٗا وَمَكَرۡنَا مَكۡرٗا وَهُمۡ لَا يَشۡعُرُونَ","End":"٥٠"},{"SurahNumber":27,"VerseNumber":51,"Text":"فَٱنظُرۡ كَيۡفَ كَانَ عَٰقِبَةُ مَكۡرِهِمۡ أَنَّا دَمَّرۡنَٰهُمۡ وَقَوۡمَهُمۡ أَجۡمَعِينَ","End":"٥١"},{"SurahNumber":27,"VerseNumber":52,"Text":"فَتِلۡكَ بُيُوتُهُمۡ خَاوِيَةَۢ بِمَا ظَلَمُوٓاْۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَعۡلَمُونَ","End":"٥٢"},{"SurahNumber":27,"VerseNumber":53,"Text":"وَأَنجَيۡنَا ٱلَّذِينَ ءَامَنُواْ وَكَانُواْ يَتَّقُونَ","End":"٥٣"},{"SurahNumber":27,"VerseNumber":54,"Text":"وَلُوطًا إِذۡ قَالَ لِقَوۡمِهِۦٓ أَتَأۡتُونَ ٱلۡفَٰحِشَةَ وَأَنتُمۡ تُبۡصِرُونَ","End":"٥٤"},{"SurahNumber":27,"VerseNumber":55,"Text":"أَئِنَّكُمۡ لَتَأۡتُونَ ٱلرِّجَالَ شَهۡوَةٗ مِّن دُونِ ٱلنِّسَآءِۚ بَلۡ أَنتُمۡ قَوۡمٞ تَجۡهَلُونَ","End":"٥٥"},{"SurahNumber":27,"VerseNumber":56,"Text":"۞فَمَا كَانَ جَوَابَ قَوۡمِهِۦٓ إِلَّآ أَن قَالُوٓاْ أَخۡرِجُوٓاْ ءَالَ لُوطٖ مِّن قَرۡيَتِكُمۡۖ إِنَّهُمۡ أُنَاسٞ يَتَطَهَّرُونَ","End":"٥٦"},{"SurahNumber":27,"VerseNumber":57,"Text":"فَأَنجَيۡنَٰهُ وَأَهۡلَهُۥٓ إِلَّا ٱمۡرَأَتَهُۥ قَدَّرۡنَٰهَا مِنَ ٱلۡغَٰبِرِينَ","End":"٥٧"},{"SurahNumber":27,"VerseNumber":58,"Text":"وَأَمۡطَرۡنَا عَلَيۡهِم مَّطَرٗاۖ فَسَآءَ مَطَرُ ٱلۡمُنذَرِينَ","End":"٥٨"},{"SurahNumber":27,"VerseNumber":59,"Text":"قُلِ ٱلۡحَمۡدُ لِلَّهِ وَسَلَٰمٌ عَلَىٰ عِبَادِهِ ٱلَّذِينَ ٱصۡطَفَىٰٓۗ ءَآللَّهُ خَيۡرٌ أَمَّا يُشۡرِكُونَ","End":"٥٩"},{"SurahNumber":27,"VerseNumber":60,"Text":"أَمَّنۡ خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَأَنزَلَ لَكُم مِّنَ ٱلسَّمَآءِ مَآءٗ فَأَنۢبَتۡنَا بِهِۦ حَدَآئِقَ ذَاتَ بَهۡجَةٖ مَّا كَانَ لَكُمۡ أَن تُنۢبِتُواْ شَجَرَهَآۗ أَءِلَٰهٞ مَّعَ ٱللَّهِۚ بَلۡ هُمۡ قَوۡمٞ يَعۡدِلُونَ","End":"٦٠"},{"SurahNumber":27,"VerseNumber":61,"Text":"أَمَّن جَعَلَ ٱلۡأَرۡضَ قَرَارٗا وَجَعَلَ خِلَٰلَهَآ أَنۡهَٰرٗا وَجَعَلَ لَهَا رَوَٰسِيَ وَجَعَلَ بَيۡنَ ٱلۡبَحۡرَيۡنِ حَاجِزًاۗ أَءِلَٰهٞ مَّعَ ٱللَّهِۚ بَلۡ أَكۡثَرُهُمۡ لَا يَعۡلَمُونَ","End":"٦١"},{"SurahNumber":27,"VerseNumber":62,"Text":"أَمَّن يُجِيبُ ٱلۡمُضۡطَرَّ إِذَا دَعَاهُ وَيَكۡشِفُ ٱلسُّوٓءَ وَيَجۡعَلُكُمۡ خُلَفَآءَ ٱلۡأَرۡضِۗ أَءِلَٰهٞ مَّعَ ٱللَّهِۚ قَلِيلٗا مَّا تَذَكَّرُونَ","End":"٦٢"},{"SurahNumber":27,"VerseNumber":63,"Text":"أَمَّن يَهۡدِيكُمۡ فِي ظُلُمَٰتِ ٱلۡبَرِّ وَٱلۡبَحۡرِ وَمَن يُرۡسِلُ ٱلرِّيَٰحَ بُشۡرَۢا بَيۡنَ يَدَيۡ رَحۡمَتِهِۦٓۗ أَءِلَٰهٞ مَّعَ ٱللَّهِۚ تَعَٰلَى ٱللَّهُ عَمَّا يُشۡرِكُونَ","End":"٦٣"},{"SurahNumber":27,"VerseNumber":64,"Text":"أَمَّن يَبۡدَؤُاْ ٱلۡخَلۡقَ ثُمَّ يُعِيدُهُۥ وَمَن يَرۡزُقُكُم مِّنَ ٱلسَّمَآءِ وَٱلۡأَرۡضِۗ أَءِلَٰهٞ مَّعَ ٱللَّهِۚ قُلۡ هَاتُواْ بُرۡهَٰنَكُمۡ إِن كُنتُمۡ صَٰدِقِينَ","End":"٦٤"},{"SurahNumber":27,"VerseNumber":65,"Text":"قُل لَّا يَعۡلَمُ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ ٱلۡغَيۡبَ إِلَّا ٱللَّهُۚ وَمَا يَشۡعُرُونَ أَيَّانَ يُبۡعَثُونَ","End":"٦٥"},{"SurahNumber":27,"VerseNumber":66,"Text":"بَلِ ٱدَّـٰرَكَ عِلۡمُهُمۡ فِي ٱلۡأٓخِرَةِۚ بَلۡ هُمۡ فِي شَكّٖ مِّنۡهَاۖ بَلۡ هُم مِّنۡهَا عَمُونَ","End":"٦٦"},{"SurahNumber":27,"VerseNumber":67,"Text":"وَقَالَ ٱلَّذِينَ كَفَرُوٓاْ أَءِذَا كُنَّا تُرَٰبٗا وَءَابَآؤُنَآ أَئِنَّا لَمُخۡرَجُونَ","End":"٦٧"},{"SurahNumber":27,"VerseNumber":68,"Text":"لَقَدۡ وُعِدۡنَا هَٰذَا نَحۡنُ وَءَابَآؤُنَا مِن قَبۡلُ إِنۡ هَٰذَآ إِلَّآ أَسَٰطِيرُ ٱلۡأَوَّلِينَ","End":"٦٨"},{"SurahNumber":27,"VerseNumber":69,"Text":"قُلۡ سِيرُواْ فِي ٱلۡأَرۡضِ فَٱنظُرُواْ كَيۡفَ كَانَ عَٰقِبَةُ ٱلۡمُجۡرِمِينَ","End":"٦٩"},{"SurahNumber":27,"VerseNumber":70,"Text":"وَلَا تَحۡزَنۡ عَلَيۡهِمۡ وَلَا تَكُن فِي ضَيۡقٖ مِّمَّا يَمۡكُرُونَ","End":"٧٠"},{"SurahNumber":27,"VerseNumber":71,"Text":"وَيَقُولُونَ مَتَىٰ هَٰذَا ٱلۡوَعۡدُ إِن كُنتُمۡ صَٰدِقِينَ","End":"٧١"},{"SurahNumber":27,"VerseNumber":72,"Text":"قُلۡ عَسَىٰٓ أَن يَكُونَ رَدِفَ لَكُم بَعۡضُ ٱلَّذِي تَسۡتَعۡجِلُونَ","End":"٧٢"},{"SurahNumber":27,"VerseNumber":73,"Text":"وَإِنَّ رَبَّكَ لَذُو فَضۡلٍ عَلَى ٱلنَّاسِ وَلَٰكِنَّ أَكۡثَرَهُمۡ لَا يَشۡكُرُونَ","End":"٧٣"},{"SurahNumber":27,"VerseNumber":74,"Text":"وَإِنَّ رَبَّكَ لَيَعۡلَمُ مَا تُكِنُّ صُدُورُهُمۡ وَمَا يُعۡلِنُونَ","End":"٧٤"},{"SurahNumber":27,"VerseNumber":75,"Text":"وَمَا مِنۡ غَآئِبَةٖ فِي ٱلسَّمَآءِ وَٱلۡأَرۡضِ إِلَّا فِي كِتَٰبٖ مُّبِينٍ","End":"٧٥"},{"SurahNumber":27,"VerseNumber":76,"Text":"إِنَّ هَٰذَا ٱلۡقُرۡءَانَ يَقُصُّ عَلَىٰ بَنِيٓ إِسۡرَـٰٓءِيلَ أَكۡثَرَ ٱلَّذِي هُمۡ فِيهِ يَخۡتَلِفُونَ","End":"٧٦"},{"SurahNumber":27,"VerseNumber":77,"Text":"وَإِنَّهُۥ لَهُدٗى وَرَحۡمَةٞ لِّلۡمُؤۡمِنِينَ","End":"٧٧"},{"SurahNumber":27,"VerseNumber":78,"Text":"إِنَّ رَبَّكَ يَقۡضِي بَيۡنَهُم بِحُكۡمِهِۦۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡعَلِيمُ","End":"٧٨"},{"SurahNumber":27,"VerseNumber":79,"Text":"فَتَوَكَّلۡ عَلَى ٱللَّهِۖ إِنَّكَ عَلَى ٱلۡحَقِّ ٱلۡمُبِينِ","End":"٧٩"},{"SurahNumber":27,"VerseNumber":80,"Text":"إِنَّكَ لَا تُسۡمِعُ ٱلۡمَوۡتَىٰ وَلَا تُسۡمِعُ ٱلصُّمَّ ٱلدُّعَآءَ إِذَا وَلَّوۡاْ مُدۡبِرِينَ","End":"٨٠"},{"SurahNumber":27,"VerseNumber":81,"Text":"وَمَآ أَنتَ بِهَٰدِي ٱلۡعُمۡيِ عَن ضَلَٰلَتِهِمۡۖ إِن تُسۡمِعُ إِلَّا مَن يُؤۡمِنُ بِـَٔايَٰتِنَا فَهُم مُّسۡلِمُونَ","End":"٨١"},{"SurahNumber":27,"VerseNumber":82,"Text":"۞وَإِذَا وَقَعَ ٱلۡقَوۡلُ عَلَيۡهِمۡ أَخۡرَجۡنَا لَهُمۡ دَآبَّةٗ مِّنَ ٱلۡأَرۡضِ تُكَلِّمُهُمۡ أَنَّ ٱلنَّاسَ كَانُواْ بِـَٔايَٰتِنَا لَا يُوقِنُونَ","End":"٨٢"},{"SurahNumber":27,"VerseNumber":83,"Text":"وَيَوۡمَ نَحۡشُرُ مِن كُلِّ أُمَّةٖ فَوۡجٗا مِّمَّن يُكَذِّبُ بِـَٔايَٰتِنَا فَهُمۡ يُوزَعُونَ","End":"٨٣"},{"SurahNumber":27,"VerseNumber":84,"Text":"حَتَّىٰٓ إِذَا جَآءُو قَالَ أَكَذَّبۡتُم بِـَٔايَٰتِي وَلَمۡ تُحِيطُواْ بِهَا عِلۡمًا أَمَّاذَا كُنتُمۡ تَعۡمَلُونَ","End":"٨٤"},{"SurahNumber":27,"VerseNumber":85,"Text":"وَوَقَعَ ٱلۡقَوۡلُ عَلَيۡهِم بِمَا ظَلَمُواْ فَهُمۡ لَا يَنطِقُونَ","End":"٨٥"},{"SurahNumber":27,"VerseNumber":86,"Text":"أَلَمۡ يَرَوۡاْ أَنَّا جَعَلۡنَا ٱلَّيۡلَ لِيَسۡكُنُواْ فِيهِ وَٱلنَّهَارَ مُبۡصِرًاۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يُؤۡمِنُونَ","End":"٨٦"},{"SurahNumber":27,"VerseNumber":87,"Text":"وَيَوۡمَ يُنفَخُ فِي ٱلصُّورِ فَفَزِعَ مَن فِي ٱلسَّمَٰوَٰتِ وَمَن فِي ٱلۡأَرۡضِ إِلَّا مَن شَآءَ ٱللَّهُۚ وَكُلٌّ أَتَوۡهُ دَٰخِرِينَ","End":"٨٧"},{"SurahNumber":27,"VerseNumber":88,"Text":"وَتَرَى ٱلۡجِبَالَ تَحۡسَبُهَا جَامِدَةٗ وَهِيَ تَمُرُّ مَرَّ ٱلسَّحَابِۚ صُنۡعَ ٱللَّهِ ٱلَّذِيٓ أَتۡقَنَ كُلَّ شَيۡءٍۚ إِنَّهُۥ خَبِيرُۢ بِمَا تَفۡعَلُونَ","End":"٨٨"},{"SurahNumber":27,"VerseNumber":89,"Text":"مَن جَآءَ بِٱلۡحَسَنَةِ فَلَهُۥ خَيۡرٞ مِّنۡهَا وَهُم مِّن فَزَعٖ يَوۡمَئِذٍ ءَامِنُونَ","End":"٨٩"},{"SurahNumber":27,"VerseNumber":90,"Text":"وَمَن جَآءَ بِٱلسَّيِّئَةِ فَكُبَّتۡ وُجُوهُهُمۡ فِي ٱلنَّارِ هَلۡ تُجۡزَوۡنَ إِلَّا مَا كُنتُمۡ تَعۡمَلُونَ","End":"٩٠"},{"SurahNumber":27,"VerseNumber":91,"Text":"إِنَّمَآ أُمِرۡتُ أَنۡ أَعۡبُدَ رَبَّ هَٰذِهِ ٱلۡبَلۡدَةِ ٱلَّذِي حَرَّمَهَا وَلَهُۥ كُلُّ شَيۡءٖۖ وَأُمِرۡتُ أَنۡ أَكُونَ مِنَ ٱلۡمُسۡلِمِينَ","End":"٩١"},{"SurahNumber":27,"VerseNumber":92,"Text":"وَأَنۡ أَتۡلُوَاْ ٱلۡقُرۡءَانَۖ فَمَنِ ٱهۡتَدَىٰ فَإِنَّمَا يَهۡتَدِي لِنَفۡسِهِۦۖ وَمَن ضَلَّ فَقُلۡ إِنَّمَآ أَنَا۠ مِنَ ٱلۡمُنذِرِينَ","End":"٩٢"},{"SurahNumber":27,"VerseNumber":93,"Text":"وَقُلِ ٱلۡحَمۡدُ لِلَّهِ سَيُرِيكُمۡ ءَايَٰتِهِۦ فَتَعۡرِفُونَهَاۚ وَمَا رَبُّكَ بِغَٰفِلٍ عَمَّا تَعۡمَلُونَ","End":"٩٣"}],"Translations":[{"Id":10,"LanguageCode":"ara","Name":"ara-quran-la","Author":"Quran Transliteration","Language":"Arabic","Description":"Arabic - Latinised","Direction":"ltr","Source":"http://tanzil.net","Translations":[{"SurahNumber":27,"VerseNumber":1,"Text":"Taseen tilka ayatu alqurani wakitabin mubeenin"},{"SurahNumber":27,"VerseNumber":2,"Text":"Hudan wabushra lilmumineena"},{"SurahNumber":27,"VerseNumber":3,"Text":"Allatheena yuqeemoona alssalata wayutoona alzzakata wahum bialakhirati hum yooqinoona"},{"SurahNumber":27,"VerseNumber":4,"Text":"Inna allatheena la yuminoona bialakhirati zayyanna lahum aAAmalahum fahum yaAAmahoona"},{"SurahNumber":27,"VerseNumber":5,"Text":"Olaika allatheena lahum sooo alAAathabi wahum fee alakhirati humu alakhsaroona"},{"SurahNumber":27,"VerseNumber":6,"Text":"Wainnaka latulaqqa alqurana min ladun hakeemin AAaleemin"},{"SurahNumber":27,"VerseNumber":7,"Text":"Ith qala moosa liahlihi innee anastu naran saateekum minha bikhabarin aw ateekum bishihabin qabasin laAAallakum tastaloona"},{"SurahNumber":27,"VerseNumber":8,"Text":"Falamma jaaha noodiya an boorika man fee alnnari waman hawlaha wasubhana Allahi rabbi alAAalameena"},{"SurahNumber":27,"VerseNumber":9,"Text":"Ya moosa innahu ana Allahu alAAazeezu alhakeemu"},{"SurahNumber":27,"VerseNumber":10,"Text":"Waalqi AAasaka falamma raaha tahtazzu kaannaha jannun walla mudbiran walam yuAAaqqib ya moosa la takhaf innee la yakhafu ladayya almursaloona"},{"SurahNumber":27,"VerseNumber":11,"Text":"Illa man thalama thumma baddala husnan baAAda sooin fainnee ghafoorun raheemun"},{"SurahNumber":27,"VerseNumber":12,"Text":"Waadkhil yadaka fee jaybika takhruj baydaa min ghayri sooin fee tisAAi ayatin ila firAAawna waqawmihi innahum kanoo qawman fasiqeena"},{"SurahNumber":27,"VerseNumber":13,"Text":"Falamma jaathum ayatuna mubsiratan qaloo hatha sihrun mubeenun"},{"SurahNumber":27,"VerseNumber":14,"Text":"Wajahadoo biha waistayqanatha anfusuhum thulman waAAuluwwan faonthur kayfa kana AAaqibatu almufsideena"},{"SurahNumber":27,"VerseNumber":15,"Text":"Walaqad atayna dawooda wasulaymana AAilman waqala alhamdu lillahi allathee faddalana AAala katheerin min AAibadihi almumineena"},{"SurahNumber":27,"VerseNumber":16,"Text":"Wawaritha sulaymanu dawooda waqala ya ayyuha alnnasu AAullimna mantiqa alttayri waooteena min kulli shayin inna hatha lahuwa alfadlu almubeenu"},{"SurahNumber":27,"VerseNumber":17,"Text":"Wahushira lisulaymana junooduhu mina aljinni waalinsi waalttayri fahum yoozaAAoona"},{"SurahNumber":27,"VerseNumber":18,"Text":"Hatta itha ataw AAala wadi alnnamli qalat namlatun ya ayyuha alnnamlu odkhuloo masakinakum la yahtimannakum sulaymanu wajunooduhu wahum la yashAAuroona"},{"SurahNumber":27,"VerseNumber":19,"Text":"Fatabassama dahikan min qawliha waqala rabbi awziAAnee an ashkura niAAmataka allatee anAAamta AAalayya waAAala walidayya waan aAAmala salihan tardahu waadkhilnee birahmatika fee AAibadika alssaliheena"},{"SurahNumber":27,"VerseNumber":20,"Text":"Watafaqqada alttayra faqala ma liya la ara alhudhuda am kana mina alghaibeena"},{"SurahNumber":27,"VerseNumber":21,"Text":"LaoAAaththibannahu AAathaban shadeedan aw laathbahannahu aw layatiyannee bisultanin mubeenin"},{"SurahNumber":27,"VerseNumber":22,"Text":"Famakatha ghayra baAAeedin faqala ahattu bima lam tuhit bihi wajituka min sabain binabain yaqeenin"},{"SurahNumber":27,"VerseNumber":23,"Text":"Innee wajadtu imraatan tamlikuhum waootiyat min kulli shayin walaha AAarshun AAatheemun"},{"SurahNumber":27,"VerseNumber":24,"Text":"Wajadtuha waqawmaha yasjudoona lilshshamsi min dooni Allahi wazayyana lahumu alshshaytanu aAAmalahum fasaddahum AAani alssabeeli fahum la yahtadoona"},{"SurahNumber":27,"VerseNumber":25,"Text":"Alla yasjudoo lillahi allathee yukhriju alkhabaa fee alssamawati waalardi wayaAAlamu ma tukhfoona wama tuAAlinoona"},{"SurahNumber":27,"VerseNumber":26,"Text":"Allahu la ilaha illa huwa rabbu alAAarshi alAAatheemi"},{"SurahNumber":27,"VerseNumber":27,"Text":"Qala sananthuru asadaqta am kunta mina alkathibeena"},{"SurahNumber":27,"VerseNumber":28,"Text":"Ithhab bikitabee hatha faalqih ilayhim thumma tawalla AAanhum faonthur matha yarjiAAoona"},{"SurahNumber":27,"VerseNumber":29,"Text":"Qalat ya ayyuha almalao innee olqiya ilayya kitabun kareemun"},{"SurahNumber":27,"VerseNumber":30,"Text":"Innahu min sulaymana wainnahu bismi Allahi alrrahmani alrraheemi"},{"SurahNumber":27,"VerseNumber":31,"Text":"Alla taAAloo AAalayya watoonee muslimeena"},{"SurahNumber":27,"VerseNumber":32,"Text":"Qalat ya ayyuha almalao aftoonee fee amree ma kuntu qatiAAatan amran hatta tashhadoona"},{"SurahNumber":27,"VerseNumber":33,"Text":"Qaloo nahnu oloo quwwatin waoloo basin shadeedin waalamru ilayki faonthuree matha tamureena"},{"SurahNumber":27,"VerseNumber":34,"Text":"Qalat inna almulooka itha dakhaloo qaryatan afsadooha wajaAAaloo aAAizzata ahliha athillatan wakathalika yafAAaloona"},{"SurahNumber":27,"VerseNumber":35,"Text":"Wainnee mursilatun ilayhim bihadiyyatin fanathiratun bima yarjiAAu almursaloona"},{"SurahNumber":27,"VerseNumber":36,"Text":"Falamma jaa sulaymana qala atumiddoonani bimalin fama ataniya Allahu khayrun mimma atakum bal antum bihadiyyatikum tafrahoona"},{"SurahNumber":27,"VerseNumber":37,"Text":"IrjiAA ilayhim falanatiyannahum bijunoodin la qibala lahum biha walanukhrijannahum minha athillatan wahum saghiroona"},{"SurahNumber":27,"VerseNumber":38,"Text":"Qala ya ayyuha almalao ayyukum yateenee biAAarshiha qabla an yatoonee muslimeena"},{"SurahNumber":27,"VerseNumber":39,"Text":"Qala AAifreetun mina aljinni ana ateeka bihi qabla an taqooma min maqamika wainne AAalayhi laqawiyyun ameenun"},{"SurahNumber":27,"VerseNumber":40,"Text":"Qala allathee AAindahu AAilmun mina alkitabi ana ateeka bihi qabla an yartadda ilayka tarfuka falamma raahu mustaqirran AAindahu qala hatha min fadli rabbee liyabluwanee aashkuru am akfuru waman shakara fainnama yashkuru linafsihi waman kafara fainna rabbee ghaniyyun kareemun"},{"SurahNumber":27,"VerseNumber":41,"Text":"Qala nakkiroo laha AAarshaha nanthur atahtadee am takoonu mina allatheena la yahtadoona"},{"SurahNumber":27,"VerseNumber":42,"Text":"Falamma jaat qeela ahakatha AAarshuki qalat kaannahu huwa waooteena alAAilma min qabliha wakunna muslimeena"},{"SurahNumber":27,"VerseNumber":43,"Text":"Wasaddaha ma kanat taAAbudu min dooni Allahi innaha kanat min qawmin kafireena"},{"SurahNumber":27,"VerseNumber":44,"Text":"Qeela laha odkhulee alssarha falamma raathu hasibathu lujjatan wakashafat AAan saqayha qala innahu sarhun mumarradun min qawareera qalat rabbi innee thalamtu nafsee waaslamtu maAAa sulaymana lillahi rabbi alAAalameena"},{"SurahNumber":27,"VerseNumber":45,"Text":"Walaqad arsalna ila thamooda akhahum salihan ani oAAbudoo Allaha faitha hum fareeqani yakhtasimoona"},{"SurahNumber":27,"VerseNumber":46,"Text":"Qala ya qawmi lima tastaAAjiloona bialssayyiati qabla alhasanati lawla tastaghfiroona Allaha laAAallakum turhamoona"},{"SurahNumber":27,"VerseNumber":47,"Text":"Qaloo ittayyarna bika wabiman maAAaka qala tairukum AAinda Allahi bal antum qawmun tuftanoona"},{"SurahNumber":27,"VerseNumber":48,"Text":"Wakana fee almadeenati tisAAatu rahtin yufsidoona fee alardi wala yuslihoona"},{"SurahNumber":27,"VerseNumber":49,"Text":"Qaloo taqasamoo biAllahi lanubayyitannahu waahlahu thumma lanaqoolanna liwaliyyihi ma shahidna mahlika ahlihi wainna lasadiqoona"},{"SurahNumber":27,"VerseNumber":50,"Text":"Wamakaroo makran wamakarna makran wahum la yashAAuroona"},{"SurahNumber":27,"VerseNumber":51,"Text":"Faonthur kayfa kana AAaqibatu makrihim anna dammarnahum waqawmahum ajmaAAeena"},{"SurahNumber":27,"VerseNumber":52,"Text":"Fatilka buyootuhum khawiyatan bima thalamoo inna fee thalika laayatan liqawmin yaAAlamoona"},{"SurahNumber":27,"VerseNumber":53,"Text":"Waanjayna allatheena amanoo wakanoo yattaqoona"},{"SurahNumber":27,"VerseNumber":54,"Text":"Walootan ith qala liqawmihi atatoona alfahishata waantum tubsiroona"},{"SurahNumber":27,"VerseNumber":55,"Text":"Ainnakum latatoona alrrijala shahwatan min dooni alnnisai bal antum qawmun tajhaloona"},{"SurahNumber":27,"VerseNumber":56,"Text":"Fama kana jawaba qawmihi illa an qaloo akhrijoo ala lootin min qaryatikum innahum onasun yatatahharoona"},{"SurahNumber":27,"VerseNumber":57,"Text":"Faanjaynahu waahlahu illa imraatahu qaddarnaha mina alghabireena"},{"SurahNumber":27,"VerseNumber":58,"Text":"Waamtarna AAalayhim mataran fasaa mataru almunthareena"},{"SurahNumber":27,"VerseNumber":59,"Text":"Quli alhamdu lillahi wasalamun AAala AAibadihi allatheena istafa allahu khayrun amma yushrikoona"},{"SurahNumber":27,"VerseNumber":60,"Text":"Amman khalaqa alssamawati waalarda waanzala lakum mina alssamai maan faanbatna bihi hadaiqa thata bahjatin ma kana lakum an tunbitoo shajaraha ailahun maAAa Allahi bal hum qawmun yaAAdiloona"},{"SurahNumber":27,"VerseNumber":61,"Text":"Amman jaAAala alarda qararan wajaAAala khilalaha anharan wajaAAala laha rawasiya wajaAAala bayna albahrayni hajizan ailahun maAAa Allahi bal aktharuhum la yaAAlamoona"},{"SurahNumber":27,"VerseNumber":62,"Text":"Amman yujeebu almudtarra itha daAAahu wayakshifu alssooa wayajAAalukum khulafaa alardi ailahun maAAa Allahi qaleelan ma tathakkaroona"},{"SurahNumber":27,"VerseNumber":63,"Text":"Amman yahdeekum fee thulumati albarri waalbahri waman yursilu alrriyaha bushran bayna yaday rahmatihi ailahun maAAa Allahi taAAala Allahu AAamma yushrikoona"},{"SurahNumber":27,"VerseNumber":64,"Text":"Amman yabdao alkhalqa thumma yuAAeeduhu waman yarzuqukum mina alssamai waalardi ailahun maAAa Allahi qul hatoo burhanakum in kuntum sadiqeena"},{"SurahNumber":27,"VerseNumber":65,"Text":"Qul la yaAAlamu man fee alssamawati waalardi alghayba illa Allahu wama yashAAuroona ayyana yubAAathoona"},{"SurahNumber":27,"VerseNumber":66,"Text":"Bali iddaraka AAilmuhum fee alakhirati bal hum fee shakkin minha bal hum minha AAamoona"},{"SurahNumber":27,"VerseNumber":67,"Text":"Waqala allatheena kafaroo aitha kunna turaban waabaona ainna lamukhrajoona"},{"SurahNumber":27,"VerseNumber":68,"Text":"Laqad wuAAidna hatha nahnu waabaona min qablu in hatha illa asateeru alawwaleena"},{"SurahNumber":27,"VerseNumber":69,"Text":"Qul seeroo fee alardi faonthuroo kayfa kana AAaqibatu almujrimeena"},{"SurahNumber":27,"VerseNumber":70,"Text":"Wala tahzan AAalayhim wala takun fee dayqin mimma yamkuroona"},{"SurahNumber":27,"VerseNumber":71,"Text":"Wayaqooloona mata hatha alwaAAdu in kuntum sadiqeena"},{"SurahNumber":27,"VerseNumber":72,"Text":"Qul AAasa an yakoona radifa lakum baAAdu allathee tastaAAjiloona"},{"SurahNumber":27,"VerseNumber":73,"Text":"Wainna rabbaka lathoo fadlin AAala alnnasi walakinna aktharahum la yashkuroona"},{"SurahNumber":27,"VerseNumber":74,"Text":"Wainna rabbaka layaAAlamu ma tukinnu sudooruhum wama yuAAlinoona"},{"SurahNumber":27,"VerseNumber":75,"Text":"Wama min ghaibatin fee alssamai waalardi illa fee kitabin mubeenin"},{"SurahNumber":27,"VerseNumber":76,"Text":"Inna hatha alqurana yaqussu AAala banee israeela akthara allathee hum feehi yakhtalifoona"},{"SurahNumber":27,"VerseNumber":77,"Text":"Wainnahu lahudan warahmatun lilmumineena"},{"SurahNumber":27,"VerseNumber":78,"Text":"Inna rabbaka yaqdee baynahum bihukmihi wahuwa alAAazeezu alAAaleemu"},{"SurahNumber":27,"VerseNumber":79,"Text":"Fatawakkal AAala Allahi innaka AAala alhaqqi almubeeni"},{"SurahNumber":27,"VerseNumber":80,"Text":"Innaka la tusmiAAu almawta wala tusmiAAu alssumma aldduAAaa itha wallaw mudbireena"},{"SurahNumber":27,"VerseNumber":81,"Text":"Wama anta bihadee alAAumyi AAan dalalatihim in tusmiAAu illa man yuminu biayatina fahum muslimoona"},{"SurahNumber":27,"VerseNumber":82,"Text":"Waitha waqaAAa alqawlu AAalayhim akhrajna lahum dabbatan mina alardi tukallimuhum anna alnnasa kanoo biayatina la yooqinoona"},{"SurahNumber":27,"VerseNumber":83,"Text":"Wayawma nahshuru min kulli ommatin fawjan mimman yukaththibu biayatina fahum yoozaAAoona"},{"SurahNumber":27,"VerseNumber":84,"Text":"Hatta itha jaoo qala akaththabtum biayatee walam tuheetoo biha AAilman ammatha kuntum taAAmaloona"},{"SurahNumber":27,"VerseNumber":85,"Text":"WawaqaAAa alqawlu AAalayhim bima thalamoo fahum la yantiqoona"},{"SurahNumber":27,"VerseNumber":86,"Text":"Alam yaraw anna jaAAalna allayla liyaskunoo feehi waalnnahara mubsiran inna fee thalika laayatin liqawmin yuminoona"},{"SurahNumber":27,"VerseNumber":87,"Text":"Wayawma yunfakhu fee alssoori fafaziAAa man fee alssamawati waman fee alardi illa man shaa Allahu wakullun atawhu dakhireena"},{"SurahNumber":27,"VerseNumber":88,"Text":"Watara aljibala tahsabuha jamidatan wahiya tamurru marra alssahabi sunAAa Allahi allathee atqana kulla shayin innahu khabeerun bima tafAAaloona"},{"SurahNumber":27,"VerseNumber":89,"Text":"Man jaa bialhasanati falahu khayrun minha wahum min fazaAAin yawmaithin aminoona"},{"SurahNumber":27,"VerseNumber":90,"Text":"Waman jaa bialssayyiati fakubbat wujoohuhum fee alnnari hal tujzawna illa ma kuntum taAAmaloona"},{"SurahNumber":27,"VerseNumber":91,"Text":"Innama omirtu an aAAbuda rabba hathihi albaldati allathee harramaha walahu kullu shayin waomirtu an akoona mina almuslimeena"},{"SurahNumber":27,"VerseNumber":92,"Text":"Waan atluwa alqurana famani ihtada fainnama yahtadee linafsihi waman dalla faqul innama ana mina almunthireena"},{"SurahNumber":27,"VerseNumber":93,"Text":"Waquli alhamdu lillahi sayureekum ayatihi fataAArifoonaha wama rabbuka bighafilin AAamma taAAmaloona"}]},{"Id":34,"LanguageCode":"ara","Name":"ara-quranuthmanihaf1","Author":"Quran Uthmani Hafs No Diacritics","Language":"Arabic","Description":"Arabic","Direction":"rtl","Source":"https://qurancomplex.gov.sa/","Translations":[{"SurahNumber":27,"VerseNumber":1,"Text":"طس تلك ءايت القرءان وكتاب مبين"},{"SurahNumber":27,"VerseNumber":2,"Text":"هد ى وبشرى للمومنين"},{"SurahNumber":27,"VerseNumber":3,"Text":"الذين يقيمون الصلوة ويوتون الزكوة وهم بالاخرة هم يوقنون"},{"SurahNumber":27,"VerseNumber":4,"Text":"ان الذين لا يومنون بالاخرة زينا لهم اعملهم فهم يعمهون"},{"SurahNumber":27,"VerseNumber":5,"Text":"اوليك الذين لهم سوء العذاب وهم في الاخرة هم الاخسرون"},{"SurahNumber":27,"VerseNumber":6,"Text":"وانك لتلقى القرءان من لدن حكيم عليم"},{"SurahNumber":27,"VerseNumber":7,"Text":"اذ قال موسى لاهله اني ءانست نار ا ساتيكم منها بخبر او ءاتيكم بشهاب قبس لعلكم تصطلون"},{"SurahNumber":27,"VerseNumber":8,"Text":"فلما جاءها نودي ان بورك من في النار ومن حولها وسبحن الله رب العلمين"},{"SurahNumber":27,"VerseNumber":9,"Text":"يموسى انه انا الله العزيز الحكيم"},{"SurahNumber":27,"VerseNumber":10,"Text":"والق عصاك فلما رءاها تهتز كانها جان ولى مدبر ا ولم يعقب يموسى لا تخف اني لا يخاف لدي المرسلون"},{"SurahNumber":27,"VerseNumber":11,"Text":"الا من ظلم ثم بدل حسنا بعد سوء فاني غفور رحيم"},{"SurahNumber":27,"VerseNumber":12,"Text":"وادخل يدك في جيبك تخرج بيضاء من غير سوء في تسع ءايت الى فرعون وقومه انهم كانوا قوم ا فسقين"},{"SurahNumber":27,"VerseNumber":13,"Text":"فلما جاءتهم ءايتنا مبصرة قالوا هذا سحر مبين"},{"SurahNumber":27,"VerseNumber":14,"Text":"وجحدوا بها واستيقنتها انفسهم ظلم ا وعلو ا فانظر كيف كان عقبة المفسدين"},{"SurahNumber":27,"VerseNumber":15,"Text":"ولقد ءاتينا داود وسليمن علم ا وقالا الحمد لله الذي فضلنا على كثير من عباده المومنين"},{"SurahNumber":27,"VerseNumber":16,"Text":"وورث سليمن داود وقال يايها الناس علمنا منطق الطير واوتينا من كل شيء ان هذا لهو الفضل المبين"},{"SurahNumber":27,"VerseNumber":17,"Text":"وحشر لسليمن جنوده من الجن والانس والطير فهم يوزعون"},{"SurahNumber":27,"VerseNumber":18,"Text":"حتى اذا اتوا على واد النمل قالت نملة يايها النمل ادخلوا مسكنكم لا يحطمنكم سليمن وجنوده وهم لا يشعرون"},{"SurahNumber":27,"VerseNumber":19,"Text":"فتبسم ضاحك ا من قولها وقال رب اوزعني ان اشكر نعمتك التي انعمت علي وعلى ولدي وان اعمل صلح ا ترضىه وادخلني برحمتك في عبادك الصلحين"},{"SurahNumber":27,"VerseNumber":20,"Text":"وتفقد الطير فقال مالي لا ارى الهدهد ام كان من الغايبين"},{"SurahNumber":27,"VerseNumber":21,"Text":"لاعذبنه عذاب ا شديدا او لااذبحنه او لياتيني بسلطن مبين"},{"SurahNumber":27,"VerseNumber":22,"Text":"فمكث غير بعيد فقال احطت بما لم تحط به وجيتك من سبا بنبا يقين"},{"SurahNumber":27,"VerseNumber":23,"Text":"اني وجدت امراة تملكهم واوتيت من كل شيء ولها عرش عظيم"},{"SurahNumber":27,"VerseNumber":24,"Text":"وجدتها وقومها يسجدون للشمس من دون الله وزين لهم الشيطن اعملهم فصدهم عن السبيل فهم لا يهتدون"},{"SurahNumber":27,"VerseNumber":25,"Text":"الا يسجدوا لله الذي يخرج الخبء في السموت والارض ويعلم ما تخفون وما تعلنون"},{"SurahNumber":27,"VerseNumber":26,"Text":"الله لا اله الا هو رب العرش العظيم۩"},{"SurahNumber":27,"VerseNumber":27,"Text":"۞قال سننظر اصدقت ام كنت من الكذبين"},{"SurahNumber":27,"VerseNumber":28,"Text":"اذهب بكتبي هذا فالقه اليهم ثم تول عنهم فانظر ماذا يرجعون"},{"SurahNumber":27,"VerseNumber":29,"Text":"قالت يايها الملوا اني القي الي كتب كريم"},{"SurahNumber":27,"VerseNumber":30,"Text":"انه من سليمن وانه بسم الله الرحمن الرحيم"},{"SurahNumber":27,"VerseNumber":31,"Text":"الا تعلوا علي واتوني مسلمين"},{"SurahNumber":27,"VerseNumber":32,"Text":"قالت يايها الملوا افتوني في امري ما كنت قاطعة امرا حتى تشهدون"},{"SurahNumber":27,"VerseNumber":33,"Text":"قالوا نحن اولوا قوة واولوا باس شديد والامر اليك فانظري ماذا تامرين"},{"SurahNumber":27,"VerseNumber":34,"Text":"قالت ان الملوك اذا دخلوا قرية افسدوها وجعلوا اعزة اهلها اذلة وكذلك يفعلون"},{"SurahNumber":27,"VerseNumber":35,"Text":"واني مرسلة اليهم بهدية فناظرة بم يرجع المرسلون"},{"SurahNumber":27,"VerseNumber":36,"Text":"فلما جاء سليمن قال اتمدونن بمال فما ءاتىن الله خير مما ءاتىكم بل انتم بهديتكم تفرحون"},{"SurahNumber":27,"VerseNumber":37,"Text":"ارجع اليهم فلناتينهم بجنود لا قبل لهم بها ولنخرجنهم منها اذلة وهم صغرون"},{"SurahNumber":27,"VerseNumber":38,"Text":"قال يايها الملوا ايكم ياتيني بعرشها قبل ان ياتوني مسلمين"},{"SurahNumber":27,"VerseNumber":39,"Text":"قال عفريت من الجن انا ءاتيك به قبل ان تقوم من مقامك واني عليه لقوي امين"},{"SurahNumber":27,"VerseNumber":40,"Text":"قال الذي عنده علم من الكتب انا ءاتيك به قبل ان يرتد اليك طرفك فلما رءاه مستقرا عنده قال هذا من فضل ربي ليبلوني ءاشكر ام اكفر ومن شكر فانما يشكر لنفسه ومن كفر فان ربي غني كريم"},{"SurahNumber":27,"VerseNumber":41,"Text":"قال نكروا لها عرشها ننظر اتهتدي ام تكون من الذين لا يهتدون"},{"SurahNumber":27,"VerseNumber":42,"Text":"فلما جاءت قيل اهكذا عرشك قالت كانه هو واوتينا العلم من قبلها وكنا مسلمين"},{"SurahNumber":27,"VerseNumber":43,"Text":"وصدها ما كانت تعبد من دون الله انها كانت من قوم كفرين"},{"SurahNumber":27,"VerseNumber":44,"Text":"قيل لها ادخلي الصرح فلما راته حسبته لجة وكشفت عن ساقيها قال انه صرح ممرد من قوارير قالت رب اني ظلمت نفسي واسلمت مع سليمن لله رب العلمين"},{"SurahNumber":27,"VerseNumber":45,"Text":"ولقد ارسلنا الى ثمود اخاهم صلحا ان اعبدوا الله فاذا هم فريقان يختصمون"},{"SurahNumber":27,"VerseNumber":46,"Text":"قال يقوم لم تستعجلون بالسيية قبل الحسنة لولا تستغفرون الله لعلكم ترحمون"},{"SurahNumber":27,"VerseNumber":47,"Text":"قالوا اطيرنا بك وبمن معك قال طيركم عند الله بل انتم قوم تفتنون"},{"SurahNumber":27,"VerseNumber":48,"Text":"وكان في المدينة تسعة رهط يفسدون في الارض ولا يصلحون"},{"SurahNumber":27,"VerseNumber":49,"Text":"قالوا تقاسموا بالله لنبيتنه واهله ثم لنقولن لوليه ما شهدنا مهلك اهله وانا لصدقون"},{"SurahNumber":27,"VerseNumber":50,"Text":"ومكروا مكر ا ومكرنا مكر ا وهم لا يشعرون"},{"SurahNumber":27,"VerseNumber":51,"Text":"فانظر كيف كان عقبة مكرهم انا دمرنهم وقومهم اجمعين"},{"SurahNumber":27,"VerseNumber":52,"Text":"فتلك بيوتهم خاوية بما ظلموا ان في ذلك لاية لقوم يعلمون"},{"SurahNumber":27,"VerseNumber":53,"Text":"وانجينا الذين ءامنوا وكانوا يتقون"},{"SurahNumber":27,"VerseNumber":54,"Text":"ولوطا اذ قال لقومه اتاتون الفحشة وانتم تبصرون"},{"SurahNumber":27,"VerseNumber":55,"Text":"اينكم لتاتون الرجال شهوة من دون النساء بل انتم قوم تجهلون"},{"SurahNumber":27,"VerseNumber":56,"Text":"۞فما كان جواب قومه الا ان قالوا اخرجوا ءال لوط من قريتكم انهم اناس يتطهرون"},{"SurahNumber":27,"VerseNumber":57,"Text":"فانجينه واهله الا امراته قدرنها من الغبرين"},{"SurahNumber":27,"VerseNumber":58,"Text":"وامطرنا عليهم مطر ا فساء مطر المنذرين"},{"SurahNumber":27,"VerseNumber":59,"Text":"قل الحمد لله وسلم على عباده الذين اصطفى ءالله خير اما يشركون"},{"SurahNumber":27,"VerseNumber":60,"Text":"امن خلق السموت والارض وانزل لكم من السماء ماء فانبتنا به حدايق ذات بهجة ما كان لكم ان تنبتوا شجرها اءله مع الله بل هم قوم يعدلون"},{"SurahNumber":27,"VerseNumber":61,"Text":"امن جعل الارض قرار ا وجعل خللها انهر ا وجعل لها روسي وجعل بين البحرين حاجزا اءله مع الله بل اكثرهم لا يعلمون"},{"SurahNumber":27,"VerseNumber":62,"Text":"امن يجيب المضطر اذا دعاه ويكشف السوء ويجعلكم خلفاء الارض اءله مع الله قليل ا ما تذكرون"},{"SurahNumber":27,"VerseNumber":63,"Text":"امن يهديكم في ظلمت البر والبحر ومن يرسل الريح بشرا بين يدي رحمته اءله مع الله تعلى الله عما يشركون"},{"SurahNumber":27,"VerseNumber":64,"Text":"امن يبدوا الخلق ثم يعيده ومن يرزقكم من السماء والارض اءله مع الله قل هاتوا برهنكم ان كنتم صدقين"},{"SurahNumber":27,"VerseNumber":65,"Text":"قل لا يعلم من في السموت والارض الغيب الا الله وما يشعرون ايان يبعثون"},{"SurahNumber":27,"VerseNumber":66,"Text":"بل ادرك علمهم في الاخرة بل هم في شك منها بل هم منها عمون"},{"SurahNumber":27,"VerseNumber":67,"Text":"وقال الذين كفروا اءذا كنا ترب ا وءاباونا اينا لمخرجون"},{"SurahNumber":27,"VerseNumber":68,"Text":"لقد وعدنا هذا نحن وءاباونا من قبل ان هذا الا اسطير الاولين"},{"SurahNumber":27,"VerseNumber":69,"Text":"قل سيروا في الارض فانظروا كيف كان عقبة المجرمين"},{"SurahNumber":27,"VerseNumber":70,"Text":"ولا تحزن عليهم ولا تكن في ضيق مما يمكرون"},{"SurahNumber":27,"VerseNumber":71,"Text":"ويقولون متى هذا الوعد ان كنتم صدقين"},{"SurahNumber":27,"VerseNumber":72,"Text":"قل عسى ان يكون ردف لكم بعض الذي تستعجلون"},{"SurahNumber":27,"VerseNumber":73,"Text":"وان ربك لذو فضل على الناس ولكن اكثرهم لا يشكرون"},{"SurahNumber":27,"VerseNumber":74,"Text":"وان ربك ليعلم ما تكن صدورهم وما يعلنون"},{"SurahNumber":27,"VerseNumber":75,"Text":"وما من غايبة في السماء والارض الا في كتب مبين"},{"SurahNumber":27,"VerseNumber":76,"Text":"ان هذا القرءان يقص على بني اسرءيل اكثر الذي هم فيه يختلفون"},{"SurahNumber":27,"VerseNumber":77,"Text":"وانه لهد ى ورحمة للمومنين"},{"SurahNumber":27,"VerseNumber":78,"Text":"ان ربك يقضي بينهم بحكمه وهو العزيز العليم"},{"SurahNumber":27,"VerseNumber":79,"Text":"فتوكل على الله انك على الحق المبين"},{"SurahNumber":27,"VerseNumber":80,"Text":"انك لا تسمع الموتى ولا تسمع الصم الدعاء اذا ولوا مدبرين"},{"SurahNumber":27,"VerseNumber":81,"Text":"وما انت بهدي العمي عن ضللتهم ان تسمع الا من يومن بايتنا فهم مسلمون"},{"SurahNumber":27,"VerseNumber":82,"Text":"۞واذا وقع القول عليهم اخرجنا لهم دابة من الارض تكلمهم ان الناس كانوا بايتنا لا يوقنون"},{"SurahNumber":27,"VerseNumber":83,"Text":"ويوم نحشر من كل امة فوج ا ممن يكذب بايتنا فهم يوزعون"},{"SurahNumber":27,"VerseNumber":84,"Text":"حتى اذا جاءو قال اكذبتم بايتي ولم تحيطوا بها علما اماذا كنتم تعملون"},{"SurahNumber":27,"VerseNumber":85,"Text":"ووقع القول عليهم بما ظلموا فهم لا ينطقون"},{"SurahNumber":27,"VerseNumber":86,"Text":"الم يروا انا جعلنا اليل ليسكنوا فيه والنهار مبصرا ان في ذلك لايت لقوم يومنون"},{"SurahNumber":27,"VerseNumber":87,"Text":"ويوم ينفخ في الصور ففزع من في السموت ومن في الارض الا من شاء الله وكل اتوه دخرين"},{"SurahNumber":27,"VerseNumber":88,"Text":"وترى الجبال تحسبها جامدة وهي تمر مر السحاب صنع الله الذي اتقن كل شيء انه خبير بما تفعلون"},{"SurahNumber":27,"VerseNumber":89,"Text":"من جاء بالحسنة فله خير منها وهم من فزع يوميذ ءامنون"},{"SurahNumber":27,"VerseNumber":90,"Text":"ومن جاء بالسيية فكبت وجوههم في النار هل تجزون الا ما كنتم تعملون"},{"SurahNumber":27,"VerseNumber":91,"Text":"انما امرت ان اعبد رب هذه البلدة الذي حرمها وله كل شيء وامرت ان اكون من المسلمين"},{"SurahNumber":27,"VerseNumber":92,"Text":"وان اتلوا القرءان فمن اهتدى فانما يهتدي لنفسه ومن ضل فقل انما انا من المنذرين"},{"SurahNumber":27,"VerseNumber":93,"Text":"وقل الحمد لله سيريكم ءايته فتعرفونها وما ربك بغفل عما تعملون"}]}]}