{"SurahNumber":57,"HasBismillah":true,"Verses":[{"SurahNumber":57,"VerseNumber":1,"Text":"سَبَّحَ لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","End":"١"},{"SurahNumber":57,"VerseNumber":2,"Text":"لَهُۥ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ يُحۡيِۦ وَيُمِيتُۖ وَهُوَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ","End":"٢"},{"SurahNumber":57,"VerseNumber":3,"Text":"هُوَ ٱلۡأَوَّلُ وَٱلۡأٓخِرُ وَٱلظَّـٰهِرُ وَٱلۡبَاطِنُۖ وَهُوَ بِكُلِّ شَيۡءٍ عَلِيمٌ","End":"٣"},{"SurahNumber":57,"VerseNumber":4,"Text":"هُوَ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ فِي سِتَّةِ أَيَّامٖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ يَعۡلَمُ مَا يَلِجُ فِي ٱلۡأَرۡضِ وَمَا يَخۡرُجُ مِنۡهَا وَمَا يَنزِلُ مِنَ ٱلسَّمَآءِ وَمَا يَعۡرُجُ فِيهَاۖ وَهُوَ مَعَكُمۡ أَيۡنَ مَا كُنتُمۡۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ","End":"٤"},{"SurahNumber":57,"VerseNumber":5,"Text":"لَّهُۥ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَإِلَى ٱللَّهِ تُرۡجَعُ ٱلۡأُمُورُ","End":"٥"},{"SurahNumber":57,"VerseNumber":6,"Text":"يُولِجُ ٱلَّيۡلَ فِي ٱلنَّهَارِ وَيُولِجُ ٱلنَّهَارَ فِي ٱلَّيۡلِۚ وَهُوَ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ","End":"٦"},{"SurahNumber":57,"VerseNumber":7,"Text":"ءَامِنُواْ بِٱللَّهِ وَرَسُولِهِۦ وَأَنفِقُواْ مِمَّا جَعَلَكُم مُّسۡتَخۡلَفِينَ فِيهِۖ فَٱلَّذِينَ ءَامَنُواْ مِنكُمۡ وَأَنفَقُواْ لَهُمۡ أَجۡرٞ كَبِيرٞ","End":"٧"},{"SurahNumber":57,"VerseNumber":8,"Text":"وَمَا لَكُمۡ لَا تُؤۡمِنُونَ بِٱللَّهِ وَٱلرَّسُولُ يَدۡعُوكُمۡ لِتُؤۡمِنُواْ بِرَبِّكُمۡ وَقَدۡ أَخَذَ مِيثَٰقَكُمۡ إِن كُنتُم مُّؤۡمِنِينَ","End":"٨"},{"SurahNumber":57,"VerseNumber":9,"Text":"هُوَ ٱلَّذِي يُنَزِّلُ عَلَىٰ عَبۡدِهِۦٓ ءَايَٰتِۭ بَيِّنَٰتٖ لِّيُخۡرِجَكُم مِّنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِۚ وَإِنَّ ٱللَّهَ بِكُمۡ لَرَءُوفٞ رَّحِيمٞ","End":"٩"},{"SurahNumber":57,"VerseNumber":10,"Text":"وَمَا لَكُمۡ أَلَّا تُنفِقُواْ فِي سَبِيلِ ٱللَّهِ وَلِلَّهِ مِيرَٰثُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ لَا يَسۡتَوِي مِنكُم مَّنۡ أَنفَقَ مِن قَبۡلِ ٱلۡفَتۡحِ وَقَٰتَلَۚ أُوْلَـٰٓئِكَ أَعۡظَمُ دَرَجَةٗ مِّنَ ٱلَّذِينَ أَنفَقُواْ مِنۢ بَعۡدُ وَقَٰتَلُواْۚ وَكُلّٗا وَعَدَ ٱللَّهُ ٱلۡحُسۡنَىٰۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرٞ","End":"١٠"},{"SurahNumber":57,"VerseNumber":11,"Text":"مَّن ذَا ٱلَّذِي يُقۡرِضُ ٱللَّهَ قَرۡضًا حَسَنٗا فَيُضَٰعِفَهُۥ لَهُۥ وَلَهُۥٓ أَجۡرٞ كَرِيمٞ","End":"١١"},{"SurahNumber":57,"VerseNumber":12,"Text":"يَوۡمَ تَرَى ٱلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِ يَسۡعَىٰ نُورُهُم بَيۡنَ أَيۡدِيهِمۡ وَبِأَيۡمَٰنِهِمۖ بُشۡرَىٰكُمُ ٱلۡيَوۡمَ جَنَّـٰتٞ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَاۚ ذَٰلِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ","End":"١٢"},{"SurahNumber":57,"VerseNumber":13,"Text":"يَوۡمَ يَقُولُ ٱلۡمُنَٰفِقُونَ وَٱلۡمُنَٰفِقَٰتُ لِلَّذِينَ ءَامَنُواْ ٱنظُرُونَا نَقۡتَبِسۡ مِن نُّورِكُمۡ قِيلَ ٱرۡجِعُواْ وَرَآءَكُمۡ فَٱلۡتَمِسُواْ نُورٗاۖ فَضُرِبَ بَيۡنَهُم بِسُورٖ لَّهُۥ بَابُۢ بَاطِنُهُۥ فِيهِ ٱلرَّحۡمَةُ وَظَٰهِرُهُۥ مِن قِبَلِهِ ٱلۡعَذَابُ","End":"١٣"},{"SurahNumber":57,"VerseNumber":14,"Text":"يُنَادُونَهُمۡ أَلَمۡ نَكُن مَّعَكُمۡۖ قَالُواْ بَلَىٰ وَلَٰكِنَّكُمۡ فَتَنتُمۡ أَنفُسَكُمۡ وَتَرَبَّصۡتُمۡ وَٱرۡتَبۡتُمۡ وَغَرَّتۡكُمُ ٱلۡأَمَانِيُّ حَتَّىٰ جَآءَ أَمۡرُ ٱللَّهِ وَغَرَّكُم بِٱللَّهِ ٱلۡغَرُورُ","End":"١٤"},{"SurahNumber":57,"VerseNumber":15,"Text":"فَٱلۡيَوۡمَ لَا يُؤۡخَذُ مِنكُمۡ فِدۡيَةٞ وَلَا مِنَ ٱلَّذِينَ كَفَرُواْۚ مَأۡوَىٰكُمُ ٱلنَّارُۖ هِيَ مَوۡلَىٰكُمۡۖ وَبِئۡسَ ٱلۡمَصِيرُ","End":"١٥"},{"SurahNumber":57,"VerseNumber":16,"Text":"۞أَلَمۡ يَأۡنِ لِلَّذِينَ ءَامَنُوٓاْ أَن تَخۡشَعَ قُلُوبُهُمۡ لِذِكۡرِ ٱللَّهِ وَمَا نَزَلَ مِنَ ٱلۡحَقِّ وَلَا يَكُونُواْ كَٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ مِن قَبۡلُ فَطَالَ عَلَيۡهِمُ ٱلۡأَمَدُ فَقَسَتۡ قُلُوبُهُمۡۖ وَكَثِيرٞ مِّنۡهُمۡ فَٰسِقُونَ","End":"١٦"},{"SurahNumber":57,"VerseNumber":17,"Text":"ٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ يُحۡيِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَاۚ قَدۡ بَيَّنَّا لَكُمُ ٱلۡأٓيَٰتِ لَعَلَّكُمۡ تَعۡقِلُونَ","End":"١٧"},{"SurahNumber":57,"VerseNumber":18,"Text":"إِنَّ ٱلۡمُصَّدِّقِينَ وَٱلۡمُصَّدِّقَٰتِ وَأَقۡرَضُواْ ٱللَّهَ قَرۡضًا حَسَنٗا يُضَٰعَفُ لَهُمۡ وَلَهُمۡ أَجۡرٞ كَرِيمٞ","End":"١٨"},{"SurahNumber":57,"VerseNumber":19,"Text":"وَٱلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَرُسُلِهِۦٓ أُوْلَـٰٓئِكَ هُمُ ٱلصِّدِّيقُونَۖ وَٱلشُّهَدَآءُ عِندَ رَبِّهِمۡ لَهُمۡ أَجۡرُهُمۡ وَنُورُهُمۡۖ وَٱلَّذِينَ كَفَرُواْ وَكَذَّبُواْ بِـَٔايَٰتِنَآ أُوْلَـٰٓئِكَ أَصۡحَٰبُ ٱلۡجَحِيمِ","End":"١٩"},{"SurahNumber":57,"VerseNumber":20,"Text":"ٱعۡلَمُوٓاْ أَنَّمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَا لَعِبٞ وَلَهۡوٞ وَزِينَةٞ وَتَفَاخُرُۢ بَيۡنَكُمۡ وَتَكَاثُرٞ فِي ٱلۡأَمۡوَٰلِ وَٱلۡأَوۡلَٰدِۖ كَمَثَلِ غَيۡثٍ أَعۡجَبَ ٱلۡكُفَّارَ نَبَاتُهُۥ ثُمَّ يَهِيجُ فَتَرَىٰهُ مُصۡفَرّٗا ثُمَّ يَكُونُ حُطَٰمٗاۖ وَفِي ٱلۡأٓخِرَةِ عَذَابٞ شَدِيدٞ وَمَغۡفِرَةٞ مِّنَ ٱللَّهِ وَرِضۡوَٰنٞۚ وَمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَآ إِلَّا مَتَٰعُ ٱلۡغُرُورِ","End":"٢٠"},{"SurahNumber":57,"VerseNumber":21,"Text":"سَابِقُوٓاْ إِلَىٰ مَغۡفِرَةٖ مِّن رَّبِّكُمۡ وَجَنَّةٍ عَرۡضُهَا كَعَرۡضِ ٱلسَّمَآءِ وَٱلۡأَرۡضِ أُعِدَّتۡ لِلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَرُسُلِهِۦۚ ذَٰلِكَ فَضۡلُ ٱللَّهِ يُؤۡتِيهِ مَن يَشَآءُۚ وَٱللَّهُ ذُو ٱلۡفَضۡلِ ٱلۡعَظِيمِ","End":"٢١"},{"SurahNumber":57,"VerseNumber":22,"Text":"مَآ أَصَابَ مِن مُّصِيبَةٖ فِي ٱلۡأَرۡضِ وَلَا فِيٓ أَنفُسِكُمۡ إِلَّا فِي كِتَٰبٖ مِّن قَبۡلِ أَن نَّبۡرَأَهَآۚ إِنَّ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٞ","End":"٢٢"},{"SurahNumber":57,"VerseNumber":23,"Text":"لِّكَيۡلَا تَأۡسَوۡاْ عَلَىٰ مَا فَاتَكُمۡ وَلَا تَفۡرَحُواْ بِمَآ ءَاتَىٰكُمۡۗ وَٱللَّهُ لَا يُحِبُّ كُلَّ مُخۡتَالٖ فَخُورٍ","End":"٢٣"},{"SurahNumber":57,"VerseNumber":24,"Text":"ٱلَّذِينَ يَبۡخَلُونَ وَيَأۡمُرُونَ ٱلنَّاسَ بِٱلۡبُخۡلِۗ وَمَن يَتَوَلَّ فَإِنَّ ٱللَّهَ هُوَ ٱلۡغَنِيُّ ٱلۡحَمِيدُ","End":"٢٤"},{"SurahNumber":57,"VerseNumber":25,"Text":"لَقَدۡ أَرۡسَلۡنَا رُسُلَنَا بِٱلۡبَيِّنَٰتِ وَأَنزَلۡنَا مَعَهُمُ ٱلۡكِتَٰبَ وَٱلۡمِيزَانَ لِيَقُومَ ٱلنَّاسُ بِٱلۡقِسۡطِۖ وَأَنزَلۡنَا ٱلۡحَدِيدَ فِيهِ بَأۡسٞ شَدِيدٞ وَمَنَٰفِعُ لِلنَّاسِ وَلِيَعۡلَمَ ٱللَّهُ مَن يَنصُرُهُۥ وَرُسُلَهُۥ بِٱلۡغَيۡبِۚ إِنَّ ٱللَّهَ قَوِيٌّ عَزِيزٞ","End":"٢٥"},{"SurahNumber":57,"VerseNumber":26,"Text":"وَلَقَدۡ أَرۡسَلۡنَا نُوحٗا وَإِبۡرَٰهِيمَ وَجَعَلۡنَا فِي ذُرِّيَّتِهِمَا ٱلنُّبُوَّةَ وَٱلۡكِتَٰبَۖ فَمِنۡهُم مُّهۡتَدٖۖ وَكَثِيرٞ مِّنۡهُمۡ فَٰسِقُونَ","End":"٢٦"},{"SurahNumber":57,"VerseNumber":27,"Text":"ثُمَّ قَفَّيۡنَا عَلَىٰٓ ءَاثَٰرِهِم بِرُسُلِنَا وَقَفَّيۡنَا بِعِيسَى ٱبۡنِ مَرۡيَمَ وَءَاتَيۡنَٰهُ ٱلۡإِنجِيلَۖ وَجَعَلۡنَا فِي قُلُوبِ ٱلَّذِينَ ٱتَّبَعُوهُ رَأۡفَةٗ وَرَحۡمَةٗۚ وَرَهۡبَانِيَّةً ٱبۡتَدَعُوهَا مَا كَتَبۡنَٰهَا عَلَيۡهِمۡ إِلَّا ٱبۡتِغَآءَ رِضۡوَٰنِ ٱللَّهِ فَمَا رَعَوۡهَا حَقَّ رِعَايَتِهَاۖ فَـَٔاتَيۡنَا ٱلَّذِينَ ءَامَنُواْ مِنۡهُمۡ أَجۡرَهُمۡۖ وَكَثِيرٞ مِّنۡهُمۡ فَٰسِقُونَ","End":"٢٧"},{"SurahNumber":57,"VerseNumber":28,"Text":"يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَءَامِنُواْ بِرَسُولِهِۦ يُؤۡتِكُمۡ كِفۡلَيۡنِ مِن رَّحۡمَتِهِۦ وَيَجۡعَل لَّكُمۡ نُورٗا تَمۡشُونَ بِهِۦ وَيَغۡفِرۡ لَكُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ","End":"٢٨"},{"SurahNumber":57,"VerseNumber":29,"Text":"لِّئَلَّا يَعۡلَمَ أَهۡلُ ٱلۡكِتَٰبِ أَلَّا يَقۡدِرُونَ عَلَىٰ شَيۡءٖ مِّن فَضۡلِ ٱللَّهِ وَأَنَّ ٱلۡفَضۡلَ بِيَدِ ٱللَّهِ يُؤۡتِيهِ مَن يَشَآءُۚ وَٱللَّهُ ذُو ٱلۡفَضۡلِ ٱلۡعَظِيمِ","End":"٢٩"}],"Translations":[{"Id":10,"LanguageCode":"ara","Name":"ara-quran-la","Author":"Quran Transliteration","Language":"Arabic","Description":"Arabic - Latinised","Direction":"ltr","Source":"http://tanzil.net","Translations":[{"SurahNumber":57,"VerseNumber":1,"Text":"Sabbaha lillahi ma fee alssamawati waalardi wahuwa alAAazeezu alhakeemu"},{"SurahNumber":57,"VerseNumber":2,"Text":"Lahu mulku alssamawati waalardi yuhyee wayumeetu wahuwa AAala kulli shayin qadeerun"},{"SurahNumber":57,"VerseNumber":3,"Text":"Huwa alawwalu waalakhiru waalththahiru waalbatinu wahuwa bikulli shayin AAaleemun"},{"SurahNumber":57,"VerseNumber":4,"Text":"Huwa allathee khalaqa alssamawati waalarda fee sittati ayyamin thumma istawa AAala alAAarshi yaAAlamu ma yaliju fee alardi wama yakhruju minha wama yanzilu mina alssamai wama yaAAruju feeha wahuwa maAAakum ayna ma kuntum waAllahu bima taAAmaloona baseerun"},{"SurahNumber":57,"VerseNumber":5,"Text":"Lahu mulku alssamawati waalardi waila Allahi turjaAAu alomooru"},{"SurahNumber":57,"VerseNumber":6,"Text":"Yooliju allayla fee alnnahari wayooliju alnnahara fee allayi wahuwa AAaleemun bithati alssudoori"},{"SurahNumber":57,"VerseNumber":7,"Text":"Aminoo biAllahi warasoolihi waanfiqoo mimma jaAAalakum mustakhlafeena feehi faallatheena amanoo minkum waanfaqoo lahum ajrun kabeerun"},{"SurahNumber":57,"VerseNumber":8,"Text":"Wama lakum la tuminoona biAllahi waalrrasoolu yadAAookum lituminoo birabbikum waqad akhatha meethaqakum in kuntum mumineena"},{"SurahNumber":57,"VerseNumber":9,"Text":"Huwa allathee yunazzilu AAala AAabdihi ayatin bayyinatin liyukhrijakum mina alththulumati ila alnnoori wainna Allaha bikum laraoofun raheemun"},{"SurahNumber":57,"VerseNumber":10,"Text":"Wama lakum alla tunfiqoo fee sabeeli Allahi walillahi meerathu alssamawati waalardi la yastawee minkum man anfaqa min qabli alfathi waqatala olaika aAAthamu darajatan mina allatheena anfaqoo min baAAdu waqataloo wakullan waAAada Allahu alhusna waAllahu bima taAAmaloona khabeerun"},{"SurahNumber":57,"VerseNumber":11,"Text":"Man tha allathee yuqridu Allaha qardan hasanan fayudaAAifahu lahu walahu ajrun kareemun"},{"SurahNumber":57,"VerseNumber":12,"Text":"Yawma tara almumineena waalmuminati yasAAa nooruhum bayna aydeehim wabiaymanihim bushrakumu alyawma jannatun tajree min tahtiha alanharu khalideena feeha thalika huwa alfawzu alAAatheemu"},{"SurahNumber":57,"VerseNumber":13,"Text":"Yawma yaqoolu almunafiqoona waalmunafiqatu lillatheena amanoo onthuroona naqtabis min noorikum qeela irjiAAoo waraakum failtamisoo nooran faduriba baynahum bisoorin lahu babun batinuhu feehi alrrahmatu wathahiruhu min qibalihi alAAathabu"},{"SurahNumber":57,"VerseNumber":14,"Text":"Yunadoonahum alam nakun maAAakum qaloo bala walakinnakum fatantum anfusakum watarabbastum wairtabtum wagharratkumu alamaniyyu hatta jaa amru Allahi wagharrakum biAllahi algharooru"},{"SurahNumber":57,"VerseNumber":15,"Text":"Faalyawma la yukhathu minkum fidyatun wala mina allatheena kafaroo mawakumu alnnaru hiya mawlakum wabisa almaseeru"},{"SurahNumber":57,"VerseNumber":16,"Text":"Alam yani lillatheena amanoo an takhshaAAa quloobuhum lithikri Allahi wama nazala mina alhaqqi wala yakoonoo kaallatheena ootoo alkitaba min qablu fatala AAalayhimu alamadu faqasat quloobuhum wakatheerun minhum fasiqoona"},{"SurahNumber":57,"VerseNumber":17,"Text":"IAAlamoo anna Allaha yuhyee alarda baAAda mawtiha qad bayyanna lakumu alayati laAAallakum taAAqiloona"},{"SurahNumber":57,"VerseNumber":18,"Text":"Inna almussaddiqeena waalmussaddiqati waaqradoo Allaha qardan hasanan yudaAAafu lahum walahum ajrun kareemun"},{"SurahNumber":57,"VerseNumber":19,"Text":"Waallatheena amanoo biAllahi warusulihi olaika humu alssiddeeqoona waalshshuhadao AAinda rabbihim lahum ajruhum wanooruhum waallatheena kafaroo wakaththaboo biayatina olaika ashabu aljaheemi"},{"SurahNumber":57,"VerseNumber":20,"Text":"IAAlamoo annama alhayatu alddunya laAAibun walahwun wazeenatun watafakhurun baynakum watakathurun fee alamwali waalawladi kamathali ghaythin aAAjaba alkuffara nabatuhu thumma yaheeju fatarahu musfarran thumma yakoonu hutaman wafee alakhirati AAathabun shadeedun wamaghfiratun mina Allahi waridwanun wama alhayatu alddunya illa mataAAu alghuroori"},{"SurahNumber":57,"VerseNumber":21,"Text":"Sabiqoo ila maghfiratin min rabbikum wajannatin AAarduha kaAAardi alssamai waalardi oAAiddat lillatheena amanoo biAllahi warusulihi thalika fadlu Allahi yuteehi man yashao waAllahu thoo alfadli alAAatheemi"},{"SurahNumber":57,"VerseNumber":22,"Text":"Ma asaba min museebatin fee alardi wala fee anfusikum illa fee kitabin min qabli an nabraaha inna thalika AAala Allahi yaseerun"},{"SurahNumber":57,"VerseNumber":23,"Text":"Likayla tasaw AAala ma fatakum wala tafrahoo bima atakum waAllahu la yuhibbu kulla mukhtalin fakhoorin"},{"SurahNumber":57,"VerseNumber":24,"Text":"Allatheena yabkhaloona wayamuroona alnnasa bialbukhli waman yatawalla fainna Allaha huwa alghaniyyu alhameedu"},{"SurahNumber":57,"VerseNumber":25,"Text":"Laqad arsalna rusulana bialbayyinati waanzalna maAAahumu alkitaba waalmeezana liyaqooma alnnasu bialqisti waanzalna alhadeeda feehi basun shadeedun wamanafiAAu lilnnasi waliyaAAlama Allahu man yansuruhu warusulahu bialghaybi inna Allaha qawiyyun AAazeezun"},{"SurahNumber":57,"VerseNumber":26,"Text":"Walaqad arsalna noohan waibraheema wajaAAalna fee thurriyyatihima alnnubuwwata waalkitaba faminhum muhtadin wakatheerun minhum fasiqoona"},{"SurahNumber":57,"VerseNumber":27,"Text":"Thumma qaffayna AAala atharihim birusulina waqaffayna biAAeesa ibni maryama waataynahu alinjeela wajaAAalna fee quloobi allatheena ittabaAAoohu rafatan warahmatan warahbaniyyatan ibtadaAAooha ma katabnaha AAalayhim illa ibtighaa ridwani Allahi fama raAAawha haqqa riAAayatiha faatayna allatheena amanoo minhum ajrahum wakatheerun minhum fasiqoona"},{"SurahNumber":57,"VerseNumber":28,"Text":"Ya ayyuha allatheena amanoo ittaqoo Allaha waaminoo birasoolihi yutikum kiflayni min rahmatihi wayajAAal lakum nooran tamshoona bihi wayaghfir lakum waAllahu ghafoorun raheemun"},{"SurahNumber":57,"VerseNumber":29,"Text":"Lialla yaAAlama ahlu alkitabi alla yaqdiroona AAala shayin min fadli Allahi waanna alfadla biyadi Allahi yuteehi man yashao waAllahu thoo alfadli alAAatheemi"}]},{"Id":34,"LanguageCode":"ara","Name":"ara-quranuthmanihaf1","Author":"Quran Uthmani Hafs No Diacritics","Language":"Arabic","Description":"Arabic","Direction":"rtl","Source":"https://qurancomplex.gov.sa/","Translations":[{"SurahNumber":57,"VerseNumber":1,"Text":"سبح لله ما في السموت والارض وهو العزيز الحكيم"},{"SurahNumber":57,"VerseNumber":2,"Text":"له ملك السموت والارض يحي ويميت وهو على كل شيء قدير"},{"SurahNumber":57,"VerseNumber":3,"Text":"هو الاول والاخر والظهر والباطن وهو بكل شيء عليم"},{"SurahNumber":57,"VerseNumber":4,"Text":"هو الذي خلق السموت والارض في ستة ايام ثم استوى على العرش يعلم ما يلج في الارض وما يخرج منها وما ينزل من السماء وما يعرج فيها وهو معكم اين ما كنتم والله بما تعملون بصير"},{"SurahNumber":57,"VerseNumber":5,"Text":"له ملك السموت والارض والى الله ترجع الامور"},{"SurahNumber":57,"VerseNumber":6,"Text":"يولج اليل في النهار ويولج النهار في اليل وهو عليم بذات الصدور"},{"SurahNumber":57,"VerseNumber":7,"Text":"ءامنوا بالله ورسوله وانفقوا مما جعلكم مستخلفين فيه فالذين ءامنوا منكم وانفقوا لهم اجر كبير"},{"SurahNumber":57,"VerseNumber":8,"Text":"وما لكم لا تومنون بالله والرسول يدعوكم لتومنوا بربكم وقد اخذ ميثقكم ان كنتم مومنين"},{"SurahNumber":57,"VerseNumber":9,"Text":"هو الذي ينزل على عبده ءايت بينت ليخرجكم من الظلمت الى النور وان الله بكم لرءوف رحيم"},{"SurahNumber":57,"VerseNumber":10,"Text":"وما لكم الا تنفقوا في سبيل الله ولله ميرث السموت والارض لا يستوي منكم من انفق من قبل الفتح وقتل اوليك اعظم درجة من الذين انفقوا من بعد وقتلوا وكل ا وعد الله الحسنى والله بما تعملون خبير"},{"SurahNumber":57,"VerseNumber":11,"Text":"من ذا الذي يقرض الله قرضا حسن ا فيضعفه له وله اجر كريم"},{"SurahNumber":57,"VerseNumber":12,"Text":"يوم ترى المومنين والمومنت يسعى نورهم بين ايديهم وبايمنهم بشرىكم اليوم جنت تجري من تحتها الانهر خلدين فيها ذلك هو الفوز العظيم"},{"SurahNumber":57,"VerseNumber":13,"Text":"يوم يقول المنفقون والمنفقت للذين ءامنوا انظرونا نقتبس من نوركم قيل ارجعوا وراءكم فالتمسوا نور ا فضرب بينهم بسور له باب باطنه فيه الرحمة وظهره من قبله العذاب"},{"SurahNumber":57,"VerseNumber":14,"Text":"ينادونهم الم نكن معكم قالوا بلى ولكنكم فتنتم انفسكم وتربصتم وارتبتم وغرتكم الاماني حتى جاء امر الله وغركم بالله الغرور"},{"SurahNumber":57,"VerseNumber":15,"Text":"فاليوم لا يوخذ منكم فدية ولا من الذين كفروا ماوىكم النار هي مولىكم وبيس المصير"},{"SurahNumber":57,"VerseNumber":16,"Text":"۞الم يان للذين ءامنوا ان تخشع قلوبهم لذكر الله وما نزل من الحق ولا يكونوا كالذين اوتوا الكتب من قبل فطال عليهم الامد فقست قلوبهم وكثير منهم فسقون"},{"SurahNumber":57,"VerseNumber":17,"Text":"اعلموا ان الله يحي الارض بعد موتها قد بينا لكم الايت لعلكم تعقلون"},{"SurahNumber":57,"VerseNumber":18,"Text":"ان المصدقين والمصدقت واقرضوا الله قرضا حسن ا يضعف لهم ولهم اجر كريم"},{"SurahNumber":57,"VerseNumber":19,"Text":"والذين ءامنوا بالله ورسله اوليك هم الصديقون والشهداء عند ربهم لهم اجرهم ونورهم والذين كفروا وكذبوا بايتنا اوليك اصحب الجحيم"},{"SurahNumber":57,"VerseNumber":20,"Text":"اعلموا انما الحيوة الدنيا لعب ولهو وزينة وتفاخر بينكم وتكاثر في الامول والاولد كمثل غيث اعجب الكفار نباته ثم يهيج فترىه مصفر ا ثم يكون حطم ا وفي الاخرة عذاب شديد ومغفرة من الله ورضون وما الحيوة الدنيا الا متع الغرور"},{"SurahNumber":57,"VerseNumber":21,"Text":"سابقوا الى مغفرة من ربكم وجنة عرضها كعرض السماء والارض اعدت للذين ءامنوا بالله ورسله ذلك فضل الله يوتيه من يشاء والله ذو الفضل العظيم"},{"SurahNumber":57,"VerseNumber":22,"Text":"ما اصاب من مصيبة في الارض ولا في انفسكم الا في كتب من قبل ان نبراها ان ذلك على الله يسير"},{"SurahNumber":57,"VerseNumber":23,"Text":"لكيلا تاسوا على ما فاتكم ولا تفرحوا بما ءاتىكم والله لا يحب كل مختال فخور"},{"SurahNumber":57,"VerseNumber":24,"Text":"الذين يبخلون ويامرون الناس بالبخل ومن يتول فان الله هو الغني الحميد"},{"SurahNumber":57,"VerseNumber":25,"Text":"لقد ارسلنا رسلنا بالبينت وانزلنا معهم الكتب والميزان ليقوم الناس بالقسط وانزلنا الحديد فيه باس شديد ومنفع للناس وليعلم الله من ينصره ورسله بالغيب ان الله قوي عزيز"},{"SurahNumber":57,"VerseNumber":26,"Text":"ولقد ارسلنا نوح ا وابرهيم وجعلنا في ذريتهما النبوة والكتب فمنهم مهتد وكثير منهم فسقون"},{"SurahNumber":57,"VerseNumber":27,"Text":"ثم قفينا على ءاثرهم برسلنا وقفينا بعيسى ابن مريم وءاتينه الانجيل وجعلنا في قلوب الذين اتبعوه رافة ورحمة ورهبانية ابتدعوها ما كتبنها عليهم الا ابتغاء رضون الله فما رعوها حق رعايتها فاتينا الذين ءامنوا منهم اجرهم وكثير منهم فسقون"},{"SurahNumber":57,"VerseNumber":28,"Text":"يايها الذين ءامنوا اتقوا الله وءامنوا برسوله يوتكم كفلين من رحمته ويجعل لكم نور ا تمشون به ويغفر لكم والله غفور رحيم"},{"SurahNumber":57,"VerseNumber":29,"Text":"ليلا يعلم اهل الكتب الا يقدرون على شيء من فضل الله وان الفضل بيد الله يوتيه من يشاء والله ذو الفضل العظيم"}]}]}