{"SurahNumber":67,"HasBismillah":true,"Verses":[{"SurahNumber":67,"VerseNumber":1,"Text":"تَبَٰرَكَ ٱلَّذِي بِيَدِهِ ٱلۡمُلۡكُ وَهُوَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ","End":"١"},{"SurahNumber":67,"VerseNumber":2,"Text":"ٱلَّذِي خَلَقَ ٱلۡمَوۡتَ وَٱلۡحَيَوٰةَ لِيَبۡلُوَكُمۡ أَيُّكُمۡ أَحۡسَنُ عَمَلٗاۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡغَفُورُ","End":"٢"},{"SurahNumber":67,"VerseNumber":3,"Text":"ٱلَّذِي خَلَقَ سَبۡعَ سَمَٰوَٰتٖ طِبَاقٗاۖ مَّا تَرَىٰ فِي خَلۡقِ ٱلرَّحۡمَٰنِ مِن تَفَٰوُتٖۖ فَٱرۡجِعِ ٱلۡبَصَرَ هَلۡ تَرَىٰ مِن فُطُورٖ","End":"٣"},{"SurahNumber":67,"VerseNumber":4,"Text":"ثُمَّ ٱرۡجِعِ ٱلۡبَصَرَ كَرَّتَيۡنِ يَنقَلِبۡ إِلَيۡكَ ٱلۡبَصَرُ خَاسِئٗا وَهُوَ حَسِيرٞ","End":"٤"},{"SurahNumber":67,"VerseNumber":5,"Text":"وَلَقَدۡ زَيَّنَّا ٱلسَّمَآءَ ٱلدُّنۡيَا بِمَصَٰبِيحَ وَجَعَلۡنَٰهَا رُجُومٗا لِّلشَّيَٰطِينِۖ وَأَعۡتَدۡنَا لَهُمۡ عَذَابَ ٱلسَّعِيرِ","End":"٥"},{"SurahNumber":67,"VerseNumber":6,"Text":"وَلِلَّذِينَ كَفَرُواْ بِرَبِّهِمۡ عَذَابُ جَهَنَّمَۖ وَبِئۡسَ ٱلۡمَصِيرُ","End":"٦"},{"SurahNumber":67,"VerseNumber":7,"Text":"إِذَآ أُلۡقُواْ فِيهَا سَمِعُواْ لَهَا شَهِيقٗا وَهِيَ تَفُورُ","End":"٧"},{"SurahNumber":67,"VerseNumber":8,"Text":"تَكَادُ تَمَيَّزُ مِنَ ٱلۡغَيۡظِۖ كُلَّمَآ أُلۡقِيَ فِيهَا فَوۡجٞ سَأَلَهُمۡ خَزَنَتُهَآ أَلَمۡ يَأۡتِكُمۡ نَذِيرٞ","End":"٨"},{"SurahNumber":67,"VerseNumber":9,"Text":"قَالُواْ بَلَىٰ قَدۡ جَآءَنَا نَذِيرٞ فَكَذَّبۡنَا وَقُلۡنَا مَا نَزَّلَ ٱللَّهُ مِن شَيۡءٍ إِنۡ أَنتُمۡ إِلَّا فِي ضَلَٰلٖ كَبِيرٖ","End":"٩"},{"SurahNumber":67,"VerseNumber":10,"Text":"وَقَالُواْ لَوۡ كُنَّا نَسۡمَعُ أَوۡ نَعۡقِلُ مَا كُنَّا فِيٓ أَصۡحَٰبِ ٱلسَّعِيرِ","End":"١٠"},{"SurahNumber":67,"VerseNumber":11,"Text":"فَٱعۡتَرَفُواْ بِذَنۢبِهِمۡ فَسُحۡقٗا لِّأَصۡحَٰبِ ٱلسَّعِيرِ","End":"١١"},{"SurahNumber":67,"VerseNumber":12,"Text":"إِنَّ ٱلَّذِينَ يَخۡشَوۡنَ رَبَّهُم بِٱلۡغَيۡبِ لَهُم مَّغۡفِرَةٞ وَأَجۡرٞ كَبِيرٞ","End":"١٢"},{"SurahNumber":67,"VerseNumber":13,"Text":"وَأَسِرُّواْ قَوۡلَكُمۡ أَوِ ٱجۡهَرُواْ بِهِۦٓۖ إِنَّهُۥ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ","End":"١٣"},{"SurahNumber":67,"VerseNumber":14,"Text":"أَلَا يَعۡلَمُ مَنۡ خَلَقَ وَهُوَ ٱللَّطِيفُ ٱلۡخَبِيرُ","End":"١٤"},{"SurahNumber":67,"VerseNumber":15,"Text":"هُوَ ٱلَّذِي جَعَلَ لَكُمُ ٱلۡأَرۡضَ ذَلُولٗا فَٱمۡشُواْ فِي مَنَاكِبِهَا وَكُلُواْ مِن رِّزۡقِهِۦۖ وَإِلَيۡهِ ٱلنُّشُورُ","End":"١٥"},{"SurahNumber":67,"VerseNumber":16,"Text":"ءَأَمِنتُم مَّن فِي ٱلسَّمَآءِ أَن يَخۡسِفَ بِكُمُ ٱلۡأَرۡضَ فَإِذَا هِيَ تَمُورُ","End":"١٦"},{"SurahNumber":67,"VerseNumber":17,"Text":"أَمۡ أَمِنتُم مَّن فِي ٱلسَّمَآءِ أَن يُرۡسِلَ عَلَيۡكُمۡ حَاصِبٗاۖ فَسَتَعۡلَمُونَ كَيۡفَ نَذِيرِ","End":"١٧"},{"SurahNumber":67,"VerseNumber":18,"Text":"وَلَقَدۡ كَذَّبَ ٱلَّذِينَ مِن قَبۡلِهِمۡ فَكَيۡفَ كَانَ نَكِيرِ","End":"١٨"},{"SurahNumber":67,"VerseNumber":19,"Text":"أَوَلَمۡ يَرَوۡاْ إِلَى ٱلطَّيۡرِ فَوۡقَهُمۡ صَـٰٓفَّـٰتٖ وَيَقۡبِضۡنَۚ مَا يُمۡسِكُهُنَّ إِلَّا ٱلرَّحۡمَٰنُۚ إِنَّهُۥ بِكُلِّ شَيۡءِۭ بَصِيرٌ","End":"١٩"},{"SurahNumber":67,"VerseNumber":20,"Text":"أَمَّنۡ هَٰذَا ٱلَّذِي هُوَ جُندٞ لَّكُمۡ يَنصُرُكُم مِّن دُونِ ٱلرَّحۡمَٰنِۚ إِنِ ٱلۡكَٰفِرُونَ إِلَّا فِي غُرُورٍ","End":"٢٠"},{"SurahNumber":67,"VerseNumber":21,"Text":"أَمَّنۡ هَٰذَا ٱلَّذِي يَرۡزُقُكُمۡ إِنۡ أَمۡسَكَ رِزۡقَهُۥۚ بَل لَّجُّواْ فِي عُتُوّٖ وَنُفُورٍ","End":"٢١"},{"SurahNumber":67,"VerseNumber":22,"Text":"أَفَمَن يَمۡشِي مُكِبًّا عَلَىٰ وَجۡهِهِۦٓ أَهۡدَىٰٓ أَمَّن يَمۡشِي سَوِيًّا عَلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ","End":"٢٢"},{"SurahNumber":67,"VerseNumber":23,"Text":"قُلۡ هُوَ ٱلَّذِيٓ أَنشَأَكُمۡ وَجَعَلَ لَكُمُ ٱلسَّمۡعَ وَٱلۡأَبۡصَٰرَ وَٱلۡأَفۡـِٔدَةَۚ قَلِيلٗا مَّا تَشۡكُرُونَ","End":"٢٣"},{"SurahNumber":67,"VerseNumber":24,"Text":"قُلۡ هُوَ ٱلَّذِي ذَرَأَكُمۡ فِي ٱلۡأَرۡضِ وَإِلَيۡهِ تُحۡشَرُونَ","End":"٢٤"},{"SurahNumber":67,"VerseNumber":25,"Text":"وَيَقُولُونَ مَتَىٰ هَٰذَا ٱلۡوَعۡدُ إِن كُنتُمۡ صَٰدِقِينَ","End":"٢٥"},{"SurahNumber":67,"VerseNumber":26,"Text":"قُلۡ إِنَّمَا ٱلۡعِلۡمُ عِندَ ٱللَّهِ وَإِنَّمَآ أَنَا۠ نَذِيرٞ مُّبِينٞ","End":"٢٦"},{"SurahNumber":67,"VerseNumber":27,"Text":"فَلَمَّا رَأَوۡهُ زُلۡفَةٗ سِيٓـَٔتۡ وُجُوهُ ٱلَّذِينَ كَفَرُواْ وَقِيلَ هَٰذَا ٱلَّذِي كُنتُم بِهِۦ تَدَّعُونَ","End":"٢٧"},{"SurahNumber":67,"VerseNumber":28,"Text":"قُلۡ أَرَءَيۡتُمۡ إِنۡ أَهۡلَكَنِيَ ٱللَّهُ وَمَن مَّعِيَ أَوۡ رَحِمَنَا فَمَن يُجِيرُ ٱلۡكَٰفِرِينَ مِنۡ عَذَابٍ أَلِيمٖ","End":"٢٨"},{"SurahNumber":67,"VerseNumber":29,"Text":"قُلۡ هُوَ ٱلرَّحۡمَٰنُ ءَامَنَّا بِهِۦ وَعَلَيۡهِ تَوَكَّلۡنَاۖ فَسَتَعۡلَمُونَ مَنۡ هُوَ فِي ضَلَٰلٖ مُّبِينٖ","End":"٢٩"},{"SurahNumber":67,"VerseNumber":30,"Text":"قُلۡ أَرَءَيۡتُمۡ إِنۡ أَصۡبَحَ مَآؤُكُمۡ غَوۡرٗا فَمَن يَأۡتِيكُم بِمَآءٖ مَّعِينِۭ","End":"٣٠"}],"Translations":[{"Id":10,"LanguageCode":"ara","Name":"ara-quran-la","Author":"Quran Transliteration","Language":"Arabic","Description":"Arabic - Latinised","Direction":"ltr","Source":"http://tanzil.net","Translations":[{"SurahNumber":67,"VerseNumber":1,"Text":"Tabaraka allathee biyadihi almulku wahuwa AAala kulli shayin qadeerun"},{"SurahNumber":67,"VerseNumber":2,"Text":"Allathee khalaqa almawta waalhayata liyabluwakum ayyukum ahsanu AAamalan wahuwa alAAazeezu alghafooru"},{"SurahNumber":67,"VerseNumber":3,"Text":"Allathee khalaqa sabAAa samawatin tibaqan ma tara fee khalqi alrrahmani min tafawutin fairjiAAi albasara hal tara min futoorin"},{"SurahNumber":67,"VerseNumber":4,"Text":"Thumma irjiAAi albasara karratayni yanqalib ilayka albasaru khasian wahuwa haseerun"},{"SurahNumber":67,"VerseNumber":5,"Text":"Walaqad zayyanna alssamaa alddunya bimasabeeha wajaAAalnaha rujooman lilshshayateeni waaAAtadna lahum AAathaba alssaAAeeri"},{"SurahNumber":67,"VerseNumber":6,"Text":"Walillatheena kafaroo birabbihim AAathabu jahannama wabisa almaseeru"},{"SurahNumber":67,"VerseNumber":7,"Text":"Itha olqoo feeha samiAAoo laha shaheeqan wahiya tafooru"},{"SurahNumber":67,"VerseNumber":8,"Text":"Takadu tamayyazu mina alghaythi kullama olqiya feeha fawjun saalahum khazanatuha alam yatikum natheerun"},{"SurahNumber":67,"VerseNumber":9,"Text":"Qaloo bala qad jaana natheerun fakaththabna waqulna ma nazzala Allahu min shayin in antum illa fee dalalin kabeerin"},{"SurahNumber":67,"VerseNumber":10,"Text":"Waqaloo law kunna nasmaAAu aw naAAqilu ma kunna fee ashabi alssaAAeeri"},{"SurahNumber":67,"VerseNumber":11,"Text":"FaiAAtarafoo bithanbihim fasuhqan liashabi alssaAAeeri"},{"SurahNumber":67,"VerseNumber":12,"Text":"Inna allatheena yakhshawna rabbahum bialghaybi lahum maghfiratun waajrun kabeerun"},{"SurahNumber":67,"VerseNumber":13,"Text":"Waasirroo qawlakum awi ijharoo bihi innahu AAaleemun bithati alssudoori"},{"SurahNumber":67,"VerseNumber":14,"Text":"Ala yaAAlamu man khalaqa wahuwa allateefu alkhabeeru"},{"SurahNumber":67,"VerseNumber":15,"Text":"Huwa allathee jaAAala lakumu alarda thaloolan faimshoo fee manakibiha wakuloo min rizqihi wailayhi alnnushooru"},{"SurahNumber":67,"VerseNumber":16,"Text":"Aamintum man fee alssamai an yakhsifa bikumu alarda faitha hiya tamooru"},{"SurahNumber":67,"VerseNumber":17,"Text":"Am amintum man fee alssamai an yursila AAalaykum hasiban fasataAAlamoona kayfa natheeri"},{"SurahNumber":67,"VerseNumber":18,"Text":"Walaqad kaththaba allatheena min qablihim fakayfa kana nakeeri"},{"SurahNumber":67,"VerseNumber":19,"Text":"Awalam yaraw ila alttayri fawqahum saffatin wayaqbidna ma yumsikuhunna illa alrrahmanu innahu bikulli shayin baseerun"},{"SurahNumber":67,"VerseNumber":20,"Text":"Amman hatha allathee huwa jundun lakum yansurukum min dooni alrrahmani ini alkafiroona illa fee ghuroorin"},{"SurahNumber":67,"VerseNumber":21,"Text":"Amman hatha allathee yarzuqukum in amsaka rizqahu bal lajjoo fee AAutuwwin wanufoorin"},{"SurahNumber":67,"VerseNumber":22,"Text":"Afaman yamshee mukibban AAala wajhihi ahda amman yamshee sawiyyan AAala siratin mustaqeemin"},{"SurahNumber":67,"VerseNumber":23,"Text":"Qul huwa allathee anshaakum wajaAAala lakumu alssamAAa waalabsara waalafidata qaleelan ma tashkuroona"},{"SurahNumber":67,"VerseNumber":24,"Text":"Qul huwa allathee tharaakum fee alardi wailayhi tuhsharoona"},{"SurahNumber":67,"VerseNumber":25,"Text":"Wayaqooloona mata hatha alwaAAdu in kuntum sadiqeena"},{"SurahNumber":67,"VerseNumber":26,"Text":"Qul innama alAAilmu AAinda Allahi wainnama ana natheerun mubeenun"},{"SurahNumber":67,"VerseNumber":27,"Text":"Falamma raawhu zulfatan seeat wujoohu allatheena kafaroo waqeela hatha allathee kuntum bihi taddaAAoona"},{"SurahNumber":67,"VerseNumber":28,"Text":"Qul araaytum in ahlakaniya Allahu waman maAAiya aw rahimana faman yujeeru alkafireena min AAathabin aleemin"},{"SurahNumber":67,"VerseNumber":29,"Text":"Qul huwa alrrahmanu amanna bihi waAAalayhi tawakkalna fasataAAlamoona man huwa fee dalalin mubeenin"},{"SurahNumber":67,"VerseNumber":30,"Text":"Qul araaytum in asbaha maokum ghawran faman yateekum bimain maAAeenin"}]},{"Id":34,"LanguageCode":"ara","Name":"ara-quranuthmanihaf1","Author":"Quran Uthmani Hafs No Diacritics","Language":"Arabic","Description":"Arabic","Direction":"rtl","Source":"https://qurancomplex.gov.sa/","Translations":[{"SurahNumber":67,"VerseNumber":1,"Text":"تبرك الذي بيده الملك وهو على كل شيء قدير"},{"SurahNumber":67,"VerseNumber":2,"Text":"الذي خلق الموت والحيوة ليبلوكم ايكم احسن عمل ا وهو العزيز الغفور"},{"SurahNumber":67,"VerseNumber":3,"Text":"الذي خلق سبع سموت طباق ا ما ترى في خلق الرحمن من تفوت فارجع البصر هل ترى من فطور"},{"SurahNumber":67,"VerseNumber":4,"Text":"ثم ارجع البصر كرتين ينقلب اليك البصر خاسي ا وهو حسير"},{"SurahNumber":67,"VerseNumber":5,"Text":"ولقد زينا السماء الدنيا بمصبيح وجعلنها رجوم ا للشيطين واعتدنا لهم عذاب السعير"},{"SurahNumber":67,"VerseNumber":6,"Text":"وللذين كفروا بربهم عذاب جهنم وبيس المصير"},{"SurahNumber":67,"VerseNumber":7,"Text":"اذا القوا فيها سمعوا لها شهيق ا وهي تفور"},{"SurahNumber":67,"VerseNumber":8,"Text":"تكاد تميز من الغيظ كلما القي فيها فوج سالهم خزنتها الم ياتكم نذير"},{"SurahNumber":67,"VerseNumber":9,"Text":"قالوا بلى قد جاءنا نذير فكذبنا وقلنا ما نزل الله من شيء ان انتم الا في ضلل كبير"},{"SurahNumber":67,"VerseNumber":10,"Text":"وقالوا لو كنا نسمع او نعقل ما كنا في اصحب السعير"},{"SurahNumber":67,"VerseNumber":11,"Text":"فاعترفوا بذنبهم فسحق ا لاصحب السعير"},{"SurahNumber":67,"VerseNumber":12,"Text":"ان الذين يخشون ربهم بالغيب لهم مغفرة واجر كبير"},{"SurahNumber":67,"VerseNumber":13,"Text":"واسروا قولكم او اجهروا به انه عليم بذات الصدور"},{"SurahNumber":67,"VerseNumber":14,"Text":"الا يعلم من خلق وهو اللطيف الخبير"},{"SurahNumber":67,"VerseNumber":15,"Text":"هو الذي جعل لكم الارض ذلول ا فامشوا في مناكبها وكلوا من رزقه واليه النشور"},{"SurahNumber":67,"VerseNumber":16,"Text":"ءامنتم من في السماء ان يخسف بكم الارض فاذا هي تمور"},{"SurahNumber":67,"VerseNumber":17,"Text":"ام امنتم من في السماء ان يرسل عليكم حاصب ا فستعلمون كيف نذير"},{"SurahNumber":67,"VerseNumber":18,"Text":"ولقد كذب الذين من قبلهم فكيف كان نكير"},{"SurahNumber":67,"VerseNumber":19,"Text":"اولم يروا الى الطير فوقهم صفت ويقبضن ما يمسكهن الا الرحمن انه بكل شيء بصير"},{"SurahNumber":67,"VerseNumber":20,"Text":"امن هذا الذي هو جند لكم ينصركم من دون الرحمن ان الكفرون الا في غرور"},{"SurahNumber":67,"VerseNumber":21,"Text":"امن هذا الذي يرزقكم ان امسك رزقه بل لجوا في عتو ونفور"},{"SurahNumber":67,"VerseNumber":22,"Text":"افمن يمشي مكبا على وجهه اهدى امن يمشي سويا على صرط مستقيم"},{"SurahNumber":67,"VerseNumber":23,"Text":"قل هو الذي انشاكم وجعل لكم السمع والابصر والافدة قليل ا ما تشكرون"},{"SurahNumber":67,"VerseNumber":24,"Text":"قل هو الذي ذراكم في الارض واليه تحشرون"},{"SurahNumber":67,"VerseNumber":25,"Text":"ويقولون متى هذا الوعد ان كنتم صدقين"},{"SurahNumber":67,"VerseNumber":26,"Text":"قل انما العلم عند الله وانما انا نذير مبين"},{"SurahNumber":67,"VerseNumber":27,"Text":"فلما راوه زلفة سيت وجوه الذين كفروا وقيل هذا الذي كنتم به تدعون"},{"SurahNumber":67,"VerseNumber":28,"Text":"قل ارءيتم ان اهلكني الله ومن معي او رحمنا فمن يجير الكفرين من عذاب اليم"},{"SurahNumber":67,"VerseNumber":29,"Text":"قل هو الرحمن ءامنا به وعليه توكلنا فستعلمون من هو في ضلل مبين"},{"SurahNumber":67,"VerseNumber":30,"Text":"قل ارءيتم ان اصبح ماوكم غور ا فمن ياتيكم بماء معين"}]}]}