{"SurahNumber":46,"HasBismillah":true,"Verses":[{"SurahNumber":46,"VerseNumber":1,"Text":"حمٓ","End":"١"},{"SurahNumber":46,"VerseNumber":2,"Text":"تَنزِيلُ ٱلۡكِتَٰبِ مِنَ ٱللَّهِ ٱلۡعَزِيزِ ٱلۡحَكِيمِ","End":"٢"},{"SurahNumber":46,"VerseNumber":3,"Text":"مَا خَلَقۡنَا ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَآ إِلَّا بِٱلۡحَقِّ وَأَجَلٖ مُّسَمّٗىۚ وَٱلَّذِينَ كَفَرُواْ عَمَّآ أُنذِرُواْ مُعۡرِضُونَ","End":"٣"},{"SurahNumber":46,"VerseNumber":4,"Text":"قُلۡ أَرَءَيۡتُم مَّا تَدۡعُونَ مِن دُونِ ٱللَّهِ أَرُونِي مَاذَا خَلَقُواْ مِنَ ٱلۡأَرۡضِ أَمۡ لَهُمۡ شِرۡكٞ فِي ٱلسَّمَٰوَٰتِۖ ٱئۡتُونِي بِكِتَٰبٖ مِّن قَبۡلِ هَٰذَآ أَوۡ أَثَٰرَةٖ مِّنۡ عِلۡمٍ إِن كُنتُمۡ صَٰدِقِينَ","End":"٤"},{"SurahNumber":46,"VerseNumber":5,"Text":"وَمَنۡ أَضَلُّ مِمَّن يَدۡعُواْ مِن دُونِ ٱللَّهِ مَن لَّا يَسۡتَجِيبُ لَهُۥٓ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِ وَهُمۡ عَن دُعَآئِهِمۡ غَٰفِلُونَ","End":"٥"},{"SurahNumber":46,"VerseNumber":6,"Text":"وَإِذَا حُشِرَ ٱلنَّاسُ كَانُواْ لَهُمۡ أَعۡدَآءٗ وَكَانُواْ بِعِبَادَتِهِمۡ كَٰفِرِينَ","End":"٦"},{"SurahNumber":46,"VerseNumber":7,"Text":"وَإِذَا تُتۡلَىٰ عَلَيۡهِمۡ ءَايَٰتُنَا بَيِّنَٰتٖ قَالَ ٱلَّذِينَ كَفَرُواْ لِلۡحَقِّ لَمَّا جَآءَهُمۡ هَٰذَا سِحۡرٞ مُّبِينٌ","End":"٧"},{"SurahNumber":46,"VerseNumber":8,"Text":"أَمۡ يَقُولُونَ ٱفۡتَرَىٰهُۖ قُلۡ إِنِ ٱفۡتَرَيۡتُهُۥ فَلَا تَمۡلِكُونَ لِي مِنَ ٱللَّهِ شَيۡـًٔاۖ هُوَ أَعۡلَمُ بِمَا تُفِيضُونَ فِيهِۚ كَفَىٰ بِهِۦ شَهِيدَۢا بَيۡنِي وَبَيۡنَكُمۡۖ وَهُوَ ٱلۡغَفُورُ ٱلرَّحِيمُ","End":"٨"},{"SurahNumber":46,"VerseNumber":9,"Text":"قُلۡ مَا كُنتُ بِدۡعٗا مِّنَ ٱلرُّسُلِ وَمَآ أَدۡرِي مَا يُفۡعَلُ بِي وَلَا بِكُمۡۖ إِنۡ أَتَّبِعُ إِلَّا مَا يُوحَىٰٓ إِلَيَّ وَمَآ أَنَا۠ إِلَّا نَذِيرٞ مُّبِينٞ","End":"٩"},{"SurahNumber":46,"VerseNumber":10,"Text":"قُلۡ أَرَءَيۡتُمۡ إِن كَانَ مِنۡ عِندِ ٱللَّهِ وَكَفَرۡتُم بِهِۦ وَشَهِدَ شَاهِدٞ مِّنۢ بَنِيٓ إِسۡرَـٰٓءِيلَ عَلَىٰ مِثۡلِهِۦ فَـَٔامَنَ وَٱسۡتَكۡبَرۡتُمۡۚ إِنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّـٰلِمِينَ","End":"١٠"},{"SurahNumber":46,"VerseNumber":11,"Text":"وَقَالَ ٱلَّذِينَ كَفَرُواْ لِلَّذِينَ ءَامَنُواْ لَوۡ كَانَ خَيۡرٗا مَّا سَبَقُونَآ إِلَيۡهِۚ وَإِذۡ لَمۡ يَهۡتَدُواْ بِهِۦ فَسَيَقُولُونَ هَٰذَآ إِفۡكٞ قَدِيمٞ","End":"١١"},{"SurahNumber":46,"VerseNumber":12,"Text":"وَمِن قَبۡلِهِۦ كِتَٰبُ مُوسَىٰٓ إِمَامٗا وَرَحۡمَةٗۚ وَهَٰذَا كِتَٰبٞ مُّصَدِّقٞ لِّسَانًا عَرَبِيّٗا لِّيُنذِرَ ٱلَّذِينَ ظَلَمُواْ وَبُشۡرَىٰ لِلۡمُحۡسِنِينَ","End":"١٢"},{"SurahNumber":46,"VerseNumber":13,"Text":"إِنَّ ٱلَّذِينَ قَالُواْ رَبُّنَا ٱللَّهُ ثُمَّ ٱسۡتَقَٰمُواْ فَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ","End":"١٣"},{"SurahNumber":46,"VerseNumber":14,"Text":"أُوْلَـٰٓئِكَ أَصۡحَٰبُ ٱلۡجَنَّةِ خَٰلِدِينَ فِيهَا جَزَآءَۢ بِمَا كَانُواْ يَعۡمَلُونَ","End":"١٤"},{"SurahNumber":46,"VerseNumber":15,"Text":"وَوَصَّيۡنَا ٱلۡإِنسَٰنَ بِوَٰلِدَيۡهِ إِحۡسَٰنًاۖ حَمَلَتۡهُ أُمُّهُۥ كُرۡهٗا وَوَضَعَتۡهُ كُرۡهٗاۖ وَحَمۡلُهُۥ وَفِصَٰلُهُۥ ثَلَٰثُونَ شَهۡرًاۚ حَتَّىٰٓ إِذَا بَلَغَ أَشُدَّهُۥ وَبَلَغَ أَرۡبَعِينَ سَنَةٗ قَالَ رَبِّ أَوۡزِعۡنِيٓ أَنۡ أَشۡكُرَ نِعۡمَتَكَ ٱلَّتِيٓ أَنۡعَمۡتَ عَلَيَّ وَعَلَىٰ وَٰلِدَيَّ وَأَنۡ أَعۡمَلَ صَٰلِحٗا تَرۡضَىٰهُ وَأَصۡلِحۡ لِي فِي ذُرِّيَّتِيٓۖ إِنِّي تُبۡتُ إِلَيۡكَ وَإِنِّي مِنَ ٱلۡمُسۡلِمِينَ","End":"١٥"},{"SurahNumber":46,"VerseNumber":16,"Text":"أُوْلَـٰٓئِكَ ٱلَّذِينَ نَتَقَبَّلُ عَنۡهُمۡ أَحۡسَنَ مَا عَمِلُواْ وَنَتَجَاوَزُ عَن سَيِّـَٔاتِهِمۡ فِيٓ أَصۡحَٰبِ ٱلۡجَنَّةِۖ وَعۡدَ ٱلصِّدۡقِ ٱلَّذِي كَانُواْ يُوعَدُونَ","End":"١٦"},{"SurahNumber":46,"VerseNumber":17,"Text":"وَٱلَّذِي قَالَ لِوَٰلِدَيۡهِ أُفّٖ لَّكُمَآ أَتَعِدَانِنِيٓ أَنۡ أُخۡرَجَ وَقَدۡ خَلَتِ ٱلۡقُرُونُ مِن قَبۡلِي وَهُمَا يَسۡتَغِيثَانِ ٱللَّهَ وَيۡلَكَ ءَامِنۡ إِنَّ وَعۡدَ ٱللَّهِ حَقّٞ فَيَقُولُ مَا هَٰذَآ إِلَّآ أَسَٰطِيرُ ٱلۡأَوَّلِينَ","End":"١٧"},{"SurahNumber":46,"VerseNumber":18,"Text":"أُوْلَـٰٓئِكَ ٱلَّذِينَ حَقَّ عَلَيۡهِمُ ٱلۡقَوۡلُ فِيٓ أُمَمٖ قَدۡ خَلَتۡ مِن قَبۡلِهِم مِّنَ ٱلۡجِنِّ وَٱلۡإِنسِۖ إِنَّهُمۡ كَانُواْ خَٰسِرِينَ","End":"١٨"},{"SurahNumber":46,"VerseNumber":19,"Text":"وَلِكُلّٖ دَرَجَٰتٞ مِّمَّا عَمِلُواْۖ وَلِيُوَفِّيَهُمۡ أَعۡمَٰلَهُمۡ وَهُمۡ لَا يُظۡلَمُونَ","End":"١٩"},{"SurahNumber":46,"VerseNumber":20,"Text":"وَيَوۡمَ يُعۡرَضُ ٱلَّذِينَ كَفَرُواْ عَلَى ٱلنَّارِ أَذۡهَبۡتُمۡ طَيِّبَٰتِكُمۡ فِي حَيَاتِكُمُ ٱلدُّنۡيَا وَٱسۡتَمۡتَعۡتُم بِهَا فَٱلۡيَوۡمَ تُجۡزَوۡنَ عَذَابَ ٱلۡهُونِ بِمَا كُنتُمۡ تَسۡتَكۡبِرُونَ فِي ٱلۡأَرۡضِ بِغَيۡرِ ٱلۡحَقِّ وَبِمَا كُنتُمۡ تَفۡسُقُونَ","End":"٢٠"},{"SurahNumber":46,"VerseNumber":21,"Text":"۞وَٱذۡكُرۡ أَخَا عَادٍ إِذۡ أَنذَرَ قَوۡمَهُۥ بِٱلۡأَحۡقَافِ وَقَدۡ خَلَتِ ٱلنُّذُرُ مِنۢ بَيۡنِ يَدَيۡهِ وَمِنۡ خَلۡفِهِۦٓ أَلَّا تَعۡبُدُوٓاْ إِلَّا ٱللَّهَ إِنِّيٓ أَخَافُ عَلَيۡكُمۡ عَذَابَ يَوۡمٍ عَظِيمٖ","End":"٢١"},{"SurahNumber":46,"VerseNumber":22,"Text":"قَالُوٓاْ أَجِئۡتَنَا لِتَأۡفِكَنَا عَنۡ ءَالِهَتِنَا فَأۡتِنَا بِمَا تَعِدُنَآ إِن كُنتَ مِنَ ٱلصَّـٰدِقِينَ","End":"٢٢"},{"SurahNumber":46,"VerseNumber":23,"Text":"قَالَ إِنَّمَا ٱلۡعِلۡمُ عِندَ ٱللَّهِ وَأُبَلِّغُكُم مَّآ أُرۡسِلۡتُ بِهِۦ وَلَٰكِنِّيٓ أَرَىٰكُمۡ قَوۡمٗا تَجۡهَلُونَ","End":"٢٣"},{"SurahNumber":46,"VerseNumber":24,"Text":"فَلَمَّا رَأَوۡهُ عَارِضٗا مُّسۡتَقۡبِلَ أَوۡدِيَتِهِمۡ قَالُواْ هَٰذَا عَارِضٞ مُّمۡطِرُنَاۚ بَلۡ هُوَ مَا ٱسۡتَعۡجَلۡتُم بِهِۦۖ رِيحٞ فِيهَا عَذَابٌ أَلِيمٞ","End":"٢٤"},{"SurahNumber":46,"VerseNumber":25,"Text":"تُدَمِّرُ كُلَّ شَيۡءِۭ بِأَمۡرِ رَبِّهَا فَأَصۡبَحُواْ لَا يُرَىٰٓ إِلَّا مَسَٰكِنُهُمۡۚ كَذَٰلِكَ نَجۡزِي ٱلۡقَوۡمَ ٱلۡمُجۡرِمِينَ","End":"٢٥"},{"SurahNumber":46,"VerseNumber":26,"Text":"وَلَقَدۡ مَكَّنَّـٰهُمۡ فِيمَآ إِن مَّكَّنَّـٰكُمۡ فِيهِ وَجَعَلۡنَا لَهُمۡ سَمۡعٗا وَأَبۡصَٰرٗا وَأَفۡـِٔدَةٗ فَمَآ أَغۡنَىٰ عَنۡهُمۡ سَمۡعُهُمۡ وَلَآ أَبۡصَٰرُهُمۡ وَلَآ أَفۡـِٔدَتُهُم مِّن شَيۡءٍ إِذۡ كَانُواْ يَجۡحَدُونَ بِـَٔايَٰتِ ٱللَّهِ وَحَاقَ بِهِم مَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ","End":"٢٦"},{"SurahNumber":46,"VerseNumber":27,"Text":"وَلَقَدۡ أَهۡلَكۡنَا مَا حَوۡلَكُم مِّنَ ٱلۡقُرَىٰ وَصَرَّفۡنَا ٱلۡأٓيَٰتِ لَعَلَّهُمۡ يَرۡجِعُونَ","End":"٢٧"},{"SurahNumber":46,"VerseNumber":28,"Text":"فَلَوۡلَا نَصَرَهُمُ ٱلَّذِينَ ٱتَّخَذُواْ مِن دُونِ ٱللَّهِ قُرۡبَانًا ءَالِهَةَۢۖ بَلۡ ضَلُّواْ عَنۡهُمۡۚ وَذَٰلِكَ إِفۡكُهُمۡ وَمَا كَانُواْ يَفۡتَرُونَ","End":"٢٨"},{"SurahNumber":46,"VerseNumber":29,"Text":"وَإِذۡ صَرَفۡنَآ إِلَيۡكَ نَفَرٗا مِّنَ ٱلۡجِنِّ يَسۡتَمِعُونَ ٱلۡقُرۡءَانَ فَلَمَّا حَضَرُوهُ قَالُوٓاْ أَنصِتُواْۖ فَلَمَّا قُضِيَ وَلَّوۡاْ إِلَىٰ قَوۡمِهِم مُّنذِرِينَ","End":"٢٩"},{"SurahNumber":46,"VerseNumber":30,"Text":"قَالُواْ يَٰقَوۡمَنَآ إِنَّا سَمِعۡنَا كِتَٰبًا أُنزِلَ مِنۢ بَعۡدِ مُوسَىٰ مُصَدِّقٗا لِّمَا بَيۡنَ يَدَيۡهِ يَهۡدِيٓ إِلَى ٱلۡحَقِّ وَإِلَىٰ طَرِيقٖ مُّسۡتَقِيمٖ","End":"٣٠"},{"SurahNumber":46,"VerseNumber":31,"Text":"يَٰقَوۡمَنَآ أَجِيبُواْ دَاعِيَ ٱللَّهِ وَءَامِنُواْ بِهِۦ يَغۡفِرۡ لَكُم مِّن ذُنُوبِكُمۡ وَيُجِرۡكُم مِّنۡ عَذَابٍ أَلِيمٖ","End":"٣١"},{"SurahNumber":46,"VerseNumber":32,"Text":"وَمَن لَّا يُجِبۡ دَاعِيَ ٱللَّهِ فَلَيۡسَ بِمُعۡجِزٖ فِي ٱلۡأَرۡضِ وَلَيۡسَ لَهُۥ مِن دُونِهِۦٓ أَوۡلِيَآءُۚ أُوْلَـٰٓئِكَ فِي ضَلَٰلٖ مُّبِينٍ","End":"٣٢"},{"SurahNumber":46,"VerseNumber":33,"Text":"أَوَلَمۡ يَرَوۡاْ أَنَّ ٱللَّهَ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَلَمۡ يَعۡيَ بِخَلۡقِهِنَّ بِقَٰدِرٍ عَلَىٰٓ أَن يُحۡـِۧيَ ٱلۡمَوۡتَىٰۚ بَلَىٰٓۚ إِنَّهُۥ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","End":"٣٣"},{"SurahNumber":46,"VerseNumber":34,"Text":"وَيَوۡمَ يُعۡرَضُ ٱلَّذِينَ كَفَرُواْ عَلَى ٱلنَّارِ أَلَيۡسَ هَٰذَا بِٱلۡحَقِّۖ قَالُواْ بَلَىٰ وَرَبِّنَاۚ قَالَ فَذُوقُواْ ٱلۡعَذَابَ بِمَا كُنتُمۡ تَكۡفُرُونَ","End":"٣٤"},{"SurahNumber":46,"VerseNumber":35,"Text":"فَٱصۡبِرۡ كَمَا صَبَرَ أُوْلُواْ ٱلۡعَزۡمِ مِنَ ٱلرُّسُلِ وَلَا تَسۡتَعۡجِل لَّهُمۡۚ كَأَنَّهُمۡ يَوۡمَ يَرَوۡنَ مَا يُوعَدُونَ لَمۡ يَلۡبَثُوٓاْ إِلَّا سَاعَةٗ مِّن نَّهَارِۭۚ بَلَٰغٞۚ فَهَلۡ يُهۡلَكُ إِلَّا ٱلۡقَوۡمُ ٱلۡفَٰسِقُونَ","End":"٣٥"}],"Translations":[{"Id":10,"LanguageCode":"ara","Name":"ara-quran-la","Author":"Quran Transliteration","Language":"Arabic","Description":"Arabic - Latinised","Direction":"ltr","Source":"http://tanzil.net","Translations":[{"SurahNumber":46,"VerseNumber":1,"Text":"Hameem"},{"SurahNumber":46,"VerseNumber":2,"Text":"Tanzeelu alkitabi mina Allahi alAAazeezi alhakeemi"},{"SurahNumber":46,"VerseNumber":3,"Text":"Ma khalaqna alssamawati waalarda wama baynahuma illa bialhaqqi waajalin musamman waallatheena kafaroo AAamma onthiroo muAAridoona"},{"SurahNumber":46,"VerseNumber":4,"Text":"Qul araaytum ma tadAAoona min dooni Allahi aroonee matha khalaqoo mina alardi am lahum shirkun fee alssamawati eetoonee bikitabin min qabli hatha aw atharatin min AAilmin in kuntum sadiqeena"},{"SurahNumber":46,"VerseNumber":5,"Text":"Waman adallu mimman yadAAoo min dooni Allahi man la yastajeebu lahu ila yawmi alqiyamati wahum AAan duAAaihim ghafiloona"},{"SurahNumber":46,"VerseNumber":6,"Text":"Waitha hushira alnnasu kanoo lahum aAAdaan wakanoo biAAibadatihim kafireena"},{"SurahNumber":46,"VerseNumber":7,"Text":"Waitha tutla AAalayhim ayatuna bayyinatin qala allatheena kafaroo lilhaqqi lamma jaahum hatha sihrun mubeenun"},{"SurahNumber":46,"VerseNumber":8,"Text":"Am yaqooloona iftarahu qul ini iftaraytuhu fala tamlikoona lee mina Allahi shayan huwa aAAlamu bima tufeedoona feehi kafa bihi shaheedan baynee wabaynakum wahuwa alghafooru alrraheemu"},{"SurahNumber":46,"VerseNumber":9,"Text":"Qul ma kuntu bidAAan mina alrrusuli wama adree ma yufAAalu bee wala bikum in attabiAAu illa ma yooha ilayya wama ana illa natheerun mubeenun"},{"SurahNumber":46,"VerseNumber":10,"Text":"Qul araaytum in kana min AAindi Allahi wakafartum bihi washahida shahidun min banee israeela AAala mithlihi faamana waistakbartum inna Allaha la yahdee alqawma alththalimeena"},{"SurahNumber":46,"VerseNumber":11,"Text":"Waqala allatheena kafaroo lillatheena amanoo law kana khayran ma sabaqoona ilayhi waith lam yahtadoo bihi fasayaqooloona hatha ifkun qadeemun"},{"SurahNumber":46,"VerseNumber":12,"Text":"Wamin qablihi kitabu moosa imaman warahmatan wahatha kitabun musaddiqun lisanan AAarabiyyan liyunthira allatheena thalamoo wabushra lilmuhsineena"},{"SurahNumber":46,"VerseNumber":13,"Text":"Inna allatheena qaloo rabbuna Allahu thumma istaqamoo fala khawfun AAalayhim wala hum yahzanoona"},{"SurahNumber":46,"VerseNumber":14,"Text":"Olaika ashabu aljannati khalideena feeha jazaan bima kanoo yaAAmaloona"},{"SurahNumber":46,"VerseNumber":15,"Text":"Wawassayna alinsana biwalidayhi ihsanan hamalathu ommuhu kurhan wawadaAAathu kurhan wahamluhu wafisaluhu thalathoona shahran hatta itha balagha ashuddahu wabalagha arbaAAeena sanatan qala rabbi awziAAnee an ashkura niAAmataka allatee anAAamta AAalayya waAAala walidayya waan aAAmala salihan tardahu waaslih lee fee thurriyyatee innee tubtu ilayka wainnee mina almuslimeena"},{"SurahNumber":46,"VerseNumber":16,"Text":"Olaika allatheena nataqabbalu AAanhum ahsana ma AAamiloo wanatajawazu AAan sayyiatihim fee ashabi aljannati waAAda alssidqi allathee kanoo yooAAadoona"},{"SurahNumber":46,"VerseNumber":17,"Text":"Waallathee qala liwalidayhi offin lakuma ataAAidaninee an okhraja waqad khalati alquroonu min qablee wahuma yastagheethani Allaha waylaka amin inna waAAda Allahi haqqun fayaqoolu ma hatha illa asateeru alawwaleena"},{"SurahNumber":46,"VerseNumber":18,"Text":"Olaika allatheena haqqa AAalayhimu alqawlu fee umamin qad khalat min qablihim mina aljinni waalinsi innahum kanoo khasireena"},{"SurahNumber":46,"VerseNumber":19,"Text":"Walikullin darajatun mimma AAamiloo waliyuwaffiyahum aAAmalahum wahum la yuthlamoona"},{"SurahNumber":46,"VerseNumber":20,"Text":"Wayawma yuAAradu allatheena kafaroo AAala alnnari athhabtum tayyibatikum fee hayatikumu alddunya waistamtaAAtum biha faalyawma tujzawna AAathaba alhooni bima kuntum tastakbiroona fee alardi bighayri alhaqqi wabima kuntum tafsuqoona"},{"SurahNumber":46,"VerseNumber":21,"Text":"Waothkur akha AAadin ith anthara qawmahu bialahqafi waqad khalati alnnuthuru min bayni yadayhi wamin khalfihi alla taAAbudoo illa Allaha innee akhafu AAalaykum AAathaba yawmin AAatheemin"},{"SurahNumber":46,"VerseNumber":22,"Text":"Qaloo ajitana litafikana AAan alihatina fatina bima taAAiduna in kunta mina alssadiqeena"},{"SurahNumber":46,"VerseNumber":23,"Text":"Qala innama alAAilmu AAinda Allahi waoballighukum ma orsiltu bihi walakinnee arakum qawman tajhaloona"},{"SurahNumber":46,"VerseNumber":24,"Text":"Falamma raawhu AAaridan mustaqbila awdiyatihim qaloo hatha AAaridun mumtiruna bal huwa ma istaAAjaltum bihi reehun feeha AAathabun aleemun"},{"SurahNumber":46,"VerseNumber":25,"Text":"Tudammiru kulla shayin biamri rabbiha faasbahoo la yura illa masakinuhum kathalika najzee alqawma almujrimeena"},{"SurahNumber":46,"VerseNumber":26,"Text":"Walaqad makkannahum feema in makkannakum feehi wajaAAalna lahum samAAan waabsaran waafidatan fama aghna AAanhum samAAuhum wala absaruhum wala afidatuhum min shayin ith kanoo yajhadoona biayati Allahi wahaqa bihim ma kanoo bihi yastahzioona"},{"SurahNumber":46,"VerseNumber":27,"Text":"Walaqad ahlakna ma hawlakum mina alqura wasarrafna alayati laAAallahum yarjiAAoona"},{"SurahNumber":46,"VerseNumber":28,"Text":"Falawla nasarahumu allatheena ittakhathoo min dooni Allahi qurbanan alihatan bal dalloo AAanhum wathalika ifkuhum wama kanoo yaftaroona"},{"SurahNumber":46,"VerseNumber":29,"Text":"Waith sarafna ilayka nafaran mina aljinni yastamiAAoona alqurana falamma hadaroohu qaloo ansitoo falamma qudiya wallaw ila qawmihim munthireena"},{"SurahNumber":46,"VerseNumber":30,"Text":"Qaloo ya qawmana inna samiAAna kitaban onzila min baAAdi moosa musaddiqan lima bayna yadayhi yahdee ila alhaqqi waila tareeqin mustaqeemin"},{"SurahNumber":46,"VerseNumber":31,"Text":"Ya qawmana ajeeboo daAAiya Allahi waaminoo bihi yaghfir lakum min thunoobikum wayujirkum min AAathabin aleemin"},{"SurahNumber":46,"VerseNumber":32,"Text":"Waman la yujib daAAiya Allahi falaysa bimuAAjizin fee alardi walaysa lahu min doonihi awliyaa olaika fee dalalin mubeenin"},{"SurahNumber":46,"VerseNumber":33,"Text":"Awalam yaraw anna Allaha allathee khalaqa alssamawati waalarda walam yaAAya bikhalqihinna biqadirin AAala an yuhyiya almawta bala innahu AAala kulli shayin qadeerun"},{"SurahNumber":46,"VerseNumber":34,"Text":"Wayawma yuAAradu allatheena kafaroo AAala alnnari alaysa hatha bialhaqqi qaloo bala warabbina qala fathooqoo alAAathaba bima kuntum takfuroona"},{"SurahNumber":46,"VerseNumber":35,"Text":"Faisbir kama sabara oloo alAAazmi mina alrrusuli wala tastaAAjil lahum kaannahum yawma yarawna ma yooAAadoona lam yalbathoo illa saAAatan min naharin balaghun fahal yuhlaku illa alqawmu alfasiqoona"}]},{"Id":34,"LanguageCode":"ara","Name":"ara-quranuthmanihaf1","Author":"Quran Uthmani Hafs No Diacritics","Language":"Arabic","Description":"Arabic","Direction":"rtl","Source":"https://qurancomplex.gov.sa/","Translations":[{"SurahNumber":46,"VerseNumber":1,"Text":"حم"},{"SurahNumber":46,"VerseNumber":2,"Text":"تنزيل الكتب من الله العزيز الحكيم"},{"SurahNumber":46,"VerseNumber":3,"Text":"ما خلقنا السموت والارض وما بينهما الا بالحق واجل مسم ى والذين كفروا عما انذروا معرضون"},{"SurahNumber":46,"VerseNumber":4,"Text":"قل ارءيتم ما تدعون من دون الله اروني ماذا خلقوا من الارض ام لهم شرك في السموت ايتوني بكتب من قبل هذا او اثرة من علم ان كنتم صدقين"},{"SurahNumber":46,"VerseNumber":5,"Text":"ومن اضل ممن يدعوا من دون الله من لا يستجيب له الى يوم القيمة وهم عن دعايهم غفلون"},{"SurahNumber":46,"VerseNumber":6,"Text":"واذا حشر الناس كانوا لهم اعداء وكانوا بعبادتهم كفرين"},{"SurahNumber":46,"VerseNumber":7,"Text":"واذا تتلى عليهم ءايتنا بينت قال الذين كفروا للحق لما جاءهم هذا سحر مبين"},{"SurahNumber":46,"VerseNumber":8,"Text":"ام يقولون افترىه قل ان افتريته فلا تملكون لي من الله شيا هو اعلم بما تفيضون فيه كفى به شهيدا بيني وبينكم وهو الغفور الرحيم"},{"SurahNumber":46,"VerseNumber":9,"Text":"قل ما كنت بدع ا من الرسل وما ادري ما يفعل بي ولا بكم ان اتبع الا ما يوحى الي وما انا الا نذير مبين"},{"SurahNumber":46,"VerseNumber":10,"Text":"قل ارءيتم ان كان من عند الله وكفرتم به وشهد شاهد من بني اسرءيل على مثله فامن واستكبرتم ان الله لا يهدي القوم الظلمين"},{"SurahNumber":46,"VerseNumber":11,"Text":"وقال الذين كفروا للذين ءامنوا لو كان خير ا ما سبقونا اليه واذ لم يهتدوا به فسيقولون هذا افك قديم"},{"SurahNumber":46,"VerseNumber":12,"Text":"ومن قبله كتب موسى امام ا ورحمة وهذا كتب مصدق لسانا عربي ا لينذر الذين ظلموا وبشرى للمحسنين"},{"SurahNumber":46,"VerseNumber":13,"Text":"ان الذين قالوا ربنا الله ثم استقموا فلا خوف عليهم ولا هم يحزنون"},{"SurahNumber":46,"VerseNumber":14,"Text":"اوليك اصحب الجنة خلدين فيها جزاء بما كانوا يعملون"},{"SurahNumber":46,"VerseNumber":15,"Text":"ووصينا الانسن بولديه احسنا حملته امه كره ا ووضعته كره ا وحمله وفصله ثلثون شهرا حتى اذا بلغ اشده وبلغ اربعين سنة قال رب اوزعني ان اشكر نعمتك التي انعمت علي وعلى ولدي وان اعمل صلح ا ترضىه واصلح لي في ذريتي اني تبت اليك واني من المسلمين"},{"SurahNumber":46,"VerseNumber":16,"Text":"اوليك الذين نتقبل عنهم احسن ما عملوا ونتجاوز عن سياتهم في اصحب الجنة وعد الصدق الذي كانوا يوعدون"},{"SurahNumber":46,"VerseNumber":17,"Text":"والذي قال لولديه اف لكما اتعدانني ان اخرج وقد خلت القرون من قبلي وهما يستغيثان الله ويلك ءامن ان وعد الله حق فيقول ما هذا الا اسطير الاولين"},{"SurahNumber":46,"VerseNumber":18,"Text":"اوليك الذين حق عليهم القول في امم قد خلت من قبلهم من الجن والانس انهم كانوا خسرين"},{"SurahNumber":46,"VerseNumber":19,"Text":"ولكل درجت مما عملوا وليوفيهم اعملهم وهم لا يظلمون"},{"SurahNumber":46,"VerseNumber":20,"Text":"ويوم يعرض الذين كفروا على النار اذهبتم طيبتكم في حياتكم الدنيا واستمتعتم بها فاليوم تجزون عذاب الهون بما كنتم تستكبرون في الارض بغير الحق وبما كنتم تفسقون"},{"SurahNumber":46,"VerseNumber":21,"Text":"۞واذكر اخا عاد اذ انذر قومه بالاحقاف وقد خلت النذر من بين يديه ومن خلفه الا تعبدوا الا الله اني اخاف عليكم عذاب يوم عظيم"},{"SurahNumber":46,"VerseNumber":22,"Text":"قالوا اجيتنا لتافكنا عن ءالهتنا فاتنا بما تعدنا ان كنت من الصدقين"},{"SurahNumber":46,"VerseNumber":23,"Text":"قال انما العلم عند الله وابلغكم ما ارسلت به ولكني ارىكم قوم ا تجهلون"},{"SurahNumber":46,"VerseNumber":24,"Text":"فلما راوه عارض ا مستقبل اوديتهم قالوا هذا عارض ممطرنا بل هو ما استعجلتم به ريح فيها عذاب اليم"},{"SurahNumber":46,"VerseNumber":25,"Text":"تدمر كل شيء بامر ربها فاصبحوا لا يرى الا مسكنهم كذلك نجزي القوم المجرمين"},{"SurahNumber":46,"VerseNumber":26,"Text":"ولقد مكنهم فيما ان مكنكم فيه وجعلنا لهم سمع ا وابصر ا وافدة فما اغنى عنهم سمعهم ولا ابصرهم ولا افدتهم من شيء اذ كانوا يجحدون بايت الله وحاق بهم ما كانوا به يستهزءون"},{"SurahNumber":46,"VerseNumber":27,"Text":"ولقد اهلكنا ما حولكم من القرى وصرفنا الايت لعلهم يرجعون"},{"SurahNumber":46,"VerseNumber":28,"Text":"فلولا نصرهم الذين اتخذوا من دون الله قربانا ءالهة بل ضلوا عنهم وذلك افكهم وما كانوا يفترون"},{"SurahNumber":46,"VerseNumber":29,"Text":"واذ صرفنا اليك نفر ا من الجن يستمعون القرءان فلما حضروه قالوا انصتوا فلما قضي ولوا الى قومهم منذرين"},{"SurahNumber":46,"VerseNumber":30,"Text":"قالوا يقومنا انا سمعنا كتبا انزل من بعد موسى مصدق ا لما بين يديه يهدي الى الحق والى طريق مستقيم"},{"SurahNumber":46,"VerseNumber":31,"Text":"يقومنا اجيبوا داعي الله وءامنوا به يغفر لكم من ذنوبكم ويجركم من عذاب اليم"},{"SurahNumber":46,"VerseNumber":32,"Text":"ومن لا يجب داعي الله فليس بمعجز في الارض وليس له من دونه اولياء اوليك في ضلل مبين"},{"SurahNumber":46,"VerseNumber":33,"Text":"اولم يروا ان الله الذي خلق السموت والارض ولم يعي بخلقهن بقدر على ان يحي الموتى بلى انه على كل شيء قدير"},{"SurahNumber":46,"VerseNumber":34,"Text":"ويوم يعرض الذين كفروا على النار اليس هذا بالحق قالوا بلى وربنا قال فذوقوا العذاب بما كنتم تكفرون"},{"SurahNumber":46,"VerseNumber":35,"Text":"فاصبر كما صبر اولوا العزم من الرسل ولا تستعجل لهم كانهم يوم يرون ما يوعدون لم يلبثوا الا ساعة من نهار بلغ فهل يهلك الا القوم الفسقون"}]}]}