{"LanguageCode":"en","SurahData":{"Chapter":28,"Index":"028","Name":"Al-Qasas","TranslatedName":"The Stories","ArabicName":"سُوْرَةُ الْقَصَصِ","Revelation":"Mecca","RevelationOrder":49,"HasBismillah":true,"VerseCount":88,"SajdaCount":0,"JuzStart":20,"JuzEnd":20,"VerseStart":3253,"VerseEnd":3340,"ManzilStart":5,"ManzilEnd":5,"RukuStart":334,"RukuEnd":341,"MaqraStart":154,"MaqraEnd":158,"PageStart":385,"PageEnd":396},"Summaries":["<p>This is a Makki Surah revealed most probably after the previous Surah in the middle Makkan period. The Surah consists of 88 verses in 9 sections.</p>","<p>The basic theme of this Surah is the prophethood. Some aspects of the life of Prophet Moses -peace be upon him- are mentioned to show the similarity between him and Prophet Muhammad –peace be upon all the prophets of Allah. There are also answers here to the questions and doubts that were raised by some non-believers.</p>","<ol>","\t<li>Story of Moses and Pharaoh is related. Pharaoh was persecuting the Israelites. Allah wished to show his favor to the oppressed people. Birth of Moses and then his growing up in Pharaoh's own palace.</li>","\t<li>Moses' encounter with an Egyptian and his escape to Madyan.</li>","\t<li>Moses' marriage in Madyan.</li>","\t<li>Moses receives Prophethood and especial signs from Allah. His appearance before Pharaoh. Pharaoh's denial and then Allah's punishment for him and his armies.</li>","\t<li>The Prophet relating these stories by inspiration from Allah and for a purpose.</li>","\t<li>Allah's guidance is continuos.</li>","\t<li>The message of Islam is tawhid.</li>","\t<li>The story of Qarun: his character and his end.</li>","\t<li>Allah's promise for the Believers.</li>","</ol>"],"Verses":[{"Verse":1,"Text":"طسٓمٓ","End":"١"},{"Verse":2,"Text":"تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ ٱلۡمُبِينِ","End":"٢"},{"Verse":3,"Text":"نَتۡلُواْ عَلَيۡكَ مِن نَّبَإِ مُوسَىٰ وَفِرۡعَوۡنَ بِٱلۡحَقِّ لِقَوۡمٖ يُؤۡمِنُونَ","End":"٣"},{"Verse":4,"Text":"إِنَّ فِرۡعَوۡنَ عَلَا فِي ٱلۡأَرۡضِ وَجَعَلَ أَهۡلَهَا شِيَعٗا يَسۡتَضۡعِفُ طَآئِفَةٗ مِّنۡهُمۡ يُذَبِّحُ أَبۡنَآءَهُمۡ وَيَسۡتَحۡيِۦ نِسَآءَهُمۡۚ إِنَّهُۥ كَانَ مِنَ ٱلۡمُفۡسِدِينَ","End":"٤"},{"Verse":5,"Text":"وَنُرِيدُ أَن نَّمُنَّ عَلَى ٱلَّذِينَ ٱسۡتُضۡعِفُواْ فِي ٱلۡأَرۡضِ وَنَجۡعَلَهُمۡ أَئِمَّةٗ وَنَجۡعَلَهُمُ ٱلۡوَٰرِثِينَ","End":"٥"},{"Verse":6,"Text":"وَنُمَكِّنَ لَهُمۡ فِي ٱلۡأَرۡضِ وَنُرِيَ فِرۡعَوۡنَ وَهَٰمَٰنَ وَجُنُودَهُمَا مِنۡهُم مَّا كَانُواْ يَحۡذَرُونَ","End":"٦"},{"Verse":7,"Text":"وَأَوۡحَيۡنَآ إِلَىٰٓ أُمِّ مُوسَىٰٓ أَنۡ أَرۡضِعِيهِۖ فَإِذَا خِفۡتِ عَلَيۡهِ فَأَلۡقِيهِ فِي ٱلۡيَمِّ وَلَا تَخَافِي وَلَا تَحۡزَنِيٓۖ إِنَّا رَآدُّوهُ إِلَيۡكِ وَجَاعِلُوهُ مِنَ ٱلۡمُرۡسَلِينَ","End":"٧"},{"Verse":8,"Text":"فَٱلۡتَقَطَهُۥٓ ءَالُ فِرۡعَوۡنَ لِيَكُونَ لَهُمۡ عَدُوّٗا وَحَزَنًاۗ إِنَّ فِرۡعَوۡنَ وَهَٰمَٰنَ وَجُنُودَهُمَا كَانُواْ خَٰطِـِٔينَ","End":"٨"},{"Verse":9,"Text":"وَقَالَتِ ٱمۡرَأَتُ فِرۡعَوۡنَ قُرَّتُ عَيۡنٖ لِّي وَلَكَۖ لَا تَقۡتُلُوهُ عَسَىٰٓ أَن يَنفَعَنَآ أَوۡ نَتَّخِذَهُۥ وَلَدٗا وَهُمۡ لَا يَشۡعُرُونَ","End":"٩"},{"Verse":10,"Text":"وَأَصۡبَحَ فُؤَادُ أُمِّ مُوسَىٰ فَٰرِغًاۖ إِن كَادَتۡ لَتُبۡدِي بِهِۦ لَوۡلَآ أَن رَّبَطۡنَا عَلَىٰ قَلۡبِهَا لِتَكُونَ مِنَ ٱلۡمُؤۡمِنِينَ","End":"١٠"},{"Verse":11,"Text":"وَقَالَتۡ لِأُخۡتِهِۦ قُصِّيهِۖ فَبَصُرَتۡ بِهِۦ عَن جُنُبٖ وَهُمۡ لَا يَشۡعُرُونَ","End":"١١"},{"Verse":12,"Text":"۞وَحَرَّمۡنَا عَلَيۡهِ ٱلۡمَرَاضِعَ مِن قَبۡلُ فَقَالَتۡ هَلۡ أَدُلُّكُمۡ عَلَىٰٓ أَهۡلِ بَيۡتٖ يَكۡفُلُونَهُۥ لَكُمۡ وَهُمۡ لَهُۥ نَٰصِحُونَ","End":"١٢"},{"Verse":13,"Text":"فَرَدَدۡنَٰهُ إِلَىٰٓ أُمِّهِۦ كَيۡ تَقَرَّ عَيۡنُهَا وَلَا تَحۡزَنَ وَلِتَعۡلَمَ أَنَّ وَعۡدَ ٱللَّهِ حَقّٞ وَلَٰكِنَّ أَكۡثَرَهُمۡ لَا يَعۡلَمُونَ","End":"١٣"},{"Verse":14,"Text":"وَلَمَّا بَلَغَ أَشُدَّهُۥ وَٱسۡتَوَىٰٓ ءَاتَيۡنَٰهُ حُكۡمٗا وَعِلۡمٗاۚ وَكَذَٰلِكَ نَجۡزِي ٱلۡمُحۡسِنِينَ","End":"١٤"},{"Verse":15,"Text":"وَدَخَلَ ٱلۡمَدِينَةَ عَلَىٰ حِينِ غَفۡلَةٖ مِّنۡ أَهۡلِهَا فَوَجَدَ فِيهَا رَجُلَيۡنِ يَقۡتَتِلَانِ هَٰذَا مِن شِيعَتِهِۦ وَهَٰذَا مِنۡ عَدُوِّهِۦۖ فَٱسۡتَغَٰثَهُ ٱلَّذِي مِن شِيعَتِهِۦ عَلَى ٱلَّذِي مِنۡ عَدُوِّهِۦ فَوَكَزَهُۥ مُوسَىٰ فَقَضَىٰ عَلَيۡهِۖ قَالَ هَٰذَا مِنۡ عَمَلِ ٱلشَّيۡطَٰنِۖ إِنَّهُۥ عَدُوّٞ مُّضِلّٞ مُّبِينٞ","End":"١٥"},{"Verse":16,"Text":"قَالَ رَبِّ إِنِّي ظَلَمۡتُ نَفۡسِي فَٱغۡفِرۡ لِي فَغَفَرَ لَهُۥٓۚ إِنَّهُۥ هُوَ ٱلۡغَفُورُ ٱلرَّحِيمُ","End":"١٦"},{"Verse":17,"Text":"قَالَ رَبِّ بِمَآ أَنۡعَمۡتَ عَلَيَّ فَلَنۡ أَكُونَ ظَهِيرٗا لِّلۡمُجۡرِمِينَ","End":"١٧"},{"Verse":18,"Text":"فَأَصۡبَحَ فِي ٱلۡمَدِينَةِ خَآئِفٗا يَتَرَقَّبُ فَإِذَا ٱلَّذِي ٱسۡتَنصَرَهُۥ بِٱلۡأَمۡسِ يَسۡتَصۡرِخُهُۥۚ قَالَ لَهُۥ مُوسَىٰٓ إِنَّكَ لَغَوِيّٞ مُّبِينٞ","End":"١٨"},{"Verse":19,"Text":"فَلَمَّآ أَنۡ أَرَادَ أَن يَبۡطِشَ بِٱلَّذِي هُوَ عَدُوّٞ لَّهُمَا قَالَ يَٰمُوسَىٰٓ أَتُرِيدُ أَن تَقۡتُلَنِي كَمَا قَتَلۡتَ نَفۡسَۢا بِٱلۡأَمۡسِۖ إِن تُرِيدُ إِلَّآ أَن تَكُونَ جَبَّارٗا فِي ٱلۡأَرۡضِ وَمَا تُرِيدُ أَن تَكُونَ مِنَ ٱلۡمُصۡلِحِينَ","End":"١٩"},{"Verse":20,"Text":"وَجَآءَ رَجُلٞ مِّنۡ أَقۡصَا ٱلۡمَدِينَةِ يَسۡعَىٰ قَالَ يَٰمُوسَىٰٓ إِنَّ ٱلۡمَلَأَ يَأۡتَمِرُونَ بِكَ لِيَقۡتُلُوكَ فَٱخۡرُجۡ إِنِّي لَكَ مِنَ ٱلنَّـٰصِحِينَ","End":"٢٠"},{"Verse":21,"Text":"فَخَرَجَ مِنۡهَا خَآئِفٗا يَتَرَقَّبُۖ قَالَ رَبِّ نَجِّنِي مِنَ ٱلۡقَوۡمِ ٱلظَّـٰلِمِينَ","End":"٢١"},{"Verse":22,"Text":"وَلَمَّا تَوَجَّهَ تِلۡقَآءَ مَدۡيَنَ قَالَ عَسَىٰ رَبِّيٓ أَن يَهۡدِيَنِي سَوَآءَ ٱلسَّبِيلِ","End":"٢٢"},{"Verse":23,"Text":"وَلَمَّا وَرَدَ مَآءَ مَدۡيَنَ وَجَدَ عَلَيۡهِ أُمَّةٗ مِّنَ ٱلنَّاسِ يَسۡقُونَ وَوَجَدَ مِن دُونِهِمُ ٱمۡرَأَتَيۡنِ تَذُودَانِۖ قَالَ مَا خَطۡبُكُمَاۖ قَالَتَا لَا نَسۡقِي حَتَّىٰ يُصۡدِرَ ٱلرِّعَآءُۖ وَأَبُونَا شَيۡخٞ كَبِيرٞ","End":"٢٣"},{"Verse":24,"Text":"فَسَقَىٰ لَهُمَا ثُمَّ تَوَلَّىٰٓ إِلَى ٱلظِّلِّ فَقَالَ رَبِّ إِنِّي لِمَآ أَنزَلۡتَ إِلَيَّ مِنۡ خَيۡرٖ فَقِيرٞ","End":"٢٤"},{"Verse":25,"Text":"فَجَآءَتۡهُ إِحۡدَىٰهُمَا تَمۡشِي عَلَى ٱسۡتِحۡيَآءٖ قَالَتۡ إِنَّ أَبِي يَدۡعُوكَ لِيَجۡزِيَكَ أَجۡرَ مَا سَقَيۡتَ لَنَاۚ فَلَمَّا جَآءَهُۥ وَقَصَّ عَلَيۡهِ ٱلۡقَصَصَ قَالَ لَا تَخَفۡۖ نَجَوۡتَ مِنَ ٱلۡقَوۡمِ ٱلظَّـٰلِمِينَ","End":"٢٥"},{"Verse":26,"Text":"قَالَتۡ إِحۡدَىٰهُمَا يَـٰٓأَبَتِ ٱسۡتَـٔۡجِرۡهُۖ إِنَّ خَيۡرَ مَنِ ٱسۡتَـٔۡجَرۡتَ ٱلۡقَوِيُّ ٱلۡأَمِينُ","End":"٢٦"},{"Verse":27,"Text":"قَالَ إِنِّيٓ أُرِيدُ أَنۡ أُنكِحَكَ إِحۡدَى ٱبۡنَتَيَّ هَٰتَيۡنِ عَلَىٰٓ أَن تَأۡجُرَنِي ثَمَٰنِيَ حِجَجٖۖ فَإِنۡ أَتۡمَمۡتَ عَشۡرٗا فَمِنۡ عِندِكَۖ وَمَآ أُرِيدُ أَنۡ أَشُقَّ عَلَيۡكَۚ سَتَجِدُنِيٓ إِن شَآءَ ٱللَّهُ مِنَ ٱلصَّـٰلِحِينَ","End":"٢٧"},{"Verse":28,"Text":"قَالَ ذَٰلِكَ بَيۡنِي وَبَيۡنَكَۖ أَيَّمَا ٱلۡأَجَلَيۡنِ قَضَيۡتُ فَلَا عُدۡوَٰنَ عَلَيَّۖ وَٱللَّهُ عَلَىٰ مَا نَقُولُ وَكِيلٞ","End":"٢٨"},{"Verse":29,"Text":"۞فَلَمَّا قَضَىٰ مُوسَى ٱلۡأَجَلَ وَسَارَ بِأَهۡلِهِۦٓ ءَانَسَ مِن جَانِبِ ٱلطُّورِ نَارٗاۖ قَالَ لِأَهۡلِهِ ٱمۡكُثُوٓاْ إِنِّيٓ ءَانَسۡتُ نَارٗا لَّعَلِّيٓ ءَاتِيكُم مِّنۡهَا بِخَبَرٍ أَوۡ جَذۡوَةٖ مِّنَ ٱلنَّارِ لَعَلَّكُمۡ تَصۡطَلُونَ","End":"٢٩"},{"Verse":30,"Text":"فَلَمَّآ أَتَىٰهَا نُودِيَ مِن شَٰطِيِٕ ٱلۡوَادِ ٱلۡأَيۡمَنِ فِي ٱلۡبُقۡعَةِ ٱلۡمُبَٰرَكَةِ مِنَ ٱلشَّجَرَةِ أَن يَٰمُوسَىٰٓ إِنِّيٓ أَنَا ٱللَّهُ رَبُّ ٱلۡعَٰلَمِينَ","End":"٣٠"},{"Verse":31,"Text":"وَأَنۡ أَلۡقِ عَصَاكَۚ فَلَمَّا رَءَاهَا تَهۡتَزُّ كَأَنَّهَا جَآنّٞ وَلَّىٰ مُدۡبِرٗا وَلَمۡ يُعَقِّبۡۚ يَٰمُوسَىٰٓ أَقۡبِلۡ وَلَا تَخَفۡۖ إِنَّكَ مِنَ ٱلۡأٓمِنِينَ","End":"٣١"},{"Verse":32,"Text":"ٱسۡلُكۡ يَدَكَ فِي جَيۡبِكَ تَخۡرُجۡ بَيۡضَآءَ مِنۡ غَيۡرِ سُوٓءٖ وَٱضۡمُمۡ إِلَيۡكَ جَنَاحَكَ مِنَ ٱلرَّهۡبِۖ فَذَٰنِكَ بُرۡهَٰنَانِ مِن رَّبِّكَ إِلَىٰ فِرۡعَوۡنَ وَمَلَإِيْهِۦٓۚ إِنَّهُمۡ كَانُواْ قَوۡمٗا فَٰسِقِينَ","End":"٣٢"},{"Verse":33,"Text":"قَالَ رَبِّ إِنِّي قَتَلۡتُ مِنۡهُمۡ نَفۡسٗا فَأَخَافُ أَن يَقۡتُلُونِ","End":"٣٣"},{"Verse":34,"Text":"وَأَخِي هَٰرُونُ هُوَ أَفۡصَحُ مِنِّي لِسَانٗا فَأَرۡسِلۡهُ مَعِيَ رِدۡءٗا يُصَدِّقُنِيٓۖ إِنِّيٓ أَخَافُ أَن يُكَذِّبُونِ","End":"٣٤"},{"Verse":35,"Text":"قَالَ سَنَشُدُّ عَضُدَكَ بِأَخِيكَ وَنَجۡعَلُ لَكُمَا سُلۡطَٰنٗا فَلَا يَصِلُونَ إِلَيۡكُمَا بِـَٔايَٰتِنَآۚ أَنتُمَا وَمَنِ ٱتَّبَعَكُمَا ٱلۡغَٰلِبُونَ","End":"٣٥"},{"Verse":36,"Text":"فَلَمَّا جَآءَهُم مُّوسَىٰ بِـَٔايَٰتِنَا بَيِّنَٰتٖ قَالُواْ مَا هَٰذَآ إِلَّا سِحۡرٞ مُّفۡتَرٗى وَمَا سَمِعۡنَا بِهَٰذَا فِيٓ ءَابَآئِنَا ٱلۡأَوَّلِينَ","End":"٣٦"},{"Verse":37,"Text":"وَقَالَ مُوسَىٰ رَبِّيٓ أَعۡلَمُ بِمَن جَآءَ بِٱلۡهُدَىٰ مِنۡ عِندِهِۦ وَمَن تَكُونُ لَهُۥ عَٰقِبَةُ ٱلدَّارِۚ إِنَّهُۥ لَا يُفۡلِحُ ٱلظَّـٰلِمُونَ","End":"٣٧"},{"Verse":38,"Text":"وَقَالَ فِرۡعَوۡنُ يَـٰٓأَيُّهَا ٱلۡمَلَأُ مَا عَلِمۡتُ لَكُم مِّنۡ إِلَٰهٍ غَيۡرِي فَأَوۡقِدۡ لِي يَٰهَٰمَٰنُ عَلَى ٱلطِّينِ فَٱجۡعَل لِّي صَرۡحٗا لَّعَلِّيٓ أَطَّلِعُ إِلَىٰٓ إِلَٰهِ مُوسَىٰ وَإِنِّي لَأَظُنُّهُۥ مِنَ ٱلۡكَٰذِبِينَ","End":"٣٨"},{"Verse":39,"Text":"وَٱسۡتَكۡبَرَ هُوَ وَجُنُودُهُۥ فِي ٱلۡأَرۡضِ بِغَيۡرِ ٱلۡحَقِّ وَظَنُّوٓاْ أَنَّهُمۡ إِلَيۡنَا لَا يُرۡجَعُونَ","End":"٣٩"},{"Verse":40,"Text":"فَأَخَذۡنَٰهُ وَجُنُودَهُۥ فَنَبَذۡنَٰهُمۡ فِي ٱلۡيَمِّۖ فَٱنظُرۡ كَيۡفَ كَانَ عَٰقِبَةُ ٱلظَّـٰلِمِينَ","End":"٤٠"},{"Verse":41,"Text":"وَجَعَلۡنَٰهُمۡ أَئِمَّةٗ يَدۡعُونَ إِلَى ٱلنَّارِۖ وَيَوۡمَ ٱلۡقِيَٰمَةِ لَا يُنصَرُونَ","End":"٤١"},{"Verse":42,"Text":"وَأَتۡبَعۡنَٰهُمۡ فِي هَٰذِهِ ٱلدُّنۡيَا لَعۡنَةٗۖ وَيَوۡمَ ٱلۡقِيَٰمَةِ هُم مِّنَ ٱلۡمَقۡبُوحِينَ","End":"٤٢"},{"Verse":43,"Text":"وَلَقَدۡ ءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ مِنۢ بَعۡدِ مَآ أَهۡلَكۡنَا ٱلۡقُرُونَ ٱلۡأُولَىٰ بَصَآئِرَ لِلنَّاسِ وَهُدٗى وَرَحۡمَةٗ لَّعَلَّهُمۡ يَتَذَكَّرُونَ","End":"٤٣"},{"Verse":44,"Text":"وَمَا كُنتَ بِجَانِبِ ٱلۡغَرۡبِيِّ إِذۡ قَضَيۡنَآ إِلَىٰ مُوسَى ٱلۡأَمۡرَ وَمَا كُنتَ مِنَ ٱلشَّـٰهِدِينَ","End":"٤٤"},{"Verse":45,"Text":"وَلَٰكِنَّآ أَنشَأۡنَا قُرُونٗا فَتَطَاوَلَ عَلَيۡهِمُ ٱلۡعُمُرُۚ وَمَا كُنتَ ثَاوِيٗا فِيٓ أَهۡلِ مَدۡيَنَ تَتۡلُواْ عَلَيۡهِمۡ ءَايَٰتِنَا وَلَٰكِنَّا كُنَّا مُرۡسِلِينَ","End":"٤٥"},{"Verse":46,"Text":"وَمَا كُنتَ بِجَانِبِ ٱلطُّورِ إِذۡ نَادَيۡنَا وَلَٰكِن رَّحۡمَةٗ مِّن رَّبِّكَ لِتُنذِرَ قَوۡمٗا مَّآ أَتَىٰهُم مِّن نَّذِيرٖ مِّن قَبۡلِكَ لَعَلَّهُمۡ يَتَذَكَّرُونَ","End":"٤٦"},{"Verse":47,"Text":"وَلَوۡلَآ أَن تُصِيبَهُم مُّصِيبَةُۢ بِمَا قَدَّمَتۡ أَيۡدِيهِمۡ فَيَقُولُواْ رَبَّنَا لَوۡلَآ أَرۡسَلۡتَ إِلَيۡنَا رَسُولٗا فَنَتَّبِعَ ءَايَٰتِكَ وَنَكُونَ مِنَ ٱلۡمُؤۡمِنِينَ","End":"٤٧"},{"Verse":48,"Text":"فَلَمَّا جَآءَهُمُ ٱلۡحَقُّ مِنۡ عِندِنَا قَالُواْ لَوۡلَآ أُوتِيَ مِثۡلَ مَآ أُوتِيَ مُوسَىٰٓۚ أَوَلَمۡ يَكۡفُرُواْ بِمَآ أُوتِيَ مُوسَىٰ مِن قَبۡلُۖ قَالُواْ سِحۡرَانِ تَظَٰهَرَا وَقَالُوٓاْ إِنَّا بِكُلّٖ كَٰفِرُونَ","End":"٤٨"},{"Verse":49,"Text":"قُلۡ فَأۡتُواْ بِكِتَٰبٖ مِّنۡ عِندِ ٱللَّهِ هُوَ أَهۡدَىٰ مِنۡهُمَآ أَتَّبِعۡهُ إِن كُنتُمۡ صَٰدِقِينَ","End":"٤٩"},{"Verse":50,"Text":"فَإِن لَّمۡ يَسۡتَجِيبُواْ لَكَ فَٱعۡلَمۡ أَنَّمَا يَتَّبِعُونَ أَهۡوَآءَهُمۡۚ وَمَنۡ أَضَلُّ مِمَّنِ ٱتَّبَعَ هَوَىٰهُ بِغَيۡرِ هُدٗى مِّنَ ٱللَّهِۚ إِنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّـٰلِمِينَ","End":"٥٠"},{"Verse":51,"Text":"۞وَلَقَدۡ وَصَّلۡنَا لَهُمُ ٱلۡقَوۡلَ لَعَلَّهُمۡ يَتَذَكَّرُونَ","End":"٥١"},{"Verse":52,"Text":"ٱلَّذِينَ ءَاتَيۡنَٰهُمُ ٱلۡكِتَٰبَ مِن قَبۡلِهِۦ هُم بِهِۦ يُؤۡمِنُونَ","End":"٥٢"},{"Verse":53,"Text":"وَإِذَا يُتۡلَىٰ عَلَيۡهِمۡ قَالُوٓاْ ءَامَنَّا بِهِۦٓ إِنَّهُ ٱلۡحَقُّ مِن رَّبِّنَآ إِنَّا كُنَّا مِن قَبۡلِهِۦ مُسۡلِمِينَ","End":"٥٣"},{"Verse":54,"Text":"أُوْلَـٰٓئِكَ يُؤۡتَوۡنَ أَجۡرَهُم مَّرَّتَيۡنِ بِمَا صَبَرُواْ وَيَدۡرَءُونَ بِٱلۡحَسَنَةِ ٱلسَّيِّئَةَ وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ","End":"٥٤"},{"Verse":55,"Text":"وَإِذَا سَمِعُواْ ٱللَّغۡوَ أَعۡرَضُواْ عَنۡهُ وَقَالُواْ لَنَآ أَعۡمَٰلُنَا وَلَكُمۡ أَعۡمَٰلُكُمۡ سَلَٰمٌ عَلَيۡكُمۡ لَا نَبۡتَغِي ٱلۡجَٰهِلِينَ","End":"٥٥"},{"Verse":56,"Text":"إِنَّكَ لَا تَهۡدِي مَنۡ أَحۡبَبۡتَ وَلَٰكِنَّ ٱللَّهَ يَهۡدِي مَن يَشَآءُۚ وَهُوَ أَعۡلَمُ بِٱلۡمُهۡتَدِينَ","End":"٥٦"},{"Verse":57,"Text":"وَقَالُوٓاْ إِن نَّتَّبِعِ ٱلۡهُدَىٰ مَعَكَ نُتَخَطَّفۡ مِنۡ أَرۡضِنَآۚ أَوَلَمۡ نُمَكِّن لَّهُمۡ حَرَمًا ءَامِنٗا يُجۡبَىٰٓ إِلَيۡهِ ثَمَرَٰتُ كُلِّ شَيۡءٖ رِّزۡقٗا مِّن لَّدُنَّا وَلَٰكِنَّ أَكۡثَرَهُمۡ لَا يَعۡلَمُونَ","End":"٥٧"},{"Verse":58,"Text":"وَكَمۡ أَهۡلَكۡنَا مِن قَرۡيَةِۭ بَطِرَتۡ مَعِيشَتَهَاۖ فَتِلۡكَ مَسَٰكِنُهُمۡ لَمۡ تُسۡكَن مِّنۢ بَعۡدِهِمۡ إِلَّا قَلِيلٗاۖ وَكُنَّا نَحۡنُ ٱلۡوَٰرِثِينَ","End":"٥٨"},{"Verse":59,"Text":"وَمَا كَانَ رَبُّكَ مُهۡلِكَ ٱلۡقُرَىٰ حَتَّىٰ يَبۡعَثَ فِيٓ أُمِّهَا رَسُولٗا يَتۡلُواْ عَلَيۡهِمۡ ءَايَٰتِنَاۚ وَمَا كُنَّا مُهۡلِكِي ٱلۡقُرَىٰٓ إِلَّا وَأَهۡلُهَا ظَٰلِمُونَ","End":"٥٩"},{"Verse":60,"Text":"وَمَآ أُوتِيتُم مِّن شَيۡءٖ فَمَتَٰعُ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَزِينَتُهَاۚ وَمَا عِندَ ٱللَّهِ خَيۡرٞ وَأَبۡقَىٰٓۚ أَفَلَا تَعۡقِلُونَ","End":"٦٠"},{"Verse":61,"Text":"أَفَمَن وَعَدۡنَٰهُ وَعۡدًا حَسَنٗا فَهُوَ لَٰقِيهِ كَمَن مَّتَّعۡنَٰهُ مَتَٰعَ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا ثُمَّ هُوَ يَوۡمَ ٱلۡقِيَٰمَةِ مِنَ ٱلۡمُحۡضَرِينَ","End":"٦١"},{"Verse":62,"Text":"وَيَوۡمَ يُنَادِيهِمۡ فَيَقُولُ أَيۡنَ شُرَكَآءِيَ ٱلَّذِينَ كُنتُمۡ تَزۡعُمُونَ","End":"٦٢"},{"Verse":63,"Text":"قَالَ ٱلَّذِينَ حَقَّ عَلَيۡهِمُ ٱلۡقَوۡلُ رَبَّنَا هَـٰٓؤُلَآءِ ٱلَّذِينَ أَغۡوَيۡنَآ أَغۡوَيۡنَٰهُمۡ كَمَا غَوَيۡنَاۖ تَبَرَّأۡنَآ إِلَيۡكَۖ مَا كَانُوٓاْ إِيَّانَا يَعۡبُدُونَ","End":"٦٣"},{"Verse":64,"Text":"وَقِيلَ ٱدۡعُواْ شُرَكَآءَكُمۡ فَدَعَوۡهُمۡ فَلَمۡ يَسۡتَجِيبُواْ لَهُمۡ وَرَأَوُاْ ٱلۡعَذَابَۚ لَوۡ أَنَّهُمۡ كَانُواْ يَهۡتَدُونَ","End":"٦٤"},{"Verse":65,"Text":"وَيَوۡمَ يُنَادِيهِمۡ فَيَقُولُ مَاذَآ أَجَبۡتُمُ ٱلۡمُرۡسَلِينَ","End":"٦٥"},{"Verse":66,"Text":"فَعَمِيَتۡ عَلَيۡهِمُ ٱلۡأَنۢبَآءُ يَوۡمَئِذٖ فَهُمۡ لَا يَتَسَآءَلُونَ","End":"٦٦"},{"Verse":67,"Text":"فَأَمَّا مَن تَابَ وَءَامَنَ وَعَمِلَ صَٰلِحٗا فَعَسَىٰٓ أَن يَكُونَ مِنَ ٱلۡمُفۡلِحِينَ","End":"٦٧"},{"Verse":68,"Text":"وَرَبُّكَ يَخۡلُقُ مَا يَشَآءُ وَيَخۡتَارُۗ مَا كَانَ لَهُمُ ٱلۡخِيَرَةُۚ سُبۡحَٰنَ ٱللَّهِ وَتَعَٰلَىٰ عَمَّا يُشۡرِكُونَ","End":"٦٨"},{"Verse":69,"Text":"وَرَبُّكَ يَعۡلَمُ مَا تُكِنُّ صُدُورُهُمۡ وَمَا يُعۡلِنُونَ","End":"٦٩"},{"Verse":70,"Text":"وَهُوَ ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَۖ لَهُ ٱلۡحَمۡدُ فِي ٱلۡأُولَىٰ وَٱلۡأٓخِرَةِۖ وَلَهُ ٱلۡحُكۡمُ وَإِلَيۡهِ تُرۡجَعُونَ","End":"٧٠"},{"Verse":71,"Text":"قُلۡ أَرَءَيۡتُمۡ إِن جَعَلَ ٱللَّهُ عَلَيۡكُمُ ٱلَّيۡلَ سَرۡمَدًا إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِ مَنۡ إِلَٰهٌ غَيۡرُ ٱللَّهِ يَأۡتِيكُم بِضِيَآءٍۚ أَفَلَا تَسۡمَعُونَ","End":"٧١"},{"Verse":72,"Text":"قُلۡ أَرَءَيۡتُمۡ إِن جَعَلَ ٱللَّهُ عَلَيۡكُمُ ٱلنَّهَارَ سَرۡمَدًا إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِ مَنۡ إِلَٰهٌ غَيۡرُ ٱللَّهِ يَأۡتِيكُم بِلَيۡلٖ تَسۡكُنُونَ فِيهِۚ أَفَلَا تُبۡصِرُونَ","End":"٧٢"},{"Verse":73,"Text":"وَمِن رَّحۡمَتِهِۦ جَعَلَ لَكُمُ ٱلَّيۡلَ وَٱلنَّهَارَ لِتَسۡكُنُواْ فِيهِ وَلِتَبۡتَغُواْ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ","End":"٧٣"},{"Verse":74,"Text":"وَيَوۡمَ يُنَادِيهِمۡ فَيَقُولُ أَيۡنَ شُرَكَآءِيَ ٱلَّذِينَ كُنتُمۡ تَزۡعُمُونَ","End":"٧٤"},{"Verse":75,"Text":"وَنَزَعۡنَا مِن كُلِّ أُمَّةٖ شَهِيدٗا فَقُلۡنَا هَاتُواْ بُرۡهَٰنَكُمۡ فَعَلِمُوٓاْ أَنَّ ٱلۡحَقَّ لِلَّهِ وَضَلَّ عَنۡهُم مَّا كَانُواْ يَفۡتَرُونَ","End":"٧٥"},{"Verse":76,"Text":"۞إِنَّ قَٰرُونَ كَانَ مِن قَوۡمِ مُوسَىٰ فَبَغَىٰ عَلَيۡهِمۡۖ وَءَاتَيۡنَٰهُ مِنَ ٱلۡكُنُوزِ مَآ إِنَّ مَفَاتِحَهُۥ لَتَنُوٓأُ بِٱلۡعُصۡبَةِ أُوْلِي ٱلۡقُوَّةِ إِذۡ قَالَ لَهُۥ قَوۡمُهُۥ لَا تَفۡرَحۡۖ إِنَّ ٱللَّهَ لَا يُحِبُّ ٱلۡفَرِحِينَ","End":"٧٦"},{"Verse":77,"Text":"وَٱبۡتَغِ فِيمَآ ءَاتَىٰكَ ٱللَّهُ ٱلدَّارَ ٱلۡأٓخِرَةَۖ وَلَا تَنسَ نَصِيبَكَ مِنَ ٱلدُّنۡيَاۖ وَأَحۡسِن كَمَآ أَحۡسَنَ ٱللَّهُ إِلَيۡكَۖ وَلَا تَبۡغِ ٱلۡفَسَادَ فِي ٱلۡأَرۡضِۖ إِنَّ ٱللَّهَ لَا يُحِبُّ ٱلۡمُفۡسِدِينَ","End":"٧٧"},{"Verse":78,"Text":"قَالَ إِنَّمَآ أُوتِيتُهُۥ عَلَىٰ عِلۡمٍ عِندِيٓۚ أَوَلَمۡ يَعۡلَمۡ أَنَّ ٱللَّهَ قَدۡ أَهۡلَكَ مِن قَبۡلِهِۦ مِنَ ٱلۡقُرُونِ مَنۡ هُوَ أَشَدُّ مِنۡهُ قُوَّةٗ وَأَكۡثَرُ جَمۡعٗاۚ وَلَا يُسۡـَٔلُ عَن ذُنُوبِهِمُ ٱلۡمُجۡرِمُونَ","End":"٧٨"},{"Verse":79,"Text":"فَخَرَجَ عَلَىٰ قَوۡمِهِۦ فِي زِينَتِهِۦۖ قَالَ ٱلَّذِينَ يُرِيدُونَ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا يَٰلَيۡتَ لَنَا مِثۡلَ مَآ أُوتِيَ قَٰرُونُ إِنَّهُۥ لَذُو حَظٍّ عَظِيمٖ","End":"٧٩"},{"Verse":80,"Text":"وَقَالَ ٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ وَيۡلَكُمۡ ثَوَابُ ٱللَّهِ خَيۡرٞ لِّمَنۡ ءَامَنَ وَعَمِلَ صَٰلِحٗاۚ وَلَا يُلَقَّىٰهَآ إِلَّا ٱلصَّـٰبِرُونَ","End":"٨٠"},{"Verse":81,"Text":"فَخَسَفۡنَا بِهِۦ وَبِدَارِهِ ٱلۡأَرۡضَ فَمَا كَانَ لَهُۥ مِن فِئَةٖ يَنصُرُونَهُۥ مِن دُونِ ٱللَّهِ وَمَا كَانَ مِنَ ٱلۡمُنتَصِرِينَ","End":"٨١"},{"Verse":82,"Text":"وَأَصۡبَحَ ٱلَّذِينَ تَمَنَّوۡاْ مَكَانَهُۥ بِٱلۡأَمۡسِ يَقُولُونَ وَيۡكَأَنَّ ٱللَّهَ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ مِنۡ عِبَادِهِۦ وَيَقۡدِرُۖ لَوۡلَآ أَن مَّنَّ ٱللَّهُ عَلَيۡنَا لَخَسَفَ بِنَاۖ وَيۡكَأَنَّهُۥ لَا يُفۡلِحُ ٱلۡكَٰفِرُونَ","End":"٨٢"},{"Verse":83,"Text":"تِلۡكَ ٱلدَّارُ ٱلۡأٓخِرَةُ نَجۡعَلُهَا لِلَّذِينَ لَا يُرِيدُونَ عُلُوّٗا فِي ٱلۡأَرۡضِ وَلَا فَسَادٗاۚ وَٱلۡعَٰقِبَةُ لِلۡمُتَّقِينَ","End":"٨٣"},{"Verse":84,"Text":"مَن جَآءَ بِٱلۡحَسَنَةِ فَلَهُۥ خَيۡرٞ مِّنۡهَاۖ وَمَن جَآءَ بِٱلسَّيِّئَةِ فَلَا يُجۡزَى ٱلَّذِينَ عَمِلُواْ ٱلسَّيِّـَٔاتِ إِلَّا مَا كَانُواْ يَعۡمَلُونَ","End":"٨٤"},{"Verse":85,"Text":"إِنَّ ٱلَّذِي فَرَضَ عَلَيۡكَ ٱلۡقُرۡءَانَ لَرَآدُّكَ إِلَىٰ مَعَادٖۚ قُل رَّبِّيٓ أَعۡلَمُ مَن جَآءَ بِٱلۡهُدَىٰ وَمَنۡ هُوَ فِي ضَلَٰلٖ مُّبِينٖ","End":"٨٥"},{"Verse":86,"Text":"وَمَا كُنتَ تَرۡجُوٓاْ أَن يُلۡقَىٰٓ إِلَيۡكَ ٱلۡكِتَٰبُ إِلَّا رَحۡمَةٗ مِّن رَّبِّكَۖ فَلَا تَكُونَنَّ ظَهِيرٗا لِّلۡكَٰفِرِينَ","End":"٨٦"},{"Verse":87,"Text":"وَلَا يَصُدُّنَّكَ عَنۡ ءَايَٰتِ ٱللَّهِ بَعۡدَ إِذۡ أُنزِلَتۡ إِلَيۡكَۖ وَٱدۡعُ إِلَىٰ رَبِّكَۖ وَلَا تَكُونَنَّ مِنَ ٱلۡمُشۡرِكِينَ","End":"٨٧"},{"Verse":88,"Text":"وَلَا تَدۡعُ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَۘ لَآ إِلَٰهَ إِلَّا هُوَۚ كُلُّ شَيۡءٍ هَالِكٌ إِلَّا وَجۡهَهُۥۚ لَهُ ٱلۡحُكۡمُ وَإِلَيۡهِ تُرۡجَعُونَ","End":"٨٨"}],"Translations":[{"LanguageCode":"eng","Language":"English","Name":"eng-mustafakhattabg","Author":"Mustafa Khattab God Edition","Source":"","Direction":"ltr","Translations":[{"Verse":1,"Text":"Ṭâ-Sĩn-Mĩm"},{"Verse":2,"Text":"These are the verses of the clear Book"},{"Verse":3,"Text":"We narrate to you ˹O Prophet˺ part of the story of Moses and Pharaoh in truth for people who believe"},{"Verse":4,"Text":"Indeed, Pharaoh ˹arrogantly˺ elevated himself in the land and divided its people into ˹subservient˺ groups, one of which he persecuted, slaughtering their sons and keeping their women. He was truly one of the corruptors"},{"Verse":5,"Text":"But it was Our Will to favour those who were oppressed in the land, making them models ˹of faith˺ as well as successors"},{"Verse":6,"Text":"and to establish them in the land; and through them show Pharaoh, Hamân, and their soldiers ˹the fulfilment of˺ what they feared"},{"Verse":7,"Text":"We inspired the mother of Moses: “Nurse him, but when you fear for him, put him then into the river, and do not fear or grieve. We will certainly return him to you, and make him one of the messengers.”"},{"Verse":8,"Text":"And ˹it so happened that˺ Pharaoh’s people picked him up, only to become their enemy and source of grief. Surely Pharaoh, Hamân, and their soldiers were sinful"},{"Verse":9,"Text":"Pharaoh’s wife said ˹to him˺, “˹This baby is˺ a source of joy for me and you. Do not kill him. Perhaps he may be useful to us or we may adopt him as a son.” They were unaware ˹of what was to come˺"},{"Verse":10,"Text":"And the heart of Moses’ mother ached so much that she almost gave away his identity, had We not reassured her heart in order for her to have faith ˹in God’s promise˺"},{"Verse":11,"Text":"And she said to his sister, “Keep track of him!” So she watched him from a distance, while they were unaware"},{"Verse":12,"Text":"And We had caused him to refuse all wet-nurses at first, so his sister suggested, “Shall I direct you to a family who will bring him up for you and take good care of him?”"},{"Verse":13,"Text":"This is how We returned him to his mother so that her heart would be put at ease, and not grieve, and that she would know that God’s promise is ˹always˺ true. But most people do not know"},{"Verse":14,"Text":"And when he reached full strength and maturity, We gave him wisdom and knowledge. This is how We reward the good-doers"},{"Verse":15,"Text":"˹One day˺ he entered the city unnoticed by its people. There he found two men fighting: one of his own people, and the other of his enemies. The man from his people called to him for help against his foe. So Moses punched him, causing his death. Moses cried, “This is from Satan’s handiwork. He is certainly a sworn, misleading enemy.”"},{"Verse":16,"Text":"He pleaded, “My Lord! I have definitely wronged my soul, so forgive me.” So He forgave him, ˹for˺ He is indeed the All-Forgiving, Most Merciful"},{"Verse":17,"Text":"Moses pledged, “My Lord! For all Your favours upon me, I will never side with the wicked.”"},{"Verse":18,"Text":"And so Moses became fearful, watching out in the city, when suddenly the one who sought his help the day before cried out to him again for help. Moses rebuked him, “Indeed, you are clearly a trouble-maker.”"},{"Verse":19,"Text":"Then when Moses was about to lay his hands on their foe, the enemy said, “O Moses! Do you intend to kill me as you killed a man yesterday? You only want to be a tyrant in the land. You do not intend to make peace!”"},{"Verse":20,"Text":"And there came a man, rushing from the farthest end of the city. He said, “O Moses! The chiefs are actually conspiring against you to put you to death, so leave ˹the city˺. I really advise you ˹to do so˺.”"},{"Verse":21,"Text":"So Moses left the city in a state of fear and caution, praying, “My Lord! Deliver me from the wrongdoing people.”"},{"Verse":22,"Text":"And as he made his way towards Midian, he said, “I trust my Lord will guide me to the right way.”"},{"Verse":23,"Text":"When he arrived at the well of Midian, he found a group of people watering ˹their herds˺. Apart from them, he noticed two women holding back ˹their herd˺. He asked ˹them˺, “What is the problem?” They replied, “We cannot water ˹our animals˺ until the ˹other˺ shepherds are done, for our father is a very old man.”"},{"Verse":24,"Text":"So he watered ˹their herd˺ for them, then withdrew to the shade and prayed, “My Lord! I am truly in ˹desperate˺ need of whatever provision You may have in store for me.”"},{"Verse":25,"Text":"Then one of the two women came to him, walking bashfully. She said, “My father is inviting you so he may reward you for watering ˹our animals˺ for us.” When Moses came to him and told him his whole story, the old man said, “Have no fear! You are ˹now˺ safe from the wrongdoing people.”"},{"Verse":26,"Text":"One of the two daughters suggested, “O my dear father! Hire him. The best man for employment is definitely the strong and trustworthy ˹one˺.”"},{"Verse":27,"Text":"The old man proposed, “I wish to marry one of these two daughters of mine to you, provided that you stay in my service for eight years. If you complete ten, it will be ˹a favour˺ from you, but I do not wish to make it difficult for you. God willing, you will find me an agreeable man.”"},{"Verse":28,"Text":"Moses responded, “˹Then˺ it is ˹settled˺ between you and I. Whichever term I fulfill, there will be no ˹further˺ obligation on me. And God is a Witness to what we say.”"},{"Verse":29,"Text":"When Moses had completed the term and was travelling with his family, he spotted a fire on the side of Mount Ṭûr. He said to his family, “Stay here, ˹for˺ I have spotted a fire. Perhaps from there I can bring you some directions or a torch from the fire so you may warm yourselves.”"},{"Verse":30,"Text":"But when he came to it, he was called from the bush in the sacred ground to the right side of the valley: “O Moses! It is truly I. I am God—the Lord of all worlds"},{"Verse":31,"Text":"Now, throw down your staff!” But when he saw it slithering like a snake, he ran away without looking back. ˹God reassured him,˺ “O Moses! Draw near, and have no fear. You are perfectly secure"},{"Verse":32,"Text":"Now put your hand through ˹the opening of˺ your collar, it will come out ˹shining˺ white, unblemished. And cross your arms tightly to calm your fears. These are two proofs from your Lord to Pharaoh and his chiefs. They have truly been a rebellious people.”"},{"Verse":33,"Text":"Moses appealed, “My Lord! I have indeed killed a man from them, so I fear they may kill me"},{"Verse":34,"Text":"And my brother Aaron is more eloquent than I, so send him with me as a helper to support what I say, for I truly fear they may reject me.”"},{"Verse":35,"Text":"God responded, “We will assist you with your brother and grant you both authority, so they cannot harm you. With Our signs, you and those who follow you will ˹certainly˺ prevail.”"},{"Verse":36,"Text":"But when Moses came to them with Our clear signs, they said ˹arrogantly˺, “This is nothing but conjured magic ˹tricks˺. We have never heard of this in ˹the history of˺ our forefathers.”"},{"Verse":37,"Text":"Moses responded, “My Lord knows best who has come with ˹true˺ guidance from Him and will fare best in the end. Indeed, the wrongdoers will never succeed.”"},{"Verse":38,"Text":"Pharaoh declared, “O chiefs! I know of no other god for you but myself. So bake bricks out of clay for me, O Hamân, and build a high tower so I may look at the God of Moses, although I am sure he is a liar.”"},{"Verse":39,"Text":"And so he and his soldiers behaved arrogantly in the land with no right, thinking they would never be returned to Us"},{"Verse":40,"Text":"So We seized him and his soldiers, casting them into the sea. See then what was the end of the wrongdoers"},{"Verse":41,"Text":"We made them leaders inviting ˹others˺ to the Fire. And on the Day of Judgment they will not be helped"},{"Verse":42,"Text":"We caused a curse to follow them in this world. And on the Day of Judgment they will be among the outcasts"},{"Verse":43,"Text":"Indeed, We gave Moses the Scripture—after destroying earlier nations—as an insight for the people, a guide, and mercy so perhaps they would be mindful"},{"Verse":44,"Text":"You were not there ˹O Prophet˺ on the western side of the mountain when We entrusted the Commandments to Moses, nor were you present ˹in his time˺"},{"Verse":45,"Text":"But We ˹later˺ raised ˹several˺ generations, and the ages took their toll on them. Nor were you living among the people of Midian, rehearsing Our revelations with them. But it is We Who have sent ˹this revelation to you˺"},{"Verse":46,"Text":"And you were not at the side of Mount Ṭûr when We called out ˹to Moses˺. But ˹you have been sent˺ as a mercy from your Lord to warn a people to whom no warner has come before you, so perhaps they may be mindful"},{"Verse":47,"Text":"Also so they would not say, if struck by an affliction for what their hands have done: “Our Lord! If only You had sent us a messenger, we would have followed Your revelations and become believers.”"},{"Verse":48,"Text":"But when the truth came to them from Us, they said, “If only he was given the like of what Moses had been given.” Did they not deny what had been given to Moses earlier? They claimed, “Both ˹Scriptures˺ are works of magic, supporting each other!” Adding, “We truly deny both.”"},{"Verse":49,"Text":"Say, ˹O Prophet,˺ “Bring then a scripture from God which is a better guide than these two so I may follow it, if your claim is true.”"},{"Verse":50,"Text":"So if they fail to respond to you, then know that they only follow their desires. And who could be more astray than those who follow their desires with no guidance from God? Surely God does not guide the wrongdoing people"},{"Verse":51,"Text":"Indeed, We have steadily delivered the Word ˹of God˺ to the people so they may be mindful"},{"Verse":52,"Text":"˹As for˺ those ˹faithful˺ to whom We had given the Scripture before this ˹Quran˺, they do believe in it"},{"Verse":53,"Text":"When it is recited to them, they declare, “We believe in it. This is definitely the truth from our Lord. We had already submitted ˹even˺ before this.”"},{"Verse":54,"Text":"These ˹believers˺ will be given a double reward for their perseverance, responding to evil with good, and for donating from what We have provided for them"},{"Verse":55,"Text":"When they hear slanderous talk, they turn away from it, saying, “We are accountable for our deeds and you for yours. Peace ˹is our only response˺ to you! We want nothing to do with those who act ignorantly.”"},{"Verse":56,"Text":"You surely cannot guide whoever you like ˹O Prophet˺, but it is God Who guides whoever He wills, and He knows best who are ˹fit to be˺ guided"},{"Verse":57,"Text":"They say ˹to the Prophet˺, “If we were to follow ˹true˺ guidance with you, we would certainly be snatched away from our land.” Have We not established for them a safe haven ˹in Mecca˺ to which fruits of all kinds are brought as a provision from Us? But most of them do not know ˹this favour˺"},{"Verse":58,"Text":"˹Imagine˺ how many societies We have destroyed that had been spoiled by their ˹comfortable˺ living! Those are their residences, never inhabited after them except passingly. And We ˹alone˺ were the Successor"},{"Verse":59,"Text":"Your Lord would never destroy a society until He had sent to its capital a messenger, reciting Our revelations to them. Nor would We ever destroy a society unless its people persisted in wrongdoing"},{"Verse":60,"Text":"Whatever ˹pleasure˺ you have been given is no more than ˹a fleeting˺ enjoyment and adornment of this worldly life. But what is with God is far better and more lasting. Will you not then understand"},{"Verse":61,"Text":"Can those to whom We have made a fine promise—which they will see fulfilled—be like those who We have allowed to enjoy the pleasures of this worldly life, but on the Day of Judgment will be brought ˹for punishment˺"},{"Verse":62,"Text":"˹Watch for˺ the Day He will call to them, “Where are those you claimed were My associate-gods?”"},{"Verse":63,"Text":"Those ˹misleaders˺ against whom the decree ˹of torment˺ is justified will cry, “Our Lord! These ˹followers˺ are the ones we caused to deviate. We led them into deviance, for we ourselves were deviant. We disassociate ourselves ˹from them˺ before You. It was not us that they used to worship.”"},{"Verse":64,"Text":"It will be said ˹to the disbelievers˺, “Call upon your associate-gods ˹for help˺.” So they will call them, but will receive no response. And they will face the punishment, wishing they had been ˹rightly˺ guided"},{"Verse":65,"Text":"And ˹watch for˺ the Day He will call to them, asking, “What response did you give to the messengers?”"},{"Verse":66,"Text":"They will be too dumbstruck on that Day to ask one another ˹for answers˺"},{"Verse":67,"Text":"As for those who repent, believe, and do good ˹in this world˺, it is right to hope that they will be among the successful"},{"Verse":68,"Text":"Your Lord creates and chooses whatever He wills—the choice is not theirs. Glorified and Exalted is God above what they associate ˹with Him˺"},{"Verse":69,"Text":"And your Lord knows what their hearts conceal and what they reveal"},{"Verse":70,"Text":"He is God. There is no god ˹worthy of worship˺ except Him. All praise belongs to Him in this life and the next. All authority is His. And to Him you will ˹all˺ be returned"},{"Verse":71,"Text":"Ask ˹them, O Prophet˺, “Imagine if God were to make the night perpetual for you until the Day of Judgment, which god other than God could bring you sunlight? Will you not then listen?”"},{"Verse":72,"Text":"Ask ˹them also˺, “Imagine if God were to make the day perpetual for you until the Day of Judgment, which god other than God could bring you night to rest in? Will you not then see?”"},{"Verse":73,"Text":"It is out of His mercy that He has made for you the day and night so that you may rest ˹in the latter˺ and seek His bounty ˹in the former˺, and perhaps you will be grateful"},{"Verse":74,"Text":"And ˹watch for˺ the Day He will call to them, “Where are those you claimed were My associate-gods?”"},{"Verse":75,"Text":"And We will bring forth a witness from every faith-community and ask ˹the polytheists˺, “Show ˹Us˺ your proof.” Then they will ˹come to˺ know that the truth is with God ˹alone˺. And whatever ˹gods˺ they fabricated will fail them"},{"Verse":76,"Text":"Indeed, Korah was from the people of Moses, but he behaved arrogantly towards them. We had granted him such treasures that even their keys would burden a group of strong men. ˹Some of˺ his people advised him, “Do not be prideful! Surely God does not like the prideful"},{"Verse":77,"Text":"Rather, seek the ˹reward˺ of the Hereafter by means of what God has granted you, without forgetting your share of this world. And be good ˹to others˺ as God has been good to you. Do not seek to spread corruption in the land, for God certainly does not like the corruptors.”"},{"Verse":78,"Text":"He replied, “I have been granted all this because of some knowledge I have.” Did he not know that God had already destroyed some from the generations before him who were far superior to him in power and greater in accumulating ˹wealth˺? There will be no need for the wicked to be asked about their sins"},{"Verse":79,"Text":"Then he came out before his people in all his glamour. Those who desired the life of this world wished, “If only we could have something like what Korah has been given. He is truly a man of great fortune!”"},{"Verse":80,"Text":"But those gifted with knowledge said, “Shame on you! God’s reward is far better for those who believe and do good. But none will attain this except the steadfast.”"},{"Verse":81,"Text":"Then We caused the earth to swallow him up, along with his home. There was no one to help him against God, nor could he even help himself"},{"Verse":82,"Text":"And those who had craved his position the previous day began to say, “Ah! It is certainly God Who gives abundant or limited provisions to whoever He wills of His servants. Had it not been for the grace of God, He could have surely caused the earth to swallow us up! Oh, indeed! The disbelievers will never succeed.”"},{"Verse":83,"Text":"That ˹eternal˺ Home in the Hereafter We reserve ˹only˺ for those who seek neither tyranny nor corruption on the earth. The ultimate outcome belongs ˹only˺ to the righteous"},{"Verse":84,"Text":"Whoever comes with a good deed will be rewarded with what is better. And whoever comes with an evil deed, then the evildoers will only be rewarded for what they used to do"},{"Verse":85,"Text":"Most certainly, the One Who has ordained the Quran for you will ˹ultimately˺ bring you back home ˹to Mecca˺. Say, “My Lord knows best who has come with ˹true˺ guidance and who is clearly astray.”"},{"Verse":86,"Text":"You never expected this Book to be revealed to you, but ˹it came˺ only ˹as˺ a mercy from your Lord. So never side with the disbelievers ˹in their disbelief˺"},{"Verse":87,"Text":"Do not let them turn you away from the revelations of God after they have been sent down to you. Rather, invite ˹all˺ to ˹the Way of˺ your Lord, and never be one of the polytheists"},{"Verse":88,"Text":"And do not invoke any other god with God. There is no god ˹worthy of worship˺ except Him. Everything is bound to perish except He Himself. All authority belongs to Him. And to Him you will ˹all˺ be returned"}]}]}