{"LanguageCode":"en","Chapter":62,"Index":"062","Name":"Al-Jumu'ah","TranslatedName":"The Congregation","ArabicName":"سُوْرَةُ الْجُمُعَةِ","Revelation":"Madina","RevelationOrder":110,"VerseCount":11,"SajdaCount":0,"JuzStart":28,"JuzEnd":28,"VerseStart":5178,"VerseEnd":5188,"ManzilStart":7,"ManzilEnd":7,"RukuStart":486,"RukuEnd":487,"MaqraStart":221,"MaqraEnd":221,"PageStart":553,"PageEnd":554,"Summaries":["<p>This is a Madani Surah. It seems that the first part of this Surah was revealed in the 7<sup>th</sup> year of Hijrah after the Battle of Khaybar and the second part was revealed soon after the Hijrah in the 1<sup>st</sup> year of Hijrah. The Surah has 11 verses in 2 sections.</p>","<p>The Surah talks about the negligence of Bani Israel in obeying the commands of Allah and becoming too much involved in worldly matters. They only carried the Books of Allah, but failed to follow these books. Muslims are urged to observe the Friday prayer and should not get involved in business so much as to neglect the remembrance of Allah.</p>","<ol>","\t<li>Allah's favor upon Muslims that Allah sent His Prophet among them to teach them and to purify them. Bani Israel neglected the commands of Allah.</li>","\t<li>Muslims are exhorted to observe the Friday prayers and always remember Allah.</li>","</ol>"],"Verses":[{"Verse":1,"Text":"۞ یُسَبِّحُ لِلَّهِ مَا فِی ٱلسَّمَـٰوَ ٰتِ وَمَا فِی ٱلۡأَرۡضِ ٱلۡمَلِكِ ٱلۡقُدُّوسِ ٱلۡعَزِیزِ ٱلۡحَكِیمِ","End":"١"},{"Verse":2,"Text":"هُوَ ٱلَّذِی بَعَثَ فِی ٱلۡأُمِّیِّـۧنَ رَسُولࣰا مِّنۡهُمۡ یَتۡلُوا۟ عَلَیۡهِمۡ ءَایَـٰتِهِۦ وَیُزَكِّیهِمۡ وَیُعَلِّمُهُمُ ٱلۡكِتَـٰبَ وَٱلۡحِكۡمَةَ وَإِن كَانُوا۟ مِن قَبۡلُ لَفِی ضَلَـٰلࣲ مُّبِینࣲ","End":"٢"},{"Verse":3,"Text":"وَءَاخَرِینَ مِنۡهُمۡ لَمَّا یَلۡحَقُوا۟ بِهِمۡۚ وَهُوَ ٱلۡعَزِیزُ ٱلۡحَكِیمُ","End":"٣"},{"Verse":4,"Text":"ذَ ٰلِكَ فَضۡلُ ٱللَّهِ یُؤۡتِیهِ مَن یَشَاۤءُۚ وَٱللَّهُ ذُو ٱلۡفَضۡلِ ٱلۡعَظِیمِ","End":"٤"},{"Verse":5,"Text":"مَثَلُ ٱلَّذِینَ حُمِّلُوا۟ ٱلتَّوۡرَىٰةَ ثُمَّ لَمۡ یَحۡمِلُوهَا كَمَثَلِ ٱلۡحِمَارِ یَحۡمِلُ أَسۡفَارَۢاۚ بِئۡسَ مَثَلُ ٱلۡقَوۡمِ ٱلَّذِینَ كَذَّبُوا۟ بِءَایَـٰتِ ٱللَّهِۚ وَٱللَّهُ لَا یَهۡدِی ٱلۡقَوۡمَ ٱلظَّـٰلِمِینَ","End":"٥"},{"Verse":6,"Text":"قُلۡ یَـٰۤأَیُّهَا ٱلَّذِینَ هَادُوۤا۟ إِن زَعَمۡتُمۡ أَنَّكُمۡ أَوۡلِیَاۤءُ لِلَّهِ مِن دُونِ ٱلنَّاسِ فَتَمَنَّوُا۟ ٱلۡمَوۡتَ إِن كُنتُمۡ صَـٰدِقِینَ","End":"٦"},{"Verse":7,"Text":"وَلَا یَتَمَنَّوۡنَهُۥۤ أَبَدَۢا بِمَا قَدَّمَتۡ أَیۡدِیهِمۡۚ وَٱللَّهُ عَلِیمُۢ بِٱلظَّـٰلِمِینَ","End":"٧"},{"Verse":8,"Text":"قُلۡ إِنَّ ٱلۡمَوۡتَ ٱلَّذِی تَفِرُّونَ مِنۡهُ فَإِنَّهُۥ مُلَـٰقِیكُمۡۖ ثُمَّ تُرَدُّونَ إِلَىٰ عَـٰلِمِ ٱلۡغَیۡبِ وَٱلشَّهَـٰدَةِ فَیُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ","End":"٨"},{"Verse":9,"Text":"یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ إِذَا نُودِیَ لِلصَّلَوٰةِ مِن یَوۡمِ ٱلۡجُمُعَةِ فَٱسۡعَوۡا۟ إِلَىٰ ذِكۡرِ ٱللَّهِ وَذَرُوا۟ ٱلۡبَیۡعَۚ ذَ ٰلِكُمۡ خَیۡرࣱ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ","End":"٩"},{"Verse":10,"Text":"فَإِذَا قُضِیَتِ ٱلصَّلَوٰةُ فَٱنتَشِرُوا۟ فِی ٱلۡأَرۡضِ وَٱبۡتَغُوا۟ مِن فَضۡلِ ٱللَّهِ وَٱذۡكُرُوا۟ ٱللَّهَ كَثِیرࣰا لَّعَلَّكُمۡ تُفۡلِحُونَ","End":"١٠"},{"Verse":11,"Text":"وَإِذَا رَأَوۡا۟ تِجَـٰرَةً أَوۡ لَهۡوًا ٱنفَضُّوۤا۟ إِلَیۡهَا وَتَرَكُوكَ قَاۤئِمࣰاۚ قُلۡ مَا عِندَ ٱللَّهِ خَیۡرࣱ مِّنَ ٱللَّهۡوِ وَمِنَ ٱلتِّجَـٰرَةِۚ وَٱللَّهُ خَیۡرُ ٱلرَّ ٰزِقِینَ","End":"١١"}],"Translations":[]}