{"LanguageCode":"en","SurahData":{"Chapter":8,"Index":"008","Name":"Al-Anfal","TranslatedName":"The Spoils of War","ArabicName":"سُوْرَةُ الْاَنْفَالِ","Revelation":"Madina","RevelationOrder":88,"HasBismillah":true,"VerseCount":75,"SajdaCount":0,"JuzStart":9,"JuzEnd":10,"VerseStart":1161,"VerseEnd":1235,"ManzilStart":2,"ManzilEnd":2,"RukuStart":146,"RukuEnd":155,"MaqraStart":71,"MaqraEnd":74,"PageStart":177,"PageEnd":186},"Summaries":["<p>Surah 88 according to the order of revelation. This is a Madani Surah revealed soon after the Battle of Badr in the 2<sup>nd</sup> year of Hijrah (or 624 CE). This Surah has 75 verses in 10 sections.</p>","<p>The Surah reminds the Believers to obey Allah and His Messenger and keep their relations good with each other. It has given rules of war and peace between Muslims and their enemies. In this Surah, six times Allah has addressed Muslims with \"O you who believe\" (see vss. 15; 20; 24; 28; 29; 46)</p>","<ol>","\t<li>Commandment relating to the spoils of war. Battle of Badr</li>","\t<li>Allah's help for the Believers in the Battle of Badr.</li>","\t<li>Believers must always obey Allah and His Messenger.</li>","\t<li>Only the righteous should be the guardians of the Masjid al-Haram.</li>","\t<li>The purpose of war and the rules about the distribution of the spoils of war.</li>","\t<li>Be firm and united in the combat against the enemy.</li>","\t<li>Victory of the Believers against the unbelievers. Allah does not change His blessings unless people change themselves.</li>","\t<li>Be prepared always to defend yourself and your people. Make peace if the enemy is inclined towards peace.</li>","\t<li>Allah's promise to help the Believers.</li>","\t<li>Treatment of the prisoners of war and obligations towards Muslims living among non-Muslims.</li>","</ol>"],"Verses":[{"Verse":1,"Text":"يَسۡـَٔلُونَكَ عَنِ ٱلۡأَنفَالِۖ قُلِ ٱلۡأَنفَالُ لِلَّهِ وَٱلرَّسُولِۖ فَٱتَّقُواْ ٱللَّهَ وَأَصۡلِحُواْ ذَاتَ بَيۡنِكُمۡۖ وَأَطِيعُواْ ٱللَّهَ وَرَسُولَهُۥٓ إِن كُنتُم مُّؤۡمِنِينَ","End":"١"},{"Verse":2,"Text":"إِنَّمَا ٱلۡمُؤۡمِنُونَ ٱلَّذِينَ إِذَا ذُكِرَ ٱللَّهُ وَجِلَتۡ قُلُوبُهُمۡ وَإِذَا تُلِيَتۡ عَلَيۡهِمۡ ءَايَٰتُهُۥ زَادَتۡهُمۡ إِيمَٰنٗا وَعَلَىٰ رَبِّهِمۡ يَتَوَكَّلُونَ","End":"٢"},{"Verse":3,"Text":"ٱلَّذِينَ يُقِيمُونَ ٱلصَّلَوٰةَ وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ","End":"٣"},{"Verse":4,"Text":"أُوْلَـٰٓئِكَ هُمُ ٱلۡمُؤۡمِنُونَ حَقّٗاۚ لَّهُمۡ دَرَجَٰتٌ عِندَ رَبِّهِمۡ وَمَغۡفِرَةٞ وَرِزۡقٞ كَرِيمٞ","End":"٤"},{"Verse":5,"Text":"كَمَآ أَخۡرَجَكَ رَبُّكَ مِنۢ بَيۡتِكَ بِٱلۡحَقِّ وَإِنَّ فَرِيقٗا مِّنَ ٱلۡمُؤۡمِنِينَ لَكَٰرِهُونَ","End":"٥"},{"Verse":6,"Text":"يُجَٰدِلُونَكَ فِي ٱلۡحَقِّ بَعۡدَ مَا تَبَيَّنَ كَأَنَّمَا يُسَاقُونَ إِلَى ٱلۡمَوۡتِ وَهُمۡ يَنظُرُونَ","End":"٦"},{"Verse":7,"Text":"وَإِذۡ يَعِدُكُمُ ٱللَّهُ إِحۡدَى ٱلطَّآئِفَتَيۡنِ أَنَّهَا لَكُمۡ وَتَوَدُّونَ أَنَّ غَيۡرَ ذَاتِ ٱلشَّوۡكَةِ تَكُونُ لَكُمۡ وَيُرِيدُ ٱللَّهُ أَن يُحِقَّ ٱلۡحَقَّ بِكَلِمَٰتِهِۦ وَيَقۡطَعَ دَابِرَ ٱلۡكَٰفِرِينَ","End":"٧"},{"Verse":8,"Text":"لِيُحِقَّ ٱلۡحَقَّ وَيُبۡطِلَ ٱلۡبَٰطِلَ وَلَوۡ كَرِهَ ٱلۡمُجۡرِمُونَ","End":"٨"},{"Verse":9,"Text":"إِذۡ تَسۡتَغِيثُونَ رَبَّكُمۡ فَٱسۡتَجَابَ لَكُمۡ أَنِّي مُمِدُّكُم بِأَلۡفٖ مِّنَ ٱلۡمَلَـٰٓئِكَةِ مُرۡدِفِينَ","End":"٩"},{"Verse":10,"Text":"وَمَا جَعَلَهُ ٱللَّهُ إِلَّا بُشۡرَىٰ وَلِتَطۡمَئِنَّ بِهِۦ قُلُوبُكُمۡۚ وَمَا ٱلنَّصۡرُ إِلَّا مِنۡ عِندِ ٱللَّهِۚ إِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٌ","End":"١٠"},{"Verse":11,"Text":"إِذۡ يُغَشِّيكُمُ ٱلنُّعَاسَ أَمَنَةٗ مِّنۡهُ وَيُنَزِّلُ عَلَيۡكُم مِّنَ ٱلسَّمَآءِ مَآءٗ لِّيُطَهِّرَكُم بِهِۦ وَيُذۡهِبَ عَنكُمۡ رِجۡزَ ٱلشَّيۡطَٰنِ وَلِيَرۡبِطَ عَلَىٰ قُلُوبِكُمۡ وَيُثَبِّتَ بِهِ ٱلۡأَقۡدَامَ","End":"١١"},{"Verse":12,"Text":"إِذۡ يُوحِي رَبُّكَ إِلَى ٱلۡمَلَـٰٓئِكَةِ أَنِّي مَعَكُمۡ فَثَبِّتُواْ ٱلَّذِينَ ءَامَنُواْۚ سَأُلۡقِي فِي قُلُوبِ ٱلَّذِينَ كَفَرُواْ ٱلرُّعۡبَ فَٱضۡرِبُواْ فَوۡقَ ٱلۡأَعۡنَاقِ وَٱضۡرِبُواْ مِنۡهُمۡ كُلَّ بَنَانٖ","End":"١٢"},{"Verse":13,"Text":"ذَٰلِكَ بِأَنَّهُمۡ شَآقُّواْ ٱللَّهَ وَرَسُولَهُۥۚ وَمَن يُشَاقِقِ ٱللَّهَ وَرَسُولَهُۥ فَإِنَّ ٱللَّهَ شَدِيدُ ٱلۡعِقَابِ","End":"١٣"},{"Verse":14,"Text":"ذَٰلِكُمۡ فَذُوقُوهُ وَأَنَّ لِلۡكَٰفِرِينَ عَذَابَ ٱلنَّارِ","End":"١٤"},{"Verse":15,"Text":"يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا لَقِيتُمُ ٱلَّذِينَ كَفَرُواْ زَحۡفٗا فَلَا تُوَلُّوهُمُ ٱلۡأَدۡبَارَ","End":"١٥"},{"Verse":16,"Text":"وَمَن يُوَلِّهِمۡ يَوۡمَئِذٖ دُبُرَهُۥٓ إِلَّا مُتَحَرِّفٗا لِّقِتَالٍ أَوۡ مُتَحَيِّزًا إِلَىٰ فِئَةٖ فَقَدۡ بَآءَ بِغَضَبٖ مِّنَ ٱللَّهِ وَمَأۡوَىٰهُ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمَصِيرُ","End":"١٦"},{"Verse":17,"Text":"فَلَمۡ تَقۡتُلُوهُمۡ وَلَٰكِنَّ ٱللَّهَ قَتَلَهُمۡۚ وَمَا رَمَيۡتَ إِذۡ رَمَيۡتَ وَلَٰكِنَّ ٱللَّهَ رَمَىٰ وَلِيُبۡلِيَ ٱلۡمُؤۡمِنِينَ مِنۡهُ بَلَآءً حَسَنًاۚ إِنَّ ٱللَّهَ سَمِيعٌ عَلِيمٞ","End":"١٧"},{"Verse":18,"Text":"ذَٰلِكُمۡ وَأَنَّ ٱللَّهَ مُوهِنُ كَيۡدِ ٱلۡكَٰفِرِينَ","End":"١٨"},{"Verse":19,"Text":"إِن تَسۡتَفۡتِحُواْ فَقَدۡ جَآءَكُمُ ٱلۡفَتۡحُۖ وَإِن تَنتَهُواْ فَهُوَ خَيۡرٞ لَّكُمۡۖ وَإِن تَعُودُواْ نَعُدۡ وَلَن تُغۡنِيَ عَنكُمۡ فِئَتُكُمۡ شَيۡـٔٗا وَلَوۡ كَثُرَتۡ وَأَنَّ ٱللَّهَ مَعَ ٱلۡمُؤۡمِنِينَ","End":"١٩"},{"Verse":20,"Text":"يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ أَطِيعُواْ ٱللَّهَ وَرَسُولَهُۥ وَلَا تَوَلَّوۡاْ عَنۡهُ وَأَنتُمۡ تَسۡمَعُونَ","End":"٢٠"},{"Verse":21,"Text":"وَلَا تَكُونُواْ كَٱلَّذِينَ قَالُواْ سَمِعۡنَا وَهُمۡ لَا يَسۡمَعُونَ","End":"٢١"},{"Verse":22,"Text":"۞إِنَّ شَرَّ ٱلدَّوَآبِّ عِندَ ٱللَّهِ ٱلصُّمُّ ٱلۡبُكۡمُ ٱلَّذِينَ لَا يَعۡقِلُونَ","End":"٢٢"},{"Verse":23,"Text":"وَلَوۡ عَلِمَ ٱللَّهُ فِيهِمۡ خَيۡرٗا لَّأَسۡمَعَهُمۡۖ وَلَوۡ أَسۡمَعَهُمۡ لَتَوَلَّواْ وَّهُم مُّعۡرِضُونَ","End":"٢٣"},{"Verse":24,"Text":"يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱسۡتَجِيبُواْ لِلَّهِ وَلِلرَّسُولِ إِذَا دَعَاكُمۡ لِمَا يُحۡيِيكُمۡۖ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ يَحُولُ بَيۡنَ ٱلۡمَرۡءِ وَقَلۡبِهِۦ وَأَنَّهُۥٓ إِلَيۡهِ تُحۡشَرُونَ","End":"٢٤"},{"Verse":25,"Text":"وَٱتَّقُواْ فِتۡنَةٗ لَّا تُصِيبَنَّ ٱلَّذِينَ ظَلَمُواْ مِنكُمۡ خَآصَّةٗۖ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ شَدِيدُ ٱلۡعِقَابِ","End":"٢٥"},{"Verse":26,"Text":"وَٱذۡكُرُوٓاْ إِذۡ أَنتُمۡ قَلِيلٞ مُّسۡتَضۡعَفُونَ فِي ٱلۡأَرۡضِ تَخَافُونَ أَن يَتَخَطَّفَكُمُ ٱلنَّاسُ فَـَٔاوَىٰكُمۡ وَأَيَّدَكُم بِنَصۡرِهِۦ وَرَزَقَكُم مِّنَ ٱلطَّيِّبَٰتِ لَعَلَّكُمۡ تَشۡكُرُونَ","End":"٢٦"},{"Verse":27,"Text":"يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَخُونُواْ ٱللَّهَ وَٱلرَّسُولَ وَتَخُونُوٓاْ أَمَٰنَٰتِكُمۡ وَأَنتُمۡ تَعۡلَمُونَ","End":"٢٧"},{"Verse":28,"Text":"وَٱعۡلَمُوٓاْ أَنَّمَآ أَمۡوَٰلُكُمۡ وَأَوۡلَٰدُكُمۡ فِتۡنَةٞ وَأَنَّ ٱللَّهَ عِندَهُۥٓ أَجۡرٌ عَظِيمٞ","End":"٢٨"},{"Verse":29,"Text":"يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِن تَتَّقُواْ ٱللَّهَ يَجۡعَل لَّكُمۡ فُرۡقَانٗا وَيُكَفِّرۡ عَنكُمۡ سَيِّـَٔاتِكُمۡ وَيَغۡفِرۡ لَكُمۡۗ وَٱللَّهُ ذُو ٱلۡفَضۡلِ ٱلۡعَظِيمِ","End":"٢٩"},{"Verse":30,"Text":"وَإِذۡ يَمۡكُرُ بِكَ ٱلَّذِينَ كَفَرُواْ لِيُثۡبِتُوكَ أَوۡ يَقۡتُلُوكَ أَوۡ يُخۡرِجُوكَۚ وَيَمۡكُرُونَ وَيَمۡكُرُ ٱللَّهُۖ وَٱللَّهُ خَيۡرُ ٱلۡمَٰكِرِينَ","End":"٣٠"},{"Verse":31,"Text":"وَإِذَا تُتۡلَىٰ عَلَيۡهِمۡ ءَايَٰتُنَا قَالُواْ قَدۡ سَمِعۡنَا لَوۡ نَشَآءُ لَقُلۡنَا مِثۡلَ هَٰذَآ إِنۡ هَٰذَآ إِلَّآ أَسَٰطِيرُ ٱلۡأَوَّلِينَ","End":"٣١"},{"Verse":32,"Text":"وَإِذۡ قَالُواْ ٱللَّهُمَّ إِن كَانَ هَٰذَا هُوَ ٱلۡحَقَّ مِنۡ عِندِكَ فَأَمۡطِرۡ عَلَيۡنَا حِجَارَةٗ مِّنَ ٱلسَّمَآءِ أَوِ ٱئۡتِنَا بِعَذَابٍ أَلِيمٖ","End":"٣٢"},{"Verse":33,"Text":"وَمَا كَانَ ٱللَّهُ لِيُعَذِّبَهُمۡ وَأَنتَ فِيهِمۡۚ وَمَا كَانَ ٱللَّهُ مُعَذِّبَهُمۡ وَهُمۡ يَسۡتَغۡفِرُونَ","End":"٣٣"},{"Verse":34,"Text":"وَمَا لَهُمۡ أَلَّا يُعَذِّبَهُمُ ٱللَّهُ وَهُمۡ يَصُدُّونَ عَنِ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ وَمَا كَانُوٓاْ أَوۡلِيَآءَهُۥٓۚ إِنۡ أَوۡلِيَآؤُهُۥٓ إِلَّا ٱلۡمُتَّقُونَ وَلَٰكِنَّ أَكۡثَرَهُمۡ لَا يَعۡلَمُونَ","End":"٣٤"},{"Verse":35,"Text":"وَمَا كَانَ صَلَاتُهُمۡ عِندَ ٱلۡبَيۡتِ إِلَّا مُكَآءٗ وَتَصۡدِيَةٗۚ فَذُوقُواْ ٱلۡعَذَابَ بِمَا كُنتُمۡ تَكۡفُرُونَ","End":"٣٥"},{"Verse":36,"Text":"إِنَّ ٱلَّذِينَ كَفَرُواْ يُنفِقُونَ أَمۡوَٰلَهُمۡ لِيَصُدُّواْ عَن سَبِيلِ ٱللَّهِۚ فَسَيُنفِقُونَهَا ثُمَّ تَكُونُ عَلَيۡهِمۡ حَسۡرَةٗ ثُمَّ يُغۡلَبُونَۗ وَٱلَّذِينَ كَفَرُوٓاْ إِلَىٰ جَهَنَّمَ يُحۡشَرُونَ","End":"٣٦"},{"Verse":37,"Text":"لِيَمِيزَ ٱللَّهُ ٱلۡخَبِيثَ مِنَ ٱلطَّيِّبِ وَيَجۡعَلَ ٱلۡخَبِيثَ بَعۡضَهُۥ عَلَىٰ بَعۡضٖ فَيَرۡكُمَهُۥ جَمِيعٗا فَيَجۡعَلَهُۥ فِي جَهَنَّمَۚ أُوْلَـٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ","End":"٣٧"},{"Verse":38,"Text":"قُل لِّلَّذِينَ كَفَرُوٓاْ إِن يَنتَهُواْ يُغۡفَرۡ لَهُم مَّا قَدۡ سَلَفَ وَإِن يَعُودُواْ فَقَدۡ مَضَتۡ سُنَّتُ ٱلۡأَوَّلِينَ","End":"٣٨"},{"Verse":39,"Text":"وَقَٰتِلُوهُمۡ حَتَّىٰ لَا تَكُونَ فِتۡنَةٞ وَيَكُونَ ٱلدِّينُ كُلُّهُۥ لِلَّهِۚ فَإِنِ ٱنتَهَوۡاْ فَإِنَّ ٱللَّهَ بِمَا يَعۡمَلُونَ بَصِيرٞ","End":"٣٩"},{"Verse":40,"Text":"وَإِن تَوَلَّوۡاْ فَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ مَوۡلَىٰكُمۡۚ نِعۡمَ ٱلۡمَوۡلَىٰ وَنِعۡمَ ٱلنَّصِيرُ","End":"٤٠"},{"Verse":41,"Text":"۞وَٱعۡلَمُوٓاْ أَنَّمَا غَنِمۡتُم مِّن شَيۡءٖ فَأَنَّ لِلَّهِ خُمُسَهُۥ وَلِلرَّسُولِ وَلِذِي ٱلۡقُرۡبَىٰ وَٱلۡيَتَٰمَىٰ وَٱلۡمَسَٰكِينِ وَٱبۡنِ ٱلسَّبِيلِ إِن كُنتُمۡ ءَامَنتُم بِٱللَّهِ وَمَآ أَنزَلۡنَا عَلَىٰ عَبۡدِنَا يَوۡمَ ٱلۡفُرۡقَانِ يَوۡمَ ٱلۡتَقَى ٱلۡجَمۡعَانِۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ","End":"٤١"},{"Verse":42,"Text":"إِذۡ أَنتُم بِٱلۡعُدۡوَةِ ٱلدُّنۡيَا وَهُم بِٱلۡعُدۡوَةِ ٱلۡقُصۡوَىٰ وَٱلرَّكۡبُ أَسۡفَلَ مِنكُمۡۚ وَلَوۡ تَوَاعَدتُّمۡ لَٱخۡتَلَفۡتُمۡ فِي ٱلۡمِيعَٰدِ وَلَٰكِن لِّيَقۡضِيَ ٱللَّهُ أَمۡرٗا كَانَ مَفۡعُولٗا لِّيَهۡلِكَ مَنۡ هَلَكَ عَنۢ بَيِّنَةٖ وَيَحۡيَىٰ مَنۡ حَيَّ عَنۢ بَيِّنَةٖۗ وَإِنَّ ٱللَّهَ لَسَمِيعٌ عَلِيمٌ","End":"٤٢"},{"Verse":43,"Text":"إِذۡ يُرِيكَهُمُ ٱللَّهُ فِي مَنَامِكَ قَلِيلٗاۖ وَلَوۡ أَرَىٰكَهُمۡ كَثِيرٗا لَّفَشِلۡتُمۡ وَلَتَنَٰزَعۡتُمۡ فِي ٱلۡأَمۡرِ وَلَٰكِنَّ ٱللَّهَ سَلَّمَۚ إِنَّهُۥ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ","End":"٤٣"},{"Verse":44,"Text":"وَإِذۡ يُرِيكُمُوهُمۡ إِذِ ٱلۡتَقَيۡتُمۡ فِيٓ أَعۡيُنِكُمۡ قَلِيلٗا وَيُقَلِّلُكُمۡ فِيٓ أَعۡيُنِهِمۡ لِيَقۡضِيَ ٱللَّهُ أَمۡرٗا كَانَ مَفۡعُولٗاۗ وَإِلَى ٱللَّهِ تُرۡجَعُ ٱلۡأُمُورُ","End":"٤٤"},{"Verse":45,"Text":"يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا لَقِيتُمۡ فِئَةٗ فَٱثۡبُتُواْ وَٱذۡكُرُواْ ٱللَّهَ كَثِيرٗا لَّعَلَّكُمۡ تُفۡلِحُونَ","End":"٤٥"},{"Verse":46,"Text":"وَأَطِيعُواْ ٱللَّهَ وَرَسُولَهُۥ وَلَا تَنَٰزَعُواْ فَتَفۡشَلُواْ وَتَذۡهَبَ رِيحُكُمۡۖ وَٱصۡبِرُوٓاْۚ إِنَّ ٱللَّهَ مَعَ ٱلصَّـٰبِرِينَ","End":"٤٦"},{"Verse":47,"Text":"وَلَا تَكُونُواْ كَٱلَّذِينَ خَرَجُواْ مِن دِيَٰرِهِم بَطَرٗا وَرِئَآءَ ٱلنَّاسِ وَيَصُدُّونَ عَن سَبِيلِ ٱللَّهِۚ وَٱللَّهُ بِمَا يَعۡمَلُونَ مُحِيطٞ","End":"٤٧"},{"Verse":48,"Text":"وَإِذۡ زَيَّنَ لَهُمُ ٱلشَّيۡطَٰنُ أَعۡمَٰلَهُمۡ وَقَالَ لَا غَالِبَ لَكُمُ ٱلۡيَوۡمَ مِنَ ٱلنَّاسِ وَإِنِّي جَارٞ لَّكُمۡۖ فَلَمَّا تَرَآءَتِ ٱلۡفِئَتَانِ نَكَصَ عَلَىٰ عَقِبَيۡهِ وَقَالَ إِنِّي بَرِيٓءٞ مِّنكُمۡ إِنِّيٓ أَرَىٰ مَا لَا تَرَوۡنَ إِنِّيٓ أَخَافُ ٱللَّهَۚ وَٱللَّهُ شَدِيدُ ٱلۡعِقَابِ","End":"٤٨"},{"Verse":49,"Text":"إِذۡ يَقُولُ ٱلۡمُنَٰفِقُونَ وَٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٌ غَرَّ هَـٰٓؤُلَآءِ دِينُهُمۡۗ وَمَن يَتَوَكَّلۡ عَلَى ٱللَّهِ فَإِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٞ","End":"٤٩"},{"Verse":50,"Text":"وَلَوۡ تَرَىٰٓ إِذۡ يَتَوَفَّى ٱلَّذِينَ كَفَرُواْ ٱلۡمَلَـٰٓئِكَةُ يَضۡرِبُونَ وُجُوهَهُمۡ وَأَدۡبَٰرَهُمۡ وَذُوقُواْ عَذَابَ ٱلۡحَرِيقِ","End":"٥٠"},{"Verse":51,"Text":"ذَٰلِكَ بِمَا قَدَّمَتۡ أَيۡدِيكُمۡ وَأَنَّ ٱللَّهَ لَيۡسَ بِظَلَّـٰمٖ لِّلۡعَبِيدِ","End":"٥١"},{"Verse":52,"Text":"كَدَأۡبِ ءَالِ فِرۡعَوۡنَ وَٱلَّذِينَ مِن قَبۡلِهِمۡۚ كَفَرُواْ بِـَٔايَٰتِ ٱللَّهِ فَأَخَذَهُمُ ٱللَّهُ بِذُنُوبِهِمۡۚ إِنَّ ٱللَّهَ قَوِيّٞ شَدِيدُ ٱلۡعِقَابِ","End":"٥٢"},{"Verse":53,"Text":"ذَٰلِكَ بِأَنَّ ٱللَّهَ لَمۡ يَكُ مُغَيِّرٗا نِّعۡمَةً أَنۡعَمَهَا عَلَىٰ قَوۡمٍ حَتَّىٰ يُغَيِّرُواْ مَا بِأَنفُسِهِمۡ وَأَنَّ ٱللَّهَ سَمِيعٌ عَلِيمٞ","End":"٥٣"},{"Verse":54,"Text":"كَدَأۡبِ ءَالِ فِرۡعَوۡنَ وَٱلَّذِينَ مِن قَبۡلِهِمۡۚ كَذَّبُواْ بِـَٔايَٰتِ رَبِّهِمۡ فَأَهۡلَكۡنَٰهُم بِذُنُوبِهِمۡ وَأَغۡرَقۡنَآ ءَالَ فِرۡعَوۡنَۚ وَكُلّٞ كَانُواْ ظَٰلِمِينَ","End":"٥٤"},{"Verse":55,"Text":"إِنَّ شَرَّ ٱلدَّوَآبِّ عِندَ ٱللَّهِ ٱلَّذِينَ كَفَرُواْ فَهُمۡ لَا يُؤۡمِنُونَ","End":"٥٥"},{"Verse":56,"Text":"ٱلَّذِينَ عَٰهَدتَّ مِنۡهُمۡ ثُمَّ يَنقُضُونَ عَهۡدَهُمۡ فِي كُلِّ مَرَّةٖ وَهُمۡ لَا يَتَّقُونَ","End":"٥٦"},{"Verse":57,"Text":"فَإِمَّا تَثۡقَفَنَّهُمۡ فِي ٱلۡحَرۡبِ فَشَرِّدۡ بِهِم مَّنۡ خَلۡفَهُمۡ لَعَلَّهُمۡ يَذَّكَّرُونَ","End":"٥٧"},{"Verse":58,"Text":"وَإِمَّا تَخَافَنَّ مِن قَوۡمٍ خِيَانَةٗ فَٱنۢبِذۡ إِلَيۡهِمۡ عَلَىٰ سَوَآءٍۚ إِنَّ ٱللَّهَ لَا يُحِبُّ ٱلۡخَآئِنِينَ","End":"٥٨"},{"Verse":59,"Text":"وَلَا يَحۡسَبَنَّ ٱلَّذِينَ كَفَرُواْ سَبَقُوٓاْۚ إِنَّهُمۡ لَا يُعۡجِزُونَ","End":"٥٩"},{"Verse":60,"Text":"وَأَعِدُّواْ لَهُم مَّا ٱسۡتَطَعۡتُم مِّن قُوَّةٖ وَمِن رِّبَاطِ ٱلۡخَيۡلِ تُرۡهِبُونَ بِهِۦ عَدُوَّ ٱللَّهِ وَعَدُوَّكُمۡ وَءَاخَرِينَ مِن دُونِهِمۡ لَا تَعۡلَمُونَهُمُ ٱللَّهُ يَعۡلَمُهُمۡۚ وَمَا تُنفِقُواْ مِن شَيۡءٖ فِي سَبِيلِ ٱللَّهِ يُوَفَّ إِلَيۡكُمۡ وَأَنتُمۡ لَا تُظۡلَمُونَ","End":"٦٠"},{"Verse":61,"Text":"۞وَإِن جَنَحُواْ لِلسَّلۡمِ فَٱجۡنَحۡ لَهَا وَتَوَكَّلۡ عَلَى ٱللَّهِۚ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ","End":"٦١"},{"Verse":62,"Text":"وَإِن يُرِيدُوٓاْ أَن يَخۡدَعُوكَ فَإِنَّ حَسۡبَكَ ٱللَّهُۚ هُوَ ٱلَّذِيٓ أَيَّدَكَ بِنَصۡرِهِۦ وَبِٱلۡمُؤۡمِنِينَ","End":"٦٢"},{"Verse":63,"Text":"وَأَلَّفَ بَيۡنَ قُلُوبِهِمۡۚ لَوۡ أَنفَقۡتَ مَا فِي ٱلۡأَرۡضِ جَمِيعٗا مَّآ أَلَّفۡتَ بَيۡنَ قُلُوبِهِمۡ وَلَٰكِنَّ ٱللَّهَ أَلَّفَ بَيۡنَهُمۡۚ إِنَّهُۥ عَزِيزٌ حَكِيمٞ","End":"٦٣"},{"Verse":64,"Text":"يَـٰٓأَيُّهَا ٱلنَّبِيُّ حَسۡبُكَ ٱللَّهُ وَمَنِ ٱتَّبَعَكَ مِنَ ٱلۡمُؤۡمِنِينَ","End":"٦٤"},{"Verse":65,"Text":"يَـٰٓأَيُّهَا ٱلنَّبِيُّ حَرِّضِ ٱلۡمُؤۡمِنِينَ عَلَى ٱلۡقِتَالِۚ إِن يَكُن مِّنكُمۡ عِشۡرُونَ صَٰبِرُونَ يَغۡلِبُواْ مِاْئَتَيۡنِۚ وَإِن يَكُن مِّنكُم مِّاْئَةٞ يَغۡلِبُوٓاْ أَلۡفٗا مِّنَ ٱلَّذِينَ كَفَرُواْ بِأَنَّهُمۡ قَوۡمٞ لَّا يَفۡقَهُونَ","End":"٦٥"},{"Verse":66,"Text":"ٱلۡـَٰٔنَ خَفَّفَ ٱللَّهُ عَنكُمۡ وَعَلِمَ أَنَّ فِيكُمۡ ضَعۡفٗاۚ فَإِن يَكُن مِّنكُم مِّاْئَةٞ صَابِرَةٞ يَغۡلِبُواْ مِاْئَتَيۡنِۚ وَإِن يَكُن مِّنكُمۡ أَلۡفٞ يَغۡلِبُوٓاْ أَلۡفَيۡنِ بِإِذۡنِ ٱللَّهِۗ وَٱللَّهُ مَعَ ٱلصَّـٰبِرِينَ","End":"٦٦"},{"Verse":67,"Text":"مَا كَانَ لِنَبِيٍّ أَن يَكُونَ لَهُۥٓ أَسۡرَىٰ حَتَّىٰ يُثۡخِنَ فِي ٱلۡأَرۡضِۚ تُرِيدُونَ عَرَضَ ٱلدُّنۡيَا وَٱللَّهُ يُرِيدُ ٱلۡأٓخِرَةَۗ وَٱللَّهُ عَزِيزٌ حَكِيمٞ","End":"٦٧"},{"Verse":68,"Text":"لَّوۡلَا كِتَٰبٞ مِّنَ ٱللَّهِ سَبَقَ لَمَسَّكُمۡ فِيمَآ أَخَذۡتُمۡ عَذَابٌ عَظِيمٞ","End":"٦٨"},{"Verse":69,"Text":"فَكُلُواْ مِمَّا غَنِمۡتُمۡ حَلَٰلٗا طَيِّبٗاۚ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","End":"٦٩"},{"Verse":70,"Text":"يَـٰٓأَيُّهَا ٱلنَّبِيُّ قُل لِّمَن فِيٓ أَيۡدِيكُم مِّنَ ٱلۡأَسۡرَىٰٓ إِن يَعۡلَمِ ٱللَّهُ فِي قُلُوبِكُمۡ خَيۡرٗا يُؤۡتِكُمۡ خَيۡرٗا مِّمَّآ أُخِذَ مِنكُمۡ وَيَغۡفِرۡ لَكُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ","End":"٧٠"},{"Verse":71,"Text":"وَإِن يُرِيدُواْ خِيَانَتَكَ فَقَدۡ خَانُواْ ٱللَّهَ مِن قَبۡلُ فَأَمۡكَنَ مِنۡهُمۡۗ وَٱللَّهُ عَلِيمٌ حَكِيمٌ","End":"٧١"},{"Verse":72,"Text":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَهَاجَرُواْ وَجَٰهَدُواْ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡ فِي سَبِيلِ ٱللَّهِ وَٱلَّذِينَ ءَاوَواْ وَّنَصَرُوٓاْ أُوْلَـٰٓئِكَ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٖۚ وَٱلَّذِينَ ءَامَنُواْ وَلَمۡ يُهَاجِرُواْ مَا لَكُم مِّن وَلَٰيَتِهِم مِّن شَيۡءٍ حَتَّىٰ يُهَاجِرُواْۚ وَإِنِ ٱسۡتَنصَرُوكُمۡ فِي ٱلدِّينِ فَعَلَيۡكُمُ ٱلنَّصۡرُ إِلَّا عَلَىٰ قَوۡمِۭ بَيۡنَكُمۡ وَبَيۡنَهُم مِّيثَٰقٞۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ","End":"٧٢"},{"Verse":73,"Text":"وَٱلَّذِينَ كَفَرُواْ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٍۚ إِلَّا تَفۡعَلُوهُ تَكُن فِتۡنَةٞ فِي ٱلۡأَرۡضِ وَفَسَادٞ كَبِيرٞ","End":"٧٣"},{"Verse":74,"Text":"وَٱلَّذِينَ ءَامَنُواْ وَهَاجَرُواْ وَجَٰهَدُواْ فِي سَبِيلِ ٱللَّهِ وَٱلَّذِينَ ءَاوَواْ وَّنَصَرُوٓاْ أُوْلَـٰٓئِكَ هُمُ ٱلۡمُؤۡمِنُونَ حَقّٗاۚ لَّهُم مَّغۡفِرَةٞ وَرِزۡقٞ كَرِيمٞ","End":"٧٤"},{"Verse":75,"Text":"وَٱلَّذِينَ ءَامَنُواْ مِنۢ بَعۡدُ وَهَاجَرُواْ وَجَٰهَدُواْ مَعَكُمۡ فَأُوْلَـٰٓئِكَ مِنكُمۡۚ وَأُوْلُواْ ٱلۡأَرۡحَامِ بَعۡضُهُمۡ أَوۡلَىٰ بِبَعۡضٖ فِي كِتَٰبِ ٱللَّهِۚ إِنَّ ٱللَّهَ بِكُلِّ شَيۡءٍ عَلِيمُۢ","End":"٧٥"}],"Translations":[{"LanguageCode":"eng","Language":"English","Name":"eng-mustafakhattabg","Author":"Mustafa Khattab God Edition","Source":"","Direction":"ltr","Translations":[{"Verse":1,"Text":"They ask you ˹O Prophet˺ regarding the spoils of war. Say, “Their distribution is decided by God and His Messenger. So be mindful of God, settle your affairs, and obey God and His Messenger if you are ˹true˺ believers.”"},{"Verse":2,"Text":"The ˹true˺ believers are only those whose hearts tremble at the remembrance of God, whose faith increases when His revelations are recited to them, and who put their trust in their Lord"},{"Verse":3,"Text":"˹They are˺ those who establish prayer and donate from what We have provided for them"},{"Verse":4,"Text":"It is they who are the true believers. They will have elevated ranks, forgiveness, and an honourable provision from their Lord"},{"Verse":5,"Text":"Similarly, when your Lord brought you ˹O Prophet˺ out of your home for a just cause, a group of believers was totally against it"},{"Verse":6,"Text":"They disputed with you about the truth after it had been made clear, as if they were being driven to death with their eyes wide open"},{"Verse":7,"Text":"˹Remember, O believers,˺ when God promised ˹to give˺ you the upper hand over either target, you wished to capture the unarmed party. But it was God’s Will to establish the truth by His Words and uproot the disbelievers"},{"Verse":8,"Text":"to firmly establish the truth and wipe out falsehood—even to the dismay of the wicked"},{"Verse":9,"Text":"˹Remember˺ when you cried out to your Lord for help, He answered, “I will reinforce you with a thousand angels—followed by many others.”"},{"Verse":10,"Text":"And God made this a sign of victory and reassurance to your hearts. Victory comes only from God. Surely God is Almighty, All-Wise"},{"Verse":11,"Text":"˹Remember˺ when He caused drowsiness to overcome you, giving you serenity. And He sent down rain from the sky to purify you, free you from Satan’s whispers, strengthen your hearts, and make ˹your˺ steps firm"},{"Verse":12,"Text":"˹Remember, O Prophet,˺ when your Lord revealed to the angels, “I am with you. So make the believers stand firm. I will cast horror into the hearts of the disbelievers. So strike their necks and strike their fingertips.”"},{"Verse":13,"Text":"This is because they defied God and His Messenger. And whoever defies God and His Messenger, then ˹know that˺ God is surely severe in punishment"},{"Verse":14,"Text":"That ˹worldly punishment˺ is yours, so taste it! Then the disbelievers will suffer the torment of the Fire"},{"Verse":15,"Text":"O believers! When you face the disbelievers in battle, never turn your backs to them"},{"Verse":16,"Text":"And whoever does so on such an occasion—unless it is a manoeuvre or to join their own troops—will earn the displeasure of God, and their home will be Hell. What an evil destination"},{"Verse":17,"Text":"It was not you ˹believers˺ who killed them, but it was God Who did so. Nor was it you ˹O Prophet˺ who threw ˹a handful of sand at the disbelievers˺, but it was God Who did so, rendering the believers a great favour. Surely God is All-Hearing, All-Knowing"},{"Verse":18,"Text":"As such, God frustrates the evil plans of the disbelievers"},{"Verse":19,"Text":"If you ˹Meccans˺ sought judgment, now it has come to you. And if you cease, it will be for your own good. But if you persist, We will persist. And your forces—no matter how numerous they might be—will not benefit you whatsoever. For God is certainly with the believers"},{"Verse":20,"Text":"O believers! Obey God and His Messenger and do not turn away from him while you hear ˹his call˺"},{"Verse":21,"Text":"Do not be like those who say, “We hear,” but in fact they are not listening"},{"Verse":22,"Text":"Indeed, the worst of all beings in the sight of God are the ˹wilfully˺ deaf and dumb, who do not understand"},{"Verse":23,"Text":"Had God known any goodness in them, He would have certainly made them hear. ˹But˺ even if He had made them hear, they would have surely turned away heedlessly"},{"Verse":24,"Text":"O believers! Respond to God and His Messenger when he calls you to that which gives you life. And know that God stands between a person and their heart, and that to Him you will all be gathered"},{"Verse":25,"Text":"Beware of a trial that will not only affect the wrongdoers among you. And know that God is severe in punishment"},{"Verse":26,"Text":"Remember when you had been vastly outnumbered and oppressed in the land, constantly in fear of attacks by your enemy, then He sheltered you, strengthened you with His help, and provided you with good things so perhaps you would be thankful"},{"Verse":27,"Text":"O believers! Do not betray God and the Messenger, nor betray your trusts knowingly"},{"Verse":28,"Text":"And know that your wealth and your children are only a test and that with God is a great reward"},{"Verse":29,"Text":"O believers! If you are mindful of God, He will grant you a standard ˹to distinguish between right and wrong˺, absolve you of your sins, and forgive you. And God is the Lord of infinite bounty"},{"Verse":30,"Text":"And ˹remember, O Prophet,˺ when the disbelievers conspired to capture, kill, or exile you. They planned, but God also planned. And God is the best of planners"},{"Verse":31,"Text":"Whenever Our revelations are recited to them, they challenge ˹you˺, “We have already heard ˹the recitation˺. If we wanted, we could have easily produced something similar. This ˹Quran˺ is nothing but ancient fables!”"},{"Verse":32,"Text":"And ˹remember˺ when they prayed, “O God! If this is indeed the truth from You, then rain down stones upon us from the sky or overcome us with a painful punishment.”"},{"Verse":33,"Text":"But God would never punish them while you ˹O Prophet˺ were in their midst. Nor would He ever punish them if they prayed for forgiveness"},{"Verse":34,"Text":"And why should God not punish them while they hinder pilgrims from the Sacred Mosque, claiming to be its rightful guardians? None has the right to guardianship except those mindful ˹of God˺, but most pagans do not know"},{"Verse":35,"Text":"Their prayer at the Sacred House was nothing but whistling and clapping. So taste the punishment for your disbelief"},{"Verse":36,"Text":"Surely the disbelievers spend their wealth to hinder others from the Path of God. They will continue to spend to the point of regret. Then they will be defeated and the disbelievers will be driven into Hell"},{"Verse":37,"Text":"so God may separate the evil from the good. He will pile up the evil ones all together and then cast them into Hell. They are the ˹true˺ losers"},{"Verse":38,"Text":"Tell the disbelievers that if they desist, their past will be forgiven. But if they persist, then they have an example in those destroyed before them"},{"Verse":39,"Text":"Fight against them until there is no more persecution—and ˹your˺ devotion will be entirely to God. But if they desist, then surely God is All-Seeing of what they do"},{"Verse":40,"Text":"And if they do not comply, then know that God is your Protector. What an excellent Protector, and what an excellent Helper"},{"Verse":41,"Text":"Know that whatever spoils you take, one-fifth is for God and the Messenger, his close relatives, orphans, the poor, and ˹needy˺ travellers, if you ˹truly˺ believe in God and what We revealed to Our servant on that decisive day when the two armies met ˹at Badr˺. And God is Most Capable of everything"},{"Verse":42,"Text":"˹Remember˺ when you were on the near side of the valley, your enemy on the far side, and the caravan was below you. Even if the two armies had made an appointment ˹to meet˺, both would have certainly missed it. Still it transpired so God may establish what He had destined—that those who were to perish and those who were to survive might do so after the truth had been made clear to both. Surely God is All-Hearing, All-Knowing"},{"Verse":43,"Text":"˹Remember, O Prophet,˺ when God showed them in your dream as few in number. Had He shown them to you as many, you ˹believers˺ would have certainly faltered and disputed in the matter. But God spared you ˹from that˺. Surely He knows best what is ˹hidden˺ in the heart"},{"Verse":44,"Text":"Then when your armies met, God made them appear as few in your eyes, and made you appear as few in theirs, so God may establish what He had destined. And to God ˹all˺ matters will be returned ˹for judgment˺"},{"Verse":45,"Text":"O believers! When you face an enemy, stand firm and remember God often so you may triumph"},{"Verse":46,"Text":"Obey God and His Messenger and do not dispute with one another, or you would be discouraged and weakened. Persevere! Surely God is with those who persevere"},{"Verse":47,"Text":"Do not be like those ˹pagans˺ who left their homes arrogantly, only to be seen by people and to hinder others from God’s Path. And God is Fully Aware of what they do"},{"Verse":48,"Text":"And ˹remember˺ when Satan made their ˹evil˺ deeds appealing to them, and said, “No one can overcome you today. I am surely by your side.” But when the two forces faced off, he cowered and said, “I have absolutely nothing to do with you. I certainly see what you do not see. I truly fear God, for God is severe in punishment.”"},{"Verse":49,"Text":"˹Remember˺ when the hypocrites and those with sickness in their hearts said, “These ˹believers˺ are deluded by their faith.” But whoever puts their trust in God, surely God is Almighty, All-Wise"},{"Verse":50,"Text":"If only you could see when the angels take the souls of the disbelievers, beating their faces and backs, ˹saying,˺ “Taste the torment of burning"},{"Verse":51,"Text":"This is ˹the reward˺ for what your hands have done. And God is never unjust to ˹His˺ creation.”"},{"Verse":52,"Text":"Their fate is that of the people of Pharaoh and those before them—they all disbelieved in God’s signs, so God seized them for their sins. Indeed, God is All-Powerful, severe in punishment"},{"Verse":53,"Text":"This is because God would never discontinue His favour to a people until they discontinue their faith. Surely God is All-Hearing, All-Knowing"},{"Verse":54,"Text":"That was the case with Pharaoh’s people and those before them—they all rejected the signs of their Lord, so We destroyed them for their sins and drowned Pharaoh’s people. They were all wrongdoers"},{"Verse":55,"Text":"Indeed, the worst of all beings in the sight of God are those who persist in disbelief, never to have faith—"},{"Verse":56,"Text":"˹namely˺ those with whom you ˹O Prophet˺ have entered into treaties, but they violate them every time, not fearing the consequences"},{"Verse":57,"Text":"If you ever encounter them in battle, make a fearsome example of them, so perhaps those who would follow them may be deterred"},{"Verse":58,"Text":"And if you ˹O Prophet˺ see signs of betrayal by a people, respond by openly terminating your treaty with them. Surely God does not like those who betray"},{"Verse":59,"Text":"Do not let those disbelievers think they are not within reach. They will have no escape"},{"Verse":60,"Text":"Prepare against them what you ˹believers˺ can of ˹military˺ power and cavalry to deter God’s enemies and your enemies as well as other enemies unknown to you but known to God. Whatever you spend in the cause of God will be paid to you in full and you will not be wronged"},{"Verse":61,"Text":"If the enemy is inclined towards peace, make peace with them. And put your trust in God. Indeed, He ˹alone˺ is the All-Hearing, All-Knowing"},{"Verse":62,"Text":"But if their intention is only to deceive you, then God is certainly sufficient for you. He is the One Who has supported you with His help and with the believers"},{"Verse":63,"Text":"He brought their hearts together. Had you spent all the riches in the earth, you could not have united their hearts. But God has united them. Indeed, He is Almighty, All-Wise"},{"Verse":64,"Text":"O Prophet! God is sufficient for you and for the believers who follow you"},{"Verse":65,"Text":"O Prophet! Motivate the believers to fight. If there are twenty steadfast among you, they will overcome two hundred. And if there are one hundred of you, they will overcome one thousand of the disbelievers, for they are a people who do not comprehend"},{"Verse":66,"Text":"Now God has lightened your burden, for He knows that there is weakness in you. So if there are a hundred steadfast among you, they will overcome two hundred. And if there be one thousand, they will overcome two thousand, by God’s Will. And God is with the steadfast"},{"Verse":67,"Text":"It is not fit for a prophet that he should take captives until he has thoroughly subdued the land. You ˹believers˺ settled with the fleeting gains of this world, while God’s aim ˹for you˺ is the Hereafter. God is Almighty, All-Wise"},{"Verse":68,"Text":"Had it not been for a prior decree from God, you would have certainly been disciplined with a tremendous punishment for whatever ˹ransom˺ you have taken"},{"Verse":69,"Text":"Now enjoy what you have taken, for it is lawful and good. And be mindful of God. Surely God is All-Forgiving, Most Merciful"},{"Verse":70,"Text":"O Prophet! Tell the captives in your custody, “If God finds goodness in your hearts, He will give you better than what has been taken from you, and forgive you. For God is All-Forgiving, Most Merciful.”"},{"Verse":71,"Text":"But if their intention is only to betray you ˹O Prophet˺, they sought to betray God before. But He gave you power over them. And God is All-Knowing, All-Wise"},{"Verse":72,"Text":"Those who believed, emigrated, and strived with their wealth and lives in the cause of God, as well as those who gave them shelter and help—they are truly guardians of one another. As for those who believed but did not emigrate, you have no obligations to them until they emigrate. But if they seek your help ˹against persecution˺ in faith, it is your obligation to help them, except against people bound with you in a treaty. God is All-Seeing of what you do"},{"Verse":73,"Text":"As for the disbelievers, they are guardians of one another. And unless you ˹believers˺ act likewise, there will be great oppression and corruption in the land"},{"Verse":74,"Text":"Those who believed, migrated, and struggled in the cause of God, and those who gave ˹them˺ shelter and help, they are the true believers. They will have forgiveness and an honourable provision"},{"Verse":75,"Text":"And those who later believed, migrated, and struggled alongside you, they are also with you. But only blood relatives are now entitled to inherit from one another, as ordained by God. Surely God has ˹full˺ knowledge of everything"}]}]}