{"LanguageCode":"en","SurahData":{"Chapter":65,"Index":"065","Name":"At-Talaq","TranslatedName":"The Divorce","ArabicName":"سُوْرَةُ الطَّلَاقِ","Revelation":"Madina","RevelationOrder":99,"HasBismillah":true,"VerseCount":12,"SajdaCount":0,"JuzStart":28,"JuzEnd":28,"VerseStart":5218,"VerseEnd":5229,"ManzilStart":7,"ManzilEnd":7,"RukuStart":492,"RukuEnd":493,"MaqraStart":223,"MaqraEnd":223,"PageStart":558,"PageEnd":559},"Summaries":["<p>This is a Madani Surah revealed in the 6<sup>th</sup> year of Hijrah. It has 12 verses in 2 sections.</p>","<p>This and the following Surah al-Tahrim speak about family rules. The spouses should follow Allah’s rules whether they have disagreement with each other or they love each other. In this Surah the proper rules of divorce are given. Do not just say the words of divorce and separate yourself from your wives, but give them their rights. It also reminds the Believers to obey Allah and His Messenger. Those who disobey Allah are warned the consequences of their disobedience.</p>","<ol>","\t<li>The Rules of Divorce.</li>","\t<li>Warning to those who disobey the commands of Allah.</li>","</ol>"],"Verses":[{"Verse":1,"Text":"يَـٰٓأَيُّهَا ٱلنَّبِيُّ إِذَا طَلَّقۡتُمُ ٱلنِّسَآءَ فَطَلِّقُوهُنَّ لِعِدَّتِهِنَّ وَأَحۡصُواْ ٱلۡعِدَّةَۖ وَٱتَّقُواْ ٱللَّهَ رَبَّكُمۡۖ لَا تُخۡرِجُوهُنَّ مِنۢ بُيُوتِهِنَّ وَلَا يَخۡرُجۡنَ إِلَّآ أَن يَأۡتِينَ بِفَٰحِشَةٖ مُّبَيِّنَةٖۚ وَتِلۡكَ حُدُودُ ٱللَّهِۚ وَمَن يَتَعَدَّ حُدُودَ ٱللَّهِ فَقَدۡ ظَلَمَ نَفۡسَهُۥۚ لَا تَدۡرِي لَعَلَّ ٱللَّهَ يُحۡدِثُ بَعۡدَ ذَٰلِكَ أَمۡرٗا","End":"١"},{"Verse":2,"Text":"فَإِذَا بَلَغۡنَ أَجَلَهُنَّ فَأَمۡسِكُوهُنَّ بِمَعۡرُوفٍ أَوۡ فَارِقُوهُنَّ بِمَعۡرُوفٖ وَأَشۡهِدُواْ ذَوَيۡ عَدۡلٖ مِّنكُمۡ وَأَقِيمُواْ ٱلشَّهَٰدَةَ لِلَّهِۚ ذَٰلِكُمۡ يُوعَظُ بِهِۦ مَن كَانَ يُؤۡمِنُ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِۚ وَمَن يَتَّقِ ٱللَّهَ يَجۡعَل لَّهُۥ مَخۡرَجٗا","End":"٢"},{"Verse":3,"Text":"وَيَرۡزُقۡهُ مِنۡ حَيۡثُ لَا يَحۡتَسِبُۚ وَمَن يَتَوَكَّلۡ عَلَى ٱللَّهِ فَهُوَ حَسۡبُهُۥٓۚ إِنَّ ٱللَّهَ بَٰلِغُ أَمۡرِهِۦۚ قَدۡ جَعَلَ ٱللَّهُ لِكُلِّ شَيۡءٖ قَدۡرٗا","End":"٣"},{"Verse":4,"Text":"وَٱلَّـٰٓـِٔي يَئِسۡنَ مِنَ ٱلۡمَحِيضِ مِن نِّسَآئِكُمۡ إِنِ ٱرۡتَبۡتُمۡ فَعِدَّتُهُنَّ ثَلَٰثَةُ أَشۡهُرٖ وَٱلَّـٰٓـِٔي لَمۡ يَحِضۡنَۚ وَأُوْلَٰتُ ٱلۡأَحۡمَالِ أَجَلُهُنَّ أَن يَضَعۡنَ حَمۡلَهُنَّۚ وَمَن يَتَّقِ ٱللَّهَ يَجۡعَل لَّهُۥ مِنۡ أَمۡرِهِۦ يُسۡرٗا","End":"٤"},{"Verse":5,"Text":"ذَٰلِكَ أَمۡرُ ٱللَّهِ أَنزَلَهُۥٓ إِلَيۡكُمۡۚ وَمَن يَتَّقِ ٱللَّهَ يُكَفِّرۡ عَنۡهُ سَيِّـَٔاتِهِۦ وَيُعۡظِمۡ لَهُۥٓ أَجۡرًا","End":"٥"},{"Verse":6,"Text":"أَسۡكِنُوهُنَّ مِنۡ حَيۡثُ سَكَنتُم مِّن وُجۡدِكُمۡ وَلَا تُضَآرُّوهُنَّ لِتُضَيِّقُواْ عَلَيۡهِنَّۚ وَإِن كُنَّ أُوْلَٰتِ حَمۡلٖ فَأَنفِقُواْ عَلَيۡهِنَّ حَتَّىٰ يَضَعۡنَ حَمۡلَهُنَّۚ فَإِنۡ أَرۡضَعۡنَ لَكُمۡ فَـَٔاتُوهُنَّ أُجُورَهُنَّ وَأۡتَمِرُواْ بَيۡنَكُم بِمَعۡرُوفٖۖ وَإِن تَعَاسَرۡتُمۡ فَسَتُرۡضِعُ لَهُۥٓ أُخۡرَىٰ","End":"٦"},{"Verse":7,"Text":"لِيُنفِقۡ ذُو سَعَةٖ مِّن سَعَتِهِۦۖ وَمَن قُدِرَ عَلَيۡهِ رِزۡقُهُۥ فَلۡيُنفِقۡ مِمَّآ ءَاتَىٰهُ ٱللَّهُۚ لَا يُكَلِّفُ ٱللَّهُ نَفۡسًا إِلَّا مَآ ءَاتَىٰهَاۚ سَيَجۡعَلُ ٱللَّهُ بَعۡدَ عُسۡرٖ يُسۡرٗا","End":"٧"},{"Verse":8,"Text":"وَكَأَيِّن مِّن قَرۡيَةٍ عَتَتۡ عَنۡ أَمۡرِ رَبِّهَا وَرُسُلِهِۦ فَحَاسَبۡنَٰهَا حِسَابٗا شَدِيدٗا وَعَذَّبۡنَٰهَا عَذَابٗا نُّكۡرٗا","End":"٨"},{"Verse":9,"Text":"فَذَاقَتۡ وَبَالَ أَمۡرِهَا وَكَانَ عَٰقِبَةُ أَمۡرِهَا خُسۡرًا","End":"٩"},{"Verse":10,"Text":"أَعَدَّ ٱللَّهُ لَهُمۡ عَذَابٗا شَدِيدٗاۖ فَٱتَّقُواْ ٱللَّهَ يَـٰٓأُوْلِي ٱلۡأَلۡبَٰبِ ٱلَّذِينَ ءَامَنُواْۚ قَدۡ أَنزَلَ ٱللَّهُ إِلَيۡكُمۡ ذِكۡرٗا","End":"١٠"},{"Verse":11,"Text":"رَّسُولٗا يَتۡلُواْ عَلَيۡكُمۡ ءَايَٰتِ ٱللَّهِ مُبَيِّنَٰتٖ لِّيُخۡرِجَ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّـٰلِحَٰتِ مِنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِۚ وَمَن يُؤۡمِنۢ بِٱللَّهِ وَيَعۡمَلۡ صَٰلِحٗا يُدۡخِلۡهُ جَنَّـٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَآ أَبَدٗاۖ قَدۡ أَحۡسَنَ ٱللَّهُ لَهُۥ رِزۡقًا","End":"١١"},{"Verse":12,"Text":"ٱللَّهُ ٱلَّذِي خَلَقَ سَبۡعَ سَمَٰوَٰتٖ وَمِنَ ٱلۡأَرۡضِ مِثۡلَهُنَّۖ يَتَنَزَّلُ ٱلۡأَمۡرُ بَيۡنَهُنَّ لِتَعۡلَمُوٓاْ أَنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ وَأَنَّ ٱللَّهَ قَدۡ أَحَاطَ بِكُلِّ شَيۡءٍ عِلۡمَۢا","End":"١٢"}],"Translations":[{"LanguageCode":"eng","Language":"English","Name":"eng-mustafakhattabg","Author":"Mustafa Khattab God Edition","Source":"","Direction":"ltr","Translations":[{"Verse":1,"Text":"O Prophet! ˹Instruct the believers:˺ When you ˹intend to˺ divorce women, then divorce them with concern for their waiting period, and count it accurately. And fear God, your Lord. Do not force them out of their homes, nor should they leave—unless they commit a blatant misconduct. These are the limits set by God. And whoever transgresses God’s limits has truly wronged his own soul. You never know, perhaps God will bring about a change ˹of heart˺ later"},{"Verse":2,"Text":"Then when they have ˹almost˺ reached the end of their waiting period, either retain them honourably or separate from them honourably. And call two of your reliable men to witness ˹either way˺—and ˹let the witnesses˺ bear true testimony for ˹the sake of˺ God. This is enjoined on whoever has faith in God and the Last Day. And whoever is mindful of God, He will make a way out for them"},{"Verse":3,"Text":"and provide for them from sources they could never imagine. And whoever puts their trust in God, then He ˹alone˺ is sufficient for them. Certainly God achieves His Will. God has already set a destiny for everything"},{"Verse":4,"Text":"As for your women past the age of menstruation, in case you do not know, their waiting period is three months, and those who have not menstruated as well. As for those who are pregnant, their waiting period ends with delivery. And whoever is mindful of God, He will make their matters easy for them"},{"Verse":5,"Text":"This is the commandment of God, which He has revealed to you. And whoever is mindful of God, He will absolve them of their sins and reward them immensely"},{"Verse":6,"Text":"Let them live where you live ˹during their waiting period˺, according to your means. And do not harass them to make their stay unbearable. If they are pregnant, then maintain them until they deliver. And if they nurse your child, compensate them, and consult together courteously. But if you fail to reach an agreement, then another woman will nurse ˹the child˺ for the father"},{"Verse":7,"Text":"Let the man of wealth provide according to his means. As for the one with limited resources, let him provide according to whatever God has given him. God does not require of any soul beyond what He has given it. After hardship, God will bring about ease"},{"Verse":8,"Text":"˹Imagine˺ how many societies rebelled against the commandments of their Lord and His messengers, so We called each ˹society˺ to a severe account and subjected them to a horrible punishment"},{"Verse":9,"Text":"So they tasted the evil consequences of their doings, and the outcome of their doings was ˹total˺ loss"},{"Verse":10,"Text":"God has ˹also˺ prepared for them a severe punishment. So fear God, O people of reason and faith. God has indeed revealed to you a Reminder"},{"Verse":11,"Text":"˹and sent˺ a messenger reciting to you God’s revelations, making things clear so that He may bring those who believe and do good out of darkness and into light. And whoever believes in God and does good will be admitted by Him into Gardens under which rivers flow, to stay there for ever and ever. God will have indeed granted them an excellent provision"},{"Verse":12,"Text":"God is the One Who created seven heavens ˹in layers˺, and likewise for the earth. The ˹divine˺ command descends between them so you may know that God is Most Capable of everything and that God certainly encompasses all things in ˹His˺ knowledge"}]}]}