{"LanguageCode":"en","SurahData":{"Chapter":23,"Index":"023","Name":"Al-Mu'minun","TranslatedName":"The Believers","ArabicName":"سُوْرَةُ الْمُؤْمِنُوْنَ","Revelation":"Mecca","RevelationOrder":74,"HasBismillah":true,"VerseCount":118,"SajdaCount":0,"JuzStart":18,"JuzEnd":18,"VerseStart":2674,"VerseEnd":2791,"ManzilStart":4,"ManzilEnd":4,"RukuStart":295,"RukuEnd":300,"MaqraStart":137,"MaqraEnd":139,"PageStart":342,"PageEnd":349},"Summaries":["<p>This is an early Makki Surah revealed about 6-7 years before the Hijrah. It has 118 verses in 6 sections.</p>","<p>In this Surah people are invited to accept and follow the Prophet. This is the central theme of the Surah. It speaks about the character of true believers and assures that they will be the real successful people. It draws attention to various stages of human creation, to many other universal signs. Then it takes some of the stories of other prophets and tells us that they also preached the same message.</p>","<ol>","\t<li>The character of the Believers. Various stages of human creation and Allah's signs in the universe.</li>","\t<li>The Message of Prophet Noah, his people's response and then the flood.</li>","\t<li>Generations were raised after Prophet Noah. Many prophets were sent among them. Then came Prophet Moses and Aaron and then came Jesus -peace be upon them all.</li>","\t<li>All prophets are one Ummah and preached the same religion. Those who are affluent think that they are also the righteous people, but the righteous are only those who do the good deeds.</li>","\t<li>Everything in the heaven and earth belongs to Allah.</li>","\t<li>Prophet's job is to continue presenting the message of Allah. This life is the only chance. The life has a purpose.</li>","</ol>"],"Verses":[{"Verse":1,"Text":"قَدۡ أَفۡلَحَ ٱلۡمُؤۡمِنُونَ","End":"١"},{"Verse":2,"Text":"ٱلَّذِينَ هُمۡ فِي صَلَاتِهِمۡ خَٰشِعُونَ","End":"٢"},{"Verse":3,"Text":"وَٱلَّذِينَ هُمۡ عَنِ ٱللَّغۡوِ مُعۡرِضُونَ","End":"٣"},{"Verse":4,"Text":"وَٱلَّذِينَ هُمۡ لِلزَّكَوٰةِ فَٰعِلُونَ","End":"٤"},{"Verse":5,"Text":"وَٱلَّذِينَ هُمۡ لِفُرُوجِهِمۡ حَٰفِظُونَ","End":"٥"},{"Verse":6,"Text":"إِلَّا عَلَىٰٓ أَزۡوَٰجِهِمۡ أَوۡ مَا مَلَكَتۡ أَيۡمَٰنُهُمۡ فَإِنَّهُمۡ غَيۡرُ مَلُومِينَ","End":"٦"},{"Verse":7,"Text":"فَمَنِ ٱبۡتَغَىٰ وَرَآءَ ذَٰلِكَ فَأُوْلَـٰٓئِكَ هُمُ ٱلۡعَادُونَ","End":"٧"},{"Verse":8,"Text":"وَٱلَّذِينَ هُمۡ لِأَمَٰنَٰتِهِمۡ وَعَهۡدِهِمۡ رَٰعُونَ","End":"٨"},{"Verse":9,"Text":"وَٱلَّذِينَ هُمۡ عَلَىٰ صَلَوَٰتِهِمۡ يُحَافِظُونَ","End":"٩"},{"Verse":10,"Text":"أُوْلَـٰٓئِكَ هُمُ ٱلۡوَٰرِثُونَ","End":"١٠"},{"Verse":11,"Text":"ٱلَّذِينَ يَرِثُونَ ٱلۡفِرۡدَوۡسَ هُمۡ فِيهَا خَٰلِدُونَ","End":"١١"},{"Verse":12,"Text":"وَلَقَدۡ خَلَقۡنَا ٱلۡإِنسَٰنَ مِن سُلَٰلَةٖ مِّن طِينٖ","End":"١٢"},{"Verse":13,"Text":"ثُمَّ جَعَلۡنَٰهُ نُطۡفَةٗ فِي قَرَارٖ مَّكِينٖ","End":"١٣"},{"Verse":14,"Text":"ثُمَّ خَلَقۡنَا ٱلنُّطۡفَةَ عَلَقَةٗ فَخَلَقۡنَا ٱلۡعَلَقَةَ مُضۡغَةٗ فَخَلَقۡنَا ٱلۡمُضۡغَةَ عِظَٰمٗا فَكَسَوۡنَا ٱلۡعِظَٰمَ لَحۡمٗا ثُمَّ أَنشَأۡنَٰهُ خَلۡقًا ءَاخَرَۚ فَتَبَارَكَ ٱللَّهُ أَحۡسَنُ ٱلۡخَٰلِقِينَ","End":"١٤"},{"Verse":15,"Text":"ثُمَّ إِنَّكُم بَعۡدَ ذَٰلِكَ لَمَيِّتُونَ","End":"١٥"},{"Verse":16,"Text":"ثُمَّ إِنَّكُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ تُبۡعَثُونَ","End":"١٦"},{"Verse":17,"Text":"وَلَقَدۡ خَلَقۡنَا فَوۡقَكُمۡ سَبۡعَ طَرَآئِقَ وَمَا كُنَّا عَنِ ٱلۡخَلۡقِ غَٰفِلِينَ","End":"١٧"},{"Verse":18,"Text":"وَأَنزَلۡنَا مِنَ ٱلسَّمَآءِ مَآءَۢ بِقَدَرٖ فَأَسۡكَنَّـٰهُ فِي ٱلۡأَرۡضِۖ وَإِنَّا عَلَىٰ ذَهَابِۭ بِهِۦ لَقَٰدِرُونَ","End":"١٨"},{"Verse":19,"Text":"فَأَنشَأۡنَا لَكُم بِهِۦ جَنَّـٰتٖ مِّن نَّخِيلٖ وَأَعۡنَٰبٖ لَّكُمۡ فِيهَا فَوَٰكِهُ كَثِيرَةٞ وَمِنۡهَا تَأۡكُلُونَ","End":"١٩"},{"Verse":20,"Text":"وَشَجَرَةٗ تَخۡرُجُ مِن طُورِ سَيۡنَآءَ تَنۢبُتُ بِٱلدُّهۡنِ وَصِبۡغٖ لِّلۡأٓكِلِينَ","End":"٢٠"},{"Verse":21,"Text":"وَإِنَّ لَكُمۡ فِي ٱلۡأَنۡعَٰمِ لَعِبۡرَةٗۖ نُّسۡقِيكُم مِّمَّا فِي بُطُونِهَا وَلَكُمۡ فِيهَا مَنَٰفِعُ كَثِيرَةٞ وَمِنۡهَا تَأۡكُلُونَ","End":"٢١"},{"Verse":22,"Text":"وَعَلَيۡهَا وَعَلَى ٱلۡفُلۡكِ تُحۡمَلُونَ","End":"٢٢"},{"Verse":23,"Text":"وَلَقَدۡ أَرۡسَلۡنَا نُوحًا إِلَىٰ قَوۡمِهِۦ فَقَالَ يَٰقَوۡمِ ٱعۡبُدُواْ ٱللَّهَ مَا لَكُم مِّنۡ إِلَٰهٍ غَيۡرُهُۥٓۚ أَفَلَا تَتَّقُونَ","End":"٢٣"},{"Verse":24,"Text":"فَقَالَ ٱلۡمَلَؤُاْ ٱلَّذِينَ كَفَرُواْ مِن قَوۡمِهِۦ مَا هَٰذَآ إِلَّا بَشَرٞ مِّثۡلُكُمۡ يُرِيدُ أَن يَتَفَضَّلَ عَلَيۡكُمۡ وَلَوۡ شَآءَ ٱللَّهُ لَأَنزَلَ مَلَـٰٓئِكَةٗ مَّا سَمِعۡنَا بِهَٰذَا فِيٓ ءَابَآئِنَا ٱلۡأَوَّلِينَ","End":"٢٤"},{"Verse":25,"Text":"إِنۡ هُوَ إِلَّا رَجُلُۢ بِهِۦ جِنَّةٞ فَتَرَبَّصُواْ بِهِۦ حَتَّىٰ حِينٖ","End":"٢٥"},{"Verse":26,"Text":"قَالَ رَبِّ ٱنصُرۡنِي بِمَا كَذَّبُونِ","End":"٢٦"},{"Verse":27,"Text":"فَأَوۡحَيۡنَآ إِلَيۡهِ أَنِ ٱصۡنَعِ ٱلۡفُلۡكَ بِأَعۡيُنِنَا وَوَحۡيِنَا فَإِذَا جَآءَ أَمۡرُنَا وَفَارَ ٱلتَّنُّورُ فَٱسۡلُكۡ فِيهَا مِن كُلّٖ زَوۡجَيۡنِ ٱثۡنَيۡنِ وَأَهۡلَكَ إِلَّا مَن سَبَقَ عَلَيۡهِ ٱلۡقَوۡلُ مِنۡهُمۡۖ وَلَا تُخَٰطِبۡنِي فِي ٱلَّذِينَ ظَلَمُوٓاْ إِنَّهُم مُّغۡرَقُونَ","End":"٢٧"},{"Verse":28,"Text":"فَإِذَا ٱسۡتَوَيۡتَ أَنتَ وَمَن مَّعَكَ عَلَى ٱلۡفُلۡكِ فَقُلِ ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي نَجَّىٰنَا مِنَ ٱلۡقَوۡمِ ٱلظَّـٰلِمِينَ","End":"٢٨"},{"Verse":29,"Text":"وَقُل رَّبِّ أَنزِلۡنِي مُنزَلٗا مُّبَارَكٗا وَأَنتَ خَيۡرُ ٱلۡمُنزِلِينَ","End":"٢٩"},{"Verse":30,"Text":"إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ وَإِن كُنَّا لَمُبۡتَلِينَ","End":"٣٠"},{"Verse":31,"Text":"ثُمَّ أَنشَأۡنَا مِنۢ بَعۡدِهِمۡ قَرۡنًا ءَاخَرِينَ","End":"٣١"},{"Verse":32,"Text":"فَأَرۡسَلۡنَا فِيهِمۡ رَسُولٗا مِّنۡهُمۡ أَنِ ٱعۡبُدُواْ ٱللَّهَ مَا لَكُم مِّنۡ إِلَٰهٍ غَيۡرُهُۥٓۚ أَفَلَا تَتَّقُونَ","End":"٣٢"},{"Verse":33,"Text":"وَقَالَ ٱلۡمَلَأُ مِن قَوۡمِهِ ٱلَّذِينَ كَفَرُواْ وَكَذَّبُواْ بِلِقَآءِ ٱلۡأٓخِرَةِ وَأَتۡرَفۡنَٰهُمۡ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا مَا هَٰذَآ إِلَّا بَشَرٞ مِّثۡلُكُمۡ يَأۡكُلُ مِمَّا تَأۡكُلُونَ مِنۡهُ وَيَشۡرَبُ مِمَّا تَشۡرَبُونَ","End":"٣٣"},{"Verse":34,"Text":"وَلَئِنۡ أَطَعۡتُم بَشَرٗا مِّثۡلَكُمۡ إِنَّكُمۡ إِذٗا لَّخَٰسِرُونَ","End":"٣٤"},{"Verse":35,"Text":"أَيَعِدُكُمۡ أَنَّكُمۡ إِذَا مِتُّمۡ وَكُنتُمۡ تُرَابٗا وَعِظَٰمًا أَنَّكُم مُّخۡرَجُونَ","End":"٣٥"},{"Verse":36,"Text":"۞هَيۡهَاتَ هَيۡهَاتَ لِمَا تُوعَدُونَ","End":"٣٦"},{"Verse":37,"Text":"إِنۡ هِيَ إِلَّا حَيَاتُنَا ٱلدُّنۡيَا نَمُوتُ وَنَحۡيَا وَمَا نَحۡنُ بِمَبۡعُوثِينَ","End":"٣٧"},{"Verse":38,"Text":"إِنۡ هُوَ إِلَّا رَجُلٌ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبٗا وَمَا نَحۡنُ لَهُۥ بِمُؤۡمِنِينَ","End":"٣٨"},{"Verse":39,"Text":"قَالَ رَبِّ ٱنصُرۡنِي بِمَا كَذَّبُونِ","End":"٣٩"},{"Verse":40,"Text":"قَالَ عَمَّا قَلِيلٖ لَّيُصۡبِحُنَّ نَٰدِمِينَ","End":"٤٠"},{"Verse":41,"Text":"فَأَخَذَتۡهُمُ ٱلصَّيۡحَةُ بِٱلۡحَقِّ فَجَعَلۡنَٰهُمۡ غُثَآءٗۚ فَبُعۡدٗا لِّلۡقَوۡمِ ٱلظَّـٰلِمِينَ","End":"٤١"},{"Verse":42,"Text":"ثُمَّ أَنشَأۡنَا مِنۢ بَعۡدِهِمۡ قُرُونًا ءَاخَرِينَ","End":"٤٢"},{"Verse":43,"Text":"مَا تَسۡبِقُ مِنۡ أُمَّةٍ أَجَلَهَا وَمَا يَسۡتَـٔۡخِرُونَ","End":"٤٣"},{"Verse":44,"Text":"ثُمَّ أَرۡسَلۡنَا رُسُلَنَا تَتۡرَاۖ كُلَّ مَا جَآءَ أُمَّةٗ رَّسُولُهَا كَذَّبُوهُۖ فَأَتۡبَعۡنَا بَعۡضَهُم بَعۡضٗا وَجَعَلۡنَٰهُمۡ أَحَادِيثَۚ فَبُعۡدٗا لِّقَوۡمٖ لَّا يُؤۡمِنُونَ","End":"٤٤"},{"Verse":45,"Text":"ثُمَّ أَرۡسَلۡنَا مُوسَىٰ وَأَخَاهُ هَٰرُونَ بِـَٔايَٰتِنَا وَسُلۡطَٰنٖ مُّبِينٍ","End":"٤٥"},{"Verse":46,"Text":"إِلَىٰ فِرۡعَوۡنَ وَمَلَإِيْهِۦ فَٱسۡتَكۡبَرُواْ وَكَانُواْ قَوۡمًا عَالِينَ","End":"٤٦"},{"Verse":47,"Text":"فَقَالُوٓاْ أَنُؤۡمِنُ لِبَشَرَيۡنِ مِثۡلِنَا وَقَوۡمُهُمَا لَنَا عَٰبِدُونَ","End":"٤٧"},{"Verse":48,"Text":"فَكَذَّبُوهُمَا فَكَانُواْ مِنَ ٱلۡمُهۡلَكِينَ","End":"٤٨"},{"Verse":49,"Text":"وَلَقَدۡ ءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ لَعَلَّهُمۡ يَهۡتَدُونَ","End":"٤٩"},{"Verse":50,"Text":"وَجَعَلۡنَا ٱبۡنَ مَرۡيَمَ وَأُمَّهُۥٓ ءَايَةٗ وَءَاوَيۡنَٰهُمَآ إِلَىٰ رَبۡوَةٖ ذَاتِ قَرَارٖ وَمَعِينٖ","End":"٥٠"},{"Verse":51,"Text":"يَـٰٓأَيُّهَا ٱلرُّسُلُ كُلُواْ مِنَ ٱلطَّيِّبَٰتِ وَٱعۡمَلُواْ صَٰلِحًاۖ إِنِّي بِمَا تَعۡمَلُونَ عَلِيمٞ","End":"٥١"},{"Verse":52,"Text":"وَإِنَّ هَٰذِهِۦٓ أُمَّتُكُمۡ أُمَّةٗ وَٰحِدَةٗ وَأَنَا۠ رَبُّكُمۡ فَٱتَّقُونِ","End":"٥٢"},{"Verse":53,"Text":"فَتَقَطَّعُوٓاْ أَمۡرَهُم بَيۡنَهُمۡ زُبُرٗاۖ كُلُّ حِزۡبِۭ بِمَا لَدَيۡهِمۡ فَرِحُونَ","End":"٥٣"},{"Verse":54,"Text":"فَذَرۡهُمۡ فِي غَمۡرَتِهِمۡ حَتَّىٰ حِينٍ","End":"٥٤"},{"Verse":55,"Text":"أَيَحۡسَبُونَ أَنَّمَا نُمِدُّهُم بِهِۦ مِن مَّالٖ وَبَنِينَ","End":"٥٥"},{"Verse":56,"Text":"نُسَارِعُ لَهُمۡ فِي ٱلۡخَيۡرَٰتِۚ بَل لَّا يَشۡعُرُونَ","End":"٥٦"},{"Verse":57,"Text":"إِنَّ ٱلَّذِينَ هُم مِّنۡ خَشۡيَةِ رَبِّهِم مُّشۡفِقُونَ","End":"٥٧"},{"Verse":58,"Text":"وَٱلَّذِينَ هُم بِـَٔايَٰتِ رَبِّهِمۡ يُؤۡمِنُونَ","End":"٥٨"},{"Verse":59,"Text":"وَٱلَّذِينَ هُم بِرَبِّهِمۡ لَا يُشۡرِكُونَ","End":"٥٩"},{"Verse":60,"Text":"وَٱلَّذِينَ يُؤۡتُونَ مَآ ءَاتَواْ وَّقُلُوبُهُمۡ وَجِلَةٌ أَنَّهُمۡ إِلَىٰ رَبِّهِمۡ رَٰجِعُونَ","End":"٦٠"},{"Verse":61,"Text":"أُوْلَـٰٓئِكَ يُسَٰرِعُونَ فِي ٱلۡخَيۡرَٰتِ وَهُمۡ لَهَا سَٰبِقُونَ","End":"٦١"},{"Verse":62,"Text":"وَلَا نُكَلِّفُ نَفۡسًا إِلَّا وُسۡعَهَاۚ وَلَدَيۡنَا كِتَٰبٞ يَنطِقُ بِٱلۡحَقِّ وَهُمۡ لَا يُظۡلَمُونَ","End":"٦٢"},{"Verse":63,"Text":"بَلۡ قُلُوبُهُمۡ فِي غَمۡرَةٖ مِّنۡ هَٰذَا وَلَهُمۡ أَعۡمَٰلٞ مِّن دُونِ ذَٰلِكَ هُمۡ لَهَا عَٰمِلُونَ","End":"٦٣"},{"Verse":64,"Text":"حَتَّىٰٓ إِذَآ أَخَذۡنَا مُتۡرَفِيهِم بِٱلۡعَذَابِ إِذَا هُمۡ يَجۡـَٔرُونَ","End":"٦٤"},{"Verse":65,"Text":"لَا تَجۡـَٔرُواْ ٱلۡيَوۡمَۖ إِنَّكُم مِّنَّا لَا تُنصَرُونَ","End":"٦٥"},{"Verse":66,"Text":"قَدۡ كَانَتۡ ءَايَٰتِي تُتۡلَىٰ عَلَيۡكُمۡ فَكُنتُمۡ عَلَىٰٓ أَعۡقَٰبِكُمۡ تَنكِصُونَ","End":"٦٦"},{"Verse":67,"Text":"مُسۡتَكۡبِرِينَ بِهِۦ سَٰمِرٗا تَهۡجُرُونَ","End":"٦٧"},{"Verse":68,"Text":"أَفَلَمۡ يَدَّبَّرُواْ ٱلۡقَوۡلَ أَمۡ جَآءَهُم مَّا لَمۡ يَأۡتِ ءَابَآءَهُمُ ٱلۡأَوَّلِينَ","End":"٦٨"},{"Verse":69,"Text":"أَمۡ لَمۡ يَعۡرِفُواْ رَسُولَهُمۡ فَهُمۡ لَهُۥ مُنكِرُونَ","End":"٦٩"},{"Verse":70,"Text":"أَمۡ يَقُولُونَ بِهِۦ جِنَّةُۢۚ بَلۡ جَآءَهُم بِٱلۡحَقِّ وَأَكۡثَرُهُمۡ لِلۡحَقِّ كَٰرِهُونَ","End":"٧٠"},{"Verse":71,"Text":"وَلَوِ ٱتَّبَعَ ٱلۡحَقُّ أَهۡوَآءَهُمۡ لَفَسَدَتِ ٱلسَّمَٰوَٰتُ وَٱلۡأَرۡضُ وَمَن فِيهِنَّۚ بَلۡ أَتَيۡنَٰهُم بِذِكۡرِهِمۡ فَهُمۡ عَن ذِكۡرِهِم مُّعۡرِضُونَ","End":"٧١"},{"Verse":72,"Text":"أَمۡ تَسۡـَٔلُهُمۡ خَرۡجٗا فَخَرَاجُ رَبِّكَ خَيۡرٞۖ وَهُوَ خَيۡرُ ٱلرَّـٰزِقِينَ","End":"٧٢"},{"Verse":73,"Text":"وَإِنَّكَ لَتَدۡعُوهُمۡ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ","End":"٧٣"},{"Verse":74,"Text":"وَإِنَّ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ عَنِ ٱلصِّرَٰطِ لَنَٰكِبُونَ","End":"٧٤"},{"Verse":75,"Text":"۞وَلَوۡ رَحِمۡنَٰهُمۡ وَكَشَفۡنَا مَا بِهِم مِّن ضُرّٖ لَّلَجُّواْ فِي طُغۡيَٰنِهِمۡ يَعۡمَهُونَ","End":"٧٥"},{"Verse":76,"Text":"وَلَقَدۡ أَخَذۡنَٰهُم بِٱلۡعَذَابِ فَمَا ٱسۡتَكَانُواْ لِرَبِّهِمۡ وَمَا يَتَضَرَّعُونَ","End":"٧٦"},{"Verse":77,"Text":"حَتَّىٰٓ إِذَا فَتَحۡنَا عَلَيۡهِم بَابٗا ذَا عَذَابٖ شَدِيدٍ إِذَا هُمۡ فِيهِ مُبۡلِسُونَ","End":"٧٧"},{"Verse":78,"Text":"وَهُوَ ٱلَّذِيٓ أَنشَأَ لَكُمُ ٱلسَّمۡعَ وَٱلۡأَبۡصَٰرَ وَٱلۡأَفۡـِٔدَةَۚ قَلِيلٗا مَّا تَشۡكُرُونَ","End":"٧٨"},{"Verse":79,"Text":"وَهُوَ ٱلَّذِي ذَرَأَكُمۡ فِي ٱلۡأَرۡضِ وَإِلَيۡهِ تُحۡشَرُونَ","End":"٧٩"},{"Verse":80,"Text":"وَهُوَ ٱلَّذِي يُحۡيِۦ وَيُمِيتُ وَلَهُ ٱخۡتِلَٰفُ ٱلَّيۡلِ وَٱلنَّهَارِۚ أَفَلَا تَعۡقِلُونَ","End":"٨٠"},{"Verse":81,"Text":"بَلۡ قَالُواْ مِثۡلَ مَا قَالَ ٱلۡأَوَّلُونَ","End":"٨١"},{"Verse":82,"Text":"قَالُوٓاْ أَءِذَا مِتۡنَا وَكُنَّا تُرَابٗا وَعِظَٰمًا أَءِنَّا لَمَبۡعُوثُونَ","End":"٨٢"},{"Verse":83,"Text":"لَقَدۡ وُعِدۡنَا نَحۡنُ وَءَابَآؤُنَا هَٰذَا مِن قَبۡلُ إِنۡ هَٰذَآ إِلَّآ أَسَٰطِيرُ ٱلۡأَوَّلِينَ","End":"٨٣"},{"Verse":84,"Text":"قُل لِّمَنِ ٱلۡأَرۡضُ وَمَن فِيهَآ إِن كُنتُمۡ تَعۡلَمُونَ","End":"٨٤"},{"Verse":85,"Text":"سَيَقُولُونَ لِلَّهِۚ قُلۡ أَفَلَا تَذَكَّرُونَ","End":"٨٥"},{"Verse":86,"Text":"قُلۡ مَن رَّبُّ ٱلسَّمَٰوَٰتِ ٱلسَّبۡعِ وَرَبُّ ٱلۡعَرۡشِ ٱلۡعَظِيمِ","End":"٨٦"},{"Verse":87,"Text":"سَيَقُولُونَ لِلَّهِۚ قُلۡ أَفَلَا تَتَّقُونَ","End":"٨٧"},{"Verse":88,"Text":"قُلۡ مَنۢ بِيَدِهِۦ مَلَكُوتُ كُلِّ شَيۡءٖ وَهُوَ يُجِيرُ وَلَا يُجَارُ عَلَيۡهِ إِن كُنتُمۡ تَعۡلَمُونَ","End":"٨٨"},{"Verse":89,"Text":"سَيَقُولُونَ لِلَّهِۚ قُلۡ فَأَنَّىٰ تُسۡحَرُونَ","End":"٨٩"},{"Verse":90,"Text":"بَلۡ أَتَيۡنَٰهُم بِٱلۡحَقِّ وَإِنَّهُمۡ لَكَٰذِبُونَ","End":"٩٠"},{"Verse":91,"Text":"مَا ٱتَّخَذَ ٱللَّهُ مِن وَلَدٖ وَمَا كَانَ مَعَهُۥ مِنۡ إِلَٰهٍۚ إِذٗا لَّذَهَبَ كُلُّ إِلَٰهِۭ بِمَا خَلَقَ وَلَعَلَا بَعۡضُهُمۡ عَلَىٰ بَعۡضٖۚ سُبۡحَٰنَ ٱللَّهِ عَمَّا يَصِفُونَ","End":"٩١"},{"Verse":92,"Text":"عَٰلِمِ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِ فَتَعَٰلَىٰ عَمَّا يُشۡرِكُونَ","End":"٩٢"},{"Verse":93,"Text":"قُل رَّبِّ إِمَّا تُرِيَنِّي مَا يُوعَدُونَ","End":"٩٣"},{"Verse":94,"Text":"رَبِّ فَلَا تَجۡعَلۡنِي فِي ٱلۡقَوۡمِ ٱلظَّـٰلِمِينَ","End":"٩٤"},{"Verse":95,"Text":"وَإِنَّا عَلَىٰٓ أَن نُّرِيَكَ مَا نَعِدُهُمۡ لَقَٰدِرُونَ","End":"٩٥"},{"Verse":96,"Text":"ٱدۡفَعۡ بِٱلَّتِي هِيَ أَحۡسَنُ ٱلسَّيِّئَةَۚ نَحۡنُ أَعۡلَمُ بِمَا يَصِفُونَ","End":"٩٦"},{"Verse":97,"Text":"وَقُل رَّبِّ أَعُوذُ بِكَ مِنۡ هَمَزَٰتِ ٱلشَّيَٰطِينِ","End":"٩٧"},{"Verse":98,"Text":"وَأَعُوذُ بِكَ رَبِّ أَن يَحۡضُرُونِ","End":"٩٨"},{"Verse":99,"Text":"حَتَّىٰٓ إِذَا جَآءَ أَحَدَهُمُ ٱلۡمَوۡتُ قَالَ رَبِّ ٱرۡجِعُونِ","End":"٩٩"},{"Verse":100,"Text":"لَعَلِّيٓ أَعۡمَلُ صَٰلِحٗا فِيمَا تَرَكۡتُۚ كَلَّآۚ إِنَّهَا كَلِمَةٌ هُوَ قَآئِلُهَاۖ وَمِن وَرَآئِهِم بَرۡزَخٌ إِلَىٰ يَوۡمِ يُبۡعَثُونَ","End":"١٠٠"},{"Verse":101,"Text":"فَإِذَا نُفِخَ فِي ٱلصُّورِ فَلَآ أَنسَابَ بَيۡنَهُمۡ يَوۡمَئِذٖ وَلَا يَتَسَآءَلُونَ","End":"١٠١"},{"Verse":102,"Text":"فَمَن ثَقُلَتۡ مَوَٰزِينُهُۥ فَأُوْلَـٰٓئِكَ هُمُ ٱلۡمُفۡلِحُونَ","End":"١٠٢"},{"Verse":103,"Text":"وَمَنۡ خَفَّتۡ مَوَٰزِينُهُۥ فَأُوْلَـٰٓئِكَ ٱلَّذِينَ خَسِرُوٓاْ أَنفُسَهُمۡ فِي جَهَنَّمَ خَٰلِدُونَ","End":"١٠٣"},{"Verse":104,"Text":"تَلۡفَحُ وُجُوهَهُمُ ٱلنَّارُ وَهُمۡ فِيهَا كَٰلِحُونَ","End":"١٠٤"},{"Verse":105,"Text":"أَلَمۡ تَكُنۡ ءَايَٰتِي تُتۡلَىٰ عَلَيۡكُمۡ فَكُنتُم بِهَا تُكَذِّبُونَ","End":"١٠٥"},{"Verse":106,"Text":"قَالُواْ رَبَّنَا غَلَبَتۡ عَلَيۡنَا شِقۡوَتُنَا وَكُنَّا قَوۡمٗا ضَآلِّينَ","End":"١٠٦"},{"Verse":107,"Text":"رَبَّنَآ أَخۡرِجۡنَا مِنۡهَا فَإِنۡ عُدۡنَا فَإِنَّا ظَٰلِمُونَ","End":"١٠٧"},{"Verse":108,"Text":"قَالَ ٱخۡسَـُٔواْ فِيهَا وَلَا تُكَلِّمُونِ","End":"١٠٨"},{"Verse":109,"Text":"إِنَّهُۥ كَانَ فَرِيقٞ مِّنۡ عِبَادِي يَقُولُونَ رَبَّنَآ ءَامَنَّا فَٱغۡفِرۡ لَنَا وَٱرۡحَمۡنَا وَأَنتَ خَيۡرُ ٱلرَّـٰحِمِينَ","End":"١٠٩"},{"Verse":110,"Text":"فَٱتَّخَذۡتُمُوهُمۡ سِخۡرِيًّا حَتَّىٰٓ أَنسَوۡكُمۡ ذِكۡرِي وَكُنتُم مِّنۡهُمۡ تَضۡحَكُونَ","End":"١١٠"},{"Verse":111,"Text":"إِنِّي جَزَيۡتُهُمُ ٱلۡيَوۡمَ بِمَا صَبَرُوٓاْ أَنَّهُمۡ هُمُ ٱلۡفَآئِزُونَ","End":"١١١"},{"Verse":112,"Text":"قَٰلَ كَمۡ لَبِثۡتُمۡ فِي ٱلۡأَرۡضِ عَدَدَ سِنِينَ","End":"١١٢"},{"Verse":113,"Text":"قَالُواْ لَبِثۡنَا يَوۡمًا أَوۡ بَعۡضَ يَوۡمٖ فَسۡـَٔلِ ٱلۡعَآدِّينَ","End":"١١٣"},{"Verse":114,"Text":"قَٰلَ إِن لَّبِثۡتُمۡ إِلَّا قَلِيلٗاۖ لَّوۡ أَنَّكُمۡ كُنتُمۡ تَعۡلَمُونَ","End":"١١٤"},{"Verse":115,"Text":"أَفَحَسِبۡتُمۡ أَنَّمَا خَلَقۡنَٰكُمۡ عَبَثٗا وَأَنَّكُمۡ إِلَيۡنَا لَا تُرۡجَعُونَ","End":"١١٥"},{"Verse":116,"Text":"فَتَعَٰلَى ٱللَّهُ ٱلۡمَلِكُ ٱلۡحَقُّۖ لَآ إِلَٰهَ إِلَّا هُوَ رَبُّ ٱلۡعَرۡشِ ٱلۡكَرِيمِ","End":"١١٦"},{"Verse":117,"Text":"وَمَن يَدۡعُ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ لَا بُرۡهَٰنَ لَهُۥ بِهِۦ فَإِنَّمَا حِسَابُهُۥ عِندَ رَبِّهِۦٓۚ إِنَّهُۥ لَا يُفۡلِحُ ٱلۡكَٰفِرُونَ","End":"١١٧"},{"Verse":118,"Text":"وَقُل رَّبِّ ٱغۡفِرۡ وَٱرۡحَمۡ وَأَنتَ خَيۡرُ ٱلرَّـٰحِمِينَ","End":"١١٨"}],"Translations":[{"LanguageCode":"eng","Language":"English","Name":"eng-mustafakhattabg","Author":"Mustafa Khattab God Edition","Source":"","Direction":"ltr","Translations":[{"Verse":1,"Text":"Successful indeed are the believers"},{"Verse":2,"Text":"those who humble themselves in prayer"},{"Verse":3,"Text":"those who avoid idle talk"},{"Verse":4,"Text":"those who pay alms-tax"},{"Verse":5,"Text":"those who guard their chastity"},{"Verse":6,"Text":"except with their wives or those ˹bondwomen˺ in their possession, for then they are free from blame"},{"Verse":7,"Text":"but whoever seeks beyond that are the transgressors"},{"Verse":8,"Text":"˹the believers are also˺ those who are true to their trusts and covenants"},{"Verse":9,"Text":"and those who are ˹properly˺ observant of their prayers"},{"Verse":10,"Text":"These are the ones who will be awarded"},{"Verse":11,"Text":"Paradise as their own. They will be there forever"},{"Verse":12,"Text":"And indeed, We created humankind from an extract of clay"},{"Verse":13,"Text":"then placed each ˹human˺ as a sperm-drop in a secure place"},{"Verse":14,"Text":"then We developed the drop into a clinging clot ˹of blood˺, then developed the clot into a lump ˹of flesh˺, then developed the lump into bones, then clothed the bones with flesh, then We brought it into being as a new creation. So Blessed is God, the Best of Creators"},{"Verse":15,"Text":"After that you will surely die"},{"Verse":16,"Text":"then on the Day of Judgment you will be resurrected"},{"Verse":17,"Text":"And indeed, We created above you seven levels ˹of heaven˺. We are never unmindful of ˹Our˺ creation"},{"Verse":18,"Text":"We send down rain from the sky in perfect measure, causing it to soak into the earth. And We are surely able to take it away"},{"Verse":19,"Text":"With it We produce for you gardens of palm trees and grapevines, in which there are abundant fruits, and from which you may eat"},{"Verse":20,"Text":"as well as ˹olive˺ trees which grow at Mount Sinai, providing oil and a condiment to eat"},{"Verse":21,"Text":"And there is certainly a lesson for you in cattle, from whose bellies We give you ˹milk˺ to drink, and in them are many other benefits for you, and from them you may eat"},{"Verse":22,"Text":"And you are carried upon ˹some of˺ them and upon ships"},{"Verse":23,"Text":"Indeed, We sent Noah to his people. He declared, “O my people! Worship God ˹alone˺. You have no god other than Him. Will you not then fear ˹Him˺?”"},{"Verse":24,"Text":"But the disbelieving chiefs of his people said ˹to the masses˺, “This is only a human like you, who wants to be superior to you. Had God willed, He could have easily sent down angels ˹instead˺. We have never heard of this in ˹the history of˺ our forefathers"},{"Verse":25,"Text":"He is simply insane, so bear with him for a while.”"},{"Verse":26,"Text":"Noah prayed, “My Lord! Help me, because they have denied ˹me˺.”"},{"Verse":27,"Text":"So We inspired him: “Build the Ark under Our ˹watchful˺ Eyes and directions. Then when Our command comes and the oven bursts ˹with water˺, take on board a pair from every species along with your family—except those against whom the decree ˹to drown˺ has already been passed. And do not plead with Me for those who have done wrong, for they will surely be drowned.”"},{"Verse":28,"Text":"Then when you and those with you have settled in the Ark, say, “All praise is for God, Who saved us from the wrongdoing people.”"},{"Verse":29,"Text":"And pray, “My Lord! Allow me a blessed landing, for You are the best accommodator.”"},{"Verse":30,"Text":"Surely in this are lessons. And We ˹always˺ put ˹people˺ to the test"},{"Verse":31,"Text":"Then We raised another generation after them"},{"Verse":32,"Text":"and sent to them a messenger from among themselves, ˹declaring,˺ “Worship God ˹alone˺. You have no god other than Him. Will you not then fear ˹Him˺?”"},{"Verse":33,"Text":"But the chiefs of his people—who disbelieved, denied the meeting ˹with God˺ in the Hereafter, and were spoiled by the worldly luxuries We had provided for them—said ˹to the masses˺, “This is only a human like you. He eats what you eat, and drinks what you drink"},{"Verse":34,"Text":"And if you ˹ever˺ obey a human like yourselves, then you would certainly be losers"},{"Verse":35,"Text":"Does he promise you that once you are dead and reduced to dust and bones, you will be brought forth ˹alive˺"},{"Verse":36,"Text":"Impossible, simply impossible is what you are promised"},{"Verse":37,"Text":"There is nothing beyond our worldly life. We die, others are born, and none will be resurrected"},{"Verse":38,"Text":"He is no more than a man who has fabricated a lie about God, and we will never believe in him.”"},{"Verse":39,"Text":"The messenger prayed, “My Lord! Help me, because they have denied ˹me˺.”"},{"Verse":40,"Text":"God responded, “Soon they will be truly regretful.”"},{"Verse":41,"Text":"Then the ˹mighty˺ blast overtook them with justice, and We reduced them to rubble. So away with the wrongdoing people"},{"Verse":42,"Text":"Then We raised other generations after them"},{"Verse":43,"Text":"No people can advance their doom, nor can they delay it"},{"Verse":44,"Text":"Then We sent Our messengers in succession: whenever a messenger came to his people, they denied him. So We destroyed them, one after the other, reducing them to ˹cautionary˺ tales. So away with the people who refuse to believe"},{"Verse":45,"Text":"Then We sent Moses and his brother Aaron with Our signs and compelling proof"},{"Verse":46,"Text":"to Pharaoh and his chiefs, but they behaved arrogantly and were a tyrannical people"},{"Verse":47,"Text":"They argued, “Will we believe in two humans, like ourselves, whose people are slaves to us?”"},{"Verse":48,"Text":"So they rejected them both, and ˹so˺ were among those destroyed"},{"Verse":49,"Text":"And We certainly gave Moses the Scripture, so perhaps his people would be ˹rightly˺ guided"},{"Verse":50,"Text":"And We made the son of Mary and his mother a sign, and gave them refuge on high ground—a ˹suitable˺ place for rest with flowing water"},{"Verse":51,"Text":"O messengers! Eat from what is good and lawful, and act righteously. Indeed, I fully know what you do"},{"Verse":52,"Text":"Surely this religion of yours is ˹only˺ one, and I am your Lord, so fear Me ˹alone˺"},{"Verse":53,"Text":"Yet the people have divided it into different sects, each rejoicing in what they have"},{"Verse":54,"Text":"So leave them ˹O Prophet˺ in their heedlessness for a while"},{"Verse":55,"Text":"Do they think, since We provide them with wealth and children"},{"Verse":56,"Text":"that We hasten to ˹honour˺ them ˹with˺ all kinds of good? No! They are not aware"},{"Verse":57,"Text":"Surely those who tremble in awe of their Lord"},{"Verse":58,"Text":"and who believe in the revelations of their Lord"},{"Verse":59,"Text":"and who associate none with their Lord"},{"Verse":60,"Text":"and who do whatever ˹good˺ they do with their hearts fearful, ˹knowing˺ that they will return to their Lord—"},{"Verse":61,"Text":"it is they who race to do good deeds, always taking the lead"},{"Verse":62,"Text":"We never require of any soul more than what it can afford. And with Us is a record which speaks the truth. None will be wronged"},{"Verse":63,"Text":"But the hearts of those ˹who disbelieve˺ are oblivious to ˹all of˺ this, and they have other ˹evil˺ deeds, opposite to this, in which they are engrossed"},{"Verse":64,"Text":"But as soon as We seize their elite with torment, they start to cry for help"},{"Verse":65,"Text":"˹They will be told,˺ “Do not cry for help today. Surely you will never be saved from Us"},{"Verse":66,"Text":"Indeed, My revelations were recited to you, but you used to back away ˹in disgust˺"},{"Verse":67,"Text":"boasting of the Sacred House, and babbling ˹nonsense about the Quran˺ by night.”"},{"Verse":68,"Text":"Is it because they have never contemplated the Word ˹of God˺? Or ˹because˺ there has come to them something that did not come to their forefathers"},{"Verse":69,"Text":"Or ˹because˺ they failed to recognize their Messenger, and so they denied him"},{"Verse":70,"Text":"Or ˹because˺ they say, “He is insane?” In fact, he has come to them with the truth, but most of them are resentful of the truth"},{"Verse":71,"Text":"Had the truth followed their desires, the heavens, the earth, and all those in them would have certainly been corrupted. In fact, We have brought them ˹the means to˺ their glory, but they turn away from it"},{"Verse":72,"Text":"Or ˹is it because˺ you ˹O Prophet˺ are asking them for tribute? But the reward of your Lord is best, for He is the Best Provider"},{"Verse":73,"Text":"And surely you are calling them to the Straight Path"},{"Verse":74,"Text":"but those who disbelieve in the Hereafter are certainly deviating from that Path"},{"Verse":75,"Text":"˹Even˺ if We had mercy on them and removed their affliction, they would still persist in their transgression, wandering blindly"},{"Verse":76,"Text":"And We have already seized them with torment, but they never humbled themselves to their Lord, nor did they ˹submissively˺ appeal ˹to Him˺"},{"Verse":77,"Text":"But as soon as We open for them a gate of severe punishment, they will be utterly desperate"},{"Verse":78,"Text":"He is the One Who created for you hearing, sight, and intellect. ˹Yet˺ you hardly give any thanks"},{"Verse":79,"Text":"And He is the One Who has dispersed you ˹all˺ over the earth, and to Him you will ˹all˺ be gathered"},{"Verse":80,"Text":"And He is the One Who gives life and causes death, and to Him belongs the alternation of the day and night. Will you not then understand"},{"Verse":81,"Text":"But they ˹just˺ say what their predecessors said"},{"Verse":82,"Text":"They said, “Once we are dead and reduced to dust and bones, will we really be resurrected"},{"Verse":83,"Text":"We have already been promised this, as well as our forefathers earlier. This is nothing but ancient fables!”"},{"Verse":84,"Text":"Ask ˹them, O Prophet˺, “To whom belong the earth and all those on it, if you ˹really˺ know?”"},{"Verse":85,"Text":"They will reply, “To God!” Say, “Why are you not then mindful?”"},{"Verse":86,"Text":"˹And˺ ask ˹them˺, “Who is the Lord of the seven heavens and the Lord of the Mighty Throne?”"},{"Verse":87,"Text":"They will reply, “God.” Say, “Will you not then fear ˹Him˺?”"},{"Verse":88,"Text":"Ask ˹them also,˺ “In Whose Hands is the authority over all things, protecting ˹all˺ while none can protect against Him, if you ˹really˺ know?”"},{"Verse":89,"Text":"They will reply, “God.” Say, “How are you then so deluded?”"},{"Verse":90,"Text":"In fact, We have brought them the truth, and they are certainly liars"},{"Verse":91,"Text":"God has never had ˹any˺ offspring, nor is there any god besides Him. Otherwise, each god would have taken away what he created, and they would have tried to dominate one another. Glorified is God above what they claim"},{"Verse":92,"Text":"˹He is the˺ Knower of the seen and unseen. Exalted is He above what they associate ˹with Him˺"},{"Verse":93,"Text":"Say, ˹O Prophet,˺ “My Lord! Should You show me what they are threatened with"},{"Verse":94,"Text":"then, my Lord, do not count me among the wrongdoing people.”"},{"Verse":95,"Text":"We are indeed able to show you what We have threatened them with"},{"Verse":96,"Text":"Respond to evil with what is best. We know well what they claim"},{"Verse":97,"Text":"And say, “My Lord! I seek refuge in You from the temptations of the devils"},{"Verse":98,"Text":"And I seek refuge in You, my Lord, that they ˹even˺ come near me.”"},{"Verse":99,"Text":"When death approaches any of them, they cry, “My Lord! Let me go back"},{"Verse":100,"Text":"so I may do good in what I left behind.” Never! It is only a ˹useless˺ appeal they make. And there is a barrier behind them until the Day they are resurrected"},{"Verse":101,"Text":"Then, when the Trumpet will be blown, there will be no kinship between them on that Day, nor will they ˹even care to˺ ask about one another"},{"Verse":102,"Text":"As for those whose scale is heavy ˹with good deeds˺, it is they who will be successful"},{"Verse":103,"Text":"But those whose scale is light, they will have doomed themselves, staying in Hell forever"},{"Verse":104,"Text":"The Fire will burn their faces, leaving them deformed"},{"Verse":105,"Text":"˹It will be said,˺ “Were My revelations not recited to you, but you used to deny them?”"},{"Verse":106,"Text":"They will cry, “Our Lord! Our ill-fate took hold of us, so we became a misguided people"},{"Verse":107,"Text":"Our Lord! Take us out of this ˹Fire˺. Then if we ever return ˹to denial˺, we will truly be wrongdoers.”"},{"Verse":108,"Text":"God will respond, “Be despised in there! Do not ˹ever˺ plead with Me ˹again˺"},{"Verse":109,"Text":"Indeed, there was a group of My servants who used to pray, ‘Our Lord! We have believed, so forgive us and have mercy on us, for You are the best of those who show mercy,’"},{"Verse":110,"Text":"but you were ˹so busy˺ making fun of them that it made you forget My remembrance. And you used to laugh at them"},{"Verse":111,"Text":"Today I have indeed rewarded them for their perseverance: they are certainly the triumphant.”"},{"Verse":112,"Text":"He will ask ˹them˺, “How many years did you remain on earth?”"},{"Verse":113,"Text":"They will reply, “We remained ˹only˺ a day or part of a day. But ask those who kept count.”"},{"Verse":114,"Text":"He will say, “You only remained for a little while, if only you knew"},{"Verse":115,"Text":"Did you then think that We had created you without purpose, and that you would never be returned to Us?”"},{"Verse":116,"Text":"Exalted is God, the True King! There is no god ˹worthy of worship˺ except Him, the Lord of the Honourable Throne"},{"Verse":117,"Text":"Whoever invokes, besides God, another god—for which they can have no proof—they will surely find their penalty with their Lord. Indeed, the disbelievers will never succeed"},{"Verse":118,"Text":"Say, ˹O Prophet,˺ “My Lord! Forgive and have mercy, for You are the best of those who show mercy.”"}]}]}