{"LanguageCode":"en","SurahData":{"Chapter":62,"Index":"062","Name":"Al-Jumu'ah","TranslatedName":"The Congregation","ArabicName":"سُوْرَةُ الْجُمُعَةِ","Revelation":"Madina","RevelationOrder":110,"HasBismillah":true,"VerseCount":11,"SajdaCount":0,"JuzStart":28,"JuzEnd":28,"VerseStart":5178,"VerseEnd":5188,"ManzilStart":7,"ManzilEnd":7,"RukuStart":486,"RukuEnd":487,"MaqraStart":221,"MaqraEnd":221,"PageStart":553,"PageEnd":554},"Summaries":["<p>This is a Madani Surah. It seems that the first part of this Surah was revealed in the 7<sup>th</sup> year of Hijrah after the Battle of Khaybar and the second part was revealed soon after the Hijrah in the 1<sup>st</sup> year of Hijrah. The Surah has 11 verses in 2 sections.</p>","<p>The Surah talks about the negligence of Bani Israel in obeying the commands of Allah and becoming too much involved in worldly matters. They only carried the Books of Allah, but failed to follow these books. Muslims are urged to observe the Friday prayer and should not get involved in business so much as to neglect the remembrance of Allah.</p>","<ol>","\t<li>Allah's favor upon Muslims that Allah sent His Prophet among them to teach them and to purify them. Bani Israel neglected the commands of Allah.</li>","\t<li>Muslims are exhorted to observe the Friday prayers and always remember Allah.</li>","</ol>"],"Verses":[{"Verse":1,"Text":"يُسَبِّحُ لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِ ٱلۡمَلِكِ ٱلۡقُدُّوسِ ٱلۡعَزِيزِ ٱلۡحَكِيمِ","End":"١"},{"Verse":2,"Text":"هُوَ ٱلَّذِي بَعَثَ فِي ٱلۡأُمِّيِّـۧنَ رَسُولٗا مِّنۡهُمۡ يَتۡلُواْ عَلَيۡهِمۡ ءَايَٰتِهِۦ وَيُزَكِّيهِمۡ وَيُعَلِّمُهُمُ ٱلۡكِتَٰبَ وَٱلۡحِكۡمَةَ وَإِن كَانُواْ مِن قَبۡلُ لَفِي ضَلَٰلٖ مُّبِينٖ","End":"٢"},{"Verse":3,"Text":"وَءَاخَرِينَ مِنۡهُمۡ لَمَّا يَلۡحَقُواْ بِهِمۡۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","End":"٣"},{"Verse":4,"Text":"ذَٰلِكَ فَضۡلُ ٱللَّهِ يُؤۡتِيهِ مَن يَشَآءُۚ وَٱللَّهُ ذُو ٱلۡفَضۡلِ ٱلۡعَظِيمِ","End":"٤"},{"Verse":5,"Text":"مَثَلُ ٱلَّذِينَ حُمِّلُواْ ٱلتَّوۡرَىٰةَ ثُمَّ لَمۡ يَحۡمِلُوهَا كَمَثَلِ ٱلۡحِمَارِ يَحۡمِلُ أَسۡفَارَۢاۚ بِئۡسَ مَثَلُ ٱلۡقَوۡمِ ٱلَّذِينَ كَذَّبُواْ بِـَٔايَٰتِ ٱللَّهِۚ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّـٰلِمِينَ","End":"٥"},{"Verse":6,"Text":"قُلۡ يَـٰٓأَيُّهَا ٱلَّذِينَ هَادُوٓاْ إِن زَعَمۡتُمۡ أَنَّكُمۡ أَوۡلِيَآءُ لِلَّهِ مِن دُونِ ٱلنَّاسِ فَتَمَنَّوُاْ ٱلۡمَوۡتَ إِن كُنتُمۡ صَٰدِقِينَ","End":"٦"},{"Verse":7,"Text":"وَلَا يَتَمَنَّوۡنَهُۥٓ أَبَدَۢا بِمَا قَدَّمَتۡ أَيۡدِيهِمۡۚ وَٱللَّهُ عَلِيمُۢ بِٱلظَّـٰلِمِينَ","End":"٧"},{"Verse":8,"Text":"قُلۡ إِنَّ ٱلۡمَوۡتَ ٱلَّذِي تَفِرُّونَ مِنۡهُ فَإِنَّهُۥ مُلَٰقِيكُمۡۖ ثُمَّ تُرَدُّونَ إِلَىٰ عَٰلِمِ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِ فَيُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ","End":"٨"},{"Verse":9,"Text":"يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا نُودِيَ لِلصَّلَوٰةِ مِن يَوۡمِ ٱلۡجُمُعَةِ فَٱسۡعَوۡاْ إِلَىٰ ذِكۡرِ ٱللَّهِ وَذَرُواْ ٱلۡبَيۡعَۚ ذَٰلِكُمۡ خَيۡرٞ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ","End":"٩"},{"Verse":10,"Text":"فَإِذَا قُضِيَتِ ٱلصَّلَوٰةُ فَٱنتَشِرُواْ فِي ٱلۡأَرۡضِ وَٱبۡتَغُواْ مِن فَضۡلِ ٱللَّهِ وَٱذۡكُرُواْ ٱللَّهَ كَثِيرٗا لَّعَلَّكُمۡ تُفۡلِحُونَ","End":"١٠"},{"Verse":11,"Text":"وَإِذَا رَأَوۡاْ تِجَٰرَةً أَوۡ لَهۡوًا ٱنفَضُّوٓاْ إِلَيۡهَا وَتَرَكُوكَ قَآئِمٗاۚ قُلۡ مَا عِندَ ٱللَّهِ خَيۡرٞ مِّنَ ٱللَّهۡوِ وَمِنَ ٱلتِّجَٰرَةِۚ وَٱللَّهُ خَيۡرُ ٱلرَّـٰزِقِينَ","End":"١١"}],"Translations":[{"LanguageCode":"eng","Language":"English","Name":"eng-mustafakhattabg","Author":"Mustafa Khattab God Edition","Source":"","Direction":"ltr","Translations":[{"Verse":1,"Text":"Whatever is in the heavens and whatever is on the earth ˹constantly˺ glorifies God—the King, the Most Holy, the Almighty, the All-Wise"},{"Verse":2,"Text":"He is the One Who raised for the illiterate ˹people˺ a messenger from among themselves—reciting to them His revelations, purifying them, and teaching them the Book and wisdom, for indeed they had previously been clearly astray—"},{"Verse":3,"Text":"along with others of them who have not yet joined them ˹in faith˺. For He is the Almighty, All-Wise"},{"Verse":4,"Text":"This is the favour of God. He grants it to whoever He wills. And God is the Lord of infinite bounty"},{"Verse":5,"Text":"The example of those who were entrusted with ˹observing˺ the Torah but failed to do so, is that of a donkey carrying books. How evil is the example of those who reject God’s signs! For God does not guide the wrongdoing people"},{"Verse":6,"Text":"Say, ˹O Prophet,˺ “O Jews! If you claim to be God’s chosen ˹people˺ out of all humanity, then wish for death, if what you say is true.”"},{"Verse":7,"Text":"But they will never wish for that because of what their hands have done. And God has ˹perfect˺ knowledge of the wrongdoers"},{"Verse":8,"Text":"Say, “The death you are running away from will inevitably come to you. Then you will be returned to the Knower of the seen and unseen, and He will inform you of what you used to do.”"},{"Verse":9,"Text":"O believers! When the call to prayer is made on Friday, then proceed ˹diligently˺ to the remembrance of God and leave off ˹your˺ business. That is best for you, if only you knew"},{"Verse":10,"Text":"Once the prayer is over, disperse throughout the land and seek the bounty of God. And remember God often so you may be successful"},{"Verse":11,"Text":"When they saw the fanfare along with the caravan, they ˹almost all˺ flocked to it, leaving you ˹O Prophet˺ standing ˹on the pulpit˺. Say, “What is with God is far better than amusement and merchandise. And God is the Best Provider.”"}]}]}