{"LanguageCode":"en","SurahData":{"Chapter":38,"Index":"038","Name":"Sad","TranslatedName":"The Sad","ArabicName":"سُوْرَةُ صٓ","Revelation":"Mecca","RevelationOrder":38,"HasBismillah":true,"VerseCount":88,"SajdaCount":1,"JuzStart":23,"JuzEnd":23,"VerseStart":3971,"VerseEnd":4058,"ManzilStart":6,"ManzilEnd":6,"RukuStart":391,"RukuEnd":395,"MaqraStart":181,"MaqraEnd":183,"PageStart":453,"PageEnd":458},"Summaries":["<p>This is a Makki Surah. It was revealed around the time of first Hijrah to Ebyssinia about 5 year of Prophethood. It has 88 verses in 5 sections.</p>","<p>The Surah talks about the basic message of all the Prophets and Messengers of Allah. They came to preach Tawhid. The Prophet suffered and went through a lot of hardship in presenting Allah's message. Their enemies attacked them and persecuted them, but then finally it was the truth that prevailed and falsehood was defeated. Power and riches all come from Allah. Some people become arrogant when they have power. But Allah gave the examples of David and Solomon who were great prophets as well as powerful kings. They obey Allah. Their riches did not corrupt them.</p>","<ol>","\t<li>Warnings to the disbelievers. The arguments of the disbelievers against the Qur'an and the Prophet. The defeat of the disbelievers.</li>","\t<li>Remember Allah's servant Prophet David. Allah's blessings upon him. He was tested and he turned to Allah.</li>","\t<li>Allah's blessings upon Prophet Solomon. He was also tested, but he repented and was forgiven by Allah.</li>","\t<li>Allah tested Prophet Job and he was rewarded for his patience. Remember Allah's servants: Abraham, Isaac, Jacob, Ishmael, Elisha and Zulkifl. The warnings for the wicked.</li>","\t<li>There is only one God. The great message. Allah created Adam, but Iblis became his enemy. He vowed to mislead human beings. Allah's curse came upon him and upon those who follow him.</li>","</ol>"],"Verses":[{"Verse":1,"Text":"صٓۚ وَٱلۡقُرۡءَانِ ذِي ٱلذِّكۡرِ","End":"١"},{"Verse":2,"Text":"بَلِ ٱلَّذِينَ كَفَرُواْ فِي عِزَّةٖ وَشِقَاقٖ","End":"٢"},{"Verse":3,"Text":"كَمۡ أَهۡلَكۡنَا مِن قَبۡلِهِم مِّن قَرۡنٖ فَنَادَواْ وَّلَاتَ حِينَ مَنَاصٖ","End":"٣"},{"Verse":4,"Text":"وَعَجِبُوٓاْ أَن جَآءَهُم مُّنذِرٞ مِّنۡهُمۡۖ وَقَالَ ٱلۡكَٰفِرُونَ هَٰذَا سَٰحِرٞ كَذَّابٌ","End":"٤"},{"Verse":5,"Text":"أَجَعَلَ ٱلۡأٓلِهَةَ إِلَٰهٗا وَٰحِدًاۖ إِنَّ هَٰذَا لَشَيۡءٌ عُجَابٞ","End":"٥"},{"Verse":6,"Text":"وَٱنطَلَقَ ٱلۡمَلَأُ مِنۡهُمۡ أَنِ ٱمۡشُواْ وَٱصۡبِرُواْ عَلَىٰٓ ءَالِهَتِكُمۡۖ إِنَّ هَٰذَا لَشَيۡءٞ يُرَادُ","End":"٦"},{"Verse":7,"Text":"مَا سَمِعۡنَا بِهَٰذَا فِي ٱلۡمِلَّةِ ٱلۡأٓخِرَةِ إِنۡ هَٰذَآ إِلَّا ٱخۡتِلَٰقٌ","End":"٧"},{"Verse":8,"Text":"أَءُنزِلَ عَلَيۡهِ ٱلذِّكۡرُ مِنۢ بَيۡنِنَاۚ بَلۡ هُمۡ فِي شَكّٖ مِّن ذِكۡرِيۚ بَل لَّمَّا يَذُوقُواْ عَذَابِ","End":"٨"},{"Verse":9,"Text":"أَمۡ عِندَهُمۡ خَزَآئِنُ رَحۡمَةِ رَبِّكَ ٱلۡعَزِيزِ ٱلۡوَهَّابِ","End":"٩"},{"Verse":10,"Text":"أَمۡ لَهُم مُّلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَاۖ فَلۡيَرۡتَقُواْ فِي ٱلۡأَسۡبَٰبِ","End":"١٠"},{"Verse":11,"Text":"جُندٞ مَّا هُنَالِكَ مَهۡزُومٞ مِّنَ ٱلۡأَحۡزَابِ","End":"١١"},{"Verse":12,"Text":"كَذَّبَتۡ قَبۡلَهُمۡ قَوۡمُ نُوحٖ وَعَادٞ وَفِرۡعَوۡنُ ذُو ٱلۡأَوۡتَادِ","End":"١٢"},{"Verse":13,"Text":"وَثَمُودُ وَقَوۡمُ لُوطٖ وَأَصۡحَٰبُ لۡـَٔيۡكَةِۚ أُوْلَـٰٓئِكَ ٱلۡأَحۡزَابُ","End":"١٣"},{"Verse":14,"Text":"إِن كُلٌّ إِلَّا كَذَّبَ ٱلرُّسُلَ فَحَقَّ عِقَابِ","End":"١٤"},{"Verse":15,"Text":"وَمَا يَنظُرُ هَـٰٓؤُلَآءِ إِلَّا صَيۡحَةٗ وَٰحِدَةٗ مَّا لَهَا مِن فَوَاقٖ","End":"١٥"},{"Verse":16,"Text":"وَقَالُواْ رَبَّنَا عَجِّل لَّنَا قِطَّنَا قَبۡلَ يَوۡمِ ٱلۡحِسَابِ","End":"١٦"},{"Verse":17,"Text":"ٱصۡبِرۡ عَلَىٰ مَا يَقُولُونَ وَٱذۡكُرۡ عَبۡدَنَا دَاوُۥدَ ذَا ٱلۡأَيۡدِۖ إِنَّهُۥٓ أَوَّابٌ","End":"١٧"},{"Verse":18,"Text":"إِنَّا سَخَّرۡنَا ٱلۡجِبَالَ مَعَهُۥ يُسَبِّحۡنَ بِٱلۡعَشِيِّ وَٱلۡإِشۡرَاقِ","End":"١٨"},{"Verse":19,"Text":"وَٱلطَّيۡرَ مَحۡشُورَةٗۖ كُلّٞ لَّهُۥٓ أَوَّابٞ","End":"١٩"},{"Verse":20,"Text":"وَشَدَدۡنَا مُلۡكَهُۥ وَءَاتَيۡنَٰهُ ٱلۡحِكۡمَةَ وَفَصۡلَ ٱلۡخِطَابِ","End":"٢٠"},{"Verse":21,"Text":"۞وَهَلۡ أَتَىٰكَ نَبَؤُاْ ٱلۡخَصۡمِ إِذۡ تَسَوَّرُواْ ٱلۡمِحۡرَابَ","End":"٢١"},{"Verse":22,"Text":"إِذۡ دَخَلُواْ عَلَىٰ دَاوُۥدَ فَفَزِعَ مِنۡهُمۡۖ قَالُواْ لَا تَخَفۡۖ خَصۡمَانِ بَغَىٰ بَعۡضُنَا عَلَىٰ بَعۡضٖ فَٱحۡكُم بَيۡنَنَا بِٱلۡحَقِّ وَلَا تُشۡطِطۡ وَٱهۡدِنَآ إِلَىٰ سَوَآءِ ٱلصِّرَٰطِ","End":"٢٢"},{"Verse":23,"Text":"إِنَّ هَٰذَآ أَخِي لَهُۥ تِسۡعٞ وَتِسۡعُونَ نَعۡجَةٗ وَلِيَ نَعۡجَةٞ وَٰحِدَةٞ فَقَالَ أَكۡفِلۡنِيهَا وَعَزَّنِي فِي ٱلۡخِطَابِ","End":"٢٣"},{"Verse":24,"Text":"قَالَ لَقَدۡ ظَلَمَكَ بِسُؤَالِ نَعۡجَتِكَ إِلَىٰ نِعَاجِهِۦۖ وَإِنَّ كَثِيرٗا مِّنَ ٱلۡخُلَطَآءِ لَيَبۡغِي بَعۡضُهُمۡ عَلَىٰ بَعۡضٍ إِلَّا ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّـٰلِحَٰتِ وَقَلِيلٞ مَّا هُمۡۗ وَظَنَّ دَاوُۥدُ أَنَّمَا فَتَنَّـٰهُ فَٱسۡتَغۡفَرَ رَبَّهُۥ وَخَرَّۤ رَاكِعٗاۤ وَأَنَابَ۩","End":"٢٤"},{"Verse":25,"Text":"فَغَفَرۡنَا لَهُۥ ذَٰلِكَۖ وَإِنَّ لَهُۥ عِندَنَا لَزُلۡفَىٰ وَحُسۡنَ مَـَٔابٖ","End":"٢٥"},{"Verse":26,"Text":"يَٰدَاوُۥدُ إِنَّا جَعَلۡنَٰكَ خَلِيفَةٗ فِي ٱلۡأَرۡضِ فَٱحۡكُم بَيۡنَ ٱلنَّاسِ بِٱلۡحَقِّ وَلَا تَتَّبِعِ ٱلۡهَوَىٰ فَيُضِلَّكَ عَن سَبِيلِ ٱللَّهِۚ إِنَّ ٱلَّذِينَ يَضِلُّونَ عَن سَبِيلِ ٱللَّهِ لَهُمۡ عَذَابٞ شَدِيدُۢ بِمَا نَسُواْ يَوۡمَ ٱلۡحِسَابِ","End":"٢٦"},{"Verse":27,"Text":"وَمَا خَلَقۡنَا ٱلسَّمَآءَ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَا بَٰطِلٗاۚ ذَٰلِكَ ظَنُّ ٱلَّذِينَ كَفَرُواْۚ فَوَيۡلٞ لِّلَّذِينَ كَفَرُواْ مِنَ ٱلنَّارِ","End":"٢٧"},{"Verse":28,"Text":"أَمۡ نَجۡعَلُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّـٰلِحَٰتِ كَٱلۡمُفۡسِدِينَ فِي ٱلۡأَرۡضِ أَمۡ نَجۡعَلُ ٱلۡمُتَّقِينَ كَٱلۡفُجَّارِ","End":"٢٨"},{"Verse":29,"Text":"كِتَٰبٌ أَنزَلۡنَٰهُ إِلَيۡكَ مُبَٰرَكٞ لِّيَدَّبَّرُوٓاْ ءَايَٰتِهِۦ وَلِيَتَذَكَّرَ أُوْلُواْ ٱلۡأَلۡبَٰبِ","End":"٢٩"},{"Verse":30,"Text":"وَوَهَبۡنَا لِدَاوُۥدَ سُلَيۡمَٰنَۚ نِعۡمَ ٱلۡعَبۡدُ إِنَّهُۥٓ أَوَّابٌ","End":"٣٠"},{"Verse":31,"Text":"إِذۡ عُرِضَ عَلَيۡهِ بِٱلۡعَشِيِّ ٱلصَّـٰفِنَٰتُ ٱلۡجِيَادُ","End":"٣١"},{"Verse":32,"Text":"فَقَالَ إِنِّيٓ أَحۡبَبۡتُ حُبَّ ٱلۡخَيۡرِ عَن ذِكۡرِ رَبِّي حَتَّىٰ تَوَارَتۡ بِٱلۡحِجَابِ","End":"٣٢"},{"Verse":33,"Text":"رُدُّوهَا عَلَيَّۖ فَطَفِقَ مَسۡحَۢا بِٱلسُّوقِ وَٱلۡأَعۡنَاقِ","End":"٣٣"},{"Verse":34,"Text":"وَلَقَدۡ فَتَنَّا سُلَيۡمَٰنَ وَأَلۡقَيۡنَا عَلَىٰ كُرۡسِيِّهِۦ جَسَدٗا ثُمَّ أَنَابَ","End":"٣٤"},{"Verse":35,"Text":"قَالَ رَبِّ ٱغۡفِرۡ لِي وَهَبۡ لِي مُلۡكٗا لَّا يَنۢبَغِي لِأَحَدٖ مِّنۢ بَعۡدِيٓۖ إِنَّكَ أَنتَ ٱلۡوَهَّابُ","End":"٣٥"},{"Verse":36,"Text":"فَسَخَّرۡنَا لَهُ ٱلرِّيحَ تَجۡرِي بِأَمۡرِهِۦ رُخَآءً حَيۡثُ أَصَابَ","End":"٣٦"},{"Verse":37,"Text":"وَٱلشَّيَٰطِينَ كُلَّ بَنَّآءٖ وَغَوَّاصٖ","End":"٣٧"},{"Verse":38,"Text":"وَءَاخَرِينَ مُقَرَّنِينَ فِي ٱلۡأَصۡفَادِ","End":"٣٨"},{"Verse":39,"Text":"هَٰذَا عَطَآؤُنَا فَٱمۡنُنۡ أَوۡ أَمۡسِكۡ بِغَيۡرِ حِسَابٖ","End":"٣٩"},{"Verse":40,"Text":"وَإِنَّ لَهُۥ عِندَنَا لَزُلۡفَىٰ وَحُسۡنَ مَـَٔابٖ","End":"٤٠"},{"Verse":41,"Text":"وَٱذۡكُرۡ عَبۡدَنَآ أَيُّوبَ إِذۡ نَادَىٰ رَبَّهُۥٓ أَنِّي مَسَّنِيَ ٱلشَّيۡطَٰنُ بِنُصۡبٖ وَعَذَابٍ","End":"٤١"},{"Verse":42,"Text":"ٱرۡكُضۡ بِرِجۡلِكَۖ هَٰذَا مُغۡتَسَلُۢ بَارِدٞ وَشَرَابٞ","End":"٤٢"},{"Verse":43,"Text":"وَوَهَبۡنَا لَهُۥٓ أَهۡلَهُۥ وَمِثۡلَهُم مَّعَهُمۡ رَحۡمَةٗ مِّنَّا وَذِكۡرَىٰ لِأُوْلِي ٱلۡأَلۡبَٰبِ","End":"٤٣"},{"Verse":44,"Text":"وَخُذۡ بِيَدِكَ ضِغۡثٗا فَٱضۡرِب بِّهِۦ وَلَا تَحۡنَثۡۗ إِنَّا وَجَدۡنَٰهُ صَابِرٗاۚ نِّعۡمَ ٱلۡعَبۡدُ إِنَّهُۥٓ أَوَّابٞ","End":"٤٤"},{"Verse":45,"Text":"وَٱذۡكُرۡ عِبَٰدَنَآ إِبۡرَٰهِيمَ وَإِسۡحَٰقَ وَيَعۡقُوبَ أُوْلِي ٱلۡأَيۡدِي وَٱلۡأَبۡصَٰرِ","End":"٤٥"},{"Verse":46,"Text":"إِنَّآ أَخۡلَصۡنَٰهُم بِخَالِصَةٖ ذِكۡرَى ٱلدَّارِ","End":"٤٦"},{"Verse":47,"Text":"وَإِنَّهُمۡ عِندَنَا لَمِنَ ٱلۡمُصۡطَفَيۡنَ ٱلۡأَخۡيَارِ","End":"٤٧"},{"Verse":48,"Text":"وَٱذۡكُرۡ إِسۡمَٰعِيلَ وَٱلۡيَسَعَ وَذَا ٱلۡكِفۡلِۖ وَكُلّٞ مِّنَ ٱلۡأَخۡيَارِ","End":"٤٨"},{"Verse":49,"Text":"هَٰذَا ذِكۡرٞۚ وَإِنَّ لِلۡمُتَّقِينَ لَحُسۡنَ مَـَٔابٖ","End":"٤٩"},{"Verse":50,"Text":"جَنَّـٰتِ عَدۡنٖ مُّفَتَّحَةٗ لَّهُمُ ٱلۡأَبۡوَٰبُ","End":"٥٠"},{"Verse":51,"Text":"مُتَّكِـِٔينَ فِيهَا يَدۡعُونَ فِيهَا بِفَٰكِهَةٖ كَثِيرَةٖ وَشَرَابٖ","End":"٥١"},{"Verse":52,"Text":"۞وَعِندَهُمۡ قَٰصِرَٰتُ ٱلطَّرۡفِ أَتۡرَابٌ","End":"٥٢"},{"Verse":53,"Text":"هَٰذَا مَا تُوعَدُونَ لِيَوۡمِ ٱلۡحِسَابِ","End":"٥٣"},{"Verse":54,"Text":"إِنَّ هَٰذَا لَرِزۡقُنَا مَا لَهُۥ مِن نَّفَادٍ","End":"٥٤"},{"Verse":55,"Text":"هَٰذَاۚ وَإِنَّ لِلطَّـٰغِينَ لَشَرَّ مَـَٔابٖ","End":"٥٥"},{"Verse":56,"Text":"جَهَنَّمَ يَصۡلَوۡنَهَا فَبِئۡسَ ٱلۡمِهَادُ","End":"٥٦"},{"Verse":57,"Text":"هَٰذَا فَلۡيَذُوقُوهُ حَمِيمٞ وَغَسَّاقٞ","End":"٥٧"},{"Verse":58,"Text":"وَءَاخَرُ مِن شَكۡلِهِۦٓ أَزۡوَٰجٌ","End":"٥٨"},{"Verse":59,"Text":"هَٰذَا فَوۡجٞ مُّقۡتَحِمٞ مَّعَكُمۡ لَا مَرۡحَبَۢا بِهِمۡۚ إِنَّهُمۡ صَالُواْ ٱلنَّارِ","End":"٥٩"},{"Verse":60,"Text":"قَالُواْ بَلۡ أَنتُمۡ لَا مَرۡحَبَۢا بِكُمۡۖ أَنتُمۡ قَدَّمۡتُمُوهُ لَنَاۖ فَبِئۡسَ ٱلۡقَرَارُ","End":"٦٠"},{"Verse":61,"Text":"قَالُواْ رَبَّنَا مَن قَدَّمَ لَنَا هَٰذَا فَزِدۡهُ عَذَابٗا ضِعۡفٗا فِي ٱلنَّارِ","End":"٦١"},{"Verse":62,"Text":"وَقَالُواْ مَا لَنَا لَا نَرَىٰ رِجَالٗا كُنَّا نَعُدُّهُم مِّنَ ٱلۡأَشۡرَارِ","End":"٦٢"},{"Verse":63,"Text":"أَتَّخَذۡنَٰهُمۡ سِخۡرِيًّا أَمۡ زَاغَتۡ عَنۡهُمُ ٱلۡأَبۡصَٰرُ","End":"٦٣"},{"Verse":64,"Text":"إِنَّ ذَٰلِكَ لَحَقّٞ تَخَاصُمُ أَهۡلِ ٱلنَّارِ","End":"٦٤"},{"Verse":65,"Text":"قُلۡ إِنَّمَآ أَنَا۠ مُنذِرٞۖ وَمَا مِنۡ إِلَٰهٍ إِلَّا ٱللَّهُ ٱلۡوَٰحِدُ ٱلۡقَهَّارُ","End":"٦٥"},{"Verse":66,"Text":"رَبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَا ٱلۡعَزِيزُ ٱلۡغَفَّـٰرُ","End":"٦٦"},{"Verse":67,"Text":"قُلۡ هُوَ نَبَؤٌاْ عَظِيمٌ","End":"٦٧"},{"Verse":68,"Text":"أَنتُمۡ عَنۡهُ مُعۡرِضُونَ","End":"٦٨"},{"Verse":69,"Text":"مَا كَانَ لِيَ مِنۡ عِلۡمِۭ بِٱلۡمَلَإِ ٱلۡأَعۡلَىٰٓ إِذۡ يَخۡتَصِمُونَ","End":"٦٩"},{"Verse":70,"Text":"إِن يُوحَىٰٓ إِلَيَّ إِلَّآ أَنَّمَآ أَنَا۠ نَذِيرٞ مُّبِينٌ","End":"٧٠"},{"Verse":71,"Text":"إِذۡ قَالَ رَبُّكَ لِلۡمَلَـٰٓئِكَةِ إِنِّي خَٰلِقُۢ بَشَرٗا مِّن طِينٖ","End":"٧١"},{"Verse":72,"Text":"فَإِذَا سَوَّيۡتُهُۥ وَنَفَخۡتُ فِيهِ مِن رُّوحِي فَقَعُواْ لَهُۥ سَٰجِدِينَ","End":"٧٢"},{"Verse":73,"Text":"فَسَجَدَ ٱلۡمَلَـٰٓئِكَةُ كُلُّهُمۡ أَجۡمَعُونَ","End":"٧٣"},{"Verse":74,"Text":"إِلَّآ إِبۡلِيسَ ٱسۡتَكۡبَرَ وَكَانَ مِنَ ٱلۡكَٰفِرِينَ","End":"٧٤"},{"Verse":75,"Text":"قَالَ يَـٰٓإِبۡلِيسُ مَا مَنَعَكَ أَن تَسۡجُدَ لِمَا خَلَقۡتُ بِيَدَيَّۖ أَسۡتَكۡبَرۡتَ أَمۡ كُنتَ مِنَ ٱلۡعَالِينَ","End":"٧٥"},{"Verse":76,"Text":"قَالَ أَنَا۠ خَيۡرٞ مِّنۡهُ خَلَقۡتَنِي مِن نَّارٖ وَخَلَقۡتَهُۥ مِن طِينٖ","End":"٧٦"},{"Verse":77,"Text":"قَالَ فَٱخۡرُجۡ مِنۡهَا فَإِنَّكَ رَجِيمٞ","End":"٧٧"},{"Verse":78,"Text":"وَإِنَّ عَلَيۡكَ لَعۡنَتِيٓ إِلَىٰ يَوۡمِ ٱلدِّينِ","End":"٧٨"},{"Verse":79,"Text":"قَالَ رَبِّ فَأَنظِرۡنِيٓ إِلَىٰ يَوۡمِ يُبۡعَثُونَ","End":"٧٩"},{"Verse":80,"Text":"قَالَ فَإِنَّكَ مِنَ ٱلۡمُنظَرِينَ","End":"٨٠"},{"Verse":81,"Text":"إِلَىٰ يَوۡمِ ٱلۡوَقۡتِ ٱلۡمَعۡلُومِ","End":"٨١"},{"Verse":82,"Text":"قَالَ فَبِعِزَّتِكَ لَأُغۡوِيَنَّهُمۡ أَجۡمَعِينَ","End":"٨٢"},{"Verse":83,"Text":"إِلَّا عِبَادَكَ مِنۡهُمُ ٱلۡمُخۡلَصِينَ","End":"٨٣"},{"Verse":84,"Text":"قَالَ فَٱلۡحَقُّ وَٱلۡحَقَّ أَقُولُ","End":"٨٤"},{"Verse":85,"Text":"لَأَمۡلَأَنَّ جَهَنَّمَ مِنكَ وَمِمَّن تَبِعَكَ مِنۡهُمۡ أَجۡمَعِينَ","End":"٨٥"},{"Verse":86,"Text":"قُلۡ مَآ أَسۡـَٔلُكُمۡ عَلَيۡهِ مِنۡ أَجۡرٖ وَمَآ أَنَا۠ مِنَ ٱلۡمُتَكَلِّفِينَ","End":"٨٦"},{"Verse":87,"Text":"إِنۡ هُوَ إِلَّا ذِكۡرٞ لِّلۡعَٰلَمِينَ","End":"٨٧"},{"Verse":88,"Text":"وَلَتَعۡلَمُنَّ نَبَأَهُۥ بَعۡدَ حِينِۭ","End":"٨٨"}],"Translations":[{"LanguageCode":"eng","Language":"English","Name":"eng-mustafakhattabg","Author":"Mustafa Khattab God Edition","Source":"","Direction":"ltr","Translations":[{"Verse":1,"Text":"Ṣãd. By the Quran, full of reminders"},{"Verse":2,"Text":"˹This is the truth,˺ yet the disbelievers are ˹entrenched˺ in arrogance and opposition"},{"Verse":3,"Text":"˹Imagine˺ how many peoples We destroyed before them, and they cried out when it was too late to escape"},{"Verse":4,"Text":"Now, the pagans are astonished that a warner has come to them from among themselves. And the disbelievers say, “This is a magician, a total liar"},{"Verse":5,"Text":"Has he reduced ˹all˺ the gods to One God? Indeed, this is something totally astonishing.”"},{"Verse":6,"Text":"The chiefs among them went forth saying, “Carry on, and stand firm in devotion to your gods. Certainly this is just a scheme ˹for power˺"},{"Verse":7,"Text":"We have never heard of this in the previous faith. This is nothing but a fabrication"},{"Verse":8,"Text":"Has the Reminder been revealed ˹only˺ to him out of ˹all of˺ us?” In fact, they are ˹only˺ in doubt of My ˹revealed˺ Reminder. In fact, ˹they do so because˺ they have not yet tasted My punishment"},{"Verse":9,"Text":"Or ˹is it because˺ they possess the treasuries of the mercy of your Lord—the Almighty, the Giver ˹of all bounties˺"},{"Verse":10,"Text":"Or ˹is it because˺ the kingdom of the heavens and the earth and everything in between belongs to them? Let them then climb their way ˹to heaven, if their claim is true˺"},{"Verse":11,"Text":"This is just another ˹enemy˺ force bound for defeat out there"},{"Verse":12,"Text":"Before them, the people of Noah denied ˹the truth˺, as did ’Âd, Pharaoh of the mighty structures"},{"Verse":13,"Text":"Thamûd, the people of Lot, and the residents of the Forest. These were ˹all˺ enemy forces"},{"Verse":14,"Text":"Each rejected their messenger, so My punishment was justified"},{"Verse":15,"Text":"These ˹pagans˺ are awaiting nothing but a single Blast that cannot be stopped"},{"Verse":16,"Text":"They say ˹mockingly˺, “Our Lord! Hasten for us our share ˹of the punishment˺ before the Day of Reckoning.”"},{"Verse":17,"Text":"Be patient ˹O Prophet˺ with what they say. And remember Our servant, David, the man of strength. Indeed, he ˹constantly˺ turned ˹to God˺"},{"Verse":18,"Text":"We truly subjected the mountains to hymn ˹Our praises˺ along with him in the evening and after sunrise"},{"Verse":19,"Text":"And ˹We subjected˺ the birds, flocking together. All turned to him ˹echoing his hymns˺"},{"Verse":20,"Text":"We strengthened his kingship, and gave him wisdom and sound judgment"},{"Verse":21,"Text":"Has the story of the two plaintiffs, who scaled the ˹wall of David’s˺ sanctuary, reached you ˹O Prophet˺"},{"Verse":22,"Text":"When they came into David’s presence, he was startled by them. They said, “Have no fear. ˹We are merely˺ two in a dispute: one of us has wronged the other. So judge between us with truth—do not go beyond ˹it˺—and guide us to the right way"},{"Verse":23,"Text":"This is my brother. He has ninety-nine sheep while I have ˹only˺ one. ˹Still˺ he asked me to give it up to him, overwhelming me with ˹his˺ argument.”"},{"Verse":24,"Text":"David ˹eventually˺ ruled, “He has definitely wronged you in demanding ˹to add˺ your sheep to his. And certainly many partners wrong each other, except those who believe and do good—but how few are they!” Then David realized that We had tested him so he asked for his Lord’s forgiveness, fell down in prostration, and turned ˹to Him in repentance˺"},{"Verse":25,"Text":"So We forgave that for him. And he will indeed have ˹a status of˺ closeness to Us and an honourable destination"},{"Verse":26,"Text":"˹We instructed him:˺ “O David! We have surely made you an authority in the land, so judge between people with truth. And do not follow ˹your˺ desires or they will lead you astray from God’s Way. Surely those who go astray from God’s Way will suffer a severe punishment for neglecting the Day of Reckoning.”"},{"Verse":27,"Text":"We have not created the heavens and earth and everything in between without purpose—as the disbelievers think. So woe to the disbelievers because of the Fire"},{"Verse":28,"Text":"Or should We treat those who believe and do good like those who make mischief throughout the land? Or should We treat the righteous like the wicked"},{"Verse":29,"Text":"˹This is˺ a blessed Book which We have revealed to you ˹O Prophet˺ so that they may contemplate its verses, and people of reason may be mindful"},{"Verse":30,"Text":"And We blessed David with Solomon—what an excellent servant ˹he was˺! Indeed, he ˹constantly˺ turned ˹to God˺"},{"Verse":31,"Text":"˹Remember˺ when the well-trained, swift horses were paraded before him in the evening"},{"Verse":32,"Text":"He then proclaimed, “I am truly in love with ˹these˺ fine things out of remembrance for God,” until they went out of sight"},{"Verse":33,"Text":"˹He ordered,˺ “Bring them back to me!” Then he began to rub down their legs and necks"},{"Verse":34,"Text":"And indeed, We tested Solomon, placing a ˹deformed˺ body on his throne, then he turned ˹to God in repentance˺"},{"Verse":35,"Text":"He prayed, “My Lord! Forgive me, and grant me an authority that will never be matched by anyone after me. You are indeed the Giver ˹of all bounties˺.”"},{"Verse":36,"Text":"So We subjected to him the wind, blowing gently at his command to wherever he pleased"},{"Verse":37,"Text":"And ˹We subjected to him˺ every builder and diver of the jinn"},{"Verse":38,"Text":"and others bound together in chains"},{"Verse":39,"Text":"˹God said,˺ “This is Our gift, so give or withhold ˹as you wish˺, never to be called to account.”"},{"Verse":40,"Text":"And he will indeed have ˹a status of˺ closeness to Us and an honourable destination"},{"Verse":41,"Text":"And remember Our servant Job, when he cried out to his Lord, “Satan has afflicted me with distress and suffering.”"},{"Verse":42,"Text":"˹We responded,˺ “Stomp your foot: ˹now˺ here is a cool ˹and refreshing˺ spring for washing and drinking.”"},{"Verse":43,"Text":"And We gave him back his family, twice as many, as a mercy from Us and a lesson for people of reason"},{"Verse":44,"Text":"˹And We said to him,˺ “Take in your hand a bundle of grass, and strike ˹your wife˺ with it, and do not break your oath.” We truly found him patient. What an excellent servant ˹he was˺! Indeed, he ˹constantly˺ turned ˹to God˺"},{"Verse":45,"Text":"And remember Our servants: Abraham, Isaac, and Jacob—the men of strength and insight"},{"Verse":46,"Text":"We truly chose them for the honour of proclaiming the Hereafter"},{"Verse":47,"Text":"And in Our sight they are truly among the chosen and the finest"},{"Verse":48,"Text":"Also remember Ishmael, Elisha, and Ⱬul-Kifl. All are among the best"},{"Verse":49,"Text":"This is ˹all˺ a reminder. And the righteous will certainly have an honourable destination"},{"Verse":50,"Text":"the Gardens of Eternity, whose gates will be open for them"},{"Verse":51,"Text":"There they will recline, calling for abundant fruit and drink"},{"Verse":52,"Text":"And with them will be maidens of modest gaze and equal age"},{"Verse":53,"Text":"This is what you are promised for the Day of Reckoning"},{"Verse":54,"Text":"This is indeed Our provision that will never end"},{"Verse":55,"Text":"That is that. And the transgressors will certainly have the worst destination"},{"Verse":56,"Text":"Hell, where they will burn. What an evil place to rest"},{"Verse":57,"Text":"Let them then taste this: boiling water and ˹oozing˺ pus"},{"Verse":58,"Text":"and other torments of the same sort"},{"Verse":59,"Text":"˹The misleaders will say to one another,˺ “Here is a crowd ˹of followers˺ being thrown in with us. They are not welcome, ˹for˺ they ˹too˺ will burn in the Fire.”"},{"Verse":60,"Text":"The followers will respond, “No! You are not welcome! You brought this upon us. What an evil place for settlement!”"},{"Verse":61,"Text":"Adding, “Our Lord! Whoever brought this upon us, double their punishment in the Fire.”"},{"Verse":62,"Text":"The tyrants will ask ˹one another˺, “But why do we not see those we considered to be lowly"},{"Verse":63,"Text":"Were we wrong in mocking them ˹in the world˺? Or do our eyes ˹just˺ fail to see them ˹in the Fire˺?”"},{"Verse":64,"Text":"This dispute between the residents of the Fire will certainly come to pass"},{"Verse":65,"Text":"Say, ˹O Prophet,˺ “I am only a warner. And there is no god ˹worthy of worship˺ except God—the One, the Supreme"},{"Verse":66,"Text":"˹He is the˺ Lord of the heavens and the earth and everything in between—the Almighty, Most Forgiving.”"},{"Verse":67,"Text":"Say, “This ˹Quran˺ is momentous news"},{"Verse":68,"Text":"from which you ˹pagans˺ are turning away.”"},{"Verse":69,"Text":"˹And say,˺ “I had no knowledge of the highest assembly ˹in heaven˺ when they differed ˹concerning Adam˺"},{"Verse":70,"Text":"What is revealed to me is that I am only sent with a clear warning.”"},{"Verse":71,"Text":"˹Remember, O Prophet˺ when your Lord said to the angels, “I am going to create a human being from clay"},{"Verse":72,"Text":"So when I have fashioned him and had a spirit of My Own ˹creation˺ breathed into him, fall down in prostration to him.”"},{"Verse":73,"Text":"So the angels prostrated all together—"},{"Verse":74,"Text":"but not Iblîs, who acted arrogantly, becoming unfaithful"},{"Verse":75,"Text":"God asked, “O Iblîs! What prevented you from prostrating to what I created with My Own Hands? Did you ˹just˺ become proud? Or have you always been arrogant?”"},{"Verse":76,"Text":"He replied, “I am better than he is: You created me from fire and him from clay.”"},{"Verse":77,"Text":"God commanded, “Then get out of Paradise, for you are truly cursed"},{"Verse":78,"Text":"And surely upon you is My condemnation until the Day of Judgment.”"},{"Verse":79,"Text":"Satan appealed, “My Lord! Then delay my end until the Day of their resurrection.”"},{"Verse":80,"Text":"God said, “You will be delayed"},{"Verse":81,"Text":"until the appointed Day.”"},{"Verse":82,"Text":"Satan said, “By Your Glory! I will certainly mislead them all"},{"Verse":83,"Text":"except Your chosen servants among them.”"},{"Verse":84,"Text":"God concluded, “The truth is—and I ˹only˺ say the truth—"},{"Verse":85,"Text":"I will surely fill up Hell with you and whoever follows you from among them, all together.”"},{"Verse":86,"Text":"Say, ˹O Prophet,˺ “I do not ask you for any reward for this ˹Quran˺, nor do I pretend to be someone I am not"},{"Verse":87,"Text":"It is only a reminder to the whole world"},{"Verse":88,"Text":"And you will certainly know its truth before long.”"}]}]}